{
 "name": "Sister",
 "display_name": "Sister",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "7th Sky Corps",
      "7th Sky Corps"
     ]
    }
   ]
  }
 ],
 "content": "\"Sister\" was the nickname of a trans female clone trooper who served in the Grand Army of the Republic during the Clone Wars. In 22 BBY, she participated in a battle alongside High Jedi General Obi-Wan Kenobi, Clone Marshal Commander CC-2224 \"Cody,\" and Jedi Commander Anakin Skywalker as part of the 7th Sky Corps. After the battle, Sister and Skywalker discussed how she had received her name from her brother troopers in affirmation of her gender identity. The same year, Sister was sent on an aid mission to the planet Langston alongside Skywalker.\nA trans female clone trooper nicknamed \"Sister\" was created on the planet Kamino as a clone of the human male bounty hunter Jango Fett. She served in the Grand Army of the Republic by the start of the Clone Wars—a galaxy-wide conflict between the Galactic Republic and the Confederacy of Independent Systems. Prior to leaving Kamino, she was given the nickname Sister by her brothers, who wished for her to feel a firm sense of belonging and support of her gender identity from them. Although Sister was initially scared of not being welcomed by her Jedi commanding officers due to her gender—which differed from many of her brother troopers—she proved able to work well with her superiors once the Clone Wars began.\nIn 22 BBY, Sister participated in a battle on a rocky planet while serving under High Jedi General Obi-Wan Kenobi, Clone Marshal Commander CC-2224 \"Cody,\" and Jedi Commander Anakin Skywalker as part of the 7th Sky Corps. Saddened by the deaths resulting from the battle, Sister arranged the helmets of her fallen brothers beneath a tree as a memorial. When asked by Skywalker, she explained the origins of her name and the heavy support of her gender identity among her brothers. Intrigued, the Padawan told her about the Jedi belief of rising above things, comparing it to Sister transcending the concepts of gender that she felt existed among clones. As both walked towards Kenobi's location for a rendezvous, she agreed with the sentiment of his statement.\nThe same year, Sister was sent on an aid mission to the mining planet Langston alongside Skywalker and the Republic's 302nd Battalion. Now in charge of a transport, she and other troopers waited in a launch bay while waiting for further instructions. When the Jedi signaled to her, Sister informed him that his ship was ready for departure while gesturing to the troopers awaiting his command. As Skywalker and the Jedi Initiate Mill Alibeth moved to board the vessel, Sister saluted the pair.\nAs a cloned individual, Sister was 1.83 meters tall and had tan skin. She had long, dark hair that she kept styled in rows of tightly woven braids. By the time she served under Kenobi, Sister considered herself a loyal Republic trooper. She grieved her brothers when they fell in battle, opting to arrange their helmets in a respectful way as a monument to remember them. Although she was initially nervous about embracing her femininity in front of her commanding officers, Sister gained confidence in her gender identity through the support of her brothers and later from the acceptance of the Jedi she served under.\nWhile in battle, Sister wore clone trooper armor. Her helmet was painted with vertical blue and magenta stripes.\nSister appeared in Queen's Hope, a young-adult novel written by E. K. Johnston and published on April 5, 2022. On March 8, 2022, Johnston shared a drawing of Clone Commander \"Sticks\" to announce the beginning of an art contest she was hosting on Twitter. Following this, the author revealed her design for Sister in a reply to Sticks' artwork and included an art commission of her done by Uzuri Art. In the image, Sister is depicted with Phase II clone trooper armor that is painted light blue and pink in the shades of the transgender flag. The commission also showed Sister with braided dark brown hair—parts of which were dyed pink—and a DC-15A blaster rifle. Johnston remarked that Sister was created to be shared with readers and other Star Wars writers but that due to her limited role in Queen's Hope, she would not be used in the novel's promotional materials. Mike Chen's novel Brotherhood, published on May 10, 2022, portrays Sister with the braided hairstyle and blue and magenta helmet first depicted in her commission artwork.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Sister_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/7th_Sky_Corps",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/22_BBY",
  "/wiki/Battles_on_a_rocky_planet",
  "/wiki/High_Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Clone_Marshal_Commander",
  "/wiki/CC-2224",
  "/wiki/Jedi_Commander",
  "/wiki/Anakin_Skywalker",
  "/wiki/Trooper",
  "/wiki/Standard_year",
  "/wiki/Aid_mission_to_Langston",
  "/wiki/Planet",
  "/wiki/Langston",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Jedi",
  "/wiki/Commanding_officer",
  "/wiki/Unidentified_rocky_planet",
  "/wiki/Death",
  "/wiki/Helmet",
  "/wiki/Tree",
  "/wiki/Padawan",
  "/wiki/Mining",
  "/wiki/302nd_Battalion",
  "/wiki/Transport",
  "/wiki/Hangar",
  "/wiki/Starship",
  "/wiki/Jedi_Initiate",
  "/wiki/Mill_Alibeth",
  "/wiki/Hair",
  "/wiki/Braid",
  "/wiki/Time",
  "/wiki/Officer",
  "/wiki/Clone_trooper_armor",
  "/wiki/Queen%27s_Hope",
  "/wiki/E._K._Johnston",
  "/wiki/April_5",
  "/wiki/2022",
  "/wiki/March_8",
  "/wiki/Clone_Commander",
  "/wiki/Cee-Cee-Seventeen-Seventy-One",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/Star_Wars",
  "/wiki/Mike_Chen",
  "/wiki/Brotherhood",
  "/wiki/May_10",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/Databank_(website)",
  "/wiki/Jedi_General",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Obi-Wan_Kenobi_(Star_Wars_Encyclopedia)",
  "/wiki/March_9",
  "/wiki/April_23",
  "/wiki/2015",
  "/wiki/March_13"
 ]
}