{
 "name": "Sivill",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3653 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireImperial Armada",
      "Imperial Armada"
     ]
    }
   ]
  }
 ],
 "content": "Sivill was a male Human Captain who commanded a Sith warship in the navy of the resurgent Sith Empire in the period just after the signing of the Treaty of Coruscant. He led the boarding party that captured Jedi Master Dar'Nala during a skirmish with a Republic transport ship in the Kuat sector.\nSivill was in command of a Sith warship during the Great Galactic War. After the Treaty of Coruscant was signed, Sivill was given secret orders from Sith Lord Darth Baras to attack the Envoy, which was carrying Jedi Satele Shan and Dar'Nala in the Kuat sector of the Core Worlds, and frame it as a Republic first strike. Sivill made an announcement over the ship's intercom that they were under attack by a Republic ship and a boarding party had to be dispatched in order to take at least one of the Jedi alive.\nSivill led a group of Imperial commandos aboard the transport, some of which attacked and were killed by Satele Shan. Meanwhile Sivill and the other commandos faced off against Dar'Nala and mockingly told her that she would not go down in a \"blaze of glory\" as they had too much to discuss, before trapping her in a net. Dar'Nala called to Shan to run and inform the council of the attack. Shan fled, and Dar'Nala remained Sivill's prisoner.\nLater, Sivill interrogated the Togruta Jedi Master in the detention center of an Imperial transport. During the interrogation, he subjected Dar'Nala to electric shock treatment in an attempt to force her to admit that the Envoy fired on the Sith warship first. Dar'Nala refused to cooperate, and he left saying he would give her one last chance when he came back.\nDar'Nala later helped another Sith captive escape so he could tell the Republic the truth. Sivill was furious, and since Dar'Nala had already refused to cooperate, he had her executed... or so he thought.\nSivill was later killed in a bombing on Korriban, which Darth Angral later realized that Baras had been behind.\nSivill carried a type of blaster that fired a net, which he used to capture Dar'Nala.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3653_BBY",
  "/wiki/Korriban",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Dar%27Nala",
  "/wiki/Captain/Legends",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Republic_transport_ship",
  "/wiki/Kuat_sector/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Envoy_(Republic_transport_ship)",
  "/wiki/Jedi/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Imperial_commando_(Sith_Empire)",
  "/wiki/Togruta/Legends",
  "/wiki/Torture/Legends#Electrocution",
  "/wiki/Braden",
  "/wiki/Darth_Angral",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_2:_New_Galactic_Order"
 ]
}