{
 "name": "Sixtat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Saki"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sakiyan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.84 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange and red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink and Red"
     ]
    }
   ]
  }
 ],
 "content": "Sixtat, also known as the \"Outlands Butcher,\" was a vicious Sakiyan bounty hunter who operated during the Clone Wars. Sixtat earned his title from the violent methods he employed against his prey, which led to their deaths. Sixtat's bloodlust eventually caught the eye of the Sith Lord Count Dooku and criminal mastermind Moralo Eval, who invited Sixtat to participate in a series of challenges at the Box on the planet Serenno.\nAt some unspecified point of his life, Sixtat became a bounty hunter, and became well known across the galaxy. Sixtat was mainly known for his violent methods against his targets, reason for which he gained the nickname of the \"Outlands Butcher\". In 20 BBY, during the Clone Wars, Sixtat was invited along some other fellow bounty hunters by the Sith Lord Count Dooku and the criminal mastermind Moralo Eval to participate in a series of challenges at the Box on the planet Serenno. Sixtat's bloodlust was the main reason for which he caught Dooku's eye.\nCompeting against other bounty hunters in the potentially fatal challenges, the victors would receive the honor of kidnapping Supreme Chancellor Sheev Palpatine of the Galactic Republic. Sixtat did well in the challenges, and made it to the fourth and final challenge, which involved shooting a fast moving distant target. The Sakiyan was the first to participate and made two perfect shots. However, he missed his third attempt at shooting the target, which resulted in the platform he was standing on to drop, plunging him into a pit of flames much to Eval's amusement, which killed the \"Outlands Butcher\", ending his career once and for all.\nWith the Sakiyans being known due being well-suited for hunting big game thanks to their quick reflexes and keen senses, Sixtat wasn't an exception. His grim talent for slaying his preys in a gruesome manner was the reason for which he earned the colorful title of the \"Outlands Butcher.\"\nSixtat translated his talents into bounty hunting, gaining him much notoriety for his cruel methods as well as the arrogance to believe he was unstoppable. However, his beliefs about his unstoppability were eventually what ultimately sealed his fate.\nSixtat was created for the TV series Star Wars: The Clone Wars, and appeared in the episode \"The Box,\" where his voice was provided by Corey Burton. Sixtat's body model was a repainted and modified model that was used for another Sakiyan character who appeared previously in the episode \"Padawan Lost.\"",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sixtat",
  "/wiki/Sixtat/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Saki",
  "/wiki/20_BBY",
  "/wiki/Serenno",
  "/wiki/Sakiyan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_Wars",
  "/wiki/Death",
  "/wiki/Eye",
  "/wiki/Sith_Lord",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Moralo_Eval",
  "/wiki/Box",
  "/wiki/Planet",
  "/wiki/The_galaxy",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Galactic_Republic",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Box",
  "/wiki/Corey_Burton",
  "/wiki/Padawan_Lost",
  "/wiki/Bane%27s_Story",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/Category:Images_of_Sixtat",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Prisoners",
  "/wiki/Crisis_on_Naboo",
  "/wiki/Standard_year"
 ]
}