{
 "name": "Skarch Vaunk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Anx"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Skarch Vaunk was a female Anx Jedi Master and the Battlemaster at the Coruscant Jedi Temple in the years preceding the Ruusan Reformation. Among her many contributions to the Jedi Order during her years of service was her authorship of several chapters of the Temple guidebook titled The Jedi Path: A Manual for Students of the Force. Her writings on the seven forms of lightsaber combat and meditation left a lasting impression on future generations.\nLike most Jedi of the era, Master Vaunk served the Order as a member of the Army of Light in the crusades against the Brotherhood of Darkness known as the New Sith Wars. At some point, Master Vaunk was appointed the Battlemaster of the academy on Coruscant and considered one of the most knowledgeable Jedi in the art of the lightsaber. A companion since the end of the war, Master Vaunk's sparring partner Snar Extruct helped build on her strengths and weaknesses.\nAs Battlemaster, Master Vaunk held her students to very high standards; as chief lightsaber instructor Vaunk decided who was admitted to classes where live lightsabers were used in addition to overseeing the Jedi Trials. Vaunk was given the authority to teach Form VII to those she felt were capable of handling it, while refusing to allow the Form to be abused as it had been during the Sith Wars. In fact, Vaunk was a staunch supporter of Form \"Zero\", the act of solving a problem without a lightsaber. Codifying the lightsaber construction ceremony and the ceremonies of the Mid-Year Fete, Vaunk was confident that the Sith had been defeated during the Seventh Battle of Ruusan.\nWhen her fellow Masters proposed that a guidebook to the life of the Jedi be written, Master Vaunk agreed to work on the project, contributing three chapters. Penning the chapter on the Third Pillar of the Jedi: Self-Discipline, Master Vaunk described the three main forms of meditation and how knowledge of each was vital to handling lightsaber combat. Additionally, she wrote the \"Introduction to the Lightsaber,\" and a guide to \"Form I Combat.\" The second chapter she contributed was titled \"Lightsabers: Their Construction and Use.\" This chapter described lightsaber variants and countermeasures, and detailed Forms II through VI. She finished off the chapter with a detailed explanation on the Marks of Contact. Her final chapter was on advanced lightsaber techniques, which explained Form VII and additional techniques.\nHaving earned the title of Battlemaster of the Jedi Order of her time, it is certain that Vaunk was an outstandingly accomplished lightsaber duelist. Particularly well-known for her nearly unprecendented knowledge of lightsaber combat, Vaunk was one of the most knowledgeable Jedi Masters when it came to Lightsaber Combat. Possessing consummate knowledge and understanding of all the seven forms of lightsaber combat and also many advanced lightsaber techniques, Vaunk was able to effectively provide thorough knowledge of each form's weaknesses and strengths and also advanced techniques as well as how to use them effectively when she aided in writing the guidebook her fellow Masters created. While Vaunk was considerably well-versed in Juyo, also describing the form and how to use it effectively in afromentioned work, she was fully aware of the dangers of learning and using Juyo and hence only allowed select individuals to join. Vaunk was also known for her outstanding skills and knowledge of Meditation and also wrote on them, displaying full understanding of why each form was vital to mastering lightsaber combat.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Anx/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Battlemaster",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Standard_year/Legends",
  "/wiki/Ruusan_Reformation",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Meditation/Legends",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Snar_Extruct",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Form_VII/Legends",
  "/wiki/Form_%22Zero%22",
  "/wiki/Mid-Year_Fete",
  "/wiki/Sith/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Form_I/Legends",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/Hoth_(Jedi_Lord)",
  "/wiki/1010_BBY",
  "/wiki/990_BBY",
  "/wiki/Cin_Drallig/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith_(novelization)",
  "/wiki/StarWars.com"
 ]
}