{
 "name": "Skodo",
 "display_name": "Skodo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chelloa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1032 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Skodo was a Rodian male mechanic who lived in the mining settlement of Jenith on the Outer Rim world of Chelloa during the Republic Dark Age. He and the secret Jedi Gorlan Palladane used a transmitter to activate one of the interstellar relay stations to contact Jedi Master Vannar Treece, asking for help in evacuating the planet's population. Palladane was concerned about the impact of Sith Lord Daiman's mining activities on the health of the children. While the message was received by the Jedi, the transmission was also intercepted by the rival Sith Lord Odion, Daiman's estranged brother.\nHowever, Operation Influx failed and most of the Jedi strike team including Treece were slain due to an attack by Odionate forces. The only survivor was the Jedi Knight Kerra Holt. Due to his role in contacting the Jedi and Odion, Skodo was tortured to death by Daiman with Force lightning. His body was then dumped in Jenith's plaza as a warning to the public. Palladane managed to find Skodo's transmitter and contacted Odion, telling him that the baradium mining operations on Chelloa were unsuccessful and that his homeworld was not worth invading. However, Daiman had substituted Skodo's transmitter for one of his own and had guards nearby. Palladane was apprehended and tortured but was rescued by Kerra Holt.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chelloa",
  "/wiki/1032_BBY/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Jenith",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Republic_Dark_Age",
  "/wiki/Jedi/Legends",
  "/wiki/Gorlan_Palladane",
  "/wiki/Transmitter/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vannar_Treece",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Daiman",
  "/wiki/Odion",
  "/wiki/Operation_Influx",
  "/wiki/Death/Legends",
  "/wiki/Odionate",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kerra_Holt",
  "/wiki/Force_lightning/Legends",
  "/wiki/Baradium/Legends",
  "/wiki/Knight_Errant:_Aflame_2",
  "/wiki/Knight_Errant:_Aflame_4"
 ]
}