{
 "name": "Skorg Jameson",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sulon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Skorg Jameson was a Human male colonist from Sulon.\nSkorg joined the Alliance to Restore the Republic during the Galactic Civil War to fight against the Galactic Empire. In 1 BBY, he aimed to be elected the Rebel Sector Leader of Sullustan Space.\nMorgan disliked him and considered him a sign of trouble. Skorg didn't like the idea that Katarn's son, one of the top Rebel leaders, was studying in the Imperial Military Academy at Cliffside, and considered him a potential danger for their cause.\nIt was when Katarn was repairing a pump relay when they had one such troubled meeting; soon after Sulon witnessed an assault from the Vengeance where several homesteads were destroyed. Skorg considered that they were an attempt to attack the G-Tap, to force the population of Sulon to depend on SoroSuub Corporation, and his well-rehearsed speech convinced the other Rebel leaders to strike back in an open warfare.\nHe was one of the twenty-six Rebel resistance soldiers that were killed during Jerec's attack.\nSkorg was a big figure, with a tall and strong body, bulging chest and wide legs. His shaggy hair touched his choulders. His speech was marked not only by his loud voice, but also his gestures and movements.\nHe took an aggressive stance against the Empire, conflicting with the more covert action favored by Morgan Katarn. His ambitions to become a Leader, and his political experience made him a convincing orator, and he had supporters in the Sulon Rebel cell.\nIn the audio adaptation Dark Forces: Soldier for the Empire, Jameson is voiced by Bob Davis.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sulon",
  "/wiki/1_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/File:SkorgJameson-DFSftE.ogg",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sullust/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Imperial_Military_Academy_at_Cliffside",
  "/wiki/Vengeance_(Imperial-class,_Jerec)",
  "/wiki/G-Tap",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/Morgan_Katarn",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire_audio_drama",
  "/wiki/Bob_Davis",
  "/wiki/Dark_Forces:_Soldier_for_the_Empire",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}