{
 "name": "Skosef",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Anti-Sith conspiracy",
      "Imperial Army",
      "Anti-Sith conspiracy"
     ]
    }
   ]
  }
 ],
 "content": "Skosef was a Human male general in the Galactic Empire's Imperial Army. By 1 BBY, Skosef had joined a plot led by Grand Moff Trachta to overthrow the two Sith Lords leading the Empire, Emperor Palpatine and Darth Vader. As a part of the plot, Skosef oversaw the bombing of Palpatine's Lambda-class T-4a shuttle, which was destined for the Empire's DS-1 Orbital Battle Station superweapon. Although Palpatine escaped the shuttle's demise, the blast killed half of the Emperor's Royal Guard and many Imperial stormtroopers, a vital part of Trachta's plan.\nAfter Skosef was suspected by the Imperials of being connected with the bombing, Trachta assigned Skosef to assassinate Grand Moff Bartam, another member of their plot, as the conspirators turned against one another. Skosef successfully killed Bartam but was in turn killed by a stormtrooper right after the assassination.\nA Human male, Skosef was a general in the Imperial Army of the Galactic Empire early during the Galactic Civil War. Skosef joined a plot to kill the Sith Lord rulers of the Empire—Emperor Palpatine and Darth Vader—by the later part of 1 BBY. That year, he escorted Moff Kadir of the Coruscant Security Force to a meeting between the members of the conspiracy near Grand Moff Bartam's luxury apartment on the galactic capital world of Coruscant. Led by Imperial Grand Moff Trachta, the conspirators—Grand Moff Bartam, Second Officer Dezsetes of the Imperial-class Star Destroyer Mathayus, and the assassin Gauer, as well as Skosef and Kadir—discussed Trachta's plan on how to kill the Sith Lords.\nThe conspirators planned to engineer a need for more troopers to guard the Emperor's Imperial Palace on Coruscant, using an apparent assassination attempt against Palpatine to kill a substantial portion of his palace security force. The attempt—the bombing of Palpatine's Lambda-class T-4a shuttle—was not intended to kill the Emperor, who the conspirators knew would survive the incident. The resulting losses among Palpatine's security force would allow stormtroopers loyal to the members of the conspiracy to take their place and be in a position to kill the Emperor. Another squad of stormtroopers under Dezsetes's command would kill Vader in the Kether system, where the planet Dargulli was located. During the meeting, Skosef was assigned to oversee the bombing of the shuttle.\nPrior to the departure of the shuttle on its trip to the Empire's DS-1 Orbital Battle Station superweapon, Skosef's stormtroopers placed a bomb inside the craft after they disguised it as a set of bottles in order to get it past the Emperor's Royal Guards. The bomb detonated before the shuttle left, obliterating the starship and killing the required amount of stormtroopers and Royal Guards; Skosef himself observed the blast from not far off. As the conspirators predicted, Palpatine indeed survived the explosion as he sensed the impending attack. When Palpatine was presented with stormtroopers, loyal to the conspirators, to replace those killed in the bombing, Trachta informed Skosef that the bombing had been traced back to the General, so Trachta assigned him a new part in the plan.\nWhile the members of the conspiracy struggled for power among one another as their plan to overthrow the Sith and ultimately become the rulers of the Empire neared fruition, Skosef sided with Trachta and tried to kill Grand Moff Bartam. Entering Bartam's luxury apartment unnoticed, Skosef shot the Grand Moff in the back with a blaster pistol at close range. However, a stormtrooper in the room observed the killing and opened fire on Skosef, killing the General. In the end, the only member of the conspiracy to survive was Gauer, as the rest were killed in the power struggles or died attempting to rid the Empire of the Sith, an effort that ultimately failed.\nAs a part of the conspiracy, Skosef believed that he and his fellow conspirators could take control of the Empire from Emperor Palpatine and Darth Vader. He initially expressed his doubts about the feasibility of using their limited number of stormtroopers to take out the Sith and at first questioned the bombing of Palpatine's shuttle, as it would waste some of their own troops. Trachta, however, eased his concerns by further explaining the plan. Skosef, upon observing the bombing, was amazed by it, and, after being ordered to kill Bartam as the conspirators turned against one another, he did so. The General was pale-skinned and had gray hair. He also owned a blaster pistol.\nSkosef first appeared in the first three issues of the Star Wars: Empire: Betrayal comic book story arc, all released in 2002 by Dark Horse Comics. He was also mentioned in 2004's 135th issue of The Official Star Wars Fact File. The Rebellion Era Campaign Guide, released in 2009, likewise mentioned Skosef.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/1_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Anti-Sith_conspiracy",
  "/wiki/General/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Trachta",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Bomb/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Palpatine%27s_shuttle_(bombing)",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Death/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Bartam",
  "/wiki/Unidentified_stormtrooper_(Coruscant)",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Kadir_(Moff)",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Bartam%27s_luxury_apartment",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Second_Officer",
  "/wiki/Dezsetes",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Mathayus",
  "/wiki/Gauer",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Kether_system",
  "/wiki/Dargulli/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Empire_1",
  "/wiki/Empire_2",
  "/wiki/Empire_3",
  "/wiki/Star_Wars:_Empire:_Betrayal",
  "/wiki/Star_Wars_comic_books",
  "/wiki/2002",
  "/wiki/Dark_Horse_Comics",
  "/wiki/2004",
  "/wiki/The_Official_Star_Wars_Fact_File_135",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/Rebellion_Era_Campaign_Guide",
  "/wiki/2009",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}