{
 "name": "Skott Yun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "25",
      "802 BBY on Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    }
   ]
  }
 ],
 "content": "Skott Yun was a male Human Je'daii Journeyer who served the Je'daii Order on Tython at the height of the Infinite Empire's reign.\nSkott Yun was a Forceful Human member of the Je'daii Order on Tython. A Je'daii Journeyer on his Great Journey a the same time as Lanoree and Dalien Brock, Yun was studying at Anil Kesh when he was summoned to assist in the arrest of the Brock brother. Dalien Brock was on an expedition in the Riftlands when he fled into the Abyss of Ruh and put him comrades in danger. As Je'daii Temple Master Quan-Jang escorted Brock back to the Temple via Cloud Chaser for judgment, Yun awaited their return alongside Master Dam-Powl and Lanoree Brock. As Quan-Jang and Brock climbed up the long stairs of the Temple's support strut, Yun agreed to wait with Lanoree Brock as Dam-Powl excused herself to prepare the medical center. Yun informed Brock that her brother would be treated for any wounds before being banished into the wild in the morning. When the Temple Master and his prisoner finally ascended to the viewing platform where Yun and Brock waited, Yun takes custody of the young man to allow Quan-Jang to see to the other injured Journeyers. As the Brock siblings begin to speak, Yun declared his intention to arrest Dalien Brock, who promptly kicked Yun in the face. Brock's martial arts skills were superior to Yun's, who had yet to travel to Stav Kesh. As the injured Yun attempted to use the Force to influence Brock's mind, Brock drew his blaster and shot the Journeyer in the chest. Coughing up blood, Yun would die on the rain-soaked platform from his wounds.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/25,802_BBY",
  "/wiki/Tython/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Infinite_Empire",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Great_Journey",
  "/wiki/Lanoree_Brock",
  "/wiki/Dalien_Brock",
  "/wiki/Anil_Kesh",
  "/wiki/Rift",
  "/wiki/Abyss_of_Ruh",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Quan-Jang",
  "/wiki/Cloud_Chaser",
  "/wiki/Dam-Powl",
  "/wiki/Stav_Kesh",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}