{
 "name": "Skreek",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Warbird gang",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Skreek was a Trandoshan male who was a member of Kragan Gorr's Warbird gang during the era of the New Republic. He flew with Gorr and several other pirates during an unsuccessful attack on the Colossus refueling station. Skreek was later there for another raid on the platform, where he engaged Kazuda Xiono in melee combat. When Torra Doza was kidnapped by the pirates Drell and Valik, Skreek escorted them and to hand her over to the First Order, but was shot when they betrayed the pirates.\nSkreek came to join the Warbird gang, a pirate gang led by Kragan Gorr. The gang secretly worked for the First Order in a campaign to force the refueling station Colossus to be given over to the latter organization.\nIn 34 ABY, Gorr sent the Neimoidian spy Hallion Nark to infiltrate the Colossus. After he gave the pirates the go-ahead for a \"triple dark,\" Gorr devised an attack on the refueling station Colossus, with Skreek taking part. Under the cover of a storm, they sprung on the platform and engaged the defending squadron, Ace Squadron. During the attack, a disturbance in the comm channel caused Skreek and the other pirates to be put off. As they stalled, one pirate was shot down, and Gorr ordered the rest of them to retreat.\nSometime later, Synara San, one of the other pirates, managed to infiltrate the Colossus and contacted Gorr when Ace Squadron was vacant. Led by Gorr, Skreek and the other pirates attacked the platform a second time. Skreek flew in aboard a speeder bike alongside Gorr as he spotted the engineers Kazuda Xiono and Jarek Yeager attempting to install a targeting computer to activate the Colossus' turbolasers. Gorr disembarked with Skreek and a Hassk pirate to stop them. While Yeager sent the Hassk falling to his doom, Gorr latched onto his hoverlift, and Skreek engaged Xiono. Yeager then rammed his hoverlift into Skreek, knocking him unconscious. When he woke up again, Yeager was still fighting Gorr on the hoverlift, and Xiono was climbing back up to the ledge after briefly falling off. Skreek confronted him, but he grabbed a spear and stunned him. Shortly after, Yeager was able to activate the targeting computer, and Gorr ordered a full retreat, saying that they had done enough damage to the platform.\nSkeek was present when the First Order Commander Pyre hired Kragan to kidnap Torra Doza, the daughter of the Colossus' captain Imanuel Doza in order to pressure the later into accepting First Order occupation. Gorr eventually sent the pirates Drell and Valik to kidnap Torra with the help of the unwilling Synara San.\nWhen Drell and Valik returned to the Warbird gang's headquarters, the Galleon, with Torra as their captive, Skreek escorted them to meet with Major Elrik Vonreg of the First Order, who had requested her capture. As Vonreg arrived, he then double-crossed them and shot Drell. Skreek fired back, but was shot in the chest and fell overboard into the ocean.\nSkreek was a male Trandoshan with yellow eyes and green skin.\nSkreek wore stormtrooper armor over his torso area. He also had brown trousers and partial bandaging over his shins and lower arms with a forearm armor plating on his right arm.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Warbird_gang",
  "/wiki/First_Order",
  "/wiki/Kragan_Gorr",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Pirate",
  "/wiki/Raid_on_the_Colossus",
  "/wiki/Colossus",
  "/wiki/Refueling_station",
  "/wiki/Second_raid_on_the_Colossus",
  "/wiki/Kazuda_Xiono",
  "/wiki/Torra_Doza",
  "/wiki/Drell",
  "/wiki/Valik",
  "/wiki/34_ABY",
  "/wiki/Neimoidian",
  "/wiki/Spy",
  "/wiki/Hallion_Nark",
  "/wiki/Triple_dark",
  "/wiki/Squadron",
  "/wiki/Ace_Squadron",
  "/wiki/Unidentified_Warbird_pirate",
  "/wiki/Synara_San",
  "/wiki/Speeder_bike",
  "/wiki/Jarek_Yeager",
  "/wiki/Targeting_computer",
  "/wiki/Turbolaser",
  "/wiki/Hassk",
  "/wiki/Hoverlift",
  "/wiki/Spear",
  "/wiki/Stun",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Galleon",
  "/wiki/Major",
  "/wiki/Elrik_Vonreg",
  "/wiki/Eye",
  "/wiki/Stormtrooper_armor",
  "/wiki/Star_Wars_Resistance",
  "/wiki/The_Triple_Dark",
  "/wiki/Synara%27s_Score",
  "/wiki/The_Doza_Dilemma",
  "/wiki/Descent_(episode)",
  "/wiki/No_Escape:_Part_2",
  "/wiki/Into_the_Unknown",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/The_Mutiny",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Covert_Missions",
  "/wiki/October_16",
  "/wiki/2018"
 ]
}