{
 "name": "Skull Shatter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3641 BBY",
      "Belsavis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Esh-kha"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Grey"
     ]
    }
   ]
  }
 ],
 "content": "Skull Shatter was a male Esh-kha warrior who was born thousands of years ago during the height of his people's reign in the galaxy. During that time, the Infinite Empire rallied its military might to end the marauding of the Esh-kha which saw the surviving members including Skull Shatter being imprisoned in stasis on the prison world of Belsavis by the Rakata. He remained there for millennia until the Galactic War when his prison vault was broken open by an attack by the Sith Empire on the Galactic Republic prison facility. Freed from imprisonment, Skull Shatter and his kin were determined to never be returned into the stasis prison again. Their berserker rampages led to them attacking both the Republic and Sith forces.\nIn this time, an official from the Empire was seeking to eliminating the threat posed by the Esh-kha. Whilst searching, the Imperial representative witnessed Skull Shatter arrive with a fellow warrior Blood Scream in order to attack a wounded Republic soldier party along with the Sith. However, he was ultimately slain in battle during this confrontation.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3641_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Belsavis/Legends",
  "/wiki/Esh-kha",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Infinite_Empire",
  "/wiki/Prison/Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Blood_Scream",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}