{
 "name": "Skwelli",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Priapulin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Skwelli was a Priapulin male who served the Jedi Order as a Jedi Master at some point before 1000 BBY. He was a skillful duelist, and his abilities were recorded in one of the Order's holocrons, which were kept in the Jedi Temple on the planet Coruscant. Jedi Battlemaster Skarch Vaunk mentioned him in the Jedi trainee guidebook The Jedi Path: A Manual for Students of the Force, first published in 990 BBY.\nSkwelli was a Priapulin male Jedi Master who served the Jedi Order at some point before the Ruusan Reformation of 1000 BBY. A proficient duelist, his skills were recorded for documentary purposes in one of the Order's holocrons and kept on file within the Jedi Temple's archives on the Galactic Republic capital planet of Coruscant.\nConsidering Skwelli's prowess with multiple lightsabers a \"wonder,\" Jedi Battlemaster Skarch Vaunk mentioned him in the chapter \"Lightsabers: Their construction and use\" that she authored for the Jedi trainee guidebook The Jedi Path: A Manual for Students of the Force, first published in 990 BBY. Almost nine centuries later, Padawan Thame Cerulian annotated the passage mentioning Skwelli in his copy of the book, regarding the Priapulin's abilities as \"amazing.\" When the book passed to Cerulian's apprentice Dooku, however, the future Sith Lord dismissed Skwelli as \"sloppy\" and lacking the proper footwork.\nSkwelli practiced Form VI of lightsaber combat and was capable of wielding six sabers at once due to his multi-limbed Priapulin physiology. His abilities were praised by several Jedi.\nSkwelli carried six lightsabers.\nCreated by Daniel Wallace, Skwelli was mentioned in the 2010 reference book The Jedi Path: A Manual for Students of the Force.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Priapulin",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/1000_BBY",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Battlemaster",
  "/wiki/Skarch_Vaunk",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Book/Legends",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force",
  "/wiki/990_BBY",
  "/wiki/Ruusan_Reformation",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Thame_Cerulian",
  "/wiki/Dooku/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Form_VI/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Daniel_Wallace",
  "/wiki/2010",
  "/wiki/The_Jedi_Path:_A_Manual_for_Students_of_the_Force_(real-life_book)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Standard_year/Legends"
 ]
}