{
 "name": "Slide_Paramita",
 "display_name": "Slide Paramita",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ciasi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brownish-gray"
     ]
    }
   ]
  }
 ],
 "content": "Slide Paramita, a Ciasi male, was a professional Podracer pilot who operated around 32 BBY. Haughty and persnickety, he disapproved of other Podracer pilots who used large, overpowering machines. Instead, he relied on only a small Pizer-Errol Stinger 627 S and his own cunning to win races. Though his craft was delicate, it responded well on turns and proved to be a great asset to him on the galaxy's twistier courses. He became the crowd favorite on the Ando Prime Centrum, a fairly large course on the snowy world of Ando Prime, which was known for its narrow, serpentine corridors and tight turns.\nThe Ciasi male Slide Paramita was renowned throughout the Podracing circuits for his fast reflexes and his faster temper on the racetrack while active in his career around the year 32 BBY, during the final decades of the Galactic Republic. Something of a haughty Podracer elitist, he preferred craft built for speed and agility like his own customized yellow Pizer-Errol Stinger 627 S, a Podracer that ranked high in maneuverability. This allowed the Ciasi to make the tight turns on various courses throughout the galaxy. However, the Stinger was also known for its frailty and a rather low top speed. To combat the top-speed issue, Paramita's racecraft was equipped with a fast-acting cooling system that afforded him the ability to boost often and take opponents by surprise. Nevertheless, if he ever caught himself falling behind other racers, his concentration generally snapped, and he turned aggressive, taking his anger out on the other pilots with his own Podracer.\nA natural expert on ice racing, Paramita became known for his performance on the courses of the ice world Ando Prime. One such course was known as the Ando Prime Centrum, a large track that weaved in and out of a water purification plant and then went through one of Ando Prime's bustling cities. Due to the non-linear nature of the track, pilots often needed to create their own path through the city. Paramita managed to master the track enough to become a crowd-pleaser for the course, as his nimble craft was perfect for moving through the tight tunnels, serpentine corridors, and long straights that were appropriate for his boost thrusters.\nParamita gained further success on Ando Prime by becoming a favored pilot on a drag course, where he challenged other pilots to one-on-one matches.\nSlide Paramita was known for his dislike for large Podracers and a short temper. He didn't believe in using large craft for racing, and far preferred smaller craft built for speed and maneuverability, like his own Pizor-Errol racer. His temper, however, occasionally sparked an aggressiveness in him that put his fragile vehicle at risk. Generally, the temper peaked whenever he found himself falling behind the competition with his modified craft, in which case he began to use the Pizor-Errol as a deadly high-speed weapon. Still, the Ciasi pilot was most at home on Ando Prime, where his skills at ice racing were top tier. Paramita tended to lob insults at pilots who he either passed or was passed by.\nPhysically, Paramita was a fairly thin individual who had brownish-gray skin and small black eyes. He was also somewhat athletic, as he could perform back-flips fairly well, and he stretched often to loosen himself up.\nSlide Paramita flew a modified yellow Pizor-Errol Stinger Podracer as his primary racing vehicle. Despite a high-end accelerator, the craft actually suffered from a poor top-speed. However, many of the vehicle's shortcomings could be overlooked thanks to an impressive handling system, which offered the craft an excellent turn response and allowed it to glide around corners with ease. For Paramita, the vehicle helped him excel in the narrow turns and tight bends that presented themselves on Ando Prime. In addition, the Podracer's cooling system allowed him to boost often, letting him outrun his competitors and claim last-second victories.\nWhen racing, Paramita employed a racing uniform that matched the color of his Stinger. The outfit was recognizable for the \"wings\" on the shoulders and thighs.\nSlide Paramita first appeared in concept art and early scripts for the 1999 film Star Wars: Episode I The Phantom Menace as a Podracer pilot from the planet Tund. Ultimately, he was cut from the script, although Tund remained as the homeworld of another Podracer pilot, Ben Quadinaros. In addition, what became Paramita's final design was originally assigned the name Teemto Pagalies, while Paramita sported a much different—and ultimately unused—design. Paramita, like several other scrapped Podracers, received his first actual appearance in the 1999 Nintendo 64 video game Star Wars Episode I: Racer, where he was voiced by Tom Kane, who also provided the voice for another racer, Elan Mak, in the game.\nThe name of Paramita's species, Ciasi, appeared in a 2006 Star Wars: Blogs non-canon fan article titled \"Alien species concepts that became part of the SW universe,\" written by Tim Veekhoven as part of his Source Blog series, which may have been drawn from early drafts of The Phantom Menace. In The Complete Star Wars Encyclopedia, released in 2008, the name Ciasi was mentioned again under Paramita's entry, thus canonizing the species.\n\"Pāramitā\" is a word meaning \"perfection\" or \"completeness\" in Sanskrit. In Buddhism, the pāramitās are the perfection of certain virtues by an individual as a means of purifying karma on the way to enlightenment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Rumi_Paramita/Legends",
  "/wiki/Ciasi",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:Slide_Paramita-taunt.ogg",
  "/wiki/Pilot/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Pizer-Errol",
  "/wiki/Stinger_627_S",
  "/wiki/Podracing/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Ando_Prime_Centrum/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ando_Prime/Legends",
  "/wiki/File:Slide_Paramita_Pitdroid.ogg",
  "/wiki/Standard_year/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cooling_unit/Legends",
  "/wiki/Water_purification_plant",
  "/wiki/City/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Ando_Prime_drag_course_1",
  "/wiki/Eye/Legends",
  "/wiki/Fodesinbeed_Annodue/Legends",
  "/wiki/Troig/Legends",
  "/wiki/File:Fode-Slide_Paramita.ogg",
  "/wiki/Standard_second",
  "/wiki/Clothing/Legends",
  "/wiki/Limb/Legends",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Tund/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Ben_Quadinaros/Legends",
  "/wiki/Teemto_Pagalies/Legends",
  "/wiki/Nintendo_64",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Episode_I:_Racer",
  "/wiki/Tom_Kane",
  "/wiki/Kam_Nale",
  "/wiki/Species/Legends",
  "/wiki/2006",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Tim_Veekhoven",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/Category:Audio_files_of_Slide_Paramita",
  "/wiki/Star_Wars:_Episode_I:_Racer:_The_Official_Nintendo_Player%27s_Guide",
  "/wiki/Star_Wars:_Episode_I_Racer:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Databank_(original)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Jar_Jar_Binks/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/File:SWPicsPreliminaryPodracers.jpg"
 ]
}