{
 "name": "Slinte",
 "display_name": "Slinte",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3641 BBY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish-brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Slinte was a male Human officer of the Sith Empire living during the Galactic War.\nIn 3642 BBY Slinte held the rank of an ensign and was stationed on Hoth as second-in-command to Commander Lanklyn, ultimately answering to Darth Baras. When Baras' apprentice arrived in search of a Jedi Knight Xerender, Lanklyn got himself captured while tracking the Jedi and it was Slinte who had to greet and assist the Sith in his absence. Though Baras' apprentice was able to find and rescue Lanklyn, he later proved his incompetence and Darth Baras had force-chocked him over the hologram, promoting Slinte to the now vacant post of the Commander. Slinte managed to hold onto the position and the apprentice had remembered his service. Next year the apprentice was betrayed by Darth Baras, but was promoted to the rank of Emperor's Wrath by the Emperor's Hand. The newly appointed Wrath returned to Hoth in search of General Greist and approached Commander Slinte, who was unaware of Sith politics and assumed Baras sent his apprentice to dispose of him. However, the Wrath demanded General Greist's location before killing him to keep him silent.\nThe Sith Warrior could suggest to tell him to ignore Darth Baras' call, play dumb or kill him. If he tells him to ignore Darth Baras' call, he will disappear to avoid dying.If the player chose to lie to Slinte and tell him Baras' order to keep the location of Greist's men a secret excluded them, he will give the location and depart.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3641_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_War",
  "/wiki/3642_BBY",
  "/wiki/Ensign/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Lanklyn",
  "/wiki/Darth_Baras",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Xerender",
  "/wiki/Sith/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Hand_of_the_Empire",
  "/wiki/General/Legends",
  "/wiki/Greist",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}