{
 "name": "Slippery_Hilts",
 "display_name": "Slippery Hilts",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 3060 BBY",
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Prior to 3000 BBY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "A Force-sensitive Human male nicknamed \"Slippery Hilts\" lived on the planet Kesh during the Time of the Rot. He married a woman who gave birth to a boy they named Varner. Varner Hilts' father was a member of the Sith Tribe on Kesh, and sometime prior to 3000 BBY, he planned to assassinate a Sith rival. However, the sheath carrying Hilts' bladed weapon was poorly constructed, and the blade fell and lodged itself into his ankle. The Tribe then began to call him \"Slippery Hilts,\" a nickname that stayed until he died from an infection in his wound one month later.\nA Force-sensitive Human male member of the Hilts family was born on the planet Kesh during the Time of the Rot, a period of turmoil and constant warring on the world. Hilts was a member of the Lost Tribe of Sith on Kesh—descendants of a group of Sith who had been stranded on the world after their starship crashed there. Hilts married a woman, and in 3060 BBY she gave birth to their child, whom they named Varner. Varner Hilts' father worked for many years to gain the trust of the leader of a political faction of Sith in Beray. Sometime prior to 3000 BBY, he planned to assassinate the head of the party and take the Sith's place.\nHilts meticulously selected a shikkar—a glass dagger made for just one use, in which the blade was snapped off from the hilt, leaving it inside the victim's body—to carry out his attack. However, he failed to properly build the sheath in which he carried his shikkar, and before he could assassinate the faction leader, the blade fell and stabbed Hilts in the ankle. His fellow Tribe members found the accident a source of humor and began to call him \"Slippery Hilts.\" Hilts' wound quickly became infected, and he died within one month, under the age of sixty. His widowed wife tried to seduce the leader just one week later, but she also died in her attempt.\nSlippery Hilts was a very ambitious man, as was the Hilts family as a whole. He also showed his patience by waiting years to gain the trust of his liege before attempting to stab the Sith and take control of the faction. Hilts was very particular in the selection of his shikkar, but his carelessness in crafting the sheath for the weapon ultimately resulted in his death.\n\"Slippery Hilts\" was first mentioned in the eighth eBook in John Jackson Miller's Lost Tribe of the Sith series, Secrets, published in 2012.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/3060_BBY",
  "/wiki/3000_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_Time_of_the_Rot",
  "/wiki/Marriage/Legends",
  "/wiki/Varner_Hilts%27_mother",
  "/wiki/Reproduction/Legends",
  "/wiki/Varner_Hilts",
  "/wiki/Parent/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Unidentified_faction_leader",
  "/wiki/Sheath",
  "/wiki/Shikkar",
  "/wiki/Death/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Hilts_family",
  "/wiki/Time/Legends",
  "/wiki/Omen",
  "/wiki/Skirmish_over_Phaegon_III",
  "/wiki/Standard_year/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Beray_faction",
  "/wiki/Beray",
  "/wiki/Glass/Legends",
  "/wiki/Dagger/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/EBook",
  "/wiki/John_Jackson_Miller",
  "/wiki/Star_Wars:_Lost_Tribe_of_the_Sith",
  "/wiki/Lost_Tribe_of_the_Sith:_Secrets",
  "/wiki/2012",
  "/wiki/Fate_of_the_Jedi:_Abyss"
 ]
}