{
 "name": "Sloan_Rusper",
 "display_name": "Sloan Rusper",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Lord Sloan Rusper was a well known, experienced hunter from Naboo, and supporter of the Rebel Alliance.\nDuring 1 ABY, Sloan Rusper resided in the city of Restuss on Rori. While here, Hefsen Zindalai tasked Rusper with making sure the area around Restuss was safe for the Restuss Arts Jubilee. Rusper soon discovered that something in the water turned predators of Rori into marauding beasts, making them even more dangerous. To help purge this danger, Sloan hired a well-armed, experienced hunter to solve the situation. Sloan had the coordinates from the latest animal attack, and requested that the hunter go to the coordinates. The hunter agreed to go to the coordinates, where he found a deadly Forest mite guardian. Fortunately, the hunter managed to kill the dangerous creature.\nWhile Sloan was impressed, he had a greater problem for his hunter to deal with. Another fellow hunter, named Ablest, found himself in trouble. While exploring what he thought was an abandoned Tusk cat den, Ablest uncovered a nest of nightspiders. Fortunately, he was able to send a final distress call before communications were cut off. Despite the dangers, the hunter agreed to set out and rescue Ablest. When reaching the coordinates, the hunter was forced to kill two spiders, but Ablest was more or less unscathed. The hunter escorted him back to Sloan, who thanked him greatly for courage.\nBefore the Battle of Restuss erupted, Sloan was apparently evacuated from the city by the Empire.\nLord Sloan Rusper was a Non-Player Character  in the MMORPG Star Wars Galaxies, located in a small camp just outside the city of Restuss. He gave players two tasks: first to kill a certain creature and then to rescue a hunter and lead him back to Rusper.\nHe was removed from the game on June 27, 2006 due to the new changes that were made to Restuss.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Lord/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Restuss",
  "/wiki/Rori/Legends",
  "/wiki/Hefsen_Zindalai",
  "/wiki/Restuss_Arts_Jubilee",
  "/wiki/Forest_mite",
  "/wiki/Ablest",
  "/wiki/Tusk_cat",
  "/wiki/Nightspider",
  "/wiki/Battle_of_Restuss",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/June_27",
  "/wiki/2006"
 ]
}