{
 "name": "Slowen_Lo",
 "display_name": "Slowen Lo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cantonica"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Abednedo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Slowen Lo was a male Abednedo who resided on Canto Bight. He made a fortune selling driftwood sculptures and lived on the beach in the coastal city on the desert planet Cantonica. In 34 ABY, Lo saw Finn and Rose Tico illegally land and abandon their ship on a Canto Bight beach. Annoyed, Lo told Finn and Rose they were not allowed to leave the ship there, but they ignored him and proceeded to the Canto Casino. Lo informed the Canto Bight Police Department about this and accompanied officers to the casino, where he observed Finn and Rose and confirmed their identities to the police. He was startled as the officers stunned and arrested Finn and Rose.\nA proud citizen of Canto Bight, Slowen Lo took his job very seriously, something that was demonstrated as when Finn and Rose Tico refused to pay attention to him that they should not park on the beach. Not wanting them to get away with it, he chose to call the Canto Bight Police Department to have them arrested.\nTo amplify his failing eyesight, he had surgical implant lenses.\nSlowen Lo was physically portrayed by creature and droid performer Dee Tails with voice work provided by actor Joseph Gordon-Levitt, who has appeared in some capacity in every film by The Last Jedi director Rian Johnson. While promoting The Last Jedi in Tokyo, Japan, in September 2017, Johnson first confirmed that Gordon-Levitt would have a brief voice acting role in The Last Jedi, though he did not clarify who he would be portraying. The character was first identified as Slowen Lo in the Star Wars: The Last Jedi: The Visual Dictionary. The name Slowen Lo is a reference to the Beastie Boys song \"Slow and Low\" from the 1986 album Licensed to Ill. Star Wars producer and director J.J. Abrams is a fan of the Beastie Boys and hip-hop music, and Slowen Lo is at least the fourth Abednedo character in the Star Wars sequel trilogy to be named after a Beastie Boys song, along with Ello Asty, \"Crusher\" Roodown and Ilco Munica.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Lo_(disambiguation)",
  "/wiki/Cantonica",
  "/wiki/Abednedo",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Canto_Bight",
  "/wiki/Driftwood",
  "/wiki/Beach",
  "/wiki/City",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/34_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Finn",
  "/wiki/Rose_Tico",
  "/wiki/Canto_Casino_and_Racetrack",
  "/wiki/Canto_Bight_Police_Department",
  "/wiki/Stun",
  "/wiki/Eye",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Slowen_Lo",
  "/wiki/Dee_Tails",
  "/wiki/Joseph_Gordon-Levitt",
  "/wiki/Rian_Johnson",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/1986",
  "/wiki/J.J._Abrams",
  "/wiki/Sequel_trilogy",
  "/wiki/Ello_Asty",
  "/wiki/Roodown",
  "/wiki/Ilco_Munica",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/Rolling_with_BB-8/Resistance_on_the_Run",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Disney%2B",
  "/wiki/Databank_(website)",
  "/wiki/File:Dee_Tails_Slowen_Lo.png",
  "/wiki/September_11",
  "/wiki/2017",
  "/wiki/May_2",
  "/wiki/2019",
  "/wiki/February_4",
  "/wiki/December_18",
  "/wiki/March_9",
  "/wiki/April_18",
  "/wiki/2020",
  "/wiki/December_17",
  "/wiki/August_7",
  "/wiki/2018"
 ]
}