{
 "name": "Slussen_Urla-fir_Kal_Kethin-wa_Canker",
 "display_name": "Slussen Urla-fir Kal Kethin-wa Canker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vorlaggn"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Slussen Urla-fir Kal Kethin-wa Canker, also known as Canker the Red, His Venomous Grace, Keeper of Men and Killer of Foes, the Prince and First Son of Vorlag, Master Scion, or simply Slussen Canker, was a male Vorlaggn slaver during the Galactic Civil War. In 5 ABY, Slussen sheltered the former Imperial Vice Admiral Perwin Gedde; who was wanted by the New Republic for war crimes including testing diseases on captive worlds.\nSlussen Canker was a Vorlaggn crime lord and slaver who resided in a volcanic fortress on the planet Vorlag. He kept slaves and several fearsome hroth-beasts. In 5 ABY, Slussen sheltered the former Imperial Vice Admiral Perwin Gedde, who was wanted by the New Republic for numerous war crimes particularly poisoning entire worlds. Slussen treated Gedde like a guest and pampered him with servants and spice to fuel his addiction. That year, Slussen's palace was infiltrated by a group of New Republic operatives consisting of Norra Wexley, the bounty hunter Jas Emari, the former Imperial loyalty officer Sinjir Rath Velus, and the New Republic Special Forces soldier Jom Barell.\nPrior to the mission, Emari infiltrated the palace a few days earlier to disable the crisscrossing laser portcullis. Unknown to the rest of Norra's team with the exception of Norra's son Temmin Wexley, Jas made a secret deal with Slussen and Vice Admiral Gedde. In return for betraying Norra's team, Slussen agreed to pay her a fifteen percent finder's fee. Gedde also agreed to pay Jas the Imperial bounty on Norra and her team. Unknown to Slussen and Gedde, this was merely a ruse by Jas to solicit funds to pay off her debts to Black Sun and other criminal groups. Jas was still loyal to Norra and her team and arranged for a metal key to be fitted around the neck of one of Slussen's hroth-beasts.\nNorra and her team managed to sneak into the hroth-beasts' feeding pan only to be ambushed by Slussen, Gedde, and his henchmen. When Jom and Sinjir asked Slussen to surrender Gedde in return for leaving his palace, Slussen rejected their offer and revealed that he was working with Gedde. After Jas publicly claimed that she had double-crossed her team, Slussen ordered his guards to secure Norra and her team in cages. However, Norra and her team managed to escape with Jas' connivance. They then kidnapped Gedde and escaped offworld on Emari's ship Halo, which was being piloted by Temmin.\nAs a Vorlaggn, Slussen Canker had skin crackled like char on fire-cooked meat. He also had fissures that emanated clear fluid and three hollow-set eyes. When Slussen spoke, his tongues clicked and clucked; causing his voice to sound wet and rheumy. As a crime lord, Slussen was involved in slavery and also sheltered the Imperial fugitive Perwin Gedde. He disliked intruders who breached his palace. While unscrupulous, Slussen maintained his agreement to shelter Gedde. He and Gedde were also deceived by Jas, who lulled them into believing that she was planning to double-cross her team.\nSlussen Canker first appeared as a minor antagonist in Chuck Wendig's 2016 novel Aftermath: Life Debt, the second installment in The Aftermath Trilogy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Vorlaggn",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Slavery",
  "/wiki/Galactic_Civil_War",
  "/wiki/5_ABY",
  "/wiki/Vice_Admiral",
  "/wiki/Perwin_Gedde",
  "/wiki/New_Republic",
  "/wiki/Crime_lord",
  "/wiki/Volcano",
  "/wiki/Slussen_Canker%27s_palace",
  "/wiki/Planet",
  "/wiki/Vorlag",
  "/wiki/Hroth-beast",
  "/wiki/Poison",
  "/wiki/Spice",
  "/wiki/Standard_year",
  "/wiki/Capture_of_Perwin_Gedde",
  "/wiki/Norra_Wexley",
  "/wiki/Bounty_hunter",
  "/wiki/Jas_Emari",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/New_Republic_Special_Forces",
  "/wiki/Soldier",
  "/wiki/Jom_Barell",
  "/wiki/Standard_day",
  "/wiki/Laser",
  "/wiki/Temmin_Wexley",
  "/wiki/Bounty",
  "/wiki/Currency",
  "/wiki/Black_Sun",
  "/wiki/Starship",
  "/wiki/Halo",
  "/wiki/Pilot",
  "/wiki/Fire",
  "/wiki/Eye",
  "/wiki/Tongue",
  "/wiki/Chuck_Wendig",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Star_Wars:_The_Aftermath_Trilogy",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}