{
 "name": "Sly_Moore",
 "display_name": "Sly Moore",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Umbara"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Umbaran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.78 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Office of the Chancellor",
      "Office of the Chancellor",
      "Galactic Empire",
      "Imperial Ruling Council",
      "Umbaran's Court",
      "Prescreen department",
      "Imperial Ruling Council",
      "Umbaran's Court",
      "Prescreen department",
      "Sith",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Sly Moore, also known as \"the Umbaran,\" was an Umbaran female Force Adept with the ability to manipulate the minds of others. Moore served as the Senior Administrative Aide and Chief of Staff of Supreme Chancellor Sheev Palpatine during the final years of the Galactic Republic. Moore was one of the few people who knew of Palpatine's true identity as the Sith Lord Darth Sidious, and she stood by the Chancellor's side along with Vice Chair Mas Amedda when the former ended the Clone Wars and declared a Proclamation of the New Order, anointing himself the title of Galactic Emperor.\nDuring the Imperial Era, Moore was a close confidante of Grand Vizier Amedda, and the Umbaran also remained one of Palpatine's closest allies. In the years following the Battle of Yavin, Moore oversaw Ochi of Bestoon and even conspired to kill Darth Vader, the Emperor's sith apprentice. When the Dark Lord of the Sith discovered Moore's treachery, she asserted that if she rescued Han Solo, Vader ought not tell the Emperor of her betrayal. Though Moore failed to retrieve Solo, she was not killed for her actions.\nA Force-sensitive female native of the planet Umbara, Sly Moore served as the Senior Administrative Aide to Supreme Chancellor Sheev Palpatine—who was, in secret, Darth Sidious, the Dark Lord of the Sith—following his election to that office, and stood beside both the Chancellor and Vice Chair Mas Amedda atop the Chancellor's podium in the center of the Galactic Senate Chamber, located in the Senate Building on the planet Coruscant, during sessions of the Galactic Senate. It was rumored that Moore threatened Sei Taria, Chancellor Finis Valorum's aide, with blackmail to resign when Taria tried to join Palpatine after Valorum's removal from office. Her past prior to her association with Palpatine was shrouded in mystery, but she was aware of Palpatine's dual role as Chancellor and Sith Master, and assisted the Sith's rise to power.\nIn 24 BBY Count Dooku of Serenno, a former Jedi Master, delivered the Raxus Address, in which he denounced the Republic as a futile enterprise rife with favoritism and corruption that harmed the outer systems in order to benefit the Core Worlds. In the wake of Dooku's speech, several dissatisfied members of the Republic left the government and joined the Confederacy of Independent Systems with Dooku as its leader. In 22 BBY, the Senate intended to vote on the Military Creation Act, but the decision was delayed after an attempt was made on Senator Padmé Amidala's life. In the wake of the attempted assassination, Moore was present during a meeting between the Jedi Council and Palpatine in the latter's office in order to discuss the upcoming vote. When Mas Amedda escorted the Loyalist Committee into the office, Moore exited the room alongside several other Jedi present.\nIn the following days, Jedi Knight Obi-Wan Kenobi discovered that a clone army had been created for the Republic in secret on the hidden world of Kamino. He also discovered that the Confederacy had forged a contract with several megacorporations to manufacture an army of battle droids to wage war against the Republic. From his location on Geonosis, Kenobi contacted Amidala and his padawan, Anakin Skywalker, who forwarded his message to Palpatine's office in turn, where Moore, the Loyalist Committee, and the Jedi Council listened to his report. In the wake of the message, Moore was present in the session of the Galactic Senate in which Junior Representative Jar Jar Binks of Naboo proposed that Palpatine be given emergency executive powers in order to combat the threat that the Confederacy posed to the Republic. The proposal was successful, and Palpatine declared that the clone army would become the Grand Army of the Republic.\nDuring the Clone Wars, in which the Grand Army fought against the Separatist battle droid armies, Moore continued to serve the Chancellor and accompanied Janus Greejatus, Ars Dangor, Sate Pestage, and Lieutenant Commander Orson Krennic to Geonosis to oversee Poggle the Lesser's homecoming. As Poggle gave a speech to his fellow Geonosians, Moore sat in the Petranaki Arena alongside the other emissaries.\nAfter the Battle of Coruscant, she was present with the Chancellor in the Galaxies Opera House on Coruscant for a performance of the Mon Calamari play Squid Lake. Palpatine dismissed her and his other aides upon the arrival of Jedi Knight Anakin Skywalker, to whom he told the story of Darth Plagueis, his Sith Master, as part of his plan to seduce Skywalker to the dark side of the Force.\nMoore remained by Sidious's side as the Dark Lord's machinations reached their endgame at the height of the war. Under Sidious's direction, Count Dooku and the Confederate General Grievous swept into Coruscant with a massive naval force and kidnapped the supreme chancellor. Before they were able to abscond with the Republic head of state, the Separatist fleet was interdicted by the Republic Navy and Palpatine was rescued by General Anakin Skywalker. Dooku was killed in the conflict, but the war carried on while the Senate continued to vote to give the Chancellor's Office increasingly significant powers to end the war. Days after the Battle of Coruscant, Moore joined Chancellor Palpatine, Mas Amedda, and Senator Sweitt Concorkill at the Galaxies Opera House in the Uscru District for an evening of theater. During a showing of the Mon Calamari ballet Squid Lake, the four politicians were joined in their private box by General Skywalker, who had come to the opera house at the chancellor's request. While discussing the location of General Grievous and the remaining Separatist leadership, Palpatine dismissed Moore, Amedda, and Concorkill so he could confer privately with the young Jedi Knight.\nA brief time later, General Grievous was killed on Utapau in an action that was intended by the Jedi to end the war. Although Palpatine had publicly promised to push for an end to hostilities on the occasion of the general's death, it was simultaneously revealed to the Jedi Order that the supreme chancellor was secretly the Dark Lord of the Sith Darth Sidious who had been manipulating events throughout the Clone Wars and long before. The Jedi Council's attempt to arrest Palpatine for his crimes ended in disaster; the four arresting Jedi Masters were killed and Anakin Skywalker joined the Dark Lord as his new Sith apprentice, Darth Vader. In the immediate aftermath, Sidious declared the Jedi enemies of the state and activated Order 66—a clone protocol programmed into their inhibitor chips that marked all Jedi for execution.\nWith the Senate marginalized and the Jedi purged, the Supreme Chancellor moved to end the war by sending Darth Vader to hunt down and kill the remaining Separatist leadership on Mustafar. In what became known as the first Empire Day, Sidious, in his public role as Palpatine—heavily deformed by his battle with the Jedi—stood before the Senate alongside Moore and Amedda to issue the Proclamation of the New Order, which formally ended the war, branded the Jedi as traitors, and transformed the Republic into the First Galactic Empire.\nBy 5 BBY, Moore had become a member of Grand Vizier Mas Amedda's private chamber. That year, Perrin Fertha invited her to dinner with the Governor of Hanna for his Day of Days. Fertha's wife, Senator Mon Mothma, however, objected to her invitation, as Moore hated Mothma and had the day before cut off the Ghorman shipping lanes.\nAfter the Sith assassin Ochi of Bestoon had apparently buried the Sith Lord Darth Vader in the cave of the Eye of Webbish Bog on Mustafar on behalf of Sidious, Ochi, reveling in his success, was approached by Moore and four death troopers. Moore expressed her doubts of Vader being dead and refused to contact the Emperor. She told the assassin that Vader was looking for the Emperor's secrets in the cave and demanded to know if Ochi had told Vader anything. Ochi denied this, stating that it would not matter if he told Vader anything, because no one ever came back from the Eye. Moore, however, argued that Vader was still Vader.\nVader ultimately survived the Eye of Webbish Bog and took Ochi prisoner inside an escape pod so he could seek Exegol to discover the Emperor's secrets. Moore was thus sent by the Emperor to complete Ochi's mission, assigning Admiral Corleque and his crew to assist Moore in the task with three Star Destroyers. Firing at Vader's ship, Moore contacted the Sith Lord and expressed her respect for him before notifying him that she would have to eliminate him. Unfazed, Vader told Moore that she would fail just like Ochi. Moore then ordered Corleque to not shoot the cannons and send eleven TIE fighters as \"brute force\" against Vader. Moore sarcastically congratulated Vader for outsmarting the TIEs and dismissed the losses.\nThe rest of the TIEs followed Vader until they reached the Red Honeycomb Zone, where a space-faring creature destroyed them. Moore warned Admiral Corleque about the creature and assured Vader that the creature was the galaxy's greatest predator before him. Vader evaded the creature while keeping his course to Exegol, leading a lieutenant to ask Moore if they should still pursue Vader, but Moore asked him to calm down and confided Corleque that she would not require further assistance of them for that day.\nMoore met with Sidious shortly afterwards on the Sith Citadel of Exegol. Following Darth Vader's surrender and apparent resignation to share Sidious' power, Moore departed from Exegol along with Sidious, Mas Amedda, Vader, and Ochi.\nUpon returning to Coruscant, Moore accompanied Sidious, Amedda, Vader and Ochi to the very tower where Vader had first been rebuilt. When Amedda questioned how he was still alive, Moore responded that as a Sith, his hatred gave him power. Sidious also assured Moore and Amedda that Vader was beyond his reach and that they were both beneath his notice. The three of them then watched as Vader was rebuilt once again and Ochi was given a cybernetic visor so he could continue to see after having his eyes burned. When Vader asked his master his will, Sidious told him to decide that for himself. Vader then departed from Coruscant with Ochi in a Lambda-class shuttle. Following Vader and Ochi's departure, Moore and her court secretly hired IG-88B to assassinate Vader with the Droid Crush Pirates of Bestoon. She also informed him of the Sith Lord's damaged state and gave him the code needed to slice into his armor. Vader and Ochi were lured into an ambush by a Hutt named Bokku, who sent them after the pirates in an attempt to locate Han Solo. However, IG-88 and the pirates were swiftly defeated by Vader and Ochi. IG-88 then returned to Moore and her court on Coruscant to report his loss. The droid lamented that Vader could not be defeated, but Moore assured him that Vader could only defeat them one at a time. And if they all stood together, they would be more powerful than either Vader or Sidious could ever imagine.\nAfter uncovering Sly Moore's betrayal, Vader and Ochi returned to Coruscant to find her, her court and IG-88 in Administrative Temple Garden 313A. As Vader struck down IG-88 once again, Moore and her court fled into the nearby temple. As they attempted to escape into the streets, Vader used the Force to close the door in front of them. However, Moore then took out another remote and used it to freeze Vader in his own armor, allowing her and her court to open fire on the Sith Lord. But this did not last as Vader overcame the Umbaran's control and struck down her entire court. Moore tried once more to take control of Vader, but Ochi revealed that Vader had fixed that vulnerability in his armor. Vader then knocked the remote out of Moore's hand and told her that she could not bend his will. Moore responded that she only wanted to see if Vader was still plagued by fear, to which Vader said that the only fear in that place was hers. Moore conceded that he could kill her effortlessly, but also pointed out that doing so would do nothing to save him from Luke Skywalker. When Vader asked the Umbaran what she knew of Skywalker, she revealed that the key to finding him, his friend Han Solo was currently being sold by Crimson Dawn. She also pointed out that if she secured Solo for Vader, then the Emperor would not learn of his plans. When Ochi asked Moore why Vader should trust her, the Umbaran answered that she would be delighted to reunite Vader with the only person who could kill him, to which Vader agreed and Ochi laughed.\nShortly after, Ochi and Moore left for Jekara along with a few Imperial officers to attend the Auction for Han Solo. Once Crimson Dawn's leader, Lady Qi'ra began the bidding within the Vermillion, Moore attempted to bid for the smuggler, but soon found herself in conflict with Jabba Desilijic Tiure, Bokku and the rest of the attending Grand Hutt Council. While the Umbaran was able to use a mind trick to weaken the minds of the other bidders, she found that the Hutts were too strong-willed for her to manipulate. After losing the bid, Moore took Ochi aside and asked why Bokku was bidding against her. Ochi explained to her that Vader had only sent her there to humiliate her in the Emperor's eyes. The auction was then interrupted by the arrival of Vader himself. Guarded by two death troopers, he declared that Solo belonged to him. As Vader argued with Jabba over the custody of Solo, Moore attempted to explain the situation to him. But Vader simply chastised Moore for her failure and warned her that the Emperor would hear of it. Once Jabba relinquished custody of Solo, Vader briefly fought Qi'ra before contacting Skywalker, ordering him to come to him lest he would kill his friend. Skywalker refused however and told Vader to come to him. Vader then ordered General Romodi to bring Solo aboard the Executor and ready his TIE Advanced.\nWhile Vader pursued Skywalker above Jekara, Moore contacted him from the Vermillion, only for him to tell her that he did not require her assistance. Moore then told him that she was not helping him as his ship was attacked by the Droid Crush Pirates. Overhearing this, Ochi attacked the Umbaran, destroying her droid guards and accusing her of attempting to kill Vader. To this, Moore reminded him that she served the Emperor in all things at all times. As they fought outside the Vermillion, Ochi ordered Moore to call off the pirates. Moore then explained to Ochi that Vader feared Skywalker because of his strength. If the Emperor claimed Skywalker as his apprentice, then Vader would become obsolete. Moore also pointed out that Vader could not kill her without betraying the Emperor and that he and Ochi had failed to destroy the Emperor's greatest weapon. She then subdued Ochi with a stab to the chest and told him that he would return to his true master. Suddenly, they were interrupted by a Hutt ship flying overhead. Ochi then contacted Bokku and discovered that the Hutts were going after the Imperial shuttle transporting Solo.\nAfter informing Vader of the situation, the Sith Lord eliminated the Grand Hutt Council and forced the Hutts to retreat. All the while, Ochi fought and captured Moore, bringing her onto the Executor before Mas Amedda. Moore once again defended her actions, claiming the Emperor wanted Skywalker alive. But upon arriving, Vader told Moore that the boy had fled during the battle, revealing that he was not who the Emperor believed he could be. When Moore retorted that he was still free and could still fight, the Sith choked her with the Force and claimed that his hope would not be enough. Vader was then contacted by Sidious, to which he released his grip on Moore and knelt before his master. Once Vader restated his loyalty to Sidious, Sidious tasked him with rooting out and eliminating Crimson Dawn's agents within the Empire. Ochi then laughed at Moore once more before departing with Vader and Mas Amedda.\nAfter a long absence from Coruscant, Vader and Ochi suddenly entered Sidious' throne room and killed all of the Emperor's present Royal Guards and several of his aides, though not Moore. Sidious then informed his apprentice that only one of them had been Crimson Dawn, meaning his list of collaborators was flawed. Vader reassured his master that he would bring order before he and Ochi left. Sometime later, Moore was confronted by Ochi, who accused her of planting the list herself. To this, Moore told Ochi that his name would've been on the list if that were the case. Just then, both of them were stunned by ZED-6-7. The droid was accompanied by Sabé, who told Moore and Ochi to do as she said or else she would inform Vader of their loyalty to Crimson Dawn.\nAs ZED-6-7 confirmed their identities, Ochi attacked Sabé, only for the droid to subdue them again. Sabé went on to explain that she was with Crimson Dawn as well and that the real names on the list were planted to clean out the syndicate. She then asked them what Vader wanted, to which Ochi said that he wanted her due to her affiliation with the Dawn. Sabé said he could inform Vader if he wanted, but she still wanted to know what drove the Sith Lord to do what he did. When Ochi and Moore clarified that Vader wanted power and order, Sabé said they would use him to bring chaos.\nAn Umbaran female, Sly Moore had pale skin and white eyes, and her head was bald. She was always at Palpatine's side—even when he addressed the galaxy from atop his podium in the Senate Chamber—but kept silent in most situations and zealously guarded her master's secrets. Moore was completely aware of Palpatine's identity as a Sith and remained loyal to him even as he dismantled the Republic, forming the Galactic Empire. However, Moore's loyalty to the Empire is questionable as she conspired to kill Darth Vader while saying she is only loyal to Palpatine himself.\nMoore was able to use the force and adept at manipulating political opponents to reveal their secrets.\nInstead of following the lead of her senator in choosing her formal attire, Moore preferred to create an intimidating look, by wearing a long Umbaran shadow cloak with a high collar. Moore also carried stiletto-like knives known as vooktar.\nSly Moore was originally created for the 2002 prequel trilogy film Star Wars: Episode II Attack of the Clones, where she was portrayed by Australian disc jockey and actress Sandi Finlay. However, she was first identified by name in the credits for the 2005 film Star Wars: Episode III Revenge of the Sith, where Finlay reprised her role as the character. Make-up artist Lesley Vanderwalt determined Moore's skin tones and palette based on goth-like concept art by concept artist Dermot Power. One of the earlier drafts for Episode II had the character who ultimately became Moore known as Uv Gizen.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sly_Moore",
  "/wiki/Sly_Moore/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Sly_Moore",
  "/wiki/Special:Upload",
  "/wiki/Umbara",
  "/wiki/Umbaran",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Office_of_the_Chancellor",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Umbaran%27s_Court",
  "/wiki/Prescreen_department",
  "/wiki/Sith",
  "/wiki/Crimson_Dawn",
  "/wiki/Force-sensitive",
  "/wiki/Brain",
  "/wiki/Senior_Administrative_Aide",
  "/wiki/Chief_of_Staff",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Republic_Era",
  "/wiki/Sith_Lord",
  "/wiki/Darth",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Clone_Wars",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Imperial_Era",
  "/wiki/Grand_Vizier",
  "/wiki/Battle_of_Yavin",
  "/wiki/Ochi",
  "/wiki/Bestoon",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sith_apprentice",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Han_Solo",
  "/wiki/Death",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Supreme_Chancellor_Election,_32_BBY",
  "/wiki/Chancellor%27s_podium",
  "/wiki/Galactic_Senate_Chamber",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Coruscant",
  "/wiki/Galactic_Senate",
  "/wiki/Sei_Taria",
  "/wiki/Finis_Valorum",
  "/wiki/Sith_Master",
  "/wiki/24_BBY",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Serenno",
  "/wiki/Jedi_Master",
  "/wiki/Raxus_Address",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/22_BBY",
  "/wiki/Military_Creation_Act",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Jedi_Council",
  "/wiki/Emperor%27s_office",
  "/wiki/Loyalist_Committee",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mission_to_Kamino_(Separatist_Crisis)",
  "/wiki/Cloning",
  "/wiki/Army",
  "/wiki/Kamino",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Battle_droid",
  "/wiki/Geonosis",
  "/wiki/Padawan",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Naboo",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Janus_Greejatus",
  "/wiki/Ars_Dangor",
  "/wiki/Sate_Pestage",
  "/wiki/Lieutenant_Commander",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Geonosian",
  "/wiki/Petranaki_Arena",
  "/wiki/Emissary",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Galaxies_Opera_House",
  "/wiki/Mon_Calamari",
  "/wiki/Squid_Lake",
  "/wiki/Aide",
  "/wiki/Tragedy_of_Darth_Plagueis_the_Wise",
  "/wiki/Darth_Plagueis",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Grievous",
  "/wiki/Sweitt_Concorkill",
  "/wiki/Uscru_District",
  "/wiki/Utapau",
  "/wiki/Battle_of_Utapau",
  "/wiki/Duel_in_Palpatine%27s_office",
  "/wiki/Order_66",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Mustafar",
  "/wiki/Empire_Day",
  "/wiki/5_BBY",
  "/wiki/Perrin_Fertha",
  "/wiki/Governor",
  "/wiki/Hanna_City",
  "/wiki/Day_of_Days",
  "/wiki/Mon_Mothma",
  "/wiki/Ghorman",
  "/wiki/Starship",
  "/wiki/Sith_assassin",
  "/wiki/Eye_of_Webbish_Bog",
  "/wiki/Death_trooper",
  "/wiki/Escape_pod",
  "/wiki/Exegol",
  "/wiki/Admiral",
  "/wiki/Corleque",
  "/wiki/Star_Destroyer",
  "/wiki/Cannon",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Red_Honeycomb_Zone",
  "/wiki/Realspace",
  "/wiki/Unidentified_summa-verminoth_subspecies",
  "/wiki/The_galaxy",
  "/wiki/Lieutenant",
  "/wiki/Sith_Citadel",
  "/wiki/Cybernetics",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/IG-88B",
  "/wiki/Droid_Crush_Pirates_of_Bestoon",
  "/wiki/Bokku",
  "/wiki/Administrative_Temple_Garden_313A",
  "/wiki/Luke_Skywalker",
  "/wiki/Jekara",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Mind_trick",
  "/wiki/General",
  "/wiki/Hurst_Romodi",
  "/wiki/Executor",
  "/wiki/Darth_Vader%27s_TIE_Advanced",
  "/wiki/Force_choke",
  "/wiki/Purge_of_suspected_Crimson_Dawn_collaborators",
  "/wiki/ZED-6-7",
  "/wiki/Sab%C3%A9",
  "/wiki/Eye",
  "/wiki/Politics",
  "/wiki/Umbaran_shadow_cloak",
  "/wiki/Knife",
  "/wiki/2002",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Sandi_Finlay",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Dermot_Power",
  "/wiki/Uv_Gizen",
  "/wiki/Category:Images_of_Sly_Moore",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Skywalker_Saga",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/Revenge_of_the_Sith_(Golden_Book)",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Andor_(television_series)",
  "/wiki/Aldhani_(episode)",
  "/wiki/Darth_Vader_(2020)_8",
  "/wiki/Darth_Vader_(2020)_10",
  "/wiki/Darth_Vader_(2020)_11",
  "/wiki/Darth_Vader_(2020)_12",
  "/wiki/Darth_Vader_(2020)_14",
  "/wiki/Darth_Vader_(2020)_13",
  "/wiki/Doctor_Aphra_(2020)_11",
  "/wiki/War_of_the_Bounty_Hunters_2",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/Darth_Vader_(2020)_16",
  "/wiki/Darth_Vader_(2020)_17",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_IG-88_1",
  "/wiki/Crimson_Reign_3",
  "/wiki/Darth_Vader_(2020)_20",
  "/wiki/Darth_Vader_(2020)_21",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Escape_from_Coruscant",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Factivity_Collection:_Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_60",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Scarif",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Kassa_(episode)",
  "/wiki/Databank_(original)",
  "/wiki/September_6",
  "/wiki/2007"
 ]
}