{
 "name": "Slyssk",
 "display_name": "Slyssk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Raff Syndicate",
      "Cargryph Capital Management"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Marn Hierogryph"
     ]
    }
   ]
  }
 ],
 "content": "Slyssk was a male Trandoshan ship thief, who joined Marn Hierogryph and Jedi Zayne Carrick through their adventures in the Mandalorian Wars.\nA male Trandoshan, Slyssk lived around the time of the Mandalorian Wars, a major conflict between the Galactic Republic and the nomadic Mandalorian warriors. A core part of Trandoshan culture was hunting but partaking in it left Slyysk feeling nauseous so he choose an alternate career as a starship thief. Slyssk joined the Raff Syndicate where he learned how to steal ships, but he soon became disenfranchised with the pirate group and ended up being kicked out of their ranks before he could actually learn how to pilot the craft he stole.\nSlyssk's skills were later enlisted when Snivvian black marketeer, Marn Hierogryph, and Human Jedi Padawan, Zayne Carrick—both of whom were on the run from the Jedi Covenant after being falsely accused as the perpetrators of the Padawan Massacre of Taris—were looking for passage off the planet Ralltiir. Hierogryph arranged for Slyssk to steal a ship that would be delivered to Pad 223 at midnight for the sum of 9000. The Trandoshan's target ship was the Little Bivoli, a Quartermaster-class supply carrier owned by a crew of freelance provisioners who assisted the overwhelmed supply channels of the Republic Navy. While the owners were preparing to refuel the ship, Slyssk stole the Bivoli and flew it to Pad 223, damaging several lampposts in the process of landing the craft. He hid inside the ship upon seeing Hierogryph and Carrick waiting, but the timid Trandoshan eventually emerged only to demand ten times his original price. He reasoned that Hierogryph's notoriety warranted the increase, but negotiations between the two sentients were proving futile so Carrick used the Force to bring one of the damaged lampposts down onto Slyssk. Hierogryph pushed the Trandoshan out of harm's way in time—an act which Slyssk saw fit to swear a life debt for, naming the Snivvian as his ghrakhowsk—to let them have the ship for free under the terms of Slyssk's life debt. The original crew then arrived and attempted to recover their ship, forcing the trio to get aboard the ship and take off. Upon arriving in orbit, the Bivoli was hailed by the Courageous, flagship of a Republic fleet, and ordered to join formation for a hyperspace jump to Serroco where a confrontation with the Mandalorians was forthcoming.\nThe Bivoli landed on Serroco at Camp Three, a staging ground for the Republic Army, where Hierogryph opened the ship as an alternative to the army commissary. Slyssk was employed as the chef, with his Bivoli Tempari gaining a positive reputation among the soldiers and highlighting the Bivoli as \"the place to be in Camp Three\". Carrick, meanwhile, insisted that Slyssk and Hierogryph leave the planet on the basis of a premonition he had of the impending Mandalorian attack and left for the Courageous to try and warn the fleet. On the next day—the same day Carrick had predicted the battle would take place—Slyssk prepared Trandoshani flatcakes using an improved method of his that made the food particularly good. Despite Carrick pleading with Hierogryph via comlink for them to leave, the Snivvian kept the Bivoli open into the afternoon and only made ready to leave after a warning siren sounded the arrival of Mandalorian vessels in the system. At this point, Slyssk informed Hierogryph that, because he had stolen the ship before it was completely refueled, there was not enough fuel to leave the planet. The Trandoshan soon suffered a panic attack, seized his ghrakhowsk, and ran aboard a delayed troop transport. Forcing himself past the transport's guards, Slyssk took the helm and launched the ship to safety. It later transpired that the transport's flight crew had been asleep, and thus Slyssk had inadvertently saved half a battalion of Republic soldiers. When met on Chandrila by members of the Ministry of Defense, a propaganda story was built around Hierogryph and Slyssk using the identities of Captain Benegryph Goodvalor and Commander True, Goodvalor's \"trusty Trandoshan sidekick\", respectively.\nEventually, the pair were picked up by the Ithorian, bounty hunting Moomo Brothers by the order of Lhosan Industries' chairman, Jervo Thalien, for a task on the planet Taris. While Hierogryph led the Taris Resistance against the Mandalorian Neo-Crusaders who had invaded the planet, Slyssk and Dob Moomo retrieved Carrick from the beleaguered Arkanian Legacy and brought him, as well as Jedi Knight Alek; Mandalorian scientist Demagol, disguised as Rohlan Dyre; and Arkanian Offshoot Jarael, back to Taris. Arriving on Taris, Carrick jumped from the Moomo's ship, Moomo Williwaw, and met with Hierogryph, leaving Slyssk and the rest of the group to find a place in orbit to wait.\nAround the same time as the Mandalorian occupation of Taris, a bounty placed upon Slyysk for charges of piracy totalling 40,000 was advertised in The Adjudicator Special Report: The Colonies trade publication. The resistance on Taris ultimately failedso Slyssk and the Williwaw escorted Sector Constable Noana Sowrs's children safely to Alderaan before hastening to rescue Carrick and Hierogryph from the Rakghoul–infested planet of Jebble. Slyysk remained with the crew during their travels to the planet Odryn where part of the group retrieved Sith artifacts from a Jedi Covenant storehouse with which they could expose the Covenant.\nThe Williwaw arrived at Coruscant, home to the base of the Jedi Covenant and the Jedi Order as a whole, to find its path blocked by a formation of Republic warships. Attempting to run the blockade led by Swiftsure, the ship was heavily damaged, forcing the crew to try a different plan. Purposefully crashing the Williwaw into Swiftsure's hangar, Slyysk stole aboard a Conductor-class shuttle and, using the discord caused by the Williwaw's crash as cover, ferried Carrick and Hierogryph to the planet below. Slyysk had a panic attack after landing which forced Hierogryph to give the Trandoshan some credits and send him to a hotel to rest. Hierogryph and Carrick were successful in clearing their names with the Jedi, bringing an end to the Jedi Covenant in the process, and set out to stop those who made life poorer for others. While Carrick took a leave of absence, Hierogryph sent Slyysk to buy a new starship to replace the Williwaw. As he had only ever stolen ships previously, the Trandoshan became nervous at the prospect of legally buying one and so he bought what was described to him as \"a gem of a ship\". What he did not realize was that the ship, called Hot Prospect, was in fact a Calipsan 560 gem mining ship infested with mynocks and generally in poor condition. In return for being fooled into buying the sub-par ship, Hierogryph used his position as Slyysk's ghrakhowsk to make the Trandoshan work on cleaning up the ship.\nThe crew of the Hot Prospect, still minus Carrick, went to the planetary rights auction being held at the Metellos Exchange with the intention of scamming it. Their ploy was uncovered by the Chevin manager of the Raff Syndicate-backed Metellos Exchange, Nunk Plaarvin, leading to the capture of Jarael and Demagol. Carrick returned and met up with Hierogryph and Slyysk aboard the Hot Prospect where they formulated a plan to rescue their friends by having the Trandoshan pretend to be a Raff captain, complete with a suitable outfit that recycled the Prospect's mynocks as kneepads. The trio confronted Plaarvin and managed to intimidate him into leaving for the recently decimated planet, Jebble. With Plaarvin gone, Jarael and Demagol were rescued and the Prospect left Metellos 3 to investigate a missing ship, the Chancellor Fillorean.\nSlyssk hotwired the hatches of the Chancellor Fillorean to gain entry, only for the crew to find it with all hands dead bar two: Toki Tollivar, a masquerading Bimm Sith Acolyte; and his companion droid. Slyssk gave the Bimm water and prepared food, but when the Trandoshan was left alone with Tollivar, the Sith attempted to strangle him. Demagol performed a field tracheotomy, saving the Trandoshan's life, before Tollivar was exposed as a Sith and killed. The Hot Prospect then traveled to the swoopdueling tournaments at Jervo's World where Slyssk was forced to remain medicated on the ship under Demagol's care while he recovered from Tollivar's attack.\nThe Hot Prospect next stopped off at Wor Tandell, where Slyssk knew a friend at a plantation who would let them use the plantation's facilities. Jedi Knight Alek, now going by the name Malak, met Jarael at the camp and Slyssk was on hand to cook a meal for the party. After a confrontation between Malak and Demagol, the crew left the planet to root out The Crucible slaving operation. Meanwhile, Slyssk, continuing his role of ship cleaner by mopping up after Demagol's chemical experiments, found a microtag that had been affixed to Exar Kun's lightsaber which Demagol had extracted from nullification resin.\nArriving in the Koornacht Cluster, Carrick and Jarael pretended to be Crucible traders and confronted the head of the Sungrazer cooperative, Sariyah Budan, and threatened to undercut Budan's mining operation by collecting the valuable thorilide crystals themselves. To lend credence to their threat, the rest of the Prospect's crew started harvesting crystals with Slyssk even working out how to use several of the mining systems on the Calipsan 560, including the particle accelerator. The Trandoshan also pointed out to Hierogryph that they could use the ship's on-board centrifuge to process the crystals on the ship for greater convenience. However, as soon as Carrick and Jarael started to free the enslaved workers, Crucible Fleet Captain Dace Golliard arrived aboard the Gladiator to bring a halt to the disruption. With the Crucible ship laying down heavy blasterfire on the Prospect's attitude thrusters, Slyssk was unable to move the ship around to retaliate with what little weaponry it possessed. Improvising, the crew used xenoboric acid, a drill and a crane arm to attack the Gladiator. To make their escape, Carrick told Slyssk to shut off the inertial compensators while he jammed the massive centrifuge aboard the Prospect. The resulting transfer of momentum sent the mining ship into a sudden spin, allowing it to get clear enough to jump to hyperspace.\nIn an attempt to track down the Crucible's base, Carrick posed as \"Carth Kamlin\", a stranded Republic Navy officer, and was taken to the planet Volgax. Jarael eventually managed to discover Carrick's location after the Crucible abandoned Volgax, but a disagreement over Jarael's past left the crew of the Hot Prospect bereft of both her and Demagol. Meanwhile, on Coruscant, Rohlan Dyre—widely believed to actually be Demagol—awoke from the coma he had been in from when Demagol slipped aboard Carrick's ship prior to the Jedi and his companions meeting Slyssk. Carrick, Hierogryph and Slyssk were asked to return to Coruscant so that they could give evidence at Demagol's trial for the many crimes and grotesque experiments he had carried out. However, before the trial, Carrick managed to get Hierogryph and Slyssk to reveal what had actually happened to them on Serroco. In a similar revelation, T1-LB—a bulk-loading droid that had been traveling with Carrick—explained that Demagol had switched places with Dyre so that the latter was facing trial for the former's crimes. After breaking Dyre free from his trial as Demagol, Carrick sent Slyssk to collect a set of Mandalorian armor for Dyre as well as to escort Shel Jelavan, a co-founder of Carrick's Rogue Moon Project, back to the base of the Project where the group formed a plan to find and rescue Jarael. Slyssk piloted the Hot Prospect for a final mission in which Dace Golliard was captured. Golliard subsequently surrendered the location of where Jarael and Demagol were: the planet Osadia. On Osadia, Carrick and Dyre managed to save Jarael while Demagol was killed, bringing an end to the dangerous work he carried out. Days later, the group went their own separate ways, with Slyssk working under Hierogryph as a waiter and chef in the Goodvalor's Little Bivoli restaurant on Coruscant.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Raff_Syndicate",
  "/wiki/Cargryph_Capital_Management",
  "/wiki/Marn_Hierogryph",
  "/wiki/Ghrakhowsk",
  "/wiki/Jedi/Legends",
  "/wiki/Zayne_Carrick",
  "/wiki/Mandalorian_Wars",
  "/wiki/Old_Republic_era",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Snivvian/Legends",
  "/wiki/Black_marketeer",
  "/wiki/Human/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Covenant",
  "/wiki/Padawan_Massacre",
  "/wiki/Taris/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ralltiir/Legends",
  "/wiki/Pad_223",
  "/wiki/Time/Legends",
  "/wiki/Credit",
  "/wiki/Little_Bivoli",
  "/wiki/Quartermaster-class_supply_carrier",
  "/wiki/Little_Bivoli%27s_original_crew",
  "/wiki/Fringer",
  "/wiki/Republic_Navy",
  "/wiki/Fuel/Legends",
  "/wiki/Lamp/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Life_debt/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Courageous_(Inexpugnable-class)",
  "/wiki/Flagship/Legends",
  "/wiki/Battle_Group_Serroco",
  "/wiki/Hyperspace/Legends",
  "/wiki/Serroco",
  "/wiki/Battle_of_Serroco",
  "/wiki/Camp_Three_(Serroco)",
  "/wiki/Republic_Army",
  "/wiki/Chef/Legends",
  "/wiki/Bivoli_Tempari",
  "/wiki/Soldier/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Flatcake/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Battalion/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Chandrila/Legends",
  "/wiki/Ministry_of_Defense",
  "/wiki/Captain/Legends",
  "/wiki/Benegryph_Goodvalor",
  "/wiki/Commander_True",
  "/wiki/Ithorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Moomo_Brothers",
  "/wiki/Lhosan_Industries",
  "/wiki/Jervo_Thalien",
  "/wiki/Taris_Resistance",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Taris_Siege",
  "/wiki/Dob_Moomo",
  "/wiki/First_Battle_of_Omonoth",
  "/wiki/Arkanian_Legacy",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Scientist/Legends",
  "/wiki/Demagol",
  "/wiki/Rohlan_Dyre",
  "/wiki/Arkanian_Offshoot/Legends",
  "/wiki/Jarael",
  "/wiki/Moomo_Williwaw",
  "/wiki/Bounty/Legends",
  "/wiki/The_Adjudicator_Special_Report:_The_Colonies",
  "/wiki/Sector_Constable",
  "/wiki/Noana_Sowrs",
  "/wiki/Alderaan/Legends",
  "/wiki/Rakghoul",
  "/wiki/Battle_of_Jebble",
  "/wiki/Jebble",
  "/wiki/Odryn",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Sanctum_of_the_Exalted",
  "/wiki/Coruscant/Legends",
  "/wiki/Draay_Estate",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Vanjervalis_Chain",
  "/wiki/Warship/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Swiftsure_(Inexpugnable-class)",
  "/wiki/Hangar/Legends",
  "/wiki/Conductor-class_short-haul_landing_craft",
  "/wiki/Shuttle/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Hotel/Legends",
  "/wiki/Vindication",
  "/wiki/Hot_Prospect",
  "/wiki/Calipsan_560_mining_ship",
  "/wiki/Mynock/Legends",
  "/wiki/Metellos_Exchange",
  "/wiki/Chevin/Legends",
  "/wiki/Nunk_Plaarvin",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Metellos_3",
  "/wiki/Chancellor_Fillorean",
  "/wiki/Death/Legends",
  "/wiki/Toki_Tollivar",
  "/wiki/Bimm_(furred_species)",
  "/wiki/Sith_Acolyte",
  "/wiki/K-OB7",
  "/wiki/Water/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Telekinesis/Legends#Choking_powers",
  "/wiki/Swoopdueling/Legends",
  "/wiki/Jervo%27s_World",
  "/wiki/Wor_Tandell/Legends",
  "/wiki/The_Crucible",
  "/wiki/Slavery/Legends",
  "/wiki/Microtag",
  "/wiki/Exar_Kun%27s_lightsaber/Legends",
  "/wiki/Nullification_resin",
  "/wiki/Koornacht_Cluster/Legends",
  "/wiki/Sungrazer_cooperative",
  "/wiki/Sariyah_Budan",
  "/wiki/Mining/Legends",
  "/wiki/Thorilide/Legends",
  "/wiki/Particle_accelerator",
  "/wiki/Dustdiver",
  "/wiki/Fleet_Captain/Legends",
  "/wiki/Dace_Golliard",
  "/wiki/Gladiator_(Crucible)",
  "/wiki/Blaster/Legends",
  "/wiki/Xenoboric_acid/Legends",
  "/wiki/Inertial_compensator",
  "/wiki/Dueling_Pits",
  "/wiki/Carth_Onasi",
  "/wiki/Kamlin",
  "/wiki/Volgax",
  "/wiki/Trial_of_Demagol",
  "/wiki/T1-LB",
  "/wiki/LB-series_bulk-loading_droid",
  "/wiki/Mandalorian_armor/Legends",
  "/wiki/Shel_Jelavan",
  "/wiki/Rogue_Moon_Project",
  "/wiki/Rogue_Moon_Project_Command",
  "/wiki/Incident_near_Ithor_system",
  "/wiki/Osadia",
  "/wiki/Standard_day/Legends",
  "/wiki/Goodvalor%27s_Little_Bivoli",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_Days_of_Fear",
  "/wiki/Knights_of_the_Old_Republic_21",
  "/wiki/Knights_of_the_Old_Republic_22",
  "/wiki/Knights_of_the_Old_Republic_28",
  "/wiki/Knights_of_the_Old_Republic_30",
  "/wiki/Knights_of_the_Old_Republic_31",
  "/wiki/Knights_of_the_Old_Republic_37",
  "/wiki/Knights_of_the_Old_Republic_38",
  "/wiki/Knights_of_the_Old_Republic_39",
  "/wiki/Knights_of_the_Old_Republic_42",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_The_Reaping",
  "/wiki/Knights_of_the_Old_Republic_46",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_Demon",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Secret_Journal_of_Doctor_Demagol_(article)",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds",
  "/wiki/Knights_of_the_Old_Republic_47",
  "/wiki/Knights_of_the_Old_Republic_13",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Knights_of_the_Old_Republic_15",
  "/wiki/Knights_of_the_Old_Republic_14",
  "/wiki/Knights_of_the_Old_Republic_40",
  "/wiki/Knights_of_the_Old_Republic_23",
  "/wiki/Knights_of_the_Old_Republic_24",
  "/wiki/Knights_of_the_Old_Republic_35",
  "/wiki/Knights_of_the_Old_Republic_36",
  "/wiki/Knights_of_the_Old_Republic_50",
  "/wiki/Knights_of_the_Old_Republic_48",
  "/wiki/Knights_of_the_Old_Republic_43",
  "/wiki/Knights_of_the_Old_Republic_44",
  "/wiki/Knights_of_the_Old_Republic_49"
 ]
}