{
 "name": "Smiley_(mynock)",
 "display_name": "Smiley  (mynock)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Hoth asteroid field"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mynock"
     ]
    }
   ]
  }
 ],
 "content": "A mynock, posthumously nicknamed Smiley, lived inside the exogorth Sy-O inside one of the asteroids of the Hoth asteroid field. In 3 ABY, it fed on the power cables of the Millennium Falcon when the rebel vessel landed within Sy-O's maw. The Starship's captain, Han Solo, then shot and killed the mynock and its body was sucked out into space when the Falcon exited through the exogorth's mouth.\nThe mynock's body was then discovered by Imperial Admiral Rae Sloane and Lieutenant Kanna Deltic while they were flying through the asteroid field in the Lambda-class T-4a shuttle Bastinade. The pair collected the mynocks body and brought it with them to the Executor, Flagship of the Sith Lord Darth Vader. After Deltic analyzed the corpse and gave it its nickname, it was presented to Admiral Firmus Piett and Vader, with Sloane showing the blaster burn on Smiley's corpse as proof that the Falcon had been hidden in the asteroid field.\nA mynock, which would be posthumously nicknamed Smiley, lived inside the exogorth Sy-O in an asteroid in the Hoth asteroid field. In 3 ABY, the Millennium Falcon, a Rebel Alliance YT-1300 light freighter fleeing from the Galactic Empire, flew into Sy-O's maw and landed inside the exogorth in order to lay low. Smiley landed on the ship and began feeding on the power cables. After Princess Leia Organa spotted a mynock through the cockpit viewport, the crew emerged to investigate. Captain Han Solo spotted the mynock opened fire with his blaster pistol and killed Smiley.\nWhen the Falcon then took off and flew out through Sy-O's mouth, Smiley's corpse was sucked out into space along with several other mynocks. The other mynocks perished in the vacuum and the cluster of dead mynocks was later spotted by Admiral Rae Sloane, who was flying through the asteroid field with Lieutenant Kanna Deltic in the Lambda-class T-4a shuttle Bastinade. The pair collected and froze the corpses of Smiley and several other mynocks and then flew to the Executor-class Star Dreadnought Executor.\nWhile Sloane reported to Admiral Firmus Piett and the Sith Lord Darth Vader, Deltic took the mynocks and analyzed them in the Star Destroyer's labs. She discovered the blaster mark on Smiley's corpse and gave the creature its nickname, before being summoned to Sloane's side by Vader. Deltic brought the mynock with her on a hovercart under a tarp and then revealed it to Sloane and Piett. She explained the analysis had shown that Smiley was killed by a hand blaster, proving that the Falcon had been hidden within the asteroid field. Sloane later ordered a pair of stormtroopers to remove the mynock's corpse.\nSmiley was a massive mynock with brown skin.\nSmiley first appeared in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. The creature was then identified in the short story \"Lord Vader Will See You Now\", which was written by John Jackson Miller and published in 2020 as part of the From a Certain Point of View: The Empire Strikes Back anthology.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/3_ABY",
  "/wiki/Hoth_asteroid_field",
  "/wiki/Mynock",
  "/wiki/Exogorth",
  "/wiki/Sy-O",
  "/wiki/Asteroid",
  "/wiki/Millennium_Falcon",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Mouth",
  "/wiki/Starship",
  "/wiki/Captain",
  "/wiki/Han_Solo",
  "/wiki/Death",
  "/wiki/Realspace",
  "/wiki/Galactic_Empire",
  "/wiki/Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Lieutenant",
  "/wiki/Kanna_Deltic",
  "/wiki/Asteroid_field",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Bastinade",
  "/wiki/Executor",
  "/wiki/Flagship",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Firmus_Piett",
  "/wiki/Blaster",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Cockpit",
  "/wiki/Viewport",
  "/wiki/Han%27s_heavy_blaster_pistol",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Star_Destroyer",
  "/wiki/Gender",
  "/wiki/Hovercart",
  "/wiki/Stormtrooper",
  "/wiki/Color",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Lord_Vader_Will_See_You_Now",
  "/wiki/John_Jackson_Miller",
  "/wiki/2020",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Smiley_(mynock)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/This_Is_No_Cave"
 ]
}