{
 "name": "Smurdap",
 "display_name": "Smurdap",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Customs",
      "Imperial Customs",
      "Fornax Security"
     ]
    }
   ]
  }
 ],
 "content": "Smurdap was a former member of Imperial Customs and later the Chief of Fornax Security on Fornax Station. He was dedicated to his work but was deposed when two smugglers outwitted him in his duplicity.\nSmurdap was the head of security on Fornax Station a few years before the Battle of Yavin. He made it his job to know everything that happened on his station, employing droids in menial tasks, such as boot-shining, to watch for suspicious activities. One day, two smugglers arrived on the station. Han Solo and Chewbacca had picked up an Imperial signal while docking. Solo has his boots-shined to inquire about stormtroopers and leaves with his boots half-shined. The little droid contacts Smurdap afterwards. Then the two pilots go the locker rentals, ostensibly to rent their own. In reality, they need to pick up a package for their employer, Jabba the Hutt. While they are stuffing Chewbacca's bag into their locker, an alarm sounds. Smurdap arrives with two security droids and demands to open their bag. Solo quicly complies, showing the officer their grooming supplies, telling Smurdap they are traveling barbers. The officer angrily apologizes and leaves. After picking up the contraband, Lashaa silk, they walk out, telling the droid at the rental desk they are leaving because they were insulted at the accusations.\nSoon after, a Tyrian cloth wedding gown owned by the Royal Margravine Abominelle of Vena. In response, Smurdap banned all departures and exits from the station. He then confronted the two smugglers at their ship, the Close Shave. Solo and Chewbacca met him at the boarding reamp after setting up the laser cannon to automatic fire. Smurdap smiled and showed them the grooming gear they had left in the locker. Solo stalls, telling him Smurdap had 'spoiled' the items for Chewbacca just by touching them. Smurdap and a security droid then board Solo's ship for inspection, coming back with Chewie's traveling bag. He opens it to reveal the stolen gown. Smurdap accuses Solo of stealing it. Solo replies by telling Smurdap it was he who had stolen it. Smurdap tells him he will never be accused for it, even though he stole it and framed the two pilots to bargain for the contraband onboard the ship. Smurdap tells Solo that he will get the contraband and will not let the two pilots leave Fornax Station alive. Solo at that moment tells the cannon to fire, destroying a droid. The two race aboard and get ready to take-off. Solo mans the quad cannon and blasts open the hangar doors while communicating with Fornax Flight Control, yelling about a weapons malfunction and flies away from the station. When the two pilots attempt to enter hyperspace, they find it has been sabotaged with a circuit-jammer.\nSmurdap contacts them. He is flying an old Mu-2 shuttle. It was the source of the Imperial signal. Smurdap tells them to hand over the cargo and he will disable the circuit-jammer. To back him up, he has six Drone fighters. Solo refuses and moves into the Five Fire Rings of Fornax. Smurdap calls his bluff and sends the drones after Solo. In a series of maneuvers, Solo and Chewie destroy the six fighters and contact Smurdap. They trick him into confessing, as Solo had Fornax Flight Control on the radio. They escort him back to the station to be interrogated by the new head of security.\nSmurdap was a man concerned with his job catching smugglers, a mentality befitting a former Imperial. Eventually, he became jaded with his position and desired to steal contraband from a smuggler to make himself rich. He was not among eliminating competition to attain what he desired.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Office_of_Customs/Legends",
  "/wiki/Chief/Legends",
  "/wiki/Fornax_Station",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Security_droid/Legends",
  "/wiki/Lashaa_silk/Legends",
  "/wiki/Tyrian_cloth",
  "/wiki/Royal_Margravine",
  "/wiki/Abominelle",
  "/wiki/Vena/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Laser_cannon/Legends",
  "/wiki/Quad_cannon",
  "/wiki/Hyperspace/Legends",
  "/wiki/Mu-class_Model_2_shuttle",
  "/wiki/Drone_fighter",
  "/wiki/Five_Fire_Rings_of_Fornax",
  "/wiki/Adventures_in_Hyperspace:_Fire_Ring_Race"
 ]
}