{
 "name": "Snes",
 "display_name": "Snes",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Besalisk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Club Deeja"
     ]
    }
   ]
  }
 ],
 "content": "Snes was a Besalisk female who worked as muscle at Club Deeja on the planet Naboo shortly after the Battle of Yavin. When the club's owner, Mul Sanaka, tried to set a trap for the Alderaanian Princess Leia Organa within his establishment in 0 ABY, Snes was given the job of disarming the princess and her companions before leading them inside. However, Snes accidentally revealed the trap to Organa, causing the princess to attack the Besalisk and eventually defeat her and Sanaka.\nShortly after the Battle of Yavin, Snes was employed as muscle for the establishment Club Deeja, located in the city of Keren on the planet Naboo. The club was owned by Mul Sanaka and run with aid from the Alderaanian Uwa Pareece, who managed its musical talent, the Melodic Order, who were also from the planet Alderaan.\nWhen the Alderaanian Princess Leia Organa traveled to Naboo in 0 ABY to search for Alderaanians who had survived the destruction of their homeworld by the Galactic Empire, she was directed to Sanaka and his Alderaanian staff by Lord Junn, an old acquaintance of hers living on Naboo. Junn contacted Sanaka before Organa could reach him and warned him that she was coming, creating a scheme with the club owner to have her killed. When Organa arrived at the club, claiming to be an Imperial official, she was greeted at the door by Snes and Sanaka.\nSanaka pretended to believe Organa's claims that she was an Imperial and ordered Snes to hand the Melodic Order over to her. Snes then demanded that Organa and her companions—the pilot Evaan Verlaine and the astromech droid R2-D2—hand over their weapons, which Organa initially refused to do before eventually complying. Snes ushered the group into the club but accidentally addressed Organa as \"princess,\" revealing that she and Sanaka knew Organa's true identity.\nWith Snes' cover blown, the princess headbutted the Besalisk and knocked her to the floor, causing two other Besalisk thugs to rush from within the club and attack Organa and her companions. While Verlaine and R2-D2 dealt with the two other thugs, Organa attempted to recover her blaster pistol from Snes, but the Besalisk knocked the weapon away before the princess could use it. Organa then kneed her opponent in the face, leaving Snes dazed on the floor. Seeing that his thugs had been defeated, Sanaka attempted to shoot Organa himself but was killed by Pareece before being able to fire a shot. Organa then proceeded to rescue the Melodic Order from Naboo.\nSnes was an orange-skinned Besalisk with yellow eyes. When trying to lead Princess Leia Organa into a trap, she unwittingly revealed to Organa that she was in danger, yet continued on with the plan without realizing her mistake.\nSnes wore brown armor with a utility belt and bandolier. She carried a blaster pistol and sword while meeting with Leia Organa.\nSnes first appeared in the comic book Princess Leia 2, which was released on March 18, 2015 as part of the Star Wars: Princess Leia comic series written by Mark Waid and illustrated by Terry Dodson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Besalisk",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Club_Deeja",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Battle_of_Yavin",
  "/wiki/Mul_Sanaka",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/0_ABY",
  "/wiki/City",
  "/wiki/Keren",
  "/wiki/Uwa_Pareece",
  "/wiki/Music",
  "/wiki/Melodic_Order",
  "/wiki/Alderaan",
  "/wiki/Mission_to_rescue_the_survivors_of_Alderaan",
  "/wiki/The_Disaster",
  "/wiki/Homeworld",
  "/wiki/Galactic_Empire",
  "/wiki/Lord",
  "/wiki/Junn",
  "/wiki/Death",
  "/wiki/Rebel_pilot",
  "/wiki/Evaan_Verlaine",
  "/wiki/R2-series_astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Blaster_pistol",
  "/wiki/Eye",
  "/wiki/Armor",
  "/wiki/Utility_belt",
  "/wiki/Bandolier",
  "/wiki/Blaster",
  "/wiki/Sword/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Princess_Leia_2",
  "/wiki/March_18",
  "/wiki/2015",
  "/wiki/Star_Wars:_Princess_Leia",
  "/wiki/Mark_Waid",
  "/wiki/Terry_Dodson",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Marvel_Comics"
 ]
}