{
 "name": "Snoke",
 "display_name": "Snoke",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Exegol"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 12 BBY",
      "Exegol"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Supremacy",
      "Crait system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid genetic strandcast"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.18 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Eternal",
      "First Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Sidious"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Unidentified apprentice",
      "Kylo Ren"
     ]
    }
   ]
  }
 ],
 "content": "Snoke was a Force-sensitive humanoid genetic strandcast male who ruled the First Order as Supreme Leader during the New Republic Era. Possibly unaware of his true nature, Snoke was an artificial genetic construct created on the planet Exegol by the Dark Lord of the Sith and Galactic Emperor Darth Sidious and his Sith Eternal cult during the reign of the Galactic Empire. After Sidious' resurrection, Snoke's body held no use in the Sith Lord's goal for restoration, so was instead utilized by Sidious for his natural Force-sensitivity as a proxy he could manipulate for his Contingency. Though Snoke possessed an independent mind, he was obliviously influenced by his creator from afar.\nWith his powerful abilities and immense foresight, Snoke eventually gained control of the First Order, a hermit state in the Unknown Regions formed from a remnant of the Galactic Empire. Despite holding absolute power as Supreme Leader, Snoke allowed General Armitage Hux to lead the First Order military in his name, preferring to concentrate on spiritual matters of the Force. With the turning of Padawan Ben Solo—grandson of the Chosen One Anakin Skywalker—to the dark side, Snoke gained the heir to the powerful Skywalker bloodline as his student. Solo adopted the persona of Kylo Ren after renouncing and destroying the Jedi Order.\nDuring the last days of the Cold War, Snoke directed his apprentice to hunt and destroy Luke Skywalker, Ren's uncle and former Jedi Master, determined to complete the Great Jedi Purge with Skywalker's death as the last Jedi. Additionally, Snoke authorized a preemptive strike with Starkiller Base against the New Republic that destroyed the Galactic Senate and launched the First Order-Resistance War in 34 ABY. While pursuing his objectives to destroy both the Resistance and Skywalker, however, Snoke was assassinated by Ren, who sought to rule the galaxy as the new Supreme Leader.\nBy dying at the hands of his apprentice, Snoke's purpose for existence was fulfilled; Kylo Ren murdering Snoke and seizing power over the First Order as Supreme Leader was an act of ascension worthy of the Rule of Two, completing the final test laid out for him by the Sith Eternal. They had designed Snoke to mold and groom his student into a master of attack and cunning, testing his worthiness as an heir worthy of the Sith. In addition, such an event allowed Sidious to sidestep the Rule of Two, in which a dark apprentice slayed their master to obtain ultimate power and ascension within the dark side of the Force.\nSnoke's creator was the Dark Lord of the Sith Darth Sidious, publicly known as Galactic Emperor Sheev Palpatine. Sidious and his cult of Sith loyalists, the Sith Eternal, experimented with cloning on the planet Exegol for several years prior to his demise at the Battle of Endor. Secure in power as Emperor, Sidious withdrew from the public eye and began to probe the secrets of the dark side. In his quest for immortality, the Sith Lord and his followers experimented with cloning technology to extend his lifespan and sustain it indefinitely.\nWhile he sought immortality through science with his followers, Exegol became the home to the most promising of Sidious' experimentations. The Emperor believing that he could create anything, utilizing pain as \"The Scalpel of Creation.\" Darth Sidious had long sensed that Vader could turn back to the light side of the Force and betray him. As a result, prior to his death, Sidious took precautions and had a clone of his original body created with modified Kaminoan cloning technology in his Sith Citadel on Exegol.\n\"Snoke\" was the identity adopted by an artificial strandcast created in the dark science laboratory on the planet Exegol by the loyalists of the Sith Eternal cult, at the behest of Dark Lord of the Sith and Galactic Emperor Darth Sidious, during their cloning experiments during the reign of the Galactic Empire. With the Sith Eternal having long experimented with the science of cloning in their bid to extend the Emperor's lifespan and aid him in obtaining immortality, utilizing modified cloning technology, various unnatural embodiments of the dark side were engineered from the cultists combination of technology with the occult. Snoke himself was created as one of the earliest attempts to produce a viable, worthy vessel for Sidious' essence to inhabit in the event of his demise and allow him to cheat death.\nIn addition to Snoke, there were three genetic copies—clone \"brothers\"—that the cultists kept in a hibernated state, housed in the laboratory of the Sith Citadel, resting in vats of nutrient fluid with technological umbilicals pumping medicinal liquid into their frail bodies. Although Snoke was naturally sensitive to the Force, and particularly strong with the dark side, Sidious rejected his body as an \"unworthy\" form for containing his spirit. Nevertheless, Sidious found the usefulness Snoke's force-sensitivity could prove to have as a powerful servant and a way for spreading his influence across the galaxy through less direct means as he already was, so instead, utilized him as a puppet in his sinister plans.\nWhen Snoke was young, he was taught a lesson when he realized a truth about the Force: that Force visions were a dangerous endeavor to perceive, for the future was always in motion. And if predicted wrong, it could lead to one's demise.\nDeveloping into a master of the Force, Snoke would gain hardened experience with the dark side of the Force and vast knowledge of its steep teachings. The dark side adept studied not only the ancient lore of prominent Force users, but also the teachings of the Sith, even though he denied having any lineage with them.\nSnoke was also a seeker of ancient lore, rediscovering much of the galaxy's lost and forgotten secrets about the Force in the Unknown Regions. This precious knowledge, ironically, led back to his master Sidious, who, throughout his reign of the Galactic Empire, coveted the same knowledge, knowing that universal truths laid within the confines of the mysterious regions. In addition, Snoke learned about the concept of the Force dyad through an ancient prophecy, which was featured prominently in the lore of the Sith Eternal. He also became familiar with the Knights of Ren, who were formed to fill the void left by the old Sith Order.\nDuring his time as a lore seeker, Snoke had various established bases across the galaxy to house gathered shards of archaic lore. He even once journeyed to Mustafar and visited Darth Vader's castle, a fortress the Sith Lord constructed in 12 BBY. While there, he discovered a gold ring engraved with glyphs of the dwartii and began to wear the object on his left index finger. He also recovered a black obsidian stone from the catacombs and mines beneath the castle and affixed it to the ring. Eventually, Snoke took up residence on the High Republic Era location known as Amaxine space station, and became familiar with its history.\nOver the course of his life, Snoke defeated legions of adversaries, orchestrating their deaths through either manipulation or just killing them personally. In his past, Snoke also experienced a severe injury that split his head, as well as a \"perpetual torment\" that slightly melted half his face and neck.\nFrom the shadows, Snoke eventually witnessed the fall of the Galactic Empire and the pivotal saga of Darth Vader and Luke Skywalker during the Battle of Endor in 4 ABY. In these events, Anakin Skywalker was redeemed by his son and betrayed Snoke's creator, Sidious, which led to his demise, and ultimately led to the fulfillment of the prophecy of the Chosen One, for the foretold destruction of the Sith Order was complete and balance was restored to the Force.\nBy extension, with the deaths of the Emperor and his right hand man, this had set in motion the downfall of the Galactic Empire, and the faction's ultimate collapse a year later at the Battle of Jakku in 5 ABY. As observed by Snoke, it was not the pursuit of truth, justice, or free will that had destroyed the Galactic Empire, but the \"sentiment\" of Darth Vader, in his failure to kill his son.\nHowever, when Sidious died above Endor, he transferred his spirit into his new clone body. But the transfer was imperfect, and the flesh of the cloned vessel designed to house Sidious' essence, despite years of research, was inadequate, and began to fail sometime later. The body was now rotting and racked with rapid degeneration in consequence to Sidious' immense power within the dark side of the Force, and the Sith Lord was left on borrowed time to find a new vessel or he would face death permanently. Because of his body having already being rejected as a potential vessel for his spirit, Darth Sidious would have Snoke become his stand-in for power, while he recovered and researched a solution for his rejuvenation and the Sith Eternal conducted further experimentation to produce a new strandcast body for his spirit.\nUnable to leave Exegol, Sidious began secretly guiding Snoke's actions and goals from afar to his creation's obliviousness, imposing him with a singular focus, to spread his influence across the galaxy. Snoke remained unaware of his status as a puppet in Sidious's larger game for his entire life, with it even being possible the Emperor had arranged for his pawn's vanity and self-assuredness to ensure Snoke never arose to be a threat to his designs. As such, the dark-side adept would serve as a puppet and oblivious pawn of the former Emperor as part of his plan to regain power, take revenge on the Skywalker family and halt the restoration of the Jedi Order and Galactic Republic. By using Snoke as his proxy, Sidious gathered forces that would eventually form the armies of the First Order, which would oppose the New Republic under his control, albeit indirectly.\nAfter the collapse of the Galactic Empire many former Imperial officers, nobles, technologists, and warlords fled to the Unknown Regions of the galaxy as part of a mass exodus during the rise of the New Republic secretly facilitated by the contingency plan designed by the Emperor. Had it not been for the ancient hyperspace trails blazed by the Attendants, a group of mute alien navigators who served Snoke, most of the former Imperial officers would have likely perished while crossing into these uncharted realms of the galaxy. Over the next rough decade, they were met by secret reinforcements, and in time gave way for the rise of a new leader.\nSeen as the architect of the First Order, Snoke was instrumental in organizing and saving the remnants of the Empire from certain destruction, along with some knowledge of the Unknown Regions provided by the Chiss Grand Admiral Thrawn, which helped the former Imperials settle there and reorganize themselves into the First Order. It was the knowledge that Snoke held in the Force and of the Unknown Regions, rather than the military power or tactical prowess of a general, that aided the First Order.\nSnoke eventually achieved the status of Supreme Leader of the First Order. The last of the old Imperial leadership, including Grand Admiral Rae Sloane, the political outcast Ormes Apolin and even General Brendol Hux did not suspect Snoke's ascension and were quite surprised when it occurred. This came to be when Snoke sidelined, co-opted or killed many of the former leaders, while others like Armitage Hux, Brendol's son, were spared by Snoke to be used as a tool in his rise to power. Some like Enric Pryde gave way for Snoke because, though the Supreme Leader's abilities were alien to him, he knew not to question the religious beliefs behind them, for he knew they held great power. The rest fell in line quickly, though remaining officers, like General Domaric Quinn, one the First Order's key ground commanders, disagreed with Snoke's reliance on mysticism. But these few officers were kept silent. In his own opinion, Snoke saw himself as an unlikely fulcrum to have been chosen to lead the faction, and knew that history would see him taking over as his master plan, rather than what he believed was improvisational on his part and not his endgame.\nUpon his rise to power, Snoke gave no indication to his origins. And much to his subordinates' surprise, he made no design towards the old title of Emperor held by Darth Sidious under the Empire. Nevertheless, he possessed the knowledge and Force ability that made him the undisputed heir to the fallen Emperor's crafted contingency, which single handedly saved the First Order from destruction. Despite holding absolute power as Supreme Leader, Snoke mostly ceded control of the First Order's military to his generals, along with the task of building the First Order's reputation and influence through propaganda, as he was more content to focus on spiritual matters.\nThough most in the First Order were oblivious to their new leader's origins, some, like General Pryde, suspected Snoke was subservient to a higher power, even though Snoke himself was possibly unaware of the factual nature surrounding his existence.\nBeing an ambitious ruler, Snoke was not content to rule a handful of sectors claimed by the First Order in the Outer Rim Territories, nor was he satisfied by the colonization of clusters of worlds beyond the frontier. In his view, ambitions limited in scope would have made the First Order no different from the various nonaligned states that had emerged in the wake of the Empire's collapse, or the hermetic kingdoms in the Unknown Regions that had been dismantled or destroyed by the First Order.\nSnoke would initiate a vast rearmament program, resulting in the creation of the First Order military as a technologically superior version of the Imperial Military that had served the Galactic Empire. Keenly aware that it lacked the superior numbers and support of the former Empire, the First Order covertly undermined the New Republic instead of relying on military force. Ultimately, it was Snoke's desire to see the First Order reclaim the galaxy that the Empire had lost in its war with the Alliance to Restore the Republic. The Supreme Leader would then build on that rebuilt foundation, taking the First Order beyond what the Empire achieved in its time.\nUntil that goal was achieved, however, the Supreme Leader wanted to keep the First Order's capital mobile. Therefore Snoke chose to rule from his throne room aboard the Supremacy, the first in a line of gargantuan warships known as the Mega-class Star Dreadnought, which he ordered the construction of at staggering costs for the First Order, insisting they keep a mobile command post despite protests from allies of the hermit faction.\nPerhaps at one time or another, Snoke considered taking Luke Skywalker as his dark-side apprentice and second in command over the First Order, surmising the galaxy would have certainly been his to rule if he had done so from the start. The Supreme Leader deemed the warrior to be a threat to his plans, being aware of his triumph over the latter's father Darth Vader at the Battle of Endor, so as such, also respected the last Jedi, for his power and strength as a formidable warrior, yet also feared him.\nSnoke considered Skywalker wise and insightful, unlike the Jedi of old, for during his quest to rebuild the Jedi Order, he instead endeavored to learn the ways of the Order and sought out its lore, rather than just restoring the religious faction outright. However, he also knew that the Jedi Master was a powerful instrument of the Cosmic Force, therefore deemed it essential to monitor him. Despite this, Snoke knew that if the Jedi Order existed in the galaxy, so did hope, and so he had to destroy the last vestiges of its teachings to extinguish it permanently.\nSoon, Skywalker's plans threatened his designs, so Snoke released his vast pool of knowledge into the galaxy to confuse the Jedi Master and his family while ensnaring them, in an attempt to ensure his own triumph over Skywalker, while the latter met his demise. At some point, Snoke had an encounter with Skywalker, in which he was damaged by the Jedi Master to some degree. Snoke had attempted to make a calculated effort to shatter the son of the Chosen One's resolve to rebuild the Jedi, but indirectly only ended inspiring him even more to restore the order.\nSnoke began to train apprentices to serve him. Aware of how Emperor Palpatine claimed Darth Vader as his ultimate weapon for the dark side of the Force during the reign of the Galactic Empire, Snoke desired to do the same with his own student, considering himself a sculptor on the path of forging a masterpiece, and by extension, needed something powerful to craft with, which in that case was an individual with promising origins. For many years, the Supreme Leader searched for a worthy acolyte to serve in this initiative, and prior to becoming invested in the Skywalker bloodline, he trained at least one individual. However, the student was not Snoke's most gifted, and Kylo Ren would eventually be the strongest of the dark-side master's apprentices.\nSnoke became invested in the Skywalker bloodline, believing that Ben Solo, the son of Han Solo and Princess Leia Organa, had the right balance of the dark side and the light side of the Force within him, and desired to claim him as his own apprentice. As the grandson of the Chosen One Anakin Skywalker, Solo inherited the prodigious strength of his family bloodline, making him the ultimate prize to Snoke. Through Snoke, to both of their obliviousness, Sidious plotted to seduce the young Solo to the dark side, utilizing Snoke as his proxy to whisper in the young boy's mind, corrupting and turning his heart. Beginning in the boy's childhood, Snoke had drawn Solo towards the dark side of the Force. The sinister creature influenced the young child, preying on Solo's feelings of abandonment, desperate need for a teacher, and fascination with his family's legacy to seduce him.\nHaving known of Snoke's interest in her son's potential for power, Organa sought to protect Solo from the mysterious dark-side adept. However, she did not inform her husband about Snoke's designs on their son, believing that, as a non-Force-sensitive, Han would not understand Organa's responsibility to shield Ben. Organa trusted her twin brother, Luke Skywalker, to keep Ben Solo in the light by training him as a Jedi. Solo began his training at the age of ten, in 15 ABY, and without invitation, Snoke was visiting Solo in his mind, invading his innermost thoughts, but the young Padawan eager to have a friend, grew to trust, and possibly even love, the stranger.\nWith Snoke's piercing perception of Solo's mind, his new clear view of the latter's fears and insecurities allowed him to poison the Jedi apprentice with the dark side. The corruption of Solo being instrumental for his plan, the Supreme Leader frequently whispered to young boy, warning him near the start of his Jedi training that his equal within the Force would one day match his power, and he could only reach his full potential by slaying the being who was his equivalent in the light side.\nIn 19 ABY, when Solo and Skywalker were on a mission to Elphrona, Snoke connected with the young boy via telepathy. Sensing the fourteen-year-old Padawan's unease, Snoke used the opening to undermine Solo's uncle and master and plant a seed of doubt within Solo about the Jedi Order. As Solo confided his frustrations about his uncle's teaching methods, despite acknowledging his strength and ability as teacher, Snoke explained the Jedi had a history of hoarding knowledge for their own power, while also encouraging his grievances about his uncle, claiming that Skywalker merely saw Solo as the child he was and a mere learner, but in time would learn of the fledgling Force wielder's true potential. Upon arriving at their destination, within the outpost, Skywalker and Solo encountered the Knights of Ren, and though his uncle dispatched them easily, Solo was prompted by the dark side. When he met \"Ren,\" the leader of the knights, and was offered a chance to seek them out if he desired, he saw a possible path that was different from the Jedi ways, allowing his darkness to grow instead of being repressed.\nFollowing the battle on Elphrona, Solo remained with Skywalker for nearly another decade. During this time, Skywalker's attention was split amongst multiple students at his Jedi Temple, allowing Solo to be drawn to the darker teachings of Force knowledge, and Snoke used this to his advantage. Still holding impulsive tendencies, Solo possessed a fascination for the dark side. At times, it seemed to him that the only person who understood this was Snoke. With this, Solo also believed Snoke possessed the answers that could help him understand the dark side and start a new life if he chose.\nIn 28 ABY, Leia Organa's political enemies revealed to the Galactic Senate the truth behind her and Luke Skywalker's heritage as the children of Darth Vader. Solo had yet to find this out for himself and learned it from the public rather than being told by his mother. Ben Solo was enraged by the revelation and felt betrayed by his family, which Snoke used to cap off his years of manipulations to turn the young man into a tool for the dark side. With Snoke's guidance and Solo's natural power in the Force, he would become even greater than his grandfather, Snoke promised him. This led Solo to believe he would not have to compete with the heroes of old anymore, and instead eclipse them. However, Snoke intentionally omitted that the Sith gained their power through great sacrifice.\nSoon, despite his nephew's promising future, Skywalker felt the darkness rising within Solo and believed that Snoke had already succeeded in corrupting his pupil. Skywalker's mistake was failing to see, that despite Snoke's influence and the anger within his nephew, Solo had yet to make his choice and was still at a focal point between light and dark. In a moment of pure instinct, Skywalker drew his lightsaber and prepared to strike the young Solo, but he quickly came to his senses—though not quickly enough, as his nephew had awakened to his uncle standing over him with his lightsaber out. Solo struck back against his master, believing that his own uncle had intended to murder him.\nFollowing the ordeal, Solo emerged from the rubble of his quarters, his lightsaber still drawn, as a powerful lightning storm was conjured from his angered confusion and struck the temple, destroying the structure and all of the students within. When Solo was horrified at what had happened, Snoke telepathically spoke to the young Jedi and reminded him that it was never his fault, for Skywalker chose the outcome by attempting to \"murder\" him moments earlier. He confirmed that the both of them had suspected the possibility of such a betrayal finally having happened. From this, Snoke's manipulations were all too evident in Solo's new rejection of the Jedi teachings and willing to accept the loss of his innocence.\nAfter destroying his uncle's Jedi temple, Solo journeyed to Amaxine space station, where Snoke had been waiting for him. Upon his arrival, Snoke welcomed and comforted the young Jedi Padawan. The two discussed the events that transpired between Solo and his uncle, and when the latter claimed to have killed his mentor, Snoke knew better, aware that Skywalker was still alive as it would take much more to kill him. Snoke was correct in assuming Skywalker's survival, for Skywalker had exiled himself to Ahch-To, and his nascent Jedi Order had been destroyed, though Snoke, like the rest of the galaxy, was unaware of Skywalker's location. Organa believed Snoke was to blame for Solo's fall to the dark side, but her brother felt personally responsible as a result of what transpired between master and apprentice.\nSolo, in need of a new path and unsure of how to proceed, questioned the Supreme Leader about the Knights of Ren. Instead, Snoke expressed his fondness of the space station they were presently on, and revealed his understanding of its history, in which the people who built it tried to hold back the darkness by creating an \"oasis of life\" in the great shadow but failed to hold back the nature of what was there. Snoke then turned back to Solo's question of the Knights, for which the dark-side adept expressed approval, agreeing with the belief that the fledgling Jedi could learn valuable skills. In addition, Snoke also briefly undermined his own knowledge and claimed what he could teach Solo was limited, in order to push the Jedi to seek the faction.\nSnoke listened as Solo expressed his frustrations with being his family legacy, correctly guessing the Jedi's frustration with being named after and related to legendary people. Solo claimed how it all seemed false and was built on lies. From there, Solo expressed interest in joining the Knights of Ren, whom he had previously encountered, and Snoke encouraged Solo to indeed do so in order to realize his truest self. The elder Force wielder had also told the young man he would need a new alias to be known by, that was not his birth name, as the Knights would likely not accept a Jedi into their rankings. Prior to Solo's departure, Snoke warned him the price to join them was indeed steep, and to survive and succeed he must impress the Knights to join their ranks or he would die a gruesome death.\nNow entrenched to become Solo's new mentor, Snoke contacted the leader of the Knights, Ren, and vouched for Solo as precaution, expressing his belief that Solo was something special and could be someone of immense power if shown the path. Snoke's power and belief influenced Ren to allow Skywalker's nephew to shadow them for a time and assess his abilities.\nSometime later, on the base of Minemoon, the Knights turned on the Jedi Snoke had sent their way. Back on Amaxine station, Snoke sensed Solo taking his steps into the dark side, as he was dueling Ren, feeling pleasure as he telepathically encouraged the fallen Jedi to continue through the Force. Far away on Exegol, his creator was also encouraging the young man to claim his birthright and strike down his foe. Solo killed Ren, and the Knights bowed to him as their new leader.\nSoon after, Ben Solo swore his loyalty to Snoke and became his apprentice, reinventing himself as Kylo Ren, master of the Knights of Ren and warlord of the First Order. For six years, Ren would serve as Snoke's second-in-command.\nAs Ren's new master, Snoke gifted him a place of power within the First Order as one of his top enforcers, in a position similar to the latter's maternal grandfather under Sidious during the Imperial Era. Having passed his grueling trial, Snoke gave Ren his blessing to inherit command of the Knights of Ren from his predecessor, gifting them to him out of a promise for powerful followers if he proved worthy and allowing him to utilize them for his own use. To this end, Snoke would utilize his student and the Knights as a tool for the dark side within the First Order.\nFrom there, Darth Sidious believed Snoke would train his apprentice well, fanning the embers of Ren's anger within his heart into a red-hot fire and grooming him into a master of not only attack, but also cunning.\nThe Supreme Leader found Ren to be his most promising student, and the Knight proving to be Snoke's most gifted protégé. Snoke saw potential in his apprentice to become a new Darth Vader, sensing his ability for limitless power, a result of the strength inherent in Ren's bloodline. As a teacher, Snoke's methods were similar to those of many renowned Jedi and Sith masters of old, administering a series of tests to Ren to hone his abilities, but also ensure he obeyed him without question.\nSnoke instructed Ren to pursue his impulses as a shortcut for power within the dark side of the Force, and promised him a future where he would be \"heir of the Force\" and with no Jedi to challenge him. He would goad his disciple's conflicted soul to push the darkness within him to purge the light from his heart indefinitely, even decreeing that the former's true name was forbidden to ever be spoken. Snoke also made Ren believe that redemption was impossible, telling him his family would never take him back after all he had done, and that they cared more about themselves and the New Republic than him.\nSnoke encouraged his apprentice to use the teachings of both the light and dark side, while he conditioned him to believe the worst of people and that they would always reject him. Under him, Kylo Ren's view of his grandfather Anakin Skywalker as Darth Vader was warped, as Snoke twisted his student's understanding of his history, passing down his belief that the Dark Lord's sentiment and failure to kill his son Luke Skywalker as the true reason the Galactic Empire fell. To stoke jealousy in Ren, Snoke often pitted him against Armitage Hux, who got many victories, and hated Ren, to fuel his negative emotions. As Ren grew stronger, Snoke knew that his equal in the light side would rise to challenge him, and believed it was Luke Skywalker, so he trained Ren to be the one to kill Skywalker and end hope within the galaxy.\nIn order to train his apprentice, Snoke and Ren traveled the galaxy to study the dark side, a similar echo to Ren's time as Skywalker's Jedi Padawan.\nSnoke, along with Ren, traveled to a rocky world in the Rarlech system. As they stood at the edge of a cliff, Snoke asked Ren if he was afraid. Ren said he was not. Snoke then used the Force to push Ren off the cliff and hold him in the air. Snoke said that he knew Ren was afraid, as he should be, because Ren wasn't in control. No, he was confused and unsure of his convictions. He felt powerless. Snoke said that feeling that way was good. Powerless men often turned to anger and lashed out blindly with rage. But powerful beings could harness their rage and use it to strike. For either they struck or they fell.\nSnoke then let go of Ren, letting him fall, advising him to use his fear, turn it into anger, and turn his anger into power. Ren, out of fear, followed that advice, holding himself up and surviving the fall. He inquired whether Snoke would have caught him if he hadn't been able to catch himself. The Supreme Leader replied by saying that Skywalker would have and in doing so, held Ren back. Snoke needed Ren to find his true power and potential if Ren wanted to rule alongside him.\nAfter the training in the Rarlech system, Ren and Snoke traveled to Dagobah. As they stepped off their shuttle, Ren commented that he sensed Luke Skywalker from his time in Dagobah when training with Yoda. As Snoke spoke of Skywalker's training, Ren asked why he spoke of Skywalker with respect. Snoke said if he had Skywalker by his side instead of Ben, the galaxy would have been his a long time ago. Snoke then made Ren go into the Cave of Evil, where his uncle had gone into so many years before.\nOnce inside, Ren experienced a vision of his uncle Luke, saying that he didn't want to fight him. Ren said he didn't care and ignited his lightsaber. Snoke sensed that decision and commended Ren for making it. After a short duel between the two, Ren killed the vision of Luke, by letting the hate festering inside of him out. But the vision had only begun.\nRen then experienced a vision of his parents, begging him to stop. He recoiled from the vision and rejected being addressed by his birth name. Organa insisted that he was still her son, Ben Solo, whom she and her husband loved. Despite his inner turmoil, Ren activated his lightsaber and acted as if he was striking down his parents, but only striking a tree with his lightsaber, showing that though he hated his uncle Luke, he still loved his parents. Ren then destroyed the cave, impressing his master with a display of raw Force power, although Snoke, expressing his disappointment over the thousand-year-old site's destruction, had also considered bringing other apprentices to the cave which had existed for millennia. Ren dismissed the notion that Snoke would ever need another apprentice. Regardless, the raw display of power by Ren pleased the Supreme Leader.\nDuring his tenure as Supreme Leader, Snoke's ultimate aim was galactic conquest. In 28 ABY, the same year as gaining Kylo Ren as his student, Snoke gave Enric Pryde command of a Resurgent-class Star Destroyer, which he named the Steadfast in honor of his old vessel. Snoke mostly allowed his subordinates to enforce his will, focusing his attention on a more personal agenda, but immediately was stirred into action when priorities, like clues for Luke Skywalker, arose within the First Order's findings. The Jedi Master, despite his exile, remained a powerful threat, making him a loose end the Supreme Leader couldn't afford to ignore.\nIn 29 ABY, the senatorial faction known as the Centrists, preferring power, withdrew from the New Republic and joined the First Order with Snoke at its head. This marked the public founding of the First Order. By the time of the Cold War, Snoke's reputation as Supreme Leader preceded him, as he had been rarely seen in the flesh, even by his own subordinates. When the First Order began the cold war against the New Republic, Snoke remained constantly mobile aboard the Supremacy, protected by his Elite Praetorian Guards, and hidden by the brightest stars within the Unknown Regions. While he governed the First Order from the Supremacy, Snoke chose to instead contact his subordinates by larger-than-life holograms of himself, many among the First Order noting his unwillingness to meet in person.\nDuring or after 30 ABY, following a series of events which had seen Hux and Ren temporally stranded on a planet in the wake of an assassination attempt, both Hux and Ren reported back to Snoke on the almost complete Starkiller Base following their rescue by Captain Phasma. Hux declared to Snoke that he had identified the one responsible for the assassination attempt, then rebuffed Ren's offer to deal with the saboteur, requesting the permission of Snoke to deal with the traitor himself. Snoke permitted this, which pleased Hux, who went to find the traitor. As he left, Ren told Snoke he didn't see Hux's worth in being kept around. Snoke merely stated that he didn't need to. Ren insisted that Hux was not to be trusted, and that he wanted to kill Snoke and take his place. Snoke replied that Hux wanted to kill a lot of people and chose not to take it personally. He instead told Ren that men like Hux were useful, being fueled by spite and after being abused, never forgave.\nWhen Hux and Phasma went to execute Admiral Brooks, the saboteur's superior, Hux cited Snoke, alongside Ren and his own father, Brendol Hux, as people who underestimated him. Gaining the Supreme Leader's favor meant that Hux effectively wielded greater authority than his rank as a general would indicate; nevertheless, Snoke refused to grant Hux his coveted title of Grand Marshal.\nFollowing Skywalker's disappearance, Snoke assigned Ren to hunt down the last Jedi, knowing that as long as Skywalker lived, the Jedi and thus hope lived. Nearly fifty years after the fall of the Jedi Order, dark master and apprentice sought to complete the Jedi Purge by finding and killing off Luke Skywalker, and with his death, the new students he was training all dead except for Ren, the First Order leaders believed they could rule with impunity like the old Galactic Empire.\nSnoke ordered Skywalker to be found and killed to eliminate his ability to stand in the First Order's way of galactic domination, the Jedi warrior being too powerful a threat to ignore. Ren, determined to find the Jedi Master, searched for clues of his location, cutting down anyone that stood in his way to accomplish his mission. Within his task given by Snoke, the First Order became aware of Lor San Tekka coming into possession of a supposed piece of the map to Skywalker's location, so Ren and the faction began searching, which started in 32 ABY, to find and retrieve this valuable asset.\nIn 34 ABY, Ren's search led him to Jakku, where he learned that the final piece of the map to Skywalker was in the possession of the astromech droid BB-8. Snoke ordered the droid's capture or destruction, preferably the former. Despite the efforts of the First Order, BB-8 escaped Jakku aboard the Millennium Falcon.\nRen and General Hux later returned to Starkiller Base to communicate with Snoke via hologram. Hux proposed using the Starkiller Base superweapon to destroy the New Republic government, which was backing the Resistance, an undertaking which Snoke authorized. With his military buildup virtually complete, Snoke had felt ready to decapitate the New Republic. He then spoke with Ren privately. Snoke claimed to have never had a student before the latter with such promise, and dismissed the knight's claim that it was his teachings that were the only thing that made him strong, explaining to his apprentice that a sculptor needed something pure, strong, and with promising origins to craft with, not only the dark side but the light.\nThe Supreme leader reminded Ren of his grandfather's past, reflecting how he had witnessed the Empire's fall, in which he was redeemed and failed to kill Luke Skywalker, crediting the dark lord's \"sentiment\" as the true reason the Galactic Empire fell, not the Rebel Alliance's pursuit of freedom, claiming the historians were nothing but wrong. Ren claimed that he would not be seduced; though Snoke commended his confidence, he knew not only his connection to Vader, but that Luke and Leia caught him up in the \"storm\" that was their conflict. Snoke asked if he had felt an awakening in the Force, the cosmic field having awoken from a dormancy of over three decades, and informing his acolyte the droid they sought was now aboard the Millennium Falcon, with Ben Solo's father, Han Solo. Because of this, he ordered Ren to kill his father to overcome his temptation by the light.\nBy commanding Ren to kill Han Solo, Snoke had administered his apprentice a Sith trial of ascendancy, in which a student would sacrifice a loved one to unlock new depths of power within the dark side of the Force. In addition to authorizing Hux to fire their superweapon, during the unveiling of Starkiller base, Snoke kept Allegiant General Enric Pryde in a second wave of leadership within the First Order, with reserve forces under the man's control.\nShortly after the destruction of the Hosnian system, resulting in the eradication of the New Republic government and a portion of its fleet, Ren invaded Takodana in search of BB-8. He later deemed the droid unnecessary as he captured a scavenger named Rey, who had seen the final piece of the map to Skywalker's location. Snoke was later upset to hear that the girl resisted Ren's interrogation. Ren defended himself by explaining that Rey was strong in the Force, albeit untrained. As the Resistance base had been discovered, Snoke ordered Hux to destroy the Resistance before they could find Skywalker, and for Ren to bring Rey to him. However, Ren never got the chance, as Rey escaped with the help of her new powers.\nSubsequently, Starkiller Base was infiltrated by Han Solo, Chewbacca, and Finn, who managed to lower the shields with the aid of a captured Captain Phasma to allow the Resistance fleet to attack the base. Solo tried to bring Ren back to the light, only for his own son to murder him. In rage and grief, Chewbacca wounded Ren and blew a hole in the superweapon's thermal oscillator, allowing Resistance pilot Poe Dameron to fly in and destroy it, causing catastrophic damage, preventing the solar energy from being contained.\nThough Ren had killed his father, he ultimately failed his trial of ascendancy. Snoke had sensed his apprentice's inner struggle from afar, this conflict within him only growing and the apprentice more spiritually misguided than before. This led to Ren's unbalanced emotions and inability to defeat Rey in their ensuing lightsaber duel within the forests on Starkiller base, much to Snoke's disappointment and annoyance. Following this, when the destruction of Starkiller Base was inevitable, a frantic Hux reported this to Snoke, who was remarkably blasé about it, instead ordering the general to collect and bring Ren to himself, the Supreme Leader planning to complete his training.\nIn spite of the loss of Starkiller Base, the First Order gained enough victories in the conflict that Snoke risked coming out of the shadows to personally lead the First Order to potential dominance over the Resistance. To this end, Snoke directed several maneuvers designed to eliminate any possibility of hope returning to the galaxy. He empowered General Hux to pursue and destroy the Resistance fleet, which initially failed when an assault on their base saw not only the Resistance slip away but the loss of a First Order dreadnought. Snoke immediately contacted Hux to make his anger clear, using the Force to painfully humiliate the general, but was delighted when Hux revealed a way to track the fleet's movements through hyperspace, thereby allowing the First Order to immediately pinpoint their location. Following this, Snoke personally joined the pursuit aboard the Supremacy and summoned Ren to his throne room.\n\nWhen Ren entered, the Supreme Leader had Hux in his presence, reporting their progress toward advancing on the Resistance, for which Snoke expressed his approval and dismissed the general. Immediately thereafter, Snoke turned his attention to his disgraced apprentice, inquiring into the condition of his injury sustained at Rey's hand. Snoke rose from his throne and reflected on the training of his apprentice to that point, reciting how he once had faith in his abilities and of his original belief, that with Ben Solo's bloodline, he could have become a new Darth Vader, but now, he revealed that perhaps he was indeed rather mistaken. Having felt from afar Ren's struggle when he killed him, Snoke remarked on how he had begun to lose faith in him after his failure at Starkiller Base and his further conflict over having murdered his father, commanding the disgraced knight to remove his mask. Snoke's continued taunts, including his apprentice being unbalanced and bested by a greenhorn Force user, caused Ren to attempt to attack him, causing the Supreme Leader's guards to react aggressively. Snoke effortlessly brushed aside the attack with a short bolt of Force lightning and subdued Ren quickly.\nLumbering back to his throne, he reminded Ren that Skywalker was still alive, and as long as the Jedi persisted in the galaxy, so too did the hope that could defeat them. Claiming his belief that the master of the Knights of Ren would have been the one to snuff it out, Snoke chastised Ren out of the throne room by telling him that he was just a child with a mask rather than the successor of Darth Vader, and that Vader would be ashamed of him. But once Ren left the throne room, Snoke smiled to himself. He had used this reprimand to motivate his apprentice. If that was the case, it worked: Ren destroyed his mask on the turbolift with all the pent-up rage he could muster before preparing for what appeared to be the First Order's final victory.Seeking to shift the tides in his favor, Snoke claimed to have used his own powers to link the minds of Rey and Ren through a Force-bond. For doing so, Snoke manipulated Ren's insecurity to his advantage, knowing his apprentice couldn't hide his conflict from Rey, who couldn't pass up the chance to redeem the former Ben Solo. Through the Force, both Rey and Ren could see each other and communicate from separate locations in the galaxy.\nUnaware of the trap the Supreme Leader had laid out for her, his manipulation of their bond initiating a bridge across their minds, like they were during telepathically peering into each other's thoughts on Starkiller base, and believing she could restore Ben Solo to the light, Rey sought Ren out, and was brought to Snoke aboard the Supreme Leader's flagship.\nUpon having Rey brought before him, Snoke was immensely pleased with Ren, even claiming that faith within his apprentice had been restored. The Supreme Leader could feel the power given off by the girl, despite judging her appearance as small and harmless looking, he knew to still not underestimate her, as he reflected on his own legions of defeated adversaries, many of which underestimated him and died for such an error.\nMany other thoughts and reflections passed through Snoke's mind during this encounter, including his recalling of Palpatine's Contingency and how he took over the forces that were sent out into the Unknown Regions because of the emergency plan, memories of what history would likely view his rise as Supreme Leader and how it was not military power, or superior tactics that saved the faction, but his knowledge, and finally thoughts on what the future would hold for Kylo Ren and he once seemed to be his perfect student, once a time as his ultimate weapon, but that his recent failures, coupled with his purpose in helping draw Rey out being fulfilled, may have led to his fate decided as in being cast aside for good after the Resistance was destroyed.\n\nCommanding her to come to him, Snoke took Rey's weapon, the legendary Skywalker lightsaber, admiring its craftsmanship, and placed it next to him on the arm of his throne. Using his formidable powers, Snoke restrained Rey, who had refused, and telekinetically brought her to his reach, the Jedi apprentice shooting words of defiance and claiming he underestimated, not only Luke Skywalker, but also Ben Solo and herself, and that such a thing would be his downfall. Amused, Snoke pridefully chuckled as he revealed his manipulation and influence of her and Ren's connection, even claiming to have created it, and he had orchestrated her falling into a trap, much to Rey and Ren's surprise. Snoke was gloating at his success of gathering of Rey and Ren together before him, because it proved to him what he had suspected for a time: that each of them shared a unique bonding within the Force. Following his revelation, the Supreme Leader commanded her to reveal Skywalker's location. When she refused, he tortuously probed her mind to discover Skywalker's whereabouts. After obtaining the knowledge he sought and contemptuously dropping the girl, Snoke laughed and mused that Skywalker had been \"so wise\" to hide from him. He decided that once the Resistance was destroyed, he would command his forces to Ahch-To and obliterate the entire Temple Island, so Skywalker and the Jedi Order could be given the death he desired.\nIn more defiance, Rey attempted to summon Anakin Skywalker's weapon into her grasp; with a sneer, Snoke effortlessly redirected the blade with telekinesis to strike her in the head from behind. As a final gesture of contempt, he forced Rey to watch the destruction of the Resistance's remaining ships via his oculus viewing scope operated and designed by the Attendants. Rather than breaking Rey's spirit, however, the sight prompted her to summon Kylo's sword to defy him once more, earning the Supreme Leader's respect as he complimented her for her courage.\nAcknowledging Rey now as a genuine threat to both him and the First Order, Snoke commanded his apprentice to execute her, confident that Ren would not turn despite Rey's faith in his former persona, that of Ben Solo, and boasted that he could read his apprentice's mind and see his every thought and intention. Intending to torture the girl with every detail up to the moment of her death, he shut his eyes and described to Rey everything he saw in Ren's mind, turning the lightsaber to \"strike true\" and igniting it to kill his \"true enemy.\" However, Snoke's visions and Force senses betrayed him. Sensing Ren's connection to the girl, Snoke made a serious error of judgment; aware of his student's connection to the girl his senses were misdirected and he believed that Ren was to strike down the girl, failing to sense that his apprentice's resolve and hate were directed towards him, not Rey.\nOnce he reopened his eyes and awaited the coming strike, his triumphant smile became one of pained surprise as he felt the blade of a lightsaber piercing his withered and twisted body. At the same time, his telekinetic hold over Rey collapsed. The Supreme Leader looked down to find the Skywalker lightsaber having been turned, aimed, and activated in his direction. There was only one in this room who had the ability and cunning to pull off such a feat through the Force: Ren.\nSnoke tried to say something but couldn't. He remained alive long enough to glare at his former apprentice for his betrayal before Ren summoned the still active lightsaber to Rey's grasp and the blue blade cut through the Supreme Leader's waist and wrists, dismembering him. His upper torso then collapsed heavily to the floor at the base of his throne, leaving his hands on the armrests and his lower torso sitting on the throne.\nImmediately after his death, Snoke's bodyguards attempted to avenge him, but despite their efforts, the entire Elite Praetorian Guard was destroyed by Ren and Rey. After the Guards had all been killed, Ren stared at his master's body, before offering Rey a place at his side. Rey begged him to help save the fleet and tried to pull her lightsaber back from him. The combined opposite pulls of Rey and Ren destroyed the blade, knocking Ren unconscious when he hit the floor while Rey escaped the doomed starship. Hux later entered to find Ren alone on the ground, and the body of the Supreme Leader. Before Hux's eyes, the lower half of Snoke's body slipped off the throne and onto the floor beside the torso.\nSnoke's death created an immediate power vacuum that Ren took advantage of by assuming his fallen master's role as the new Supreme Leader of the First Order, much to the displeasure of Hux. Although Ren desired to rule the galaxy with Rey as his equal, the aspiring Jedi rejected his offer, leading Ren to falsely implicate her in the assassination of Snoke.\nBy the time of the battle of Grail City, some First Order officers, such as Colonel Barrut and her crew, weren't aware of Snoke's death and Ren's rise to power. When Wing Commander Poe Dameron informed them about Snoke's fate before destroying the Fortitude, the Maxima-A class heavy cruiser which they commanded, two of Barrut's crewmen believed that Hux had taken Snoke's role as Supreme Leader, only for Barrut to refuse to believe Dameron's claims, dismissing them as lies.\nAfter Snoke's death, the veils of secrecy that surrounded the First Order because of his reliance on mysticism unraveled as Ren seized control and moved to assert dominance over the galaxy.\nDuring his campaign as Supreme Leader, Kylo Ren started to suffer from Force visions and found scraps of arcane lore uncovered in Snoke's old bases, which led him to realize that Snoke was not the apex of the First Order's dark-side pyramid. With Snoke dead, Ren fully expected the dark voice that plagued his mind to vanish, but was perplexed and stunned when it continued, and this pointed to someone manipulating Snoke. The Supreme Leader examined his former mentor's past, but his search led to only dead ends and more unanswered questions than before.\nAfter it was announced that Emperor Palpatine returned to the larger galaxy, Ren traveled to Exegol to crush any threat to his power. Upon tracking down and finding the revived Darth Sidious on Exegol, Kylo Ren learned that Sidious was responsible not only for impersonating Darth Vader's spirit but also for the creation of Snoke: he observed several copies of Snoke being grown in vats while Sidious explained that he had been pulling the strings the whole time. Ren learned that Snoke had been a mere puppet, created and controlled by Sidious, a more powerful master of the dark side.\nRen's betraying and killing of Snoke to save Rey was an act of ascension worthy of Darth Bane's doctrine, from which he proved himself to be a worthy successor of Vader, as he achieved what his grandfather failed to do in the past and when he had the opportunity: overthrow his master in the Sith way, the ancient Rule of Two. The purpose of Snoke's entire existence was built up to serve as Ren's final test. His role had been designed by the Sith Eternal cultists to groom Ren as heir to the Sith legacy, and to mold him into a master of attack and cunning. By dying at Ren's hand, such a test was complete, and by extension, Snoke had fulfilled his role and purpose. With this, despite multiple bodies of him being stored on Exegol, Sidious had no further use for him. The creation of Snoke allowed Sidious to sidestep the tradition in dark-side training where an apprentice killed the master; and while Sidious credited Snoke for training Ren well, he considered himself to be Ren's true master. Additionally, though Snoke failed to bring Rey to Exegol, his master was able to lure his granddaughter to him, pulling the strings from afar.\nEven in death, the vestiges of Snoke's teachings remained with his apprentice, the training he had administered to Kylo Ren leading the Master of the Knights of Ren to continue down his path and committed to the dark side of the Force, influencing his mindset and spirit, even up to his redemption and own death. Kylo thought back to teachings when he pursued Rey, recalling how he was instructed to pursue his impulses when chasing his desires, and how he was nearly unable to do so because of his strong feelings toward the Jedi apprentice.\nIn addition, Ren still respected his master or his teachings, as he continued to think of Snoke as his esteemed mentor for guiding him on the path to the power of the dark side. However, learning the truth about Snoke's origins shattered the respect that Ren held for the former Supreme Leader, as whereas Ren once regarded Snoke as the wise leader of the First Order, he now saw his old Master as nothing more than an expendable \"vat-grown organism.\" Regardless, Snoke's manipulations still influenced him. After the death of his mother, the Supreme Leader remembered Snoke constantly telling him of their intentions, that they would never take him back after his deeds or even care for him, and finally realized the dark-side adept had been deceiving him.\nIn the last minutes of his life, as he climbed from the chasm he was hurled into by Emperor Palpatine, Solo realized the extent of his injuries and the pain that coursed through his body, and credited Snoke's conditioning as the reason he was able to endure such anguish. Finally, as he healed Rey with his own life energy, as per Snoke's previous influence, believing that she would reject him once again, she instead kissed him, and he passed away into the Force at peace.\nSnoke only possessed a limited will of his own; as a genetic creation of Emperor Palpatine, the humanoid was secretly manipulated by the Sith Lord from afar, oblivious to the fact he was having actions and goals orchestrated for him. With a singular focus imposed upon him by his creator, Snoke was oblivious to his own origins and true nature as a genetic being, and had memories that predated his creation, believing he lived through the rise of the Galactic Empire, despite only actually being created by the Sith Eternal in time to witness the faction's destruction. Snoke's belief in himself being the most powerful and wisest Force user in the galaxy may have been implanted into the Supreme Leader by Palpatine as a way to make sure the puppet was never able to betray his master. Snoke was unable to even fathom the idea that there could be a Force user greater than himself.\nIn spiritual matters, Snoke adhered to the dark side and viewed the light as the weak and pathetic side of the Force. Additionally, while Snoke denied any connection to the Sith lineage, he still followed ancient Sith traditions when he chose Kylo Ren as his student. Snoke respected Darth Vader, considering him a legendary figure who lived a \"truly exemplary life,\" and that the Sith Lord's bloodline had potential for power within the Force like no other. This was another factor that influenced his decision to claim Kylo Ren, Vader's grandson, as a student. However, he credited Vader's \"sentiment,\" the inability to overcome the light within himself and kill his son, Luke Skywalker, as the error and true reason the Galactic Empire had fallen, rather than the Rebel Alliance's pursuit for justice, free will, and independence. To this end, he also believed this as the reason behind the man having been destroyed.\nSnoke was fascinated with Ren, not only for his apprentice's inherent potential for limitless power but also because he regarded him as the embodiment of the dark side and the light, and encouraged Ren to use the teachings of both. It was Ren's raw, untamed strength in the Force that led Snoke to believe his student could achieve a level of power comparable to that of Ren's late grandfather, the Sith Lord Darth Vader. As such, Snoke believed that he had never had a student that showed more promise before Ren.\nHe was a secretive, enigmatic figure who coveted arcane lore. Rather than establish a permanent base of operations, he preferred governing the First Order in a mobile command post from where he could contact his subordinates, though his exact location was unknown. He was known for his unwillingness to meet in person with his underlings and often communicated solely through his holographic project transmitted from his throne aboard the Supremacy, only interacting personally with specific targets. He was both wise and cunning, having risen to power by undermining the First Order's leading officials through guile. A master at manipulation, he lured Kylo Ren to the dark side of the Force by using the young Jedi's desperate need for a teacher to his advantage. Although he regarded Armitage Hux as a \"rabid cur,\" Snoke recognized the general's usefulness and believed that even a person's weakness could serve a purpose if properly manipulated. Despite holding a low opinion of Hux's character, the Supreme Leader shared his underling's belief in the necessity of a powerful military force. In addition to overseeing a militarization program that violated treaties signed with the New Republic, Snoke often sanctioned Hux's military strategies and showed approval for his technological innovations.\nDisappointed by Ren's defeat on Starkiller Base, the Supreme Leader berated him as a failed apprentice—a child in a mask—who was unworthy of Vader's legacy. In light of Ren's failure, Snoke began to doubt whether his disciple would ever overcome his conflict between the two sides of the Force. As such, he also considered casting Ren aside for good, just as Han Solo warned his son moments before his death. Nevertheless, Snoke used his skills at manipulation to stoke Ren's conflicted soul, knowing that his apprentice would fail to hide his emotions from Rey after they became linked to each other through their Force-bond. It was through Ren that Snoke sought to manipulate Rey, convinced she would fall into his trap by believing that Ren could be turned from his dark path.\nLike his apprentice, whose mask provided him with a more imposing presence, Snoke relied on theatrics when interacting with his subordinates via holographic transmission. Although the Supreme Leader was around seven feet tall, his holographic form magnified his height several times over, allowing him to \"look down\" upon his followers. While he initially tolerated his apprentice's desire to emulate Vader by wearing a mask, Snoke thought it was absurd and later ridiculed Ren's affectation.\nSnoke's intelligent, sophisticated, and at times calm demeanor masked his more sinister qualities such as cruelty, arrogance, egotism, and narcissism. He was a terrifying, monstrous individual who possessed a dark nature that rivaled even that of the late Darth Sidious. Snoke's demeanor shifted from calmness to anger, depending on the situation. Upon learning of Starkiller's impending destruction, he simply told Hux to evacuate the base with Ren, only to later scold and physically reprimand his apprentice out of frustration. When presented with the chance to use the Starkiller superweapon against the New Republic, Snoke agreed with Hux's plan to lure the First Order's enemies out of hiding despite ending billions of lives in the process.\nSnoke was aware of the inner workings of the Knights and Ren and of their philosophy, and considered them doing as they pleased with the dark side of the Force granted them fluidity, as opposed to what he believed to be the Jedi Order's rigid code that limited them.\nAdditionally, Snoke was a cruel master as well as a predator, who identified weakness and exploited it, as demonstrated by how Snoke dominated not just the First Order but specifically Ren and Hux, making him a brutal tyrant. He particularly enjoyed using his powers to penetrate the minds of his victims and subject them to agonizing scenes, picking apart their courage and resolve slowly over time.\nSnoke believed, as he explained to Ben Solo, children to have pure minds, with thoughts being the most open for possibility, for they did practice self-deception, uncorrupted by the influence of existence, meaning their thoughts could produce logical opinions and observations.\nAs powerful, cunning, and cruel as he was, Snoke was no different from other masters of the dark side in that he still felt fear, specifically a fear of Luke Skywalker and the return of the Jedi. He was convinced that if Skywalker, the last living Jedi at the time, ever returned from exile, he would herald the rise of a new generation of Jedi Knights. Despite his hatred for the Jedi, Snoke actually respected Skywalker while also fearing him, knowing that the legendary Jedi Master wasn't weak but misguided, even musing that had he taken Skywalker as his second-in-command instead of Ren, the galaxy would have been already his by the time of the Cold War. He regarded the Jedi Order as a threat to his designs and, therefore, plotted to destroy it entirely by killing the last Jedi. Upon meeting Skywalker's final apprentice, the Jakku scavenger Rey, Snoke remarked that she possessed the qualities of a true Jedi and, as such, was resolved to see her die before she could also become a threat to his plans. As noted by Rey, however, Snoke was prone to underestimating those around him, such as his own apprentice. He exulted when sensing Ren's newfound resolve, unaware that the dark warrior intended to save Rey by striking down his own master through subterfuge. Indeed, very much like his creator before him, Snoke failed to understand that Force visions were not absolute; he saw the truth, just not what he expected.\nOne of the evil duplicates created by Emperor Palpatine and the Sith Eternal, Snoke was a genetic strandcast, artificially constructed from the donated blood cells from various genetic sources through bioengineering science and advanced cloning technology. As a result of the crude experimentation which yielded his existence, Snoke's appearance was frail, with large hands and a mutilated appearance. He had a distinctive, idiosyncratic bone and facial structure. His hologram used on the Starkiller Base projected him several times larger  than his natural appearance, towering over Kylo Ren and General Hux. Snoke had an elongated face with pale, heavily scarred skin, and pale blue eyes. Even in person, however, he was still exceptionally large, standing over seven foot two inches tall. Nevertheless, Snoke didn't need size to impose his will given that the mere sight of his appearance could terrify. He sported a large scar from the top of his head, all the way down to his brow. Snoke also had what appeared to be a scar or burn on his right cheek that caused his mouth to be contorted. Snoke's left zygoma was malformed. His twisted build and extensive scarring indeed confounded attempts to identify his species. He wore ornate golden khalat robes with a gray underdress, tied at the waist by an elegant golden belt, and on his finger he wore a ring of gold and obsidian engraved with runes from the Dwartii. The black obsidian stone was excavated from the catacombs and mines beneath Fortress Vader on the planet Mustafar. Because of his physical frailties, which left him past his prime in terms of physical strength, he relied on material comforts such as slippers to deal with his ailing body which was in a constant state of pain due to his advanced age and wounds, and he could not defend himself in a physical fight, instead relying on his Elite Praetorian Guards to deal with any threats to him.\nAlthough Snoke was not trained as a Sith, he was naturally Force-sensitive and highly attuned to the dark side, with Force powers equally as impressive and terrifying. While his abilities were not explicitly Sith in origin, like those of his creator, Sidious, Snoke possessed the knowledge and power to rule the First Order. Despite this, Snoke still learned about the lost truths of the Force waiting within the Unknown Regions and made them serve his will. While his physical strength atrophied along with his wounded body, Snoke remained tremendously strong in the Force until his death.\nHis teachings blended traditions of both the light and the dark side; his mastery of the Force was so great that Snoke was capable of exerting his power with the barest minimum of gestures to devastating effect even from great distances. His abilities included Force sense, telepathy, Force choke, and telekinesis, all of which he possessed mastery over.\nLike his apprentice, Snoke possessed the power of mind probe, and his skills were far greater, being the one who taught the latter such an ability, easily successfully employing it on both Rey and Ren prior to his demise. Snoke's mastery of the Force and mind reading even made him telepathically cognizant of Ren's thoughts, emotions, and motives.\nAs a master in the ways of the dark side, Snoke could conjure Force lightning from his fingertips—a power he masteredto the point where he could fire it down at a metal surface and let it ricochet into the intended target. The effects of his lightning-based attacks were immensely painful, as noted by Ren, who backed down in deference to Snoke's superior knowledge of the dark side.\nDespite being a Force wielder of impressive strength, Snoke was not as powerful as the Emperor. Though having mastered telepathy, Snoke's ability to communicate with an individual through the Force across great distances was not as strong as that of his creator, and he was oblivious to the fact that he was semi-controlled by the more powerful master of the dark side of the Force.\nAlthough both Rey and Ren possessed a raw connection to the Force, Snoke's abilities eclipsed their powers due to the greater knowledge and experience at the Supreme Leader's disposal. In addition to subduing Ren with a single attack, Snoke toyed with Rey by telekinetically tossing her across his throne room. He could even overpower her when both were using the Force at the same time, as he demonstrated by overriding her control of the Skywalker lightsaber, causing it to avoid Rey's grasp before turning around and smacking her in the back of the head.\nSnoke was able to coerce the connection of two individuals bonded through the Force with his powers. The Supreme Leader's knowledge and mastery provided him the ability to influence the bridge shared between the minds of Rey and Ren, who, though unbeknownst to them at the time, were a Dyad in the Force, a unique bond stronger than life itself. Suspecting as much, Snoke manipulated their connection in order to lure Rey to him. The two saw and heard each other despite the millions of light years that separated them. As their bond deepened, they could even make physical contact with one another. Through it all, both remained oblivious to Snoke's third-party influence until he outright revealed his manipulation of their connection.\nIn the end, Snoke's visions and Force senses ultimately failed him. While exulting at the resolve he sensed in his often conflicted apprentice, he did not sense his own impending death by the son of Han Solo; Ren utilized Snoke's ability to read his every thought to his advantage and outclassed the dark-side adept, misdirecting his attention, which such a power failure led to his demise.\nThough it is not known if he had any skill in lightsaber combat, Snoke was a warrior of prowess in his prime, having personally defeated and killed legions of adversaries over the span of his life, and being skilled enough to have survived an encounter with Luke Skywalker. By the time of the Cold War, Snoke's physical capabilities had faded, with his advanced age and wounds. Because of his broken body, his stride was staggered, his muscles weakened, and he could not defend himself in conflict beyond his Force abilities. Even with his frail appearance and damaged body, Snoke was strong enough to slap Ren in the face hard enough to draw blood, out of anger for ignoring his orders to leave his mask aboard their ship. Regardless of his deformities, Snoke's mind was sharp, for he possessed a vast, extensive knowledge; this included apprehension about the dark side of the Force, arcane lore, culture of prominent Force wielders, Sith teachings, and historical events, such as the Battle of Endor.\nSnoke was portrayed by Andy Serkis via motion capture in the films Star Wars: Episode VII The Force Awakens and Star Wars: Episode VIII The Last Jedi, the first two installments of the Star Wars sequel trilogy, released in 2015 and 2017 respectively. His name was officially unveiled on May 28, 2015, and his voice was first heard in the initial teaser trailer for The Force Awakens. According to Serkis, Snoke's mannerisms, in particular his gold bathrobe in The Last Jedi, was derived in part from attire worn by Hugh Hefner, the late founder of the Playboy adult magazine.\nFrom the beginning of the production, the character who would ultimately fill the role as main antagonist of the film was nicknamed \"Uber,\" though no specific ideas were clearly defined by that point. Snoke's appearance underwent many changes throughout the development of The Force Awakens, with the character's final appearance not being decided on until October 2015, two months before the film's release. J.J. Abrams and Neal Scanlan didn't want the character to look old and decrepit like Darth Sidious, and even considered making him female. Ivan Manzella sculpted at least two busts to try to hone the look of the character. Snoke's final appearance was based in part of the horror movies of Hammer Films, the concept being that Snoke was handsome in his younger days but was consumed and twisted by the dark side as he became more powerful. Manzella's concepts for Snoke were specifically inspired by the Hammer Films star Peter Cushing, who portrayed Grand Moff Wilhuff Tarkin in the 1977 film Star Wars: Episode IV A New Hope. He also designed Snoke as having a breathing tube coming out of his nose that kept him alive. Snoke's physical appearance in The Last Jedi was first shown in a leaked image of an upcoming LEGO set, and was later officially revealed with the teaser image of the Star Wars Force Link BB-8 2-in-1 Mega Playset that was unveiled at Force Friday 2017. Andy Serkis wore artificial facial hair for this film.\nIn November 2015, Serkis stated in an interview with Entertainment Weekly that while Snoke was a newly created character, he was \"aware of the past to a great degree.\"\nIn another interview with Entertainment Weekly in November 2017, Andy Serkis said that Snoke's injuries were inspired by injuries sustained by soldiers in the trenches of World War I. In addition, in an interview with Empire magazine, Serkis claimed that the disfigurements Snoke possessed were caused in part by osteoporosis that was severe enough that he appeared \"as twisted as a corkscrew,\" and that this was part of what made Snoke in his opinion \"darker than Palpatine.\" Serkis has gone on to say that Snoke's malevolence comes out in reaction to the injuries that he has suffered, which he blames on the Resistance, fueling his hatred for them. Serkis explained that Snoke's desire for power is motivated by greed, bitterness, and fear.\nThe Last Jedi director Rian Johnson said he killed off Snoke to give Kylo Ren a compelling set-up for the 2019 sequel Star Wars: Episode IX The Rise of Skywalker. When asked if he had planned to elaborate on Snoke's backstory in Episode VIII, Johnson replied, \"It would have stopped any of these scenes dead cold if he had stopped and given a 30-second speech about how he's Darth Plagueis. It doesn't matter to Rey. If he had done that, Rey would have blinked and said, 'Who?' And the scene would have gone on.  And I'm not saying he's Darth Plagueis!\"\nUpon the release of The Force Awakens, multiple fan theories about Snoke's identity emerged online. The most famous was, however, was that he was Darth Plagueis, Darth Sidious' Sith Master, who was mentioned anecdotally in the 2005 film Star Wars: Episode III Revenge of the Sith. Plagueis allegedly possessed the power to prevent death. Another popular fan theory was that Snoke was Star Wars Rebels protagonist Ezra Bridger. Lucasfilm Story Group's Pablo Hidalgo dismissed the Darth Plagueis theory in May 2016. The Force Awakens sculptor Ivan Manzella noted that amusing theories about Snoke being Grand Moff Tarkin inspired him to design Snoke after Peter Cushing.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Snoke_(disambiguation)",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/The_Rise_of_Kylo_Ren_1",
  "/wiki/The_Rise_of_Kylo_Ren_2",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/The_Last_Jedi_Adaptation_1",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars_Inside_Intel:_Palpatine%27s_Contingency_Plan",
  "/wiki/Exegol",
  "/wiki/12_BBY",
  "/wiki/34_ABY",
  "/wiki/Supremacy",
  "/wiki/Crait_system",
  "/wiki/Humanoid",
  "/wiki/DNA",
  "/wiki/Strand-Cast",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/Sith_Eternal",
  "/wiki/First_Order",
  "/wiki/Darth_Sidious",
  "/wiki/Snoke%27s_other_apprentice",
  "/wiki/Ben_Solo",
  "/wiki/Force-sensitive",
  "/wiki/Supreme_Leader",
  "/wiki/New_Republic_Era",
  "/wiki/Bioengineering",
  "/wiki/Planet",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Religion",
  "/wiki/Galactic_Empire",
  "/wiki/Sith_Lord",
  "/wiki/Contingency",
  "/wiki/Force_power",
  "/wiki/Hermit",
  "/wiki/Politics",
  "/wiki/Unknown_Regions",
  "/wiki/Imperial_remnant_(cold_war)",
  "/wiki/Dictatorship",
  "/wiki/General",
  "/wiki/Armitage_Hux",
  "/wiki/First_Order_military",
  "/wiki/Padawan",
  "/wiki/Chosen_One",
  "/wiki/Anakin_Skywalker",
  "/wiki/Skywalker_family",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Jedi_Order",
  "/wiki/Standard_day",
  "/wiki/Cold_War",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi_Master",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Death",
  "/wiki/Jedi",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Senate",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Battle_of_Oetchi",
  "/wiki/The_galaxy",
  "/wiki/Rule_of_Two",
  "/wiki/Sith",
  "/wiki/Sith_apprentice",
  "/wiki/Sith_Master",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sith_cultist",
  "/wiki/Cloning",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Emperor",
  "/wiki/Immortality",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Clone_template",
  "/wiki/Kaminoan",
  "/wiki/Imperial_cloning_program",
  "/wiki/Sith_Citadel_laboratory",
  "/wiki/Sith_Citadel",
  "/wiki/Clone_vat",
  "/wiki/Bacta",
  "/wiki/Life_support",
  "/wiki/The_Force",
  "/wiki/Force_vision",
  "/wiki/Dark_side_adept",
  "/wiki/Force_dyad",
  "/wiki/Unidentified_Sith_Eternal_prophecy",
  "/wiki/Knights_of_Ren",
  "/wiki/Snoke%27s_ring",
  "/wiki/High_Republic_Era",
  "/wiki/Amaxine_space_station",
  "/wiki/Battle_of_Jakku",
  "/wiki/4_ABY",
  "/wiki/5_ABY",
  "/wiki/Endor",
  "/wiki/Jedi_Temple_of_Luke_Skywalker",
  "/wiki/Galactic_Republic",
  "/wiki/Imperial_officer",
  "/wiki/Noble",
  "/wiki/Scientist",
  "/wiki/Warlord",
  "/wiki/Hyperspace_route",
  "/wiki/Attendants",
  "/wiki/Navigator",
  "/wiki/Officer",
  "/wiki/Chiss",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Ormes_Apolin",
  "/wiki/Brendol_Hux",
  "/wiki/Hux_family",
  "/wiki/Enric_Pryde",
  "/wiki/Domaric_Quinn",
  "/wiki/First_Order_High_Command",
  "/wiki/Propaganda",
  "/wiki/Sector",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Wild_Space",
  "/wiki/Imperial_Military",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Time",
  "/wiki/Flagship",
  "/wiki/Snoke%27s_throne_room",
  "/wiki/Warship",
  "/wiki/Mega-class_Star_Dreadnought",
  "/wiki/Blood",
  "/wiki/Solo_family",
  "/wiki/Han_Solo",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Twin",
  "/wiki/Jedi_training",
  "/wiki/15_ABY",
  "/wiki/19_ABY",
  "/wiki/Mission_to_Elphrona",
  "/wiki/Elphrona",
  "/wiki/28_ABY",
  "/wiki/Exile_(punishment)",
  "/wiki/Ahch-To",
  "/wiki/Minemoon",
  "/wiki/Master_of_the_Knights_of_Ren",
  "/wiki/Unidentified_rocky_astronomical_object",
  "/wiki/Rarlech_system",
  "/wiki/Dagobah",
  "/wiki/Cave_of_Evil",
  "/wiki/Janyor",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Steadfast_(Imperial-class_Star_Destroyer)",
  "/wiki/29_ABY",
  "/wiki/Centrists",
  "/wiki/Elite_Praetorian_Guard",
  "/wiki/30_ABY",
  "/wiki/Unidentified_planet_(Bylsma)",
  "/wiki/Captain",
  "/wiki/Phasma",
  "/wiki/Brooks",
  "/wiki/Military_rank",
  "/wiki/Grand_Marshal",
  "/wiki/Hunt_for_Lor_San_Tekka",
  "/wiki/32_ABY",
  "/wiki/Jakku",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Droid",
  "/wiki/Escape_from_Jakku",
  "/wiki/Millennium_Falcon",
  "/wiki/Starkiller_Base",
  "/wiki/Hologram",
  "/wiki/Superweapon",
  "/wiki/Hosnian_system",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Battle_of_Takodana",
  "/wiki/Takodana",
  "/wiki/Scavenger",
  "/wiki/Rey_Skywalker",
  "/wiki/Mind_probe_(Force_power)",
  "/wiki/Resistance_base",
  "/wiki/Chewbacca",
  "/wiki/Finn",
  "/wiki/Resistance_navy",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Thermal_oscillator",
  "/wiki/Resistance_pilot",
  "/wiki/Poe_Dameron",
  "/wiki/Hyperspace",
  "/wiki/Kylo_Ren%27s_helmet",
  "/wiki/Turbolift",
  "/wiki/Force-bond",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Temple_Island",
  "/wiki/Oculus_(device)",
  "/wiki/Bodyguard",
  "/wiki/Assassin",
  "/wiki/Battle_of_Grail_City",
  "/wiki/Grail_City",
  "/wiki/First_Order_officer",
  "/wiki/Colonel",
  "/wiki/Barrut",
  "/wiki/Wing_Commander",
  "/wiki/Fortitude",
  "/wiki/Maxima-A_class_heavy_cruiser",
  "/wiki/Vat",
  "/wiki/Darth_Bane",
  "/wiki/Mission_to_Kef_Bir",
  "/wiki/Battle_of_Exegol",
  "/wiki/Lord",
  "/wiki/Jedi_Code",
  "/wiki/Jedi_Knight",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Khalat_robes",
  "/wiki/Gold",
  "/wiki/Obsidian",
  "/wiki/Dwartii_(group)",
  "/wiki/Stone",
  "/wiki/Mining",
  "/wiki/Fortress_Vader",
  "/wiki/Mustafar",
  "/wiki/Snoke%27s_slippers",
  "/wiki/File:An_Awakening.ogg",
  "/wiki/Force_sense",
  "/wiki/Telepathy",
  "/wiki/Force_choke",
  "/wiki/Telekinesis",
  "/wiki/Mind_probe",
  "/wiki/Force_lightning",
  "/wiki/Andy_Serkis",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/2015",
  "/wiki/2017",
  "/wiki/May_28",
  "/wiki/J.J._Abrams",
  "/wiki/Neal_Scanlan",
  "/wiki/Ivan_Manzella",
  "/wiki/Peter_Cushing",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Force_Friday",
  "/wiki/Rian_Johnson",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Darth_Plagueis",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2016",
  "/wiki/Category:Images_of_Snoke",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/The_Rise_of_Kylo_Ren_3",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Age_of_Resistance_-_Supreme_Leader_Snoke_1",
  "/wiki/Phasma_(novel)",
  "/wiki/Phasma_(audiobook)",
  "/wiki/Before_the_Awakening",
  "/wiki/Poe_Dameron_1",
  "/wiki/Poe_Dameron_8",
  "/wiki/Poe_Dameron_10",
  "/wiki/Poe_Dameron_11",
  "/wiki/Poe_Dameron_12",
  "/wiki/Poe_Dameron_14",
  "/wiki/Poe_Dameron_16",
  "/wiki/Join_the_Resistance",
  "/wiki/Age_of_Resistance_-_General_Hux_1",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens_(Golden_Book)",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_3",
  "/wiki/The_Force_Awakens_Adaptation_5",
  "/wiki/The_Force_Awakens_Adaptation_6",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_Adaptation_2",
  "/wiki/The_Last_Jedi_Adaptation_3",
  "/wiki/The_Last_Jedi_Adaptation_4",
  "/wiki/The_Last_Jedi_Adaptation_5",
  "/wiki/Poe_Dameron_28",
  "/wiki/Poe_Dameron_30",
  "/wiki/Poe_Dameron_31",
  "/wiki/Through_the_Turbulence",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/Choose_Your_Destiny:_A_Finn_%26_Poe_Adventure",
  "/wiki/Spark_of_the_Resistance",
  "/wiki/Spark_of_the_Resistance_(audiobook)",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/The_Lost_Stories,_Part_3",
  "/wiki/Star_Wars_Adventures_(2017)_32",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_All-Stars",
  "/wiki/Scouting_for_Leia/A_Mission_with_Maz",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Rolling_with_BB-8/Resistance_on_the_Run",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/The_Art_of_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Databank_A-Z",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars_Helmet_Collection_24",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Sphero",
  "/wiki/Star_Wars_Droids_App_by_Sphero",
  "/wiki/File:Supreme_Leader_Snoke_data.png",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_Incredible_Cross-Sections",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Last_Jedi_Activity_Book_with_Stickers",
  "/wiki/Star_Wars:_The_Last_Jedi:_Heroes_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Last_Jedi_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Helmet_Collection_31",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Star_Wars_Helmet_Collection_43",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/The_Last_Jedi:_Rose_Tico:_Resistance_Fighter",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_Resistance_Bomber_Book_and_3D_Wood_Model",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/First_Order_Conversion_Kit",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Star_Wars_Helmet_Collection_72",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/TIE_Fighter_Owners%27_Workshop_Manual",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_1",
  "/wiki/Star_Wars_Universe",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Databank_(website)",
  "/wiki/35_ABY",
  "/wiki/Dathan",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/21_ABY",
  "/wiki/Star_Wars_Insider_Special_Edition_2018",
  "/wiki/Darth_Vader_(2020)_11",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/0_ABY",
  "/wiki/Bloodline_(novel)",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Commanding_officer",
  "/wiki/Starship",
  "/wiki/Star_Wars:_The_Last_Jedi_The_Official_Movie_Companion",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Ovanis",
  "/wiki/Lor_San_Tekka",
  "/wiki/December_6",
  "/wiki/January_9",
  "/wiki/2020",
  "/wiki/November_29",
  "/wiki/July_8",
  "/wiki/Entertainment_Weekly",
  "/wiki/November_22",
  "/wiki/June_4",
  "/wiki/November_12",
  "/wiki/July_1",
  "/wiki/November_17",
  "/wiki/May_30",
  "/wiki/June_2",
  "/wiki/March_11",
  "/wiki/December_7",
  "/wiki/May_3",
  "/wiki/Phil_Szostak",
  "/wiki/File:PhilSzostak-Uber-September-10-2018.png",
  "/wiki/July_20",
  "/wiki/July_27",
  "/wiki/September_15",
  "/wiki/January_27",
  "/wiki/2018",
  "/wiki/December_17",
  "/wiki/December_21",
  "/wiki/December_28",
  "/wiki/February_2",
  "/wiki/December_29",
  "/wiki/June_20",
  "/wiki/January_21",
  "/wiki/July_23",
  "/wiki/July_18",
  "/wiki/July_22",
  "/wiki/February_20",
  "/wiki/January_13",
  "/wiki/May_10",
  "/wiki/December_14"
 ]
}