{
 "name": "Sol_Windtide",
 "display_name": "Sol Windtide",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Sol Windtide was a Human male who resided in the city of Bestine on Tatooine during the time of the Galactic Civil War. He was a friend of a Jedi named Nos'lyn. By the time following the Battle of Yavin in 0 BBY, Windtide met with one of Nos'lyn's pupils, a Force-sensitive individual who aspired to become a Jedi. During the course of their training, Windtide bestowed to the trainee a number of gifts, including a training lightsaber that had once belonged to Nos'lyn.\nA Human male by the name of Sol Windtide resided in the Imperial-controlled capital city of Bestine on the Outer Rim Territories world of Tatooine during the time of the Galactic Civil War. He was a friend of Nos'lyn, a Human Jedi who took up residency aboard Tansarii Point Station, a space station situated in the Bright Jewel system.\nBy the time following the Battle of Yavin in 0 BBY, Nos'lyn met with a Force-sensitive individual referred to him by the famed Rebel Alliance hero, Han Solo. Nos'lyn took it upon himself to train the individual in the ways of the Force. As part of their training, Nos'lyn sent the aspiring Jedi to a village on Tatooine, the site of a brutal massacre carried out by Anakin Skywalker against a tribe of Tusken Raiders. The village was left deserted, except for a number of aggressive creatures which roamed the area, twisted by the dark side of the Force. Nos'lyn instructed his trainee to cleanse the area by putting the creatures out of their misery, but not out of hatred. After completing this lesson, Nos'lyn commended his student, and referred them to Sol Windtide to receive a gift in the form of credits and a plasma shield generator.\nHowever, this would not be the last time Windtide had an encounter with the Force-sensitive. For the next step in their training, Nos'lyn directed his pupil to the Crystal Cave on the planet Naboo. There, the aspiring Jedi fought off vicious Narglatch creatures, and collected an unrefined crystal to be used in a lightsaber. As soon as the crystal was found, Nos'lyn's pupil brought it back to Sol Windtide in Bestine. Windtide commented that the Force-sensitive looked very \"centered.\" He then asked if they found what they were searching for. When the pupil informed Windtide that a suitable crystal had been found, Windtide handed over to the Force-sensitive a training lightsaber which had once belonged to Nos'lyn. Windtide also took the unrefined crystal and returned to the Force-sensitive a tuned, green colored lightsaber crystal. Windtide told the Force-sensitive that the lightsaber would serve them well, but that they should use discretion when using it.\nSol Windtide had fair skin, balding brown hair, and brown colored eyes. As a trusted friend of Nos'lyn, Windtide had a calm and agreeable demeanor. He also saw much promise in Nos'lyn's pupil.\nDuring his time in Bestine, Windtide wore a white trim lined shirt with black trimming, and a white pair of dress slacks. Additional clothing included a pair of white long uniform gloves, a gray fancy belt, and a pair of white high quality boots. Nos'lyn had also sent to Windtide a plasma shield generator and his very first lightsaber, both of which were given to Nos'lyn's pupil as gifts. The cylindrical handle of Nos'lyn's hilt was strongly reminiscent of the one fashioned for Anakin Skywalker's second lightsaber.\nSol Windtide was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online role-playing game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.. With the release of Publish 25's New Game Enhancements on November 15, 2005, a New Player Tutorial based on Tansarii Point Station was introduced to the game. Players who selected the Jedi profession could receive introductory quests from an NPC named Nos'lyn. One of the quests, titled \"First Steps: Anger and Harmony,\" ended with Nos'lyn directing the player to meet with Sol Windtide in Bestine for their reward, including 5000 credits and a plasma shield generator. During a following quest, titled \"Searching for a Jedi's Weapon,\" players were again directed by Nos'lyn to meet with Sol Windtide for a reward, which included a green color crystal and a training lightsaber. In the conversation prompt with Windtide, it was possible for players to select an arrogantly toned dark sided response when first introducing themselves to Windtide. However, neither response altered the overall quest progression.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/City/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Nos%27lyn",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Training_lightsaber/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Bestine_(city)",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Bright_Jewel_system/Legends",
  "/wiki/Canon",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Tusken_village",
  "/wiki/Mission_to_Tatooine_(Separatist_Crisis)",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Species/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Plasma/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Crystal_Cave_(Naboo)",
  "/wiki/Naboo/Legends",
  "/wiki/Narglatch/Legends",
  "/wiki/Crystal/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Shirt",
  "/wiki/Clothing/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Lightsaber_hilt/Legends",
  "/wiki/Anakin_Skywalker%27s_second_lightsaber",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Roleplaying_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope"
 ]
}