{
 "name": "Sola_Naberrie",
 "display_name": "Sola Naberrie",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Naberrie family"
     ]
    }
   ]
  }
 ],
 "content": "Sola Naberrie was a human female from the planet Naboo. A member of the Naberrie family, she was a daughter of Ruwee Naberrie and Jobal Naberrie, and the sister of Senator Padmé Amidala. Sola had two daughters of her own, Ryoo and Pooja Naberrie, who were born during the last years of the Galactic Republic.\nSola Naberrie was a human female who was the daughter of Ruwee and Jobal Naberrie, along with her younger sister, Padmé. Sola and Padmé grew up together in the Naberrie family house on their homeworld, Naboo. When Padmé became queen of the Naboo, Padmé changed her last name from Naberrie to Amidala to protect Sola and her other loved ones. Amidala participated in the speech of choosing to be the Queen of Naboo as a hologram to Sola.\nIn 28 BBY, choosing to have a child without a sexual partner. Sola gave birth to her first child, Ryoo Naberrie. After returning from a week long visit to Alderaan, Amidala and several members of her entourage returned to Naboo and briefly met with Queen Réillata before visiting the family home, where Amidala met her niece for the first time. Sola also had another daughter, Pooja. As she choose not to marry, Sola used her portion of the Naberrie family wedding fabric to make clothes for her daughters, showing that she welcomed the new additions to the family.\nShortly before the Clone Wars, Amidala visited the Naberries with her bodyguard, the Jedi Padawan Anakin Skywalker. Soon afterward, Amidala and Skywalker secretly married. The formation of the Galactic Empire was closely followed by Amidala's death after giving birth to the twins Luke Skywalker and Leia Organa. Sola Naberrie was among the mourners who attended her sister's funeral in the city of Theed, alongside her parents and her daughters.\nSola Naberrie was a human female who had light skin. Unlike her sister Padmé, who desired a romantic relationship like the one their parents had, Sola was uninterested in having a partner, although she was comfortable with having children of her own.\nSola wore a dark burgundy outfit with golden details to her sister's funeral, an outfit that closely resembled Amidala's wardrobe as a tribute. The dark tones of the costume reflected the sadness of the family and their mourning of her death.\nSola Naberrie was portrayed by Claudia Karvan. She first appeared in a deleted scene from Star Wars: Episode II Attack of the Clones. She appears at the end of Star Wars: Episode III Revenge of the Sith attending Padmé Amidala's funeral. The character's name is given in the film's closing credits.\nE. K. Johnston, the author of Queen's Shadow, confirmed that she intended Sola Naberrie to be both aromantic and asexual.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sola_Naberrie",
  "/wiki/Sola_Naberrie/Legends",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Hope",
  "/wiki/Padm%C3%A9_Amidala_(Star_Wars_Encyclopedia)",
  "/wiki/Naboo_(Star_Wars_Encyclopedia)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Naberrie_family",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Ruwee_Naberrie",
  "/wiki/Jobal_Naberrie",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Ryoo_Naberrie",
  "/wiki/Pooja_Naberrie",
  "/wiki/Reproduction",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Naberrie_family_house",
  "/wiki/Homeworld",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Naboo_(people)",
  "/wiki/Hologram",
  "/wiki/28_BBY",
  "/wiki/Alderaan",
  "/wiki/R%C3%A9illata",
  "/wiki/Marriage",
  "/wiki/Wedding_fabric",
  "/wiki/Clothing",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Wedding_of_Anakin_Skywalker_and_Padm%C3%A9_Amidala",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Death",
  "/wiki/Twin",
  "/wiki/Luke_Skywalker",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Padm%C3%A9_Amidala%27s_funeral",
  "/wiki/City",
  "/wiki/Theed",
  "/wiki/Parent",
  "/wiki/Claudia_Karvan",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/E._K._Johnston",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Padm%C3%A9%27s_Real_Last_Name",
  "/wiki/Standard_year",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY",
  "/wiki/Skywalker:_A_Family_at_War"
 ]
}