{
 "name": "Solha",
 "display_name": "Solha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Solha's family",
      "Galactic Republic",
      "Confederacy of Independent Systems",
      "Confederacy military",
      "Mokivj droid factory",
      "Confederacy military",
      "Mokivj droid factory"
     ]
    }
   ]
  }
 ],
 "content": "Duke Solha was a human male born on the planet Serenno who served the Galactic Republic. While in the Republic's service, the Serennian met Senator Padmé Amidala on a diplomatic excursion. Solha believed the Republic and its Senate thought of him as a joke, which prompted him leave his work and join the Confederacy of Independent Systems. The duke, along with his brother and sister, were dispatched to the planet Mokivj. There, under Separatist leader Count Dooku's direction, workers mined and proccessed cortosis, a metal that deflected blaster bolts and powered down lightsabers. Solha also designed the cortosis B2 super battle droid and manufactured them within the Mokivj droid factory. The complex also produced cortosis covered clone trooper armor, which the Sith Lord Darth Sidious, the secret leader of the Separatists, intended to use in the upcoming execution of Order 66.\nAround 19 BBY, when Amidala's former handmaiden Duja started investigating the Separatist presence on Mokivj, Solha ordered assassins to kill her on the planet Batuu in an attempt to keep knowledge of the droid factory's existence and the Serennian's plans safe. The senator received one of Duja's calls regarding the search, and upon learning about her former handmaiden's discoveries, chose to travel to Mokivj. The senator was followed to the planet by her husband Anakin Skywalker, and his colleague, the Chiss Senior Captain Mitth'raw'nuruodo \"Thrawn\", after her ship was found abandoned. Solha apprehended Skywalker and Thrawn upon entering the facility, placing them in makeshift prison cells.\nThe pair managed to open the cell and met with Amidala to plan the destruction of the complex and investigate the unique weapons being produced there. Duke Solha donned cortosis coated clone armor, and attempted to minimize the chaos Skywalker was causing with Force-powered telekinesis by ordering the droids under his command to secure the complex. While in the factory, Solha tracked down Amidala, leading the pair to have a conversation about the duke's past and his ambitions for destroying the Republic in line with Dooku's plans. The senator escaped, helped evacuate the site's workers, and watched as Skywalker blew up the planet's cortosis mines, which would prevent the Separatists from producing more coated battle droids in Solha's factory. The explosions caused by the rare metal resulted in volcanic activity, which ruined the planet's natural habitats and farmland.\nSolha was a Serennian duke born on the Outer Rim planet Serenno who belonged to a family consisting of him and his brother and sister. Before the Clone Wars, a galactic-wide conflict between the Galactic Republic and the Confederacy of Independent Systems, the duke served in the Republic and met Senator Padmé Amidala on a diplomatic excursion. By that time, Solha believed that many individuals in the Republic and the Senate viewed him as a joke, or did not notice him at all. Eventually, he lost faith in the Republic and joined Count Dooku's Separatists and began working for their military.\nAround 19 BBY, the Separatist leader Dooku dispatched Solha to the planet Mokivj where he led a droid factory and oversaw workers mining and proccessing cortosis, a metal that deflected blaster bolts and powered down lightsabers. While there, the duke designed and manufactured cortosis B2 super battle droids within the factory. The secret overseer of Solha's facility, the Sith Lord Darth Sidious, intended to use the factory's other product, cortosis covered clone trooper armor, as a safeguard to ensure the success of Order 66, a command installed in all clone troopers ordering them to kill all Jedi. Eventually, Solha's brother and sister came to work at the factory with him. After the droid factory and its cortosis mines were established, the Serennian duke spent several months working with the material to produce reserves of battle droids. Solha hired smugglers from many locations to bring materials for his operations to the planet Batuu for later transfer to Mokivj, aiming to keep the location of his facility as secret as possible by having few direct connections to it. The duke began working with Captain Boroklif and his crew, who used their freighter the Larkrer to transport goods to the Mokivj factory.\nAt some point, Amidala's former handmaiden Duja began investigating the Separatist presence on Mokivj while on Batuu. After uncovering evidence concerning Solha's factory, Duja was assassinated on the duke's orders. Local citizens later found her corpse and left her at a bar, hoping someone would uncover the reason behind her death. In an effort to keep Mokivj factory's products a secret, Solha and his siblings blocked the factory's lower levels except for the ones used by maintenance workers. Amidala eventually received a message from Duja which had been sent prior to her death, relaying the suspicious findings of her investigation into Separatist activities.\nAfter this, Amidala then traveled to Batuu, but went missing for weeks following her choice to investigate Separatist activities by journeying to Mokivj. Her disappearance prompted her husband, Jedi Knight Anakin Skywalker, to search for his wife; a quest that eventually led him to Batuu. While there, he met the Senior Captain Mitth'raw'nuruodo, also known by his core name Thrawn, of the Chiss Expansionary Defense Fleet in his ship, and the pair decided to work together to investigate Amidala's disappearance. Thrawn and Skywalker killed some of Solha's smugglers, including Boroklif and his crew, while in the world's Black Spire outpost. After stealing their ship and its cargo, the pair changed clothes to appear less suspicious when introduced to the duke.\nUsing the preset hyperspace route stored in Boroklif's ship, Skywalker and Thrawn traveled to the coordinates on Mokivj, where the Serennian was. After the pair located Solha's droid factory, Skywalker contacted the duke, planning to infiltrate the facility. The Jedi informed Solha that Boroklif was indisposed due to trouble at Black Spire, and that his forces were most likely dead. The Jedi Knight offered to bring the cargo Solha had lost to his factory, which the duke accepted, telling Skywalker that he would open the shield when the ship landed at the factory courtyard, and not before.\nFollowing their arrival, the Jedi Knight and the Chiss senior captain were hailed by the Serennian duke, who was escorted by a pair of B2-series super battle droids and two squads of B1-series battle droids. Solha inquired about Skywalker's posession of R2-D2, an astromech droid that belonged to the Republic. In response, Skywalker explained that he had found the droid and believed it could be worth something if the duke desired to purchase it. The pair asked Solha about Duja's fate which the duke brushed off, and also informed him how they acquired Boroklif's ship. Thrawn explained that they came to Mokivj because there was a preset hyperspace course on the ship, and upon the Serennian's inquiry elaborated that Boroklif had set the coordinates.\nSolha warned Skywalker and Thrawn that they had told him all the information they had, leaving them minimal bargaining room. However, the pair told him that there was another preset hyperspace course locked below the current one, which was locked by a two–stage encryption passcode, and that each of them had one half. After Skywalker introduced Thrawn under the name \"Brix,\" Solha ordered all of his droids to lower their weapons and escort them into the factory.\nAs their group entered the building, Skywalker used Force-powered telekinesis to move his lightsaber around, making it appear as if a rogue Jedi had entered the facility and caused damage to doors. Skywalker destroyed several droids and then threw his lightsaber to the top of the building, hoping the duke would attempt to chase a figure that did not exist. Now focused on capturing a rogue Jedi, Solha sent Skywalker and Thrawn to stay in improvised prison cells, calling the latter a thief. The Serennian aimed his blaster at Skywalker, blaming him for \"transporting\" a Jedi to the facility aboard the Larkrer. Solha then tried to impress Skywalker with his title of duke, though it had no effect.\nA B2-series super battle droid proceeded to take the pair's weapons and communication devices, leaving with R2-D2 after locking the cell. Skywalker, who could sense Amidala on Mokivj through the Force, agreed with Thrawn to wait in the detention block for two hours to see if she joined them, after which they would break out and attempt to locate her. Skywalker was later informed by Thrawn that the ship in the courtyard was an ore carrier filled with the ore, meaning Solha's factory was a manufacturing facility, not a staging ground. While they waited, Thrawn updated his partner on the ebbs and flows of activity near them by sensing heat signatures, as Chiss could see more infrared than humans.\nAfter waiting two hours without Amidala arriving in the detention block, the Chiss crafted a cord from the clothing he got from the Larkrer and used it to unlock their cell. Shortly after, assisted by factory maintenance workers Cimy, Huga, and LebJau, Amidala met Skywalker and Thrawn once they had escaped from confinement, defeating the droids guarding the area. Following the Chiss' introduction to the newcomers by his Jedi companion, the group created a plan to retrieve Skywalker's lightsaber and defeat Solha.\nWhen Amidala and Thrawn left, the Jedi began to wander across the factory and found a section of the building that produced cortosis B2 super battle droids, which was guarded by the duke, his siblings, and droid sentries. The Serennians, who were protecting themselves with cortosis-covered clone trooper armor, were resistant to Skywalker's attempts to confuse them. Aware of the Jedi's presence, Solha attempted to track down the Jedi, prompting him to hide while Amidala and the Chiss commander retrieved his lightsaber. Unarmed, Skywalker used the Force to see where Solha and his droid sentries were, avoiding them while traveling across the factory. The duke became increasingly frustrated by the Jedi's use of telekinesis to cause chaos, ordering the droids under his command to secure the factory. Shortly after, Skywalker met with Amidala and reacquired his lightsaber, also learning from his wife that Thrawn had decided to focus on his own mission, for the Chiss Ascendancy nation.\nWith Skywalker intent on destroying Solha's factory, Amidala helped the factory's workers evacuate. Thrawn, who decided to rejoin their mission following the completion of his own, informed the duo that the duke's droids built with cortosis, a metal Solha thought could change the Clone Wars forever. After donning clone trooper armor, Solha sought out Amidala and engaged in a conversation with her regarding his past ambitions and current goal of destroying the Republic in line with Dooku's plans. When Amidala's attempt to make Solha surrender failed, she resorted to stunning him with a strike from the grappling hook function of her S-5 blaster pistol.\nIn another section of the factory, Skywalker and Thrawn also learned that the Separatists were producing cortosis-covered clone trooper armor. The Jedi surmised they were planning to infiltrate the Republic by sending Serennian troopers wearing clone trooper armor to Coruscant, the capital planet of the Republic. After the battle droids protecting the room were defeated by Skywalker and Thrawn, the group abandoned the factory and destroyed it once evacuated to prevent the facility from producing more battle droids.\nSkywalker decided to destroy the cortosis mine of Solha's facility as well, though Amidala, Thrawn, and LebJau petitioned against it, setting it to explode. Though the mines Solha had established were wiped, out, the amplified blast caused by the expansion of area's cortosis resulted in heat being sent to Mokivj's crust, which directed lava, ash, and smoke into the planet's best cropland and water supplies. Though LebJau informed the Jedi that his actions would result in volcanic activity and leading to widespread devastation—including mass deforestation and desertification—Skywalker remained unrepentant for his actions. Many years later, after Skywalker had fallen to the Dark side of the Force and become the Sith Lord Darth Vader, he reflected on the events on Mokivj and Solha's demise.\nSolha was a tall, slender human male whose voice carried heavy Serennian accent by the time of the Clone Wars. While working for the Galactic Republic, he felt that members of the Galactic Senate and the Republic saw him as a joke. By the time he oversaw work within the Separatist Mokivj droid factory, Solha presented himself as a very ambitious and confident man, despite having been a quiet person prior to that. While he worked for the Republic, Amidala noted that his face portrayed him as someone whose desires and ambitions had been thwarted, however, when he worked for Dooku, his face was filled with ambition and determination. The duke held aspirations of becoming one of the most important members of the Confederacy, assuring others that his actions would make everyone remember him. During his time leading the factory, he acted as a traffic controller, which later became the reason for Skywalker not taking him seriously. The duke spoke the Basic language.\nSolha was very proud of his creations on Mokivj, some of which included cortosis B2 super battle droids. He did not care about the workers he managed, treating them harshly by not giving them enough food or letting them die during their labor of lifting heavy loads. During the raid on the facility, the Serennian duke was always confident that he was going to succeed in defeating the assailants, which would bring him praise after the Republic's eventual defeat. Protected by armor, Solha was willing to fight Amidala, having thought she was a Jedi initially when she was holding Skywalker's lightsaber. As the factory's situation deteriorated, he continued to firmly believe that he would live to see the assailants defeated up until the facility's destruction.\nThough initially a professional politician, Solha proved able to lead workers in manufacturing projects such as producing cortosis B2 super battle droids at the Mokivj droid factory, which were designed by him.\nBy the time Skywalker arrived on Mokivj, Solha wore a royal Serennian cloak that was distinctively identifiable by its style, throat clasps, color, and ribbing. After later taking off the cloak, he donned cortosis clone trooper armor to protect himself when assailants were loose in his factory. He also used an E-5 blaster rifle and a communications device during the attack on his facility.\nSolha first appeared in the second storyline of the 2018 novel Thrawn: Alliances, the second installment in the Star Wars: Thrawn novel series written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/Solha",
  "/wiki/Serenno",
  "/wiki/Human",
  "/wiki/Serennian",
  "/wiki/Gender",
  "/wiki/Solha%27s_family",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_military",
  "/wiki/Mokivj_droid_factory",
  "/wiki/File:Solha1.ogg",
  "/wiki/Duke",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Politics",
  "/wiki/Galactic_Senate",
  "/wiki/Solha%27s_brother",
  "/wiki/Solha%27s_sister",
  "/wiki/Mokivj",
  "/wiki/Head_of_State",
  "/wiki/Count_of_Serenno",
  "/wiki/Dooku",
  "/wiki/Mining",
  "/wiki/Cortosis",
  "/wiki/Metal",
  "/wiki/Blaster",
  "/wiki/Lightsaber",
  "/wiki/Cortosis_B2_super_battle_droid",
  "/wiki/Clone_trooper_armor",
  "/wiki/Sith_Lord",
  "/wiki/Darth_Sidious",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Order_66",
  "/wiki/19_BBY",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Duja",
  "/wiki/Assassin",
  "/wiki/Death",
  "/wiki/Batuu",
  "/wiki/Droid",
  "/wiki/Mission_to_Mokivj",
  "/wiki/Marriage",
  "/wiki/Anakin_Skywalker",
  "/wiki/Chiss",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Core_name",
  "/wiki/Prison",
  "/wiki/Weapon",
  "/wiki/Cloning",
  "/wiki/Armor",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Volcano",
  "/wiki/Farm",
  "/wiki/File:Solha2.ogg",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Clone_Wars",
  "/wiki/The_galaxy",
  "/wiki/Time",
  "/wiki/File:Solha3.ogg",
  "/wiki/Factory",
  "/wiki/Clone_trooper",
  "/wiki/Jedi",
  "/wiki/Cortosis_mine",
  "/wiki/Standard_month",
  "/wiki/Battle_droid",
  "/wiki/Smuggler",
  "/wiki/Captain",
  "/wiki/Boroklif",
  "/wiki/Boroklif%27s_crew",
  "/wiki/Freighter",
  "/wiki/Larkrer",
  "/wiki/Transport",
  "/wiki/Batuuan",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Mission_to_Batuu",
  "/wiki/Standard_week",
  "/wiki/Jedi_Knight",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Mitth%27raw%27nuruodo%27s_ship",
  "/wiki/Black_Spire",
  "/wiki/Starship",
  "/wiki/Clothing",
  "/wiki/File:Solha4.ogg",
  "/wiki/Hyperspace_route",
  "/wiki/Galactic_coordinates",
  "/wiki/Deflector_shield",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Squad",
  "/wiki/B1-series_battle_droid",
  "/wiki/R2-D2",
  "/wiki/Astromech_droid",
  "/wiki/Hyperspace",
  "/wiki/File:Solha5.ogg",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Thief",
  "/wiki/Standard_hour",
  "/wiki/Ore_carrier",
  "/wiki/Ore",
  "/wiki/Staging_area",
  "/wiki/Temperature",
  "/wiki/Infrared",
  "/wiki/File:Solha6.ogg",
  "/wiki/Cimy",
  "/wiki/Huga",
  "/wiki/Nodlia",
  "/wiki/Commanding_officer",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Trooper",
  "/wiki/Stun",
  "/wiki/Grappling_hook",
  "/wiki/S-5_blaster_pistol",
  "/wiki/File:Solha7.ogg",
  "/wiki/Coruscant",
  "/wiki/Capital",
  "/wiki/Magma",
  "/wiki/Water",
  "/wiki/Forest",
  "/wiki/Desert",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sith",
  "/wiki/File:Solha8.ogg",
  "/wiki/Traffic_controller",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Language",
  "/wiki/Foodstuff",
  "/wiki/File:Solha9.ogg",
  "/wiki/Serennian_cloak",
  "/wiki/Color",
  "/wiki/Cloak",
  "/wiki/E-5_blaster_rifle",
  "/wiki/Comm_unit",
  "/wiki/2018",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Star_Wars:_Thrawn_(novel_series)",
  "/wiki/Timothy_Zahn",
  "/wiki/Category:Audio_files_of_Solha",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising"
 ]
}