{
 "name": "Solha%27s_brother",
 "display_name": "Solha's brother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Solha's family",
      "Confederacy of Independent Systems",
      "Confederacy of Independent Systems Navy",
      "Confederacy of Independent Systems Navy"
     ]
    }
   ]
  }
 ],
 "content": "A human male was the brother of Duke Solha and his sister, he was born on the planet of Serenno. He served alongside his brother, Duke Solha and his sister in the Confederacy of Independent Systems. They all were dispatched by Count Dooku to the planet Mokivj, where they oversaw the manufacturing of cortosis B2 super battle droids and mining of cortosis. He wore a Serennian cloak and later wore clone trooper armor during the raid on the Mokivj droid factory.\nWhen Jedi Knight Anakin Skywalker and Senior Captain Mitth'raw'nuruodo raided the factory, Solha's brother and sister were talking to some workers on the courtyard, next to a speeder struck. They later sieged the Jedi and the Chiss and their allies until the destruction of the factory.\nBorn on the planet of Serenno, this male Serennian had a brother and a sister. One of them, the brother, Duke Solha, served the Galactic Republic and met Senator Padmé Amidala in a diplomatic excursion before joining Count of Serenno Dooku's rising faction.\nCount Dooku dispatched Duke Solha, his sister and his brother to the planet of Mokivj, to oversee mining of cortosis, a rare metal which powered down lightsabers and deflected blaster bolts, and manufacturing of cortosis B2 super battle droids and clone trooper armor covered with cortosis on Solha's factory, in 19 BBY. The cortosis b2 super battle droids would be used in the Clone Wars, a galactic conflict fought by the Galactic Republic and Count Dooku's Confederacy of Independent Systems. When former handmaiden of Padmé Amidala, Duja, started investigating the Separatist presence on Mokivj, Solha ordered some assassins to deal with her so the droid factory or Solha's plans wouldn't be rveealed. Some months afterwards, Amidala received the call of her former handmaiden telling her of the former's discovery, Amidala traveled to Mokivj, and went missing for some weeks. When her husband, Anakin Skywalker noticed she was missing, he flew to Mokivj to find his wife.\nAfter Jedi Knight Anakin Skywalker and Chiss Senior Captain Mitth'raw'nuruodo or Thrawn, his core name, located Solha's factory, the Jedi offered to bring Solha's lost cargo to his factory, the duke accepted their offer to bring the cargo he had lost to the factory. At that time, Solha's brother, and his sister were talking with some maintenance workers of the factory near a B1-series battle droid squad and an atmospheric craft.\nThe Serennian duke, the Jedi and the Chiss mantained a brief conversation on the courtyard of the factory about Duja, how the pair got Separatist Captain Boroklif's ship, the Larkrer and about what else the pair could offer the Serennian, then, the lights went off, and the Jedi slashed a B1-series battle droid squad and later threw his lightsaber to the roof of the building so the Separatists weren't aware that he was in fact, a Jedi. When the lights came back on, Solha witnessed the destroyed battle droids, which made him aware that there was a Jedi loose. The duke and the pair, escorted by a droid escort, entered the building. Afterwards, the duke imprisoned the Jedi and Chiss, calling the human a thief and telling him that a Jedi had entered his factory thanks to his actions, and for that alone, he should be shot. As Solha knew there was a Jedi loose on the factory, he imprisoned them, and shortly afterwards barricaded himself, his brother and sister in the production section for the cortosis B2 super battle droid, wearing clone trooper armor covered with cortosis. Later, Solha's brother and Solha's sister also used clone trooper armor to protect themselves from the Jedi.\nSkywalker and the Chiss escaped the prison cells two hours later when Skywalker's wife, Amidala arrived at the factory's detention block, shortly after Thrawn unlocked their cells with a cord he made from the clothing they got from the Larkrer. When the Senator arrived, she arrived accompanied by some of the factory's maintenance workers, LebJau, Cimy and Huga, which Amidala had promised a fortune to if they helped her infiltrate the factory, the Jedi introduced Thrawn to his wife and the group and Amidala and the workers did the same.\nSolha's brother and sister led an attack on one wing of the factory after fleeing the production section of the cortosis battle droids, however, the attack on the assailants ultimately failed, which made the duke, and his siblings lose their troops and lose the factory to the attackers, as Solha was knocked out by Amidala using her grappling hook to knock him out.\nAfter the Jedi, Chiss and senator, fought against the factory's droid forces, the duke, and his siblings, the Jedi and Chiss fled the factory with all the maintenance workers. Later, the Jedi destroyed the factory, Skywalker also decided to destroy the mine too, so the Separatists couldn't start again on Mokivj. Although, Amidala, Thrawn, and LebJau asked him not to do it, he ignored their petition, and he destroyed the mine too, which gained him the anger and devastation of the already devastated Mokivj, as it caused a massive explosion expanded by the cortosis.\nSkywalker accidentallly sent lava, ash, and smoke into the planet's best cropland and water. Skywalker wasn't aware that the cortosis in the mine would redirect the heat of th eexplosions, so, the heat was sent down the planet's crust, which activated volcanic activity and leading to widespread devastation, deforestation and desertification on Mokivj. Resulting in the explosive force doing much more than merely collapsing the mine's tunnels.\nThe catastrophe forced LebJau to move to another planet as the population knew he had collaborated with the ones who devastated Mokivj.\nSolha's brother wore a Serennian cloak like his siblings, and later wore clone trooper armor covered with cortosis to protect himself from Jedi Knight Anakin Skywalker.\nSolha's brother first appeared in the clone wars storyline of the 2018 novel Thrawn: Alliances by Timothy Zahn, the second installment in the Star Wars: Thrawn trilogy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Serenno",
  "/wiki/Human",
  "/wiki/Serennian",
  "/wiki/Gender",
  "/wiki/Solha%27s_family",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/Duke",
  "/wiki/Solha",
  "/wiki/Solha%27s_sister",
  "/wiki/Planet",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Mokivj",
  "/wiki/Cortosis_B2_super_battle_droid",
  "/wiki/Cortosis",
  "/wiki/Serennian_cloak",
  "/wiki/Clone_trooper_armor",
  "/wiki/Mission_to_Mokivj",
  "/wiki/Mokivj_droid_factory",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Unidentified_speeder_truck",
  "/wiki/Chiss",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Reproduction",
  "/wiki/Galactic_Republic",
  "/wiki/Senator",
  "/wiki/Count_of_Serenno",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Mining",
  "/wiki/Metal",
  "/wiki/Lightsaber",
  "/wiki/Blaster",
  "/wiki/Cortosis_mine",
  "/wiki/19_BBY",
  "/wiki/Clone_Wars",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Duja",
  "/wiki/Assassin",
  "/wiki/Standard_month",
  "/wiki/Standard_week",
  "/wiki/Marriage",
  "/wiki/Core_name",
  "/wiki/Factory",
  "/wiki/Jedi",
  "/wiki/B1-series_battle_droid",
  "/wiki/Squad",
  "/wiki/Captain",
  "/wiki/Boroklif",
  "/wiki/Starship",
  "/wiki/Larkrer",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Battle_droid",
  "/wiki/Clone_trooper",
  "/wiki/Armor",
  "/wiki/Standard_hour",
  "/wiki/Prison",
  "/wiki/Clothing",
  "/wiki/Nodlia",
  "/wiki/Cimy",
  "/wiki/Huga",
  "/wiki/Currency",
  "/wiki/Grappling_hook",
  "/wiki/Magma",
  "/wiki/Farm",
  "/wiki/Water",
  "/wiki/Volcano",
  "/wiki/Forest",
  "/wiki/Desert",
  "/wiki/2018",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars:_Thrawn_(novel_series)",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Mission_to_Batuu",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}