{
 "name": "Solha%27s_sister",
 "display_name": "Solha's sister",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Serenno"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Solha's family",
      "Confederacy of Independent Systems",
      "Confederacy military",
      "Mokivj droid factory",
      "Confederacy military",
      "Mokivj droid factory"
     ]
    }
   ]
  }
 ],
 "content": "A human female Serennian hailing from the Outer Rim Territories planet Serenno was the sister of Serennian Duke Solha. Following Solha's secession from the Galactic Republic, he joined Count Dooku's Confederacy of Independent Systems. Eventually, Solha's sister was dispatched alongside her brother, and Solha to the Outer Rim Territories planet Mokivj by the Confederacy's leader Count Dooku, a world where workers mined and proccessed cortosis, a metal that deflected blaster bolts and powered down lightsabers. Around 19 BBY, the family was still proccessing and manufacturing cortosis for the production of Cortosis B2 super battle droids for use in the Clone Wars, a conflict between the Confederacy and the Republic.\nFollowing Handmaiden Duja's investigation on the Separatist presence on Mokivj, Solha had her killed on the nearby planet Batuu in an attempt to keep the Mokivj droid factory secret. However, Senator Padmé Amidala of Naboo, who had been served by Duja ultimately followed her trace to Batuu and went missing from the Republic for weeks. Her disappearance prompted her husband Jedi Knight Anakin Skywalker to follow her, eventually finding Solha and his factory. Following the discovery of the factory, Skywalker and Chiss Senior Captain Thrawn who had teamed up with the Jedi infiltrated it and defeated Solha and his siblings, destroying the factory and bringing ruin to Mokivj's farmland and natural habitats.\nA human female native to the Outer Rim Territories planet Serenno was the sister of Serennian Duke Solha and another male individual. Following Solha's desertion from the Galactic Republic, she and her brothers joined the Confederacy of Independent Systems led by Serennian Count Dooku and served in the government's military.\nAround 19 BBY, Dooku dispatched Solha to the planet Mokivj, where he oversaw workers mining and proccessing cortosis, a metal that deflected blaster bolts and powered down lightsabers. At Mokivj, the duke designed and manufactured cortosis B2 super battle droids within the Mokivj droid factory. Eventually, Solha's siblings joined Solha at the factory. Following Naboo Handmaiden Duja's investigation on the Separatist presence on Mokivj, Solha had her killed on the nearby planet Batuu in an attempt to keep the Mokivj droid factory secret. However, Senator Padmé Amidala of Naboo, who had been served by Duja ultimately followed her trace to Batuu and went missing from the Republic for weeks. Her disappearance prompted her husband Jedi Knight Anakin Skywalker to follow her, eventually finding Solha and his factory. Following the discovery of the factory, Skywalker and Chiss Senior Captain Thrawn who had teamed up with the Jedi infiltrated it and saw Solha's siblings speaking with some workers next to a speeder truck. Shortly after, however, Solha had both infiltrators imprisoned as he believed a rogue Jedi was present at the factory following his discovery of the factory's doors being damaged by a lightsaber, the weapon of a Jedi.\nEventually, the infiltrators escaped and sieged the factory with Amidala, who teamed up with them in an attempt to defeat Solha. The duke, and his siblings, now alert of the chaos in his factory, donned cortosis clone trooper armor to defend themselves from the Jedi, and led droid forces in the defense of the factory. The Serennian siblings met at the production line for the cortosis battle droids, and removed their helmets. Sometime after, Solha's siblings left to defeat Skywalker's siege and the duke was left alone with a droid escort. However, Skywalker and Thrawn stopped the battle droid campaign to defeat them, and following Amidala's attack on Solha, destroyed the Serennian factory.\nSolha's sister wore a Serennian cloak and later wore clone trooper armor covered with cortosis to protect herself from Jedi Knight Anakin Skywalker.\nSolha's sister appeared in the 2018 novel Thrawn: Alliances by Timothy Zahn, the second installment in the Star Wars: Thrawn trilogy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Serenno",
  "/wiki/Human",
  "/wiki/Serennian",
  "/wiki/Gender",
  "/wiki/Solha%27s_family",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_military",
  "/wiki/Mokivj_droid_factory",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Duke",
  "/wiki/Solha",
  "/wiki/Galactic_Republic",
  "/wiki/Count_of_Serenno",
  "/wiki/Dooku",
  "/wiki/Solha%27s_brother",
  "/wiki/Mokivj",
  "/wiki/Head_of_State",
  "/wiki/Mining",
  "/wiki/Cortosis",
  "/wiki/Metal",
  "/wiki/Blaster",
  "/wiki/Lightsaber",
  "/wiki/19_BBY",
  "/wiki/Cortosis_B2_super_battle_droid",
  "/wiki/Clone_Wars",
  "/wiki/Handmaiden/Legends",
  "/wiki/Duja",
  "/wiki/Death",
  "/wiki/Batuu",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Standard_week",
  "/wiki/Marriage",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Factory",
  "/wiki/Chiss",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Jedi",
  "/wiki/Mission_to_Mokivj",
  "/wiki/Farm",
  "/wiki/Naboo_(people)",
  "/wiki/Unidentified_speeder_truck",
  "/wiki/Prison",
  "/wiki/Clone_trooper_armor",
  "/wiki/B1-series_battle_droid",
  "/wiki/Serennian_cloak",
  "/wiki/2018",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Timothy_Zahn",
  "/wiki/Star_Wars:_Thrawn_(novel_series)",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Mission_to_Batuu",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising"
 ]
}