{
 "name": "Solimon_Dambrizi",
 "display_name": "Solimon Dambrizi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Solimon Dambrizi was a male Human who was a police officer before discovering that he was force-sensitive and he left his position to study the ways of the Force.\nSolimon was born on Corulag. He followed in his father and grandfather's footsteps and joined the police force in the city of Adjesk. He excelled as an officer and detective, mostly due to his mysterious sixth sense that helped him avoid danger.\nHe discovered an old Jedi lorebook during a raid on a black market warehouse, and used it to learn the origin of his insight and abilities. He constructed a burgundy bladed lightsaber and left Corulag to study in the ways of the Force.\nSolimon was intelligent and insightful. He had a strong heroic streak which had led him into some trouble in the past. Since leaving to become a Jedi he frequented seedier establishments in hopes of avoiding contact with Imperial forces.\nOn his own Solimon was able to learn some basic Force powers including Accelerate Healing, Force sense and to Detoxify Poison. He had quite a lot of talent but did not progress as quickly as expected, possibly due to his learning being self-taught out of an ancient tome that was in poor condition.\nSolimon Dambrizi was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corulag/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Adjesk",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_lorebook",
  "/wiki/Lightsaber/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Accelerate_Healing",
  "/wiki/Force_sense/Legends",
  "/wiki/Detoxify_Poison",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997"
 ]
}