{
 "name": "Sollaine",
 "display_name": "Sollaine",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Electroshock prosthetic hands"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Sollaine was a Human male who served as the Central Commander of the Imperial Security Bureau during the Galactic Civil War.\nIn 0 ABY, Sollaine met with Darth Vader on a KDY shipyard above Kuat to discuss a secret mission. Vader tasked Sollaine with uncovering a Rebel Alliance spy placed with the Imperial hierarchy and deliver him alive to the Dark Lord.\nPlaced aboard Vader's Devastator, Sollaine quickly uncovered the traitorous Rivoche Tarkin and her location on Corulag. He demanded the captain of Devastator abort its patrol and sail to Corulag at full speed. When the officer refused, Sollaine murdered him and seized control of the ship. Sollaine was determined to capture Tarkin, deliver her to Emperor Palpatine and earn command of Executor.\nDevastator exited hyperspace at Corulag amidst a large civilian fleet in orbit. The ships belonged to dignitaries and important Imperial subjects, including Vader, attending the engagement party of Tarkin and Vastin Caglio. Determined to catch Tarkin, Sollaine boarded his blue and black TIE Interceptor and made his way to the surface with a shuttle behind him. Sollaine and his personal squad of Storm commandos made their way to the surface as Devastator turned and left the system.\nSollaine and his soldiers prepared to ambush Tarkin, but were caught off guard by the Alliance agents Cryle Cavv and Quillin Arkell. A thermite bomb thrown by Cavv gave the spy and her rescuers enough time to flee, and left only Sollaine alive. Determined not to lose his prize, Sollaine hired 40 mercenaries to help catch Tarkin, Cavv and Arkell as they fled to the roof to the Royal Galaxy Hotel. Again, Sollaine was bested by Cavv's good timing, and the trio escaped in G Cat. As planned, Devastator returned in what seemed to be the best time to capture the fleeing freighter, but the timely arrival of Vader and Executor allowed Tarkin to escape.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Central_Commander",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Kuat/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Devastator/Legends",
  "/wiki/Rivoche_Tarkin",
  "/wiki/Corulag/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Vastin_Caglio",
  "/wiki/Storm_commando",
  "/wiki/Cryle_Cavv",
  "/wiki/Quillin_Arkell",
  "/wiki/Thermite/Legends",
  "/wiki/Royal_Galaxy_Hotel",
  "/wiki/G_Cat",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Small_Favors",
  "/wiki/Star_Wars_Adventure_Journal_12",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Nevik"
 ]
}