{
 "name": "Somminick_Timmns",
 "display_name": "Somminick Timmns",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3641 BBY",
      "Belsavis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Nomen Karr"
     ]
    }
   ]
  }
 ],
 "content": "Somminick Timmns was a male Mirialan Jedi Master who was trained by Nomen Karr during the Great Galactic War and prevented the liberation of Darth Ekkage from the Republic Prison on Belsavis.\nShortly after the treaty and the Sacking of Coruscant, Timmns completed his Jedi training as a Knight and gained the title of Jedi Master. His training had created a deep bond between him and his master Nomen Karr. Karr later trained another student named Jaesa Willsaam, but they both fell to the dark side thanks to the actions of Darth Baras's Sith apprentice.\nIn 3653 BBY, Timmns captured an unidentified Sith who was an agent of Baras. This Sith began naming names and her husband, Jorem Yange, was forced to silence her at Baras' order and Yange held a grudge against Timmns ever since.\nDuring the Galactic War, Timmns had a meeting with Baras's sister Darth Ekkage before she was arrested and transferred to Belsavis. When Baras found out that his sister was imprisoned there, he decided to organize a rescue attempt. Timmns eventually learned about this and returned to Belsavis to prevent the Imperial troops from rescuing Ekkage from her prison. He fought against Lord Melicoste, who was hired by Baras to rescue Ekkage, but Melicoste was able to find the location of Ekkage and lock Timmns in the archive room. As the door was sealed and secured by a force field, Timmns could not break free.\nBaras' former apprentice, the Emperor's Wrath, also received an order to prevent Ekkage's liberation from Servant One and was retracing the steps of Melicoste, eventually finding Timmns in the locked room. Since both had the same goal, Timmns proposed to work together, even though he recognized the Sith Warrior who destroyed his master. Timmns didn't trust the Wrath, but they were forced to work together to leave the prison and prevent Ekkage's release. Timmns knew that they could only prevent a common liberation. To save time, they split paths: while Timmns was on his way to Ekkage's cell block in the Deep Prison, the Wrath stopped the Sith infiltrators who were in another cell block just before they were liberated. Shortly after the Wrath neutralized the threat, Timmns contacted him again. Timmns explained that had found a way into Ekkage's cell block, but it was broken down behind him. The Wrath had to come up an alternative way, and so the Wrath transmitted to Timmns the coordinates of their final meeting place. Timmns was able to call Ekkage's cell number and promised he would survive. He finally made it to the cell, just as anger turned against Ekkage who had been freed by Melicoste. Along with the Wrath, Timmns engaged the Sith, and defeated her in fair combat. However, Timmns was disappointed about killing an unarmed opponent. The Wrath couldn't be friends with the Jedi and engaged him in duel. Somminick tried his best to defeat the Wrath, but was killed.\nTimmns displayed great lightsaber fighting abilities being able to fight two Sith Lords, one being a former member of the powerful Dark Council, and survive. In combat, he used a blue-colored lightsaber.\nWhen freeing Timmns and Jaesa Willsaam is the active companion, Timmns will recognize her and asks if she has any regrets about teaming up with a Sith. If dark sided, Jaesa replies she has no regrets, especially when she gets to \"meet and kill obnoxious fools like .\" Timmns sarcastically replies that she and the Wrath deserve each other. If light-sided, after Timmns has recognized her \"serene and tempered presence,\" Jaesa will say that she doesn't regret joining the Warrior most of the time; she believes that everyone has a \"great capacity to change.\"\nAfter defeating Darth Ekkage, the player has the option to kill her for dark alignment points or put her back into her cell for light alignment points. As a compromise, Timmns seals the controls so she can never be let out again. Once that's done, they can either fight and kill Timmns for dark alignment points or let him walk free for light alignment points. In the case of the latter, they can reassert their status as his enemy, or assure him they have a common goal and that when the War is over, they can be friends. He replies that he looks forward to the opportunity.\nIf Timmns is spared, he sends a mail to the Wrath where he explains how much their cooperation meant, and how he told everyone in the Jedi Academy of how a Sith and Jedi united for perhaps the first time in millennia.\nIf Timmns is killed, the player will receive an email from Jorem Yange, who, though disappointed at having his vengeance stolen, relishes his demise.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3641_BBY",
  "/wiki/Belsavis/Legends",
  "/wiki/Mirialan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Nomen_Karr",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Darth_Ekkage",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaesa_Willsaam",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Empire%27s_Wrath",
  "/wiki/3653_BBY",
  "/wiki/Jorem_Yange%27s_wife",
  "/wiki/Jorem_Yange",
  "/wiki/Galactic_War",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Melicoste",
  "/wiki/Canon",
  "/wiki/Servant_One",
  "/wiki/Ancient_Prison_Caverns",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Dark_Council",
  "/wiki/Lightsaber/Legends"
 ]
}