{
 "name": "Sonou",
 "display_name": "Sonou",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sonou's Apparel"
     ]
    }
   ]
  }
 ],
 "content": "Sonou was a female Twi'lek who made a good living running the clothing shop named Sonou's Apparel during the Galactic Civil War between the Galactic Empire and Alliance to Restore the Republic. The store was located on the space station known as the Wheel, a location which she was highly familiar with concerning both its layout and those who passed through it. The store sold a diverse range of starship-ready clothing, all at prices below the standard market value of such garments, although also lower in terms of quality, something Sonou freely admitted if asked. Whilst in the shop she relentlessly ordered around the other staff, whom were Twi'leks or droids, but was fairly polite when interacting with customers.\nSonou first appeared in 2013 in Beyond the Rim, an adventure module written by Sterling Hershey for the Fantasy Flight Games roleplaying game, Star Wars: Edge of the Empire. She was included as someone that players could potentially interact with whilst searching for information on the Wheel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sonou%27s_Apparel",
  "/wiki/Clothing/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/The_Wheel/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Droid/Legends",
  "/wiki/2013",
  "/wiki/Beyond_the_Rim",
  "/wiki/Sterling_Hershey",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}