{
 "name": "Soon_Bayts",
 "display_name": "Soon Bayts",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19.43 BBY",
      "Boz Pity"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black and gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Soon Bayts was a male Human Jedi Master who served the Jedi Order the last decades of the Republic Classic era. When the Yinchorri Uprising came to bear, Bayts was charged with supervising communications between the Jedi strike teams and the Jedi Temple on Coruscant. When the temple was attacked by Yinchorri raiders during the Uprising, Bayts fought alongside his fellow Jedi to defend his home.\nBy the time of the Clone Wars, Bayts was a Master, and he joined Mace Windu in accompanying Senator Bail Organa of Alderaan to the Outer Rim Territories on the Intervention. Following a rugged crash landing on Boz Pity, Master Bayts was among the advance group scouting for Confederate installations on the planet. Upon reaching the base, they were met with heavy droid resistance, as well as the presence of General Grievous. Before Bayts even had a chance to attack Grievous, the droid general swiftly killed the Jedi Master by crushing his skull.\nDuring the Yinchorri Uprising of 33 BBY, the Human male Jedi Knight Soon Bayts was tasked with keeping track of the Jedi strike teams sent to the Yinchorri system. When the Jedi Temple on Coruscant was attacked, Bayts fought alongside the other Jedi to defend it from the Yinchorri threat. Following the battle, he received word from Masters Eeth Koth and Adi Gallia, determining that Yinchorri command was not located on Yitheeth as had been suspected. He also learned that Mace Windu's strike team had not engaged the opposition, and was lying in wait on Yinchorr. Delivering this news to Yoda, he encountered the Grand Master interrogating a Yinchorri survivor of the battle.\nBayts was curious as to how Yoda had made the prisoner so fearful, but the Grand Master explained that the warrior had brought the fear with him when he attacked the temple, and that he had simply shown him the reality of it. While Bayts delivered his message, the warrior made to attack Yoda, inciting the younger Jedi to leap to the Grand Master's aid. Yoda, however, simply levitated Bayts as he deflected the warrior's attack, and shoved the warrior into the wall, incapacitating him. Yoda then reprimanded Bayts, telling him that emotion had clouded his judgment.\nShortly thereafter, Bayts received further reports from the Yinchorri system: All three strike teams had rendezvoused on Yinchorr, and a Devaronian prisoner had been taken. Upon delivering the news to Yoda, Bayts speculated that the Devaronians might have been behind the mysterious uprising. Later, Master Windu called with urgent news about the Yinchorri command center's location, and Bayts once again had to rush into Yoda's presence, alerting him to the situation. The uprising was eventually quelled thanks to the efforts of the strike teams, though three Jedi perished in the conflict.\nBy the time of the Clone Wars, Soon Bayts had ascended to the rank of Jedi Master. For unknown reasons, he changed the color of his lightsaber blade from orange to blue. Along with Mace Windu and several of the Jedi, among them veterans of the Yinchorri Uprising, he accompanied Senator Bail Organa of Alderaan on the Venator-class Star Destroyer Intervention, bound for the Outer Rim Territories. Alderaan had many ties to the Outer Rim worlds, and when Organa learned that the Confederacy of Independent Systems was retreating there, he felt the need to witness the battles firsthand.\nBased on intelligence from Master Obi-Wan Kenobi, the Intervention journeyed to Boz Pity, where a large Confederate blockade was known to be amassing. Since they were but one ship against an entire flotilla, the Jedi enlisted Anakin Skywalker, to help pilot the capital ship through the blockade, resulting in a crash landing on the planet's surface. Master Bayts ventured out with Senator Organa and a detachment of clone troopers.\nThe group met heavy resistance at the Confederate base, fighting off hordes of battle droids. Organa called for a charge, and Bayts obliged. As Bayts cut his way through to the opening of the base, he encountered the Kaleesh cyborg General Grievous. Before Bayts could even attack the general, Grievous grasped his head with one of his mechanical claws, and crushed it, killing the Jedi Master instantly. The General then took Bayts' lightsaber, and used it to attack Republic troops. The Battle of Boz Pity was eventually won by the Republic, however.\nSoon Bayts was a prompt individual, and always made sure that his superiors were well informed with the intelligence he gleaned as supervisor of communications during the Yinchorri uprising. He was able to survive the Yinchorri attack, and readily went to Master Yoda's aid, even when he did not need it. He acted on emotion, rather than instinct; a trait that Yoda openly criticized. Though Bayts' combat skills served him well during the Yinchorri conflict, they did not match those of General Grievous, who killed the Jedi Master without difficulty; taking his blue lightsaber as a trophy.\nSoon Bayts was created by Randy Stradley, and first appeared in the comic mini-series Jedi Council: Acts of War. In it, the character appears in a minor supporting role. Bayts' name was intended as a pun on the term \"masturbates\"; a pun later illustrated by Haden Blackman in Star Wars: Obsession. Stradley had initially planned to use the name as a practical joke on Comic Editor at Lucas Licensing Sue Rostoni, who would often put the word \"Master\" in front of any Jedi's name. Stradley created Bayts as an unimportant tertiary character simply to play a joke on Rostoni, but the character made it through to publication.\nFollowing Blackman's use of the character, Comic Editor at Lucas Licensing Sue Rostoni would publicly lament that she was not in charge of editing at the time of Bayts' creation. In Star Wars: Obsession, Bayts is once again used as a minor supporting character. Perhaps due to the nature of Soon Bayts' name, references to him outside Jedi Council: Acts of War and Star Wars: Obsession have been virtually non-existent, save for the mention of him in Abel G. Peña's Star Wars Insider article, Unknown Soldier: The Story of General Grievous, and an entry in The Complete Star Wars Encyclopedia.\nBayts name was spelled in two different ways in the Expanded Universe, both \"Bayts\" and \"Baytes.\" In Jedi Council: Acts of War, his name is only mentioned once, and it is spelled \"Bayts.\" In Star Wars: Obsession, it is also spelled in this manner, save for one panel. But on the same page, the original spelling is used as well. Abel G. Peña, the most recent author to reference the character, uses the spelling \"Bayts\", but alludes to a pronunciation closer to \"bey-tiz\", to avoid the former implications.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/20_BBY/Legends",
  "/wiki/Great_ReSynchronization",
  "/wiki/Boz_Pity/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Yinchorri_Uprising",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Yinchorri",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Intervention",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Droid/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Yinchorri_system",
  "/wiki/Raid_on_the_Jedi_Temple_(Yinchorri_Uprising)",
  "/wiki/Eeth_Koth/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Yitheeth",
  "/wiki/Yinchorr/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Devaronian/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Battle_of_Boz_Pity_(Clone_Wars)",
  "/wiki/Battle_droid/Legends",
  "/wiki/Kaleesh/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Sue_Rostoni",
  "/wiki/Randy_Stradley",
  "/wiki/Jedi_Council:_Acts_of_War",
  "/wiki/W._Haden_Blackman",
  "/wiki/Star_Wars:_Obsession",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_Council:_Acts_of_War_2",
  "/wiki/Jedi_Council:_Acts_of_War_3",
  "/wiki/Jedi_Council:_Acts_of_War_4",
  "/wiki/Obsession_4",
  "/wiki/Obsession_5",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Jedi_Council_Forums",
  "/wiki/April_13",
  "/wiki/2013"
 ]
}