{
 "name": "Soopan",
 "display_name": "Soopan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Duro"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Soopan was a male Duros from the city New Tayana on the planet Duro who was at one time the best friend of Cad Bane. After Bane left Duro and established himself as a successful bounty hunter, Soopan capitalized on his former friend's reputation by masquerading as Bane and using the hunter's identity to become the leader of a criminal operation within New Tayana's Descent Ghetto.\nUnder his guise as Bane, Soopan became wanted by the local sheriff and, during the Clone Wars, the real Bane journeyed to Duro to track down his former associate. Bane located Soopan within the Descent Ghetto, and Soopan engaged in a firefight with him and turned large numbers of his minions on Bane. However, Bane defeated Soopan's forces and confronted his old friend on the last floor of the Descent Shopping Mall, telling him he had to earn the right to steal something as valuable as his reputation.\nBane then gave Soopan one of his LL-30 blaster pistols and, in memory of better times, granted him one last shot at power, giving him the choice to decide how the story would end for him. Although it is unclear whether Soopan committed suicide, was killed by the bounty hunter, or was handed over to the local authorities, Bane later declared that when the dust settled, there was only one Bane standing, and that he was in no mood to celebrate.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duro/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cad_Bane/Legends",
  "/wiki/City/Legends",
  "/wiki/New_Tayana",
  "/wiki/Planet/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Descent_Ghetto",
  "/wiki/Unidentified_New_Tayana_sheriff",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Raid_on_the_Descent_Shopping_Mall",
  "/wiki/Descent_Shopping_Mall",
  "/wiki/LL-30_blaster_pistol/Legends",
  "/wiki/Bane_vs_...Bane%3F",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.46"
 ]
}