{
 "name": "Sophia_Farash",
 "display_name": "Sophia Farash",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Before 3626 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicRepublic Diplomatic Corps",
      "Republic Diplomatic Corps",
      "Sith EmpireChildren of the Emperor",
      "Children of the Emperor"
     ]
    }
   ]
  }
 ],
 "content": "Sophia Farash was a female Human Child of the Emperor who acted as an Ambassador of the Republic on Voss during the Cold War.\nA Force-sensitive female Human, Sophia Farash was brought to the Sith Emperor during her childhood, who impregnated her with his dark essence turning Farash into one of his Children of the Emperor.\nDuring the war between the Republic and the Sith Empire, Sophia was an Ambassador of the Republic on Voss, where she became a noble friend to Gaden-Ko, a Mystic in training. She eventually helped the Barsen'thor when the young Jedi Consular arrived on Voss in search of an alliance against the Empire, suggesting that the Barsen'thor help her friend Gaden-Ko in his training to gain the trust of the Voss. However, when Gaden-Ko came back with the Barsen'thor to ally with the Republic, Sophia met them with two Sith Acolytes by her side and revealed herself to be a child of the Sith Emperor.\nGaden-Ko was clueless as to why she betrayed him and the Jedi, but Sophia told him not to worry, and that his true destiny was just the beginning. She and the acolytes engaged the Barsen'thor, but the Jedi took the upper hand and defeated them in combat. Sophia was wounded and was surprised how the strong the Jedi was in the light side, since as a child she believed that the dark side was the true power. Sophia revealed to Barsen'thor that she was hoping the pilgrimage would test Gaden-Ko's power, and hopefully result in the Barsen'thor's death. She feared that the First Son would kill her for her failure, but the Barsen'thor believed that they could save her from the First Son's wrath and tried to convince her to let go of the dark side.\nSophia then explained to the Jedi about how the First Son served the Emperor. At this moment, Gaden-Ko said that he was upset that his own friend betrayed him. Sophia apologized for her actions, saying she wanted to save him and allow the people of Voss to serve the Emperor and Sith Empire. She was taken into custody by the Voss officers, who said she would be forced to take the Step of Harmony, a Voss sentence where a criminal would fall off the top of the mountain of Voss-Ka. Despite the Barsen'thor's argument that the sentence was barbaric, Sophia was taken away.\nHowever, before her sentence could be carried out, Sophia overpowered the Voss commandos escorting her and escaped. Later, during the final confrontation with Tenebrae, Sophia was among the spirits witnessing his final death.\nDuring the flashpoint \"The Nathema Conspiracy\", if the Outlander is a Jedi Consular who remained on the Light Side, Sophia Farash will seek revenge on them by joining the Order of Zildrog led by Vinn Atrius, only to be sacrificed as fuel to awaken Zildrog by GEMINI 16 on Nathema. If the Jedi Consular fell to the dark side of the Force, they will encounter Gaden-Ko instead, while the other classes face antagonists from their own class stories.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3626_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Diplomatic_Corps/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Ambassador/Legends",
  "/wiki/Voss",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Tenebrae",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Gaden-Ko",
  "/wiki/Voss_Mystics",
  "/wiki/The_Barsen%27thor",
  "/wiki/Jedi_Consular",
  "/wiki/Voss_(species)",
  "/wiki/Sith_Acolyte",
  "/wiki/Jedi/Legends",
  "/wiki/Syo_Bakarn",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Step_of_Harmony",
  "/wiki/Voss-Ka",
  "/wiki/Voss_commandos",
  "/wiki/Mission_to_Kira_Carsen%27s_ship",
  "/wiki/Death/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Order_of_Zildrog",
  "/wiki/Vinn_Atrius",
  "/wiki/Zildrog",
  "/wiki/GEMINI_16",
  "/wiki/Nathema",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Standard_week/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Force_spirit"
 ]
}