{
 "name": "Soran_Keize",
 "display_name": "Soran Keize",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "204th Imperial Fighter Wing",
      "Imperial Navy's officer corps",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Soran Keize was a human male who held the rank of colonel, serving as an ace pilot in the Galactic Empire's 204th Imperial Fighter Wing, informally known as \"Shadow Wing.\" He acted as a mentor for many of his fellow pilots, and led the fighter wing with respect for the responsibility he had. Following the Imperial defeat against the Rebel Alliance at the Battle of Endor and the subsequent Operation: Cinder campaign, Keize went into hiding under the alias Devon Lhent, living on worlds including Mrinzebon and Vernid. After being tracked down by officers of New Republic Intelligence, whom he was forced to kill, Keize felt that there was no place in the galaxy for former Imperials such as himself. Keize vowed to return to the Empire, leading the 204th once again.\nSoran Keize did not especially believe in the righteousness of the Galactic Empire, but he was fiercely loyal to the personnel of his fighter wing. After several months living as Devon Lhent, Keize returned to Shadow Wing as \"advisor\" before being promoted to colonel as the successor to Shakara Nuress. He led the 204th Fighter Wing through a campaign in the Cerberon system, where his people sought revenge against New Republic General Hera Syndulla for the attack on Pandem Nai which had killed Nuress. He then led a second round of Operation: Cinder, conducting genocides on worlds ruled by Imperial splinter factions at the behest of Grand Moff Randd and the Shadow Council. In the months leading up to the climactic battle of Jakku, Keize fixated on Galactic Emperor Sheev Palpatine's Messengers and how they had chosen Imperial units to conduct the atrocities of Operation: Cinder. After sending a force to Netalych to analyze a Messenger's programming, Keize and his aide Yrica Quell determined that the Empire had kept a databank of all the Empire's employees' crimes, from petty to unforgivable.\nWhether the Empire were to win or lose to the New Republic, Keize saw that databank as an existential threat to the billions of soldiers of the Empire. If the New Republic won, he believed every Imperial would live in fear of prosecution for decades, even if they sought to escape and seek a quiet and peaceful life as he had as Devon. If the Empire won, Keize believed it would be used to coerce loyalty and continued service among soldiers who wished to retire. Seeing both alternatives as unacceptable, Keize attacked the databank, located in the upscale Verity District of the Galactic capital planet of Coruscant. While his attack was a failure and he died in his attempt to attack, Keize posthumously broadcast a holographic message in which he claimed responsibility for all of Shadow Wing's war crimes dating back for years; including many for which he had no responsibility. In doing so, he sought to sacrifice himself to be remembered as a war criminal so the other pilots and crew of the 204th could lead normal lives in the aftermath of the Galactic Civil War.\nDuring the time of the Galactic Empire, Soran Keize served its navy as a TIE fighter pilot. Keize transferred to the 204th Imperial Fighter Wing, also known as Shadow Wing, which had been assigned to anti-piracy operations in the Mid Rim. An ace pilot, he eventually gained the rank of major, becoming a squadron commander and mentoring the new pilots and officers. Both Major Keize and the fighter wing's commander, Colonel Shakara Nuress, gained the 204th some esteem, and the unit was assigned to the Star Destroyer Pursuer, focusing on operations against the Rebel Alliance following the destruction of the Death Star at the end of 0 BBY and the resulting Galactic Civil War.\nOne of the 204th's missions took them to the planet Mek'tradi, the location of a rebel cell. The pilots of the 204th were assigned to bombard the planet, preventing rebel ships from escaping. One pilot, Yrica Quell, was horrified at her part in the bombardment, and Keize approached her after their debriefing. Quell attempted to hide her reluctance to attack the rebels, aware of the Empire's inefficiencies. While Keize was similarly aware, he convinced Quell to fight for her fellow pilots and crew.\nSix months before the Battle of Endor, the 204th's Squadron Five took severe losses during an incident in the Lyjdaa system. Some time afterwards, Keize approached Teso Broosh, commander in one of Shadow Wing's other squadrons. Keize informed Broosh that he was to be moved to Squadron Five, and that he had recommended Broosh be appointed the squadron's new leader. When Broosh declined the offer, Keize wished to know why, learning that Broosh did not feel that he was fit to lead. However, Keize reacted positively to Broosh's hesitation, glad to hear that he did not wish to acquire power for his own gain. Keize insisted that he had judged Broosh as suitable for the posting, and Broosh accepted the offer, promising to protect the squadron's pilots.\nAfter the death of Emperor Palpatine at the hands of the Rebel Alliance during the Battle of Endor in 4 ABY, many members of the 204th Imperial Fighter Wing were left in shock and disarray. After two weeks, the Empire initiated Operation: Cinder, a campaign that involved the devastation of many worlds that both supported and opposed the regime. The 204th was assigned to assist with an attack on the planet Nacronis, and Keize briefed the pilots on their task, providing information on their target.\nThe squadrons of the 204th, including one commanded by Keize, descended on Nacronis. The pilots were ordered to protect the TIE bombers that were increasing the severity of Nacronis' siltstorms with vortex detonators. After the planet had been devastated, the pilots returned, but Yrica Quell, shocked by what she had done, landed on the ground. Keize followed her, but rather than punish her, he told Quell that she should leave Imperial service before it killed her, convincing her to defect to the fledgling New Republic. Keize left Quell on Nacronis, destroying her TIE fighter to make her defection story plausible. Though Keize intended to similarly leave the Empire, he felt that he needed to stay and convince others to do the same. However, many of his comrades continued to serve the Empire, and Keize was forced to leave them behind.\nAfter leaving the Empire, Keize took the alias \"Devon Lhent,\" and attempted to find somewhere to settle down and make a new life. He traveled to Tinker-Town on the colony world Mrinzebon, visiting Gannory's Cantina. Attempting to sell salvage, Keize spoke to the Cerean proprietor, Gannory, who directed him to the junk dealer Narlowe. However, some time after leaving the cantina, Keize was assaulted by two criminals, who had been informed of his presence by Gannory, and his belongings were stolen. Keize returned to Gannory, who apologized, explaining that the criminal gang that controlled the town forced him to provide information. He offered to train the town's residents to fight back against the criminals, and Gannory found a number of students to recruit.\nWorking out of the garden behind Gannory's Cantina, Keize taught a number of lessons to the residents of Tinker-Town. He lived on Mrinzebon for several weeks, in which his number of students increased greatly. During one night, Keize's home was entered by the criminals, who took him to the gang's leader, Vryant, a former member of the Imperial Army garrison on Mrinzebon. Vryant gave Keize an offer: either leave Mrinzebon, or stay and work for him, returning order to the world. Keize chose to do neither, and instead killed Vryant, setting the communications tower where his gang operated alight. When Keize returned to Gannory, the Cerean informed him of a freighter that would take him away from Mrinzebon. Keize left the world, and searched elsewhere to find his place in the galaxy.\nAfter leaving Mrinzebon, Keize visited a number of other worlds. While on Mon Gazza, he became caught up in a war between rival spice traders, and left once it has escalated. Keize was forced to leave the Ring of Kafrene after antagonizing a weapons smuggler, and was present when the Bazaar of Esoteric Obscenities burned down. He eventually arrived on the Whitedrift Exchange, a mobile space station serving as a trading post and residency for a number of passengers. While he had not intended to stay on the station for long, Keize found work in the crew of \"the Harch,\" who ran a shop for supplies and salvage.\nWhile on the Whitedrift Exchange, Keize met Agias Rikton, a fellow member of the Harch's crew who had also formerly served the Empire. After noticing that Rikton often indirectly stole items from the Harch's store, Keize began to inquire about him, learning that he intended to construct a bomb with the stolen components, and use it to attack Traitor's Remorse, a shantytown where defectors from the Empire were held by the New Republic. Keize spoke with Rikton, and eventually convinced him to change his mind, instead leaving for Corulag. After Rikton's departure, Keize reported to the Harch that he also intended to leave the Whitedrift Exchange. Before Keize left, the Harch suggested that he visit the Outer Rim planet Vernid, where an associate of the Harch would welcome him.\nKeize took the Harch's advice and traveled to Vernid, where he joined a dig-rig crew. He worked with the crew for several weeks, becoming close to his fellow workers. After one work shift, while visiting a cantina with his crew, Keize saw the report of a New Republic attack on Pandem Nai, a planet where the remnants of the 204th Imperial Fighter Wing were held out. Keize was angered by the destruction that the New Republic had caused in the attack, which antagonized his crew, especially the hauler Klevin, who felt that the Empire deserved it. Keize chose to leave the cantina before the conflict escalated, but later checked reports of the attack on Pandem Nai, learning that Colonel Nuress had died and the 204th had fled.\nSeveral days after the incident, Keize was intercepted on his way home by two New Republic Intelligence agents, who had learned who he truly was. Keize attempted to convince the agents to let him live his new life in peace, but the agents drew their weapons, forcing Keize to fight back. Keize killed the two agents, assisted by Klevin, who promised to back him with any trouble he received. However, Keize, tired of his past catching up to him, chose to abandon his attempted new life, and vowed to return to the Empire and serve the 204th once more.\nSoran Keize was aware of the problems and corruption within the Empire, but felt that a soldier could not choose the battles that they fought. Rather than fighting for the Emperor, Keize fought for the regular crew of the Empire. Keize also knew that many in the Empire wished to only gain power for their benefit, using leadership as a path to higher positions, and believed that Imperial officers who did so put others at risk. Because of this, Keize was glad when others were scared of leadership, knowing that they understood the responsibility. As a commanding officer of the 204th Imperial Fighter Wing, Keize was determined to protect his peers. Yrica Quell remembered Keize as having a way of dealing with fellow pilots, relating to their doubts and failures.\nThough he followed the Empire's orders when carrying out Operation: Cinder, Keize knew that it was a pointless atrocity, and that the Empire had already lost the war. Keize felt that Imperials like Quell who assisted with Operation: Cinder would continue to fight with no purpose until their deaths, and wished to convince them to leave the Empire. He ordered Quell to defect and join the New Republic, but refused to join them himself.\nWhile in hiding after leaving the Empire, Keize did not impart any details of his past, distancing himself from the students he trained on Mrinzebon, though he did confess about his secrets to Rikton, in an attempt to convince him not to be ashamed in defecting from the Empire. Whenever he found trouble in his attempts to make a new life, Keize would silently move on.\nDespite allowing Quell to defect, Keize's life after his own desertion turned him away from the New Republic, witnessing how the new government treated the remaining Imperial personnel. After having his old life catch up to him whenever encountering someone on either side of the Galactic Civil War, Keize felt that there was no place in the galaxy for former Imperials, and considered himself to be foolish in thinking that he could escape, deciding to return to his former comrades.\nA human male, Keize had dark brown hair and brown eyes. He had light skin, and an angular face with thin lips.\nSoran Keize was an ace pilot, gaining prestige in the 204th Imperial Fighter Wing for his skills. When not flying, Keize was also an efficient mentor to many of the fighter wing's personnel. After being confronted by New Republic spies on Vernid, Keize managed to overwhelm and defeat one of the spies, using a blaster to kill the other.\nKeize flew a TIE fighter in his service to the 204th Imperial Fighter Wing, despite the wing's preference for the TIE/IN interceptor. When not in his fighter, Keize wore the uniform of the Imperial Military. While on Mrinzebon after defecting from the Empire, Keize carried a hold-out blaster pistol.\nSoran Keize first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed. The character was revealed in an excerpt from the novel included in the comic TIE Fighter 1, published on April 17, 2019. Keize was first pictured in TIE Fighter 3, a comic written by Jody Houser and published on June 19, 2019, in which he appeared in a flashback sequence illustrated by Geraldo Borges.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shadow_Fall",
  "/wiki/Victory%27s_Price",
  "/wiki/5_ABY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Military_rank",
  "/wiki/Colonel",
  "/wiki/Ace",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Pilot",
  "/wiki/Fighter_wing",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Endor",
  "/wiki/Operation:_Cinder",
  "/wiki/Mrinzebon",
  "/wiki/Vernid",
  "/wiki/Officer",
  "/wiki/New_Republic_Intelligence",
  "/wiki/Death",
  "/wiki/The_galaxy",
  "/wiki/Shakara_Nuress",
  "/wiki/Campaign_in_the_Cerberon_system",
  "/wiki/New_Republic",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Attack_on_Pandem_Nai",
  "/wiki/Imperial_remnants",
  "/wiki/Grand_Moff",
  "/wiki/Randd",
  "/wiki/Shadow_Council",
  "/wiki/Standard_month",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Sentinel_(Contingency)",
  "/wiki/Mission_to_Netalych",
  "/wiki/Netalych",
  "/wiki/Yrica_Quell",
  "/wiki/Databank",
  "/wiki/Attack_on_Coruscant%27s_Verity_District",
  "/wiki/Verity_District",
  "/wiki/Capital",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_Navy",
  "/wiki/Pirate",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Major",
  "/wiki/Squadron_commander",
  "/wiki/Commanding_officer",
  "/wiki/Star_Destroyer",
  "/wiki/Pursuer",
  "/wiki/Battle_of_Yavin",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/0_BBY",
  "/wiki/Galactic_Civil_War",
  "/wiki/Planet",
  "/wiki/Mek%27tradi",
  "/wiki/Bombardment_of_Mek%27tradi",
  "/wiki/Starship",
  "/wiki/Squadron_Five_(Shadow_Wing)",
  "/wiki/Lyjdaa_system",
  "/wiki/Teso_Broosh",
  "/wiki/Endor",
  "/wiki/4_ABY",
  "/wiki/Standard_week",
  "/wiki/Destruction_of_Nacronis",
  "/wiki/Nacronis",
  "/wiki/Squadron",
  "/wiki/Soran_Keize%27s_squadron",
  "/wiki/TIE/sa_bomber",
  "/wiki/Siltstorm",
  "/wiki/Vortex_detonator",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Tinker-Town",
  "/wiki/Gannory%27s_Cantina",
  "/wiki/Cerean",
  "/wiki/Gannory",
  "/wiki/Junk_dealer",
  "/wiki/Narlowe",
  "/wiki/Cantina",
  "/wiki/Vryant",
  "/wiki/Imperial_Army",
  "/wiki/Mrinzebon_garrison",
  "/wiki/Unidentified_communications_tower",
  "/wiki/Freighter",
  "/wiki/Mon_Gazza",
  "/wiki/Spice_trader",
  "/wiki/Ring_of_Kafrene",
  "/wiki/Smuggler",
  "/wiki/Bazaar_of_Esoteric_Obscenities",
  "/wiki/Whitedrift_Exchange",
  "/wiki/Space_station",
  "/wiki/The_Harch",
  "/wiki/Agias_Rikton",
  "/wiki/Harch",
  "/wiki/Bomb",
  "/wiki/Traitor%27s_Remorse",
  "/wiki/Corulag",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Dig-rig",
  "/wiki/Pandem_Nai",
  "/wiki/Klevin",
  "/wiki/Standard_day",
  "/wiki/Agent",
  "/wiki/Soldier",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Blaster",
  "/wiki/TIE_line",
  "/wiki/Starfighter",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Imperial_Military",
  "/wiki/Hold-out_blaster",
  "/wiki/Blaster_pistol",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Star_Wars_comic_books",
  "/wiki/TIE_Fighter_1",
  "/wiki/April_17",
  "/wiki/TIE_Fighter_3",
  "/wiki/Jody_Houser",
  "/wiki/June_19",
  "/wiki/Geraldo_Borges",
  "/wiki/Category:Audio_files_of_Soran_Keize",
  "/wiki/Category:Images_of_Soran_Keize",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/TIE_Fighter_5",
  "/wiki/Marvel_Comics"
 ]
}