{
 "name": "Sora_Mobari",
 "display_name": "Sora Mobari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "New Holstice"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Evan-Ott"
     ]
    }
   ]
  }
 ],
 "content": "Sora Mobari was a Human female Jedi Master who served the Jedi Order during the Clone Wars. In 21 BBY, while on a mission to stop Ithorian terrorists, Mobari's Padawan, Evan-Ott, betrayed his Master and tried to kill her in an explosion. The blast claimed the Padawan's life and gravely injured Mobari, who later died in a hospital on the planet New Holstice.\nA Force-sensitive Human female, Sora Mobari was educated in the ways of the Force by the Jedi Order, eventually attaining the rank of Jedi Master and selecting Evan-Ott as her Padawan learner. In 21 BBY, during the Clone Wars, Mobari and her student were sent on a mission to the planet Ithor to lead an attack against Ithorian terrorists. However, Evan-Ott betrayed Mobari and tried to murder her in an explosion. The blast killed Evan-Ott but also grievously injured Mobari, taking her eyesight.\nThe Jedi Master was brought to a Republic medcenter on the planet New Holstice, where one of the Jedi stationed there, A'Sharad Hett, tried every imaginable treatment to save Mobari's life. However, nothing worked, and Hett was sure that she would not recover. He asked the Jedi Padawan Anakin Skywalker to ease Mobari's pain during her ordeal, but Skywalker, who had recently lost a great number of fellow Jedi on the planet Jabiim, could not accept another death. The Padawan tried to stabilize Mobari's heart by using the Force but only succeeded in making her convulse violently. Mobari died soon afterward, and Hett released a memory moth that would eternally whisper her name at the Jedi memorial on New Holstice.\nMobari had brown eyes and fair skin.\nSora Mobari first appeared in the Republic 58 comic, written by W. Haden Blackman and released on December 17, 2003 by Dark Horse Comics. In 2008, she received an entry in The Complete Star Wars Encyclopedia, which also gave her Padawan a name and revealed further info about her mission.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Jedi/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Moburi",
  "/wiki/21_BBY/Legends",
  "/wiki/New_Holstice/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Evan-Ott",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Terrorist/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Death/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Ithor/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Jabiim",
  "/wiki/Padawan_Pack",
  "/wiki/Jabiim/Legends",
  "/wiki/Heart/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Memory_moth/Legends",
  "/wiki/Jedi_Monument_(New_Holstice)",
  "/wiki/Republic_58",
  "/wiki/Star_Wars_comic_books",
  "/wiki/W._Haden_Blackman",
  "/wiki/December_17",
  "/wiki/2003",
  "/wiki/Dark_Horse_Comics",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology"
 ]
}