{
 "name": "Sorc_Tormo",
 "display_name": "Sorc Tormo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Umbaran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Torso"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Haxion Brood"
     ]
    }
   ]
  }
 ],
 "content": "Sorc Tormo was an Umbaran male crime lord who led the Haxion Brood criminal syndicate during the Imperial Era. In 14 BBY, Tormo had the former Jedi Padawan Cal Kestis captured by a bounty hunter and forced to fight in his arena, due to his companion Greez Dritus' large gambling debt to the Brood.\nSorc Tormo was an Umbaran male crime boss who was the leader of the Haxion Brood, having asserted himself as a regional boss after the Galactic Empire imprisoned his predecessor.\nIn 14 BBY, Tormo had the former Jedi Padawan Cal Kestis, kidnapped and jailed by a bounty hunter of the Haxion Brood on Ordo Eris, the Brood's space station stronghold, as a consequence of the pilot Greez Dritus' large gambling debt to the syndicate. Kestis escaped imprisonment, as the crime lord anticipated, and was lead to the Haxion Fight Pit. Tormo proceeded to give Kestis his lightsaber and had him battle various creatures in the arena, before dispatching the bounty hunter who had kidnapped him.\nAfter Kestis defeated the bounty hunter, Dritus and Cere Junda located the Jedi, crashing into the arena and rescuing him aboard the Stinger Mantis. As Kestis escaped Ordo Eris, Tormo threatened to have the Haxion Brood chase him across the galaxy. Bounty hunters of the Brood, sent by the crime boss, continued to apprehend Kestis through the remainder of his journey.\nSorc Tormo was greedy and ruthless, expressing a large focus on money and caring little about much else. The crime boss demonstrated a sense of humor, while being a commentator for battles in the Haxion Fight Pit. Tormo spent excessively on his schemes, however he ultimately managed to make a substantial amount of profit. He enjoyed watching combat in his fight club on Ordo Eris where he took special pride in a collection of vicious creatures, he had gathered from all across the the galaxy.\nSorc Tormo had cybernetics attached to his torso. He wore a helmet along with a jacket and two rings on his left hand.\nSorc Tormo was introduced in the 2019 video game Star Wars Jedi: Fallen Order, developed by Respawn Entertainment and published by Electronic Arts where he was voiced by Luke Cook. Concept art for Sorc Tormo was done by artist Theo Stylianides.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Umbaran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Haxion_Brood",
  "/wiki/Crime_lord",
  "/wiki/Imperial_Era",
  "/wiki/14_BBY",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Cal_Kestis",
  "/wiki/Bounty_hunter",
  "/wiki/Haxion_Fight_Pit",
  "/wiki/Greez_Dritus",
  "/wiki/Gambling",
  "/wiki/Galactic_Empire",
  "/wiki/Sorc_Tormo%27s_predecessor",
  "/wiki/Ordo_Eris",
  "/wiki/Space_station",
  "/wiki/Pilot",
  "/wiki/Jaro_Tapal%27s_lightsaber",
  "/wiki/Species",
  "/wiki/Cere_Junda",
  "/wiki/Stinger_Mantis",
  "/wiki/The_galaxy",
  "/wiki/Currency",
  "/wiki/Cybernetics",
  "/wiki/Helmet",
  "/wiki/Jacket",
  "/wiki/Ring",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Respawn_Entertainment",
  "/wiki/Electronic_Arts",
  "/wiki/Luke_Cook",
  "/wiki/Category:Images_of_Sorc_Tormo",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/The_Star_Wars_Book",
  "/wiki/StarWars.com"
 ]
}