{
 "name": "Sorsha",
 "display_name": "Sorsha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Andowyne"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.62 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Sorsha was an individual from Andowyne and was the daughter of the Demon Queen Bavmorda and the good Prince Mikal Tanthalos of Tir Asleen whose fiery red hair she inherited.\nBavmorda raised the young princess as a warrior and Sorsha became a master archer and horseback rider. At a very young age she was knowledgeable enough in the art of war to command the Nockmaar army. However, when her battles brought her up against the valiant swordsman Madmartigan she became smitten with love, rejected her wicked past, and vowed to put an end to her mother's treachery. Once Bavmorda was defeated, she married Madmartigan and lived with him in her childhood home of Tir Asleen. One year after Bavmorda's downfall, Sorsha disappeared in the Cataclysm, along with the rest of Tir Asleen.\nOn April 1, 2006, StarWars.com updated its Databank with elements from the film and its spin-off novels, indicating that Willow would be added to the Star Wars continuity. Elaborate databank entries were written which attempted to plausibly fit the film into the history of the Star Wars universe. However, two days later, it was revealed to be an April Fools' joke, and thus non-canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Andowyne",
  "/wiki/Human/Legends",
  "/wiki/Daikini",
  "/wiki/Gender/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Tir_Asleen",
  "/wiki/Madmartigan",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Sorsha",
  "/wiki/April_1",
  "/wiki/2006",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Willow_(film)",
  "/wiki/Star_Wars",
  "/wiki/George_Lucas:_The_Creative_Impulse",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club"
 ]
}