{
 "name": "Sorzus_Syn",
 "display_name": "Sorzus Syn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Exiles",
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Sorzus Syn was a female Jedi who was exiled from the Jedi Order following the Hundred-Year Darkness. Sorzus Syn and her fellow Dark Jedi enslaved the native Sith of Korriban, christened themselves the first of the Sith Lords, and instituted a new order that centered around worship and practice of the dark side of the Force.\nDuring her reign, Syn wrote a journal that was later included in the Book of Sith, which was a chronicle of her encounters with Sith Purebloods, explorations in alchemy, and the foundations of the Sith Order. She was apparently the original author of the Sith Code.\nOnce a former Jedi, she and her comrades fled from the Jedi Order because the Jedi Council did not permit their delving into the dark side of the Force. Because of this, the Dark Jedi attempted to overthrow the Order, in a war known as the Hundred-Year Darkness. Learning the power of dark side alchemy, Syn became one of the top commanders in the Dark Jedi. During the war, she was a master summoner and developed a number of creatures, Shamblers, Howlers, Pit Horrors, and Leviathans, the latter which was used to break the barricades of the Jedi during a battle on Balmorra. However, Syn and the other Dark Jedi were defeated at the Battle of Corbos. Afterwards, Syn and the eleven other surviving dark siders were forcefully put on a ship and exiled.\nDuring the war, Syn collected rumors and information from refugees about Sith space and the Sith people, who possessed a special knowledge of the dark side. Therefore, she and the survivors steered the ship to the unknown, making sure the Jedi or Republic could not follow them.\nAfter arriving on Korriban, homeworld of the pureblood Sith, they landed in the Valley of the Sleeping Kings. Initially the Sith, under their king Hakagram Graush, greeted the Exiles with hostility; however, the Dark Jedi were able to use their superior technology, lightsabers, and Force knowledge to foil their attempts. The Dark Jedi then suborned Graush's Shadow Hand to their side, with the result that Graush was betrayed to the Dark Jedi and was executed by their leader Ajunta Pall, who used Graush's own war sword to do the deed. After which, Pall took Graush's place as leader of the Sith. The Dark Jedi, referred to as \"Jen'jidai\", became the first Sith Lords, with Pall becoming the first Dark Lord of the Sith. The former Jedi then took the knowledge of the Sith and made it their own, and created the first Sith Empire.\nNot long after, Sorzus decided to create her first diary, titled \"exile and arrival\", in which she detailed the events during the war and after their defeat against the Jedi. In her own view about the arrival of the Dark Jedi and the triumph of the Sith, Syn expressed hope that she would become the new Dark Lord.\nShortly afterwards, the Sith worlds and hyperspace routes were mapped by the Dark Jedi. On the throne of the planet Ziost, the Dark Jedi built their own palaces and formed a Sith Council under the leadership of Ajunta Pall; however, Syn expressed hope that his reign would not last long. In the following years, she created powerful artifacts, the three Great Amulets, for her fellow Sith Lords, such as a talisman for Karness Muur. However, she planned to actually create several such talismans, with the second going to Muur's bitter rival Remulus Dreypa, and the third, which was the most powerful amulet would remain in her possession. She also discovered that the Sith's blood was similar enough to their own to allow crossbreeding through alchemy.\nAfter the Dark Jedi had settled on Ziost, Syn returned with a group of priests and slaves back to Korriban to open the sealed tombs. After entering the Cloister of Bilious Torment, Syn lost about two score slaves to booby traps before she could penetrate to the sarcophagus inside the temple. At the end of the seventh day, Syn entered the sanctuary of Sakkra-Kla, which had been sealed for over 10,000 years, and while she lost six more slaves to a pack of Tuk'ata, she also discovered a number of scrolls with information about Sith Alchemy. She also found the Holocron of King Nakgru, from whom she learned more about the Sith and the rule of their ancestral King Adas.\nAfterwards, she sought out some of the conquered Sith worlds to obtain more information. At the sight of a chained Draethos, she realized that she had more to delve into the star maps, so they could trace the raids of the Sith. She discovered that as some point, the Sith did indeed attack the worlds of Draethos, Felucia, Quermia, and others. Later, Syn studied the breeding pens on Ziost and the creatures kept there. She also studied Sith Alchemy and Sith Sorcery, discovering scrolls hidden in the blood slurry of the Mongrel Altar, which was next to the body of Wyrmuk the Undying, whose grave was concealed behind a mural of King Adas. She was able to fight and resist the curses that were imposed on the scrolls to protect them, and study their contents. Syn may have been the author of the Sith Code.\nIn her diary, Sorzus told the story of the Jedi Order founding on Tython. After a summary of the Second Great Schism, she expressed her regret that the Order had learned nothing from the Renunciates and started to follow the old ways of the Jedi instead of following the dark side. She explained her view about the Hundred Year Darkness, the arrival on Korriban, the start of culture, and the tradition of the Sith. She also wrote down the findings on the weapons and artifacts of the Sith, bringing them into the new rule of the Sith. Then, she discussed her findings from the ancient holocrons and her insights about the rise of the ancestral King Adas, which led to her own research on the conquest of the Sith.\nAfter a chapter on the war beasts, she made mention of Sith alchemy, and explained her findings to the incantations of Sith magic. Along with her group, they compared the codes of the Jedi and the Sith, explaining the prophecy of Sith'ari.\nLater down the line Syn's journals would be used, along with other chronicals from those such as Darth Malgus and Darth Bane, to form the Book of Sith by Darth Sidious.\nAt the end of her life, Sorzus Syn created her own holocron. Jedi such as Jedi Master Mace Windu believed that the Jedi Order had successfully recovered her holocron, but in actuality what they had recovered was a secret spying device that had been concealed with a shrouding spell, the real holocron having been in the possession of the Sith since the time of Darth Bane.\nA part of her diary, started from the third month of their exile, remained intact after her death and was included in the archive of the Jedi Temple where Mace Windu and Grand Master Yoda examined the pages written in which she pointed primarily to the dangers of the dark side. In the wake of the Great Jedi Purge, the book came into the possession of the new Emperor Darth Sidious. According to his statement, these statements were the oldest text that lasted for thousands of years. He noted that all the authors collected were Sorzus Syn, Darth Malgus, Darth Bane, Darth Plagueis, and Mother Talzin. They were believed to be strong in their own dogma and were removed from the path that the Sith had. When the book fell into the hands of Grand Master Luke Skywalker, he tried to associate the contributions to their time. He believed that the scriptures were written in the years after 7000 BBY. The entries of the Jedi that he dated to a time before the Battle of Naboo in 32 BBY, and Sidious' remarks, after he seized power in 19 BBY.\nWhen Sorzus Syn was a member of the Jedi Order, she served the light side of the Force; however, when she fell to the dark side, she became cold, selfish and power hungry, not caring at all about the plight of other beings. For example, she didn't feel anything for the slaves that died during her excavations of Sith tombs, even feeding one of them to a tuk'ata to save her own life. As an expert for creating living biological weapons and plagues, Sorzus Syn talked about various forms and benefits. In her view, using alchemy to alter dead creatures was easier because dead cells, unlike living ones, could not resist.\nSorzus Syn was created by Daniel Wallace and featured in the 2012 publication Book of Sith: Secrets from the Dark Side, as the in-universe writer of a section of the book that described the Sith Purebloods. Wallace's original name for the character was \"Sanguinus Syn.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Exiles",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Code_of_the_Sith/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Hundred-Year_Darkness/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Korriban",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_Order",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Book_of_Sith",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Master_summoner",
  "/wiki/Shambler",
  "/wiki/Howler",
  "/wiki/Pit_Horror",
  "/wiki/Leviathan_(creature)",
  "/wiki/Balmorra/Legends",
  "/wiki/Battle_of_Corbos",
  "/wiki/Discovery_of_Korriban",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/King/Legends",
  "/wiki/Hakagram_Graush",
  "/wiki/Shadow_Hand",
  "/wiki/Ajunta_Pall",
  "/wiki/Jen%27jidai",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ziost/Legends",
  "/wiki/Great_Amulet",
  "/wiki/Muur_Talisman",
  "/wiki/Karness_Muur",
  "/wiki/Remulus_Dreypa",
  "/wiki/Cloister_of_Bilious_Torment",
  "/wiki/Holocron_of_King_Nakgru",
  "/wiki/Draethos_(species)",
  "/wiki/Draethos_(planet)",
  "/wiki/Felucia/Legends",
  "/wiki/Quermia/Legends",
  "/wiki/Ziost%27s_breeding_pens",
  "/wiki/Mongrel_Altar",
  "/wiki/Wyrmuk_the_Undying",
  "/wiki/Tython/Legends",
  "/wiki/Second_Great_Schism",
  "/wiki/Sith%27ari",
  "/wiki/Darth_Malgus",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Syn_Holocron",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Mother_(title)/Legends",
  "/wiki/Talzin/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/7000_BBY",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Tuk%27ata/Legends",
  "/wiki/Daniel_Wallace",
  "/wiki/2012",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/Lost_Tribe_of_the_Sith%E2%80%94Spiral_3"
 ]
}