{
 "name": "Sowa_Chuan",
 "display_name": "Sowa Chuan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Abednedo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Sowa Chuan, also known as Ilka, was a female Abednedo whom Agent Terex of the First Order Security Bureau employed as a servant aboard the Carrion Spike. Ilka served Terex his drinks.\nSowa Chuan was the wife of the Resistance technician Oddy Muva. She was kidnapped and enslaved by the First Order in order to exert leverage on her husband. In order to keep Chuan alive, Muva was forced to work as a spy for Terex. Muva reported on Poe Dameron and Black Squadron's missions to Ovanis, Megalox Beta, and Kaddak. Chuan was part of a harem of slaves from various alien species who were kept as hostages by Terex aboard his personal starship Carrion Spike.\nWhen Terex received his assignment from Captain Phasma to recover the data that Dameron had Stolen from Senator Erudo Ro-Kiintor during Operation: Sabre Strike, Chuan was present and served her master Wookiee–brewed brandy with Kessel spice. She and the other slaves withdrew when Terex requested that he have time to speak privately with Phasma. Chuan was later present at the bridge of the Carrion Spike when Terex ordered the First Order crew to attack Megalox space station and the escaping shuttles. When she tried to speak, Terex addressed her as Ilka and told her to keep his glass full.\nSowa and a female humanoid slave stood behind Terex's throne aboard the Carrion Spike's bridge when his First Order crew informed him that their repairs were nearly complete. Terex then retreated to his private chamber. When the humanoid slave asked Terex if there was anything they could do for him, Terex insisted on being left alone and pointed his blaster at them.\nLater, Chuan was serving Terex drinks and refreshments following the latter's tense conversation with Phasma. Terex had reasserted control over the Ranc Gang and had mustered an armada of \"Uglies\" for an attack on the Resistance base. Terex hoped to use Dameron to lead his criminal armada to the Resistance and destroy them once and for all. Terex's plan was criticized by Phasma, who warned him that he was disobeying Supreme Leader Snoke's directive to avoid open conflict with the New Republic and the Resistance. Unknown to Chuan, her husband had infiltrated the Carrion Spike with the intention of rescuing her and settling scores with Terex.\nMuva forced Terex's lieutenant Zumgi to lead him to Chuan and the other prisoners. Chuan was shocked to encounter her husband and embraced him. When Zumgi asked if Chuan was Muva's wife, to which he confirmed this was so. Chuan also told her husband that Terex had kidnapped and enslaved other hostages, whom he used as leverage against his assets. Muva told Chuan that he no longer wanted to work for Terex and ordered Zumgi to call his master. However, Terex had already departed with a landing party on a desert planet to hunt down Dameron and the droids BB-8 and N1-ZX.\nAfter the other Black Squadron pilots Temmin Wexley, Karé Kun, Jessika Pava, and L'ulo L'ampar arrived to rescue Dameron, Chuan, Muva, and the other slaves escaped in about four escape pods. Before leaving, Muva also sabotaged the Carrion Spike's battle computers to auto-target Terex's \"Uglies,\" which laced Resistance transponders. Muva also got Black Squadron to provide firing cover for the escape pods. Chuan stood beside her husband as the escape pods traveled to the desert planet. After one of the pods was hit by an \"Ugly,\" Chuan hugged her husband and asked if they were going to make it. He reassured her that they were together. As a result, the escape pods were able to reach the desert planet safely. Terex's forces were wiped out by First Order forces under Commander Malarus, who had been sent to chastise the rebellious Terex.\nSowa Chuan was a female Abednedo with sandy blown hair tied into a pony tail and dark eyes. She wore a long brown dress. Chuan loved her husband Oddy Muva and was amazed that he came to save her. After being kidnapped, Chuan was forced to work for the First Order agent Terex. Terex used her to serve him beverages and lorded over her and the slaves. He did not allow her to speak and once told Sowa that her only responsibility was to fill his cup. Chuan was fearful that they would die during the escape from the Carrion Spike but Muva reassured her that they were together.\nSowa Chuan first appeared in the 2016 comic Poe Dameron 2, written by Charles Soule and illustrated by Phil Noto.\nLike other Abednedo, she is named after a Beastie Boys work, namely the song \"So What'cha Want.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Poe_Dameron_17",
  "/wiki/Poe_Dameron_18",
  "/wiki/Poe_Dameron_19",
  "/wiki/Special:Upload",
  "/wiki/Abednedo",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Agent",
  "/wiki/Terex",
  "/wiki/First_Order_Security_Bureau",
  "/wiki/Carrion_Spike",
  "/wiki/Marriage",
  "/wiki/Resistance",
  "/wiki/Technician",
  "/wiki/Oddy_Muva",
  "/wiki/First_Order",
  "/wiki/Spy",
  "/wiki/Poe_Dameron",
  "/wiki/Black_Squadron_(Resistance)",
  "/wiki/Ovanis",
  "/wiki/Megalox_Beta",
  "/wiki/Kaddak",
  "/wiki/Slavery",
  "/wiki/Alien",
  "/wiki/Species",
  "/wiki/Starship",
  "/wiki/Mission_to_Ovanis",
  "/wiki/Captain",
  "/wiki/Phasma",
  "/wiki/Senator",
  "/wiki/Erudo_Ro-Kiintor",
  "/wiki/Operation:_Sabre_Strike",
  "/wiki/Wookiee",
  "/wiki/Brandy",
  "/wiki/Kessel_spice",
  "/wiki/Time",
  "/wiki/Bridge_(starship)",
  "/wiki/Mission_to_Megalox_Beta",
  "/wiki/Megalox_space_station",
  "/wiki/Shuttle",
  "/wiki/Glass",
  "/wiki/Humanoid",
  "/wiki/Throne",
  "/wiki/Blaster",
  "/wiki/Ranc_Gang",
  "/wiki/Ugly",
  "/wiki/Resistance_base",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Cold_War",
  "/wiki/New_Republic",
  "/wiki/Lieutenant",
  "/wiki/Zumgi",
  "/wiki/Prisoner",
  "/wiki/Unidentified_desert_planet",
  "/wiki/Droid",
  "/wiki/BB-8",
  "/wiki/N1-ZX",
  "/wiki/Squadron",
  "/wiki/Pilot",
  "/wiki/Temmin_Wexley",
  "/wiki/Kar%C3%A9_Kun",
  "/wiki/Jessika_Pava",
  "/wiki/L%27ulo_L%27ampar",
  "/wiki/Escape_pod",
  "/wiki/Computer",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Commander",
  "/wiki/Malarus",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Death",
  "/wiki/2016",
  "/wiki/Marvel_Comics",
  "/wiki/Poe_Dameron_2",
  "/wiki/Charles_Soule",
  "/wiki/Phil_Noto",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Poe_Dameron_6",
  "/wiki/Poe_Dameron_8",
  "/wiki/Poe_Dameron_11",
  "/wiki/Poe_Dameron_12",
  "/wiki/Poe_Dameron_13",
  "/wiki/Poe_Dameron_14",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Highlights_of_the_Saga"
 ]
}