{
 "name": "SP-113",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Ninety-Seventh Stormtrooper Legion",
      "Imperial Ninety-Seventh Stormtrooper Legion"
     ]
    }
   ]
  }
 ],
 "content": "SP-113 was a human male stormtrooper who was stationed on the planet Sullust during the Galactic Civil War. He was took part in a mission to catch a smuggler in Pinyumb. A week after that mission ended with the Chadra-Fan smuggler suicide he was already in line, while all other injured stormtroopers were not fully recovered. SP-475 had been told SP-113 was one of the original clone commandos who had founded the Stormtrooper Corps.\nDuring the Galactic Civil War between the Galactic Empire and the Rebel Alliance, the human male stormtrooper designated \"SP-113\" served in the Imperial Ninety-Seventh Stormtrooper Legion in the local Imperial garrison at the underground cavern city of Pinyumb, the capital of the Outer Rim volcanic mining and manufacturing planet Sullust. 113 was an older member of the legion, and the stormtrooper Thara Nyende, designated \"SP-475,\" was told that 113 was one of the clone commandos that founded the Stormtrooper Corps.\nIn 3 ABY, the Sullustan resistance, a rebel cell led by the Sullustan Nien Nunb, was active in Pinyumb and made a sabotage attack on the Inyusu Tor mineral processing facility, which was located north of Pinyumb up the Inyusu Tor volcanic peak. Raids and lockdowns followed in Pinyumb, and the Imperial Security Bureau soon flagged the VCX-150 freighter Keepsake as property of the Sullustan resistance. Twelve stormtroopers, led by 113 were tasked with boarding and investigating the Keepsake, which was docked in the Pinyumb spaceport. Others in the squad included SP-475 and SP-156.\nSP-113 donned the standard armor of a stormtrooper, including a helmet equipped with night vision and a comm. He was also equipped with his own rifle.\nSP-113 appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed. Freed wrote the novel with the one of his intentions being to dehumanize aspects of the Imperial hierarchy with the way they treated stormtroopers like SP-113. He chose to convey their treatment under the Empire being having them only be referred to by their operating numbers, which he viewed as similar to that of clone troopers.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:SP-113",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Ninety-Seventh_Stormtrooper_Legion",
  "/wiki/Stormtrooper",
  "/wiki/Planet",
  "/wiki/Sullust",
  "/wiki/Galactic_Civil_War",
  "/wiki/Unidentified_Chadra-Fan",
  "/wiki/Pinyumb",
  "/wiki/Standard_week",
  "/wiki/Chadra-Fan",
  "/wiki/Suicide",
  "/wiki/Thara_Nyende",
  "/wiki/Clone_commando",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Operating_number",
  "/wiki/Imperial_Garrison_(Sullust)",
  "/wiki/Cave",
  "/wiki/City",
  "/wiki/Capital",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Volcano",
  "/wiki/Mining",
  "/wiki/Legion",
  "/wiki/3_ABY",
  "/wiki/Sullustan_resistance",
  "/wiki/Sullustan",
  "/wiki/Nien_Nunb",
  "/wiki/Attack_on_the_Inyusu_Tor_mineral_processing_facility",
  "/wiki/Inyusu_Tor_mineral_processing_facility",
  "/wiki/Inyusu_Tor",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/VCX-150_freighter",
  "/wiki/Keepsake",
  "/wiki/Pinyumb_spaceport",
  "/wiki/Squad",
  "/wiki/SP-156",
  "/wiki/Stormtrooper_armor",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Clone_trooper",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/March_11",
  "/wiki/September_3",
  "/wiki/2017"
 ]
}