{
 "name": "SP-156",
 "display_name": "SP-156",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Ninety-Seventh Stormtrooper Legion",
      "Imperial Ninety-Seventh Stormtrooper Legion"
     ]
    }
   ]
  }
 ],
 "content": "SP-156  was the designation of a human male stormtrooper in the Galactic Empire's Imperial Ninety-Seventh Stormtrooper Legion on the planet Sullust. During a lockdown of Sullust's capital city Pinyumb in 3 ABY, he was assigned as sentry at a tram station with Thara Nyende \"SP-475,\" where he broke regulations by trying to start chatter.\nFifteen days later, 156 joined a team of stormtroopers in boarding the VCX-150 freighter Keepsake which had been labeled as rebel property. The troopers searched the rooms before congregating in a hallway, where 156 investigated a conduit panel. He found a Chadra-Fan rebel behind the panel, who eventually set off a detonator to avoid capture.\nDuring the Galactic Civil War, the human male designated \"SP-156\" served as a stormtrooper in the Galactic Empire's Imperial Ninety-Seventh Stormtrooper Legion in the local Imperial garrison on the manufacturing planet Sullust. Around the first year of her career in the Empire, fellow stormtrooper Thara Nyende, designated \"SP-475,\" worked with 156, although she never learned his real name. In 3 ABY, following a sabotage attack on the Inyusu Tor mineral processing facility by the local Sullustan resistance rebel cell, troopers of the Ninety-Seventh were deployed to oversee the lockdown and building raids in Sullust's capital city Pinyumb. 156 was soon assigned as sentry at a tram station with SP-475.\nDuring their posting, 156 asked his colleague if anybody had died in the Sullustan resistance's attack on the Inyusu Tor facility, although chatter while on duty was against regulations. Citing reports, 475 answered that there were likely no deaths. 156 then questioned whether any of the Empire's side had killed anyone during the lockdown and raids, which 475 chose not to reply to.\nFifteen days later, 156 and 475 were part of a squad of twelve stormtroopers assigned to board the VCX-150 freighter Keepsake, which the Imperial Security Bureau had flagged as property of the Sullustan resistance. The twelve troopers fanned out around the freighter until orders were given for two teams to check the inside of the vessel. Eight stormtroopers—including 156, 475, and the lead trooper SP-113—boarded the Keepsake, with 113 ordering his colleagues to use their helmets' night vision functions as there was no illumination inside.\nOut of caution for bombs, the eight stormtroopers scanned the more than half a dozen rooms of the Keepsake for comm signals and power sources before entering. After spending ten minutes searching the bunk room, the troopers received orders from the garrison to speed up the search. The two teams continued, finding medical supplies, food, tools, and datachips containing propaganda videos. When they finished, they gathered at the hallway leading to the cockpit.\nAs 113 ordered the cargo to be locked down for a forensic investigation, 156 noticed a conduit access panel in the corridor and approached it. After studying the panel, he then bashed it off with his rifle and discovered a Chadra-Fan rebel hiding inside the cramped space. With the stormtroopers raising their rifles, 113 briefly questioned the rebel about the Sullustan resistance's operations before having three other troopers move in to restrain the alien. However, the Chadra-Fan, wishing not to fall into Imperial custody, committed suicide by setting off a detonator that also killed several troopers.\nSP-156 flouted regulations to question whether any deaths had occurred as a result of the Sullustan resistance attack and the following lockdown of Pinyumb.\nSP-156 wore the standard armor of a stormtrooper, which included a helmet equipped with night vision and a comm. He was equipped with a rifle.\nSP-156 appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed. Freed had intended to dehumanize aspects of the Imperial hierarchy with the way they treated stormtroopers like SP-156. He had the troopers only be referred to by their operating numbers to convey their treatment under the Empire, which he viewed as not so different to that of clone troopers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Ninety-Seventh_Stormtrooper_Legion",
  "/wiki/Operating_number",
  "/wiki/Stormtrooper",
  "/wiki/Planet",
  "/wiki/Sullust",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Pinyumb",
  "/wiki/3_ABY",
  "/wiki/Thara_Nyende",
  "/wiki/Standard_day",
  "/wiki/VCX-150_freighter",
  "/wiki/Keepsake",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Trooper",
  "/wiki/Unidentified_Chadra-Fan",
  "/wiki/Detonator",
  "/wiki/Galactic_Civil_War",
  "/wiki/Imperial_Garrison_(Sullust)",
  "/wiki/Standard_year",
  "/wiki/Attack_on_the_Inyusu_Tor_mineral_processing_facility",
  "/wiki/Inyusu_Tor_mineral_processing_facility",
  "/wiki/Sullustan_resistance",
  "/wiki/Death",
  "/wiki/Inyusu_Tor",
  "/wiki/Squad",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Soldier",
  "/wiki/Freighter",
  "/wiki/Starship",
  "/wiki/SP-113",
  "/wiki/Helmet",
  "/wiki/Night_vision",
  "/wiki/Bomb",
  "/wiki/Standard_minute",
  "/wiki/Garrison",
  "/wiki/Datachip",
  "/wiki/Propaganda",
  "/wiki/Cockpit",
  "/wiki/Rifle",
  "/wiki/Alien",
  "/wiki/Chadra-Fan",
  "/wiki/Suicide",
  "/wiki/Stormtrooper_armor",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Clone_trooper",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/March_11",
  "/wiki/September_3",
  "/wiki/2017"
 ]
}