{
 "name": "Spek-Man",
 "display_name": "Spek-Man",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic arm",
      "Cybernetic leg"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Sleeper Cell V-16",
      "Sleeper Cell V-16"
     ]
    }
   ]
  }
 ],
 "content": "Spek-Man was a Near-Human mechanic, who worked for the Rebel Alliance during the Galactic Civil War. He was a member of Sleeper Cell V-16, a Rebel sleeper cell that was active on the planet Malthor around 0 BBY.\nSpek-Man lived on the planet Malthor, where he worked as a machinesmith and droid programmer. He disliked the Galactic Empire and so joined the Rebel Alliance sometime before 1 BBY. He served as a part-time operative and later helped Berren Sid Té set up Sleeper Cell V-16. In the process, Sid learned the identity of Spek-Man and knew how to get in contact with him but never bothered to figure out where he lived. Spek-Man would program or reprogram droids for the cell and only asked for spare parts or food in return.\nSpek-Man spoke using abbreviations and droidspeak and also had a very short attention span. He was considered very unusual and was often very difficult to talk to due to his unusual speech patterns.\nSpek-Man was very skilled at repairs and specialized in fixing droids. He was also talented at repairing armor, ground vehicles, repulsorlift vehicles, blasters and computers. He was also skilled at surviving in the wild outskirts of Malthor.\nSpek-man had a cybernetic arm and leg. He also carried a variety of tools on him at all times as well as a blaster. He had a storage area where he had several repaired and refurbished droids, especially R2-series astromech droids as well as a number of miscellaneous junk parts.\nSpek-Man was designed by Ted Stark for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Brian Schomburg.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Sleeper_Cell_V-16",
  "/wiki/Technician/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sleeper_cell",
  "/wiki/Planet/Legends",
  "/wiki/Malthor",
  "/wiki/0_BBY/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Berren_Sid_T%C3%A9",
  "/wiki/Binary/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Computer/Legends",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Ted_Stark",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Brian_Schomburg"
 ]
}