{
 "name": "Spenc_Orbar",
 "display_name": "Spenc Orbar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "By 28 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Royal Imperial Academy",
      "Royal Imperial Academy"
     ]
    }
   ]
  }
 ],
 "content": "Spenc Orbar was a male human Imperial cadet who attended the Royal Imperial Academy on Coruscant. His family had great influence over Coruscant and the Academy, resulting in him getting away with whatever he wanted. He, like the majority of his classmates and the faculty of the Academy, was surprised and displeased by the arrival of Thrawn, an alien from the Unknown Regions who defied the xenophobia running rampant throughout the Galactic Empire, and so he conspired with Rosita Turuy and several other classmates to get rid of him. First, he and Turuy invited Thrawn to the metallurgy lab to gamble, an activity strictly forbidden by the Academy, in an effort to get him caught doing so. This attempt failed when Thrawn brandished a lieutenant's plaque Commandant Deenlark, the president of the Academy, had given him in order to hasten his graduation. When an instructor Orbar had discreetly called for burst in, he saw the plaque and had no choice but to leave them to their activities, as lieutenants were allowed in the metallurgy lab. Orbar, Turuy, and their fellow conspirators resorted to physically attacking Thrawn, but thanks to intervention from Eli Vanto, Thrawn's aide, this attempt also failed. Thrawn and Vanto later reported the attack to Commandant Deenlark, who was surprised when Thrawn, instead of demanding that his assailants be punished, recommended that they be transferred to Skystrike Academy, as he had noted while under attack from them that they had displayed tremendous aptitude as fighter pilots. Deenlark granted Thrawn's request, and in a stroke of genius on Thrawn's part, Orbar and Turuy's co-conspirators disappeared without a trace, leaving them paranoid and unsure of their fate.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/28_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Royal_Imperial_Academy",
  "/wiki/Cadet",
  "/wiki/Coruscant",
  "/wiki/Alien",
  "/wiki/Unknown_Regions",
  "/wiki/Xenophobia",
  "/wiki/Rosita_Turuy",
  "/wiki/Lieutenant",
  "/wiki/Commandant",
  "/wiki/Deenlark",
  "/wiki/Eli_N._Vanto",
  "/wiki/Skystrike_Academy",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Spenc_Orbar",
  "/wiki/Thrawn_(novel)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn_1",
  "/wiki/Thrawn_2",
  "/wiki/Del_Rey",
  "/wiki/A_New_Dawn_(novel)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Kanan_Jarrus",
  "/wiki/Hera_Syndulla",
  "/wiki/Standard_year",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/5_BBY",
  "/wiki/11_BBY",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Imperial_Academy",
  "/wiki/Imperial_Cadet",
  "/wiki/Reproduction"
 ]
}