{
 "name": "Spilferithimus-narlamos",
 "display_name": "Spilferithimus-narlamos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Squib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "0.97 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Squib Polyanarchy"
     ]
    }
   ]
  }
 ],
 "content": "Spilferithimus-narlamos, often called Spilfer for short, was a blue-furred Squib male diplomat—a status that allowed him to sign agreements on behalf of his entire species. Sometime between 0 and 2 ABY, the Squib King, Ebareebaveebeedee, charged the diplomat with leading a group of Rebel Alliance operatives through the Paradise system to obtain a \"quest object\" for the Squibs. In exchange, the King agreed to provide the coordinates of the Imperial Armored Transport Elusive, which had information that could compromise Rebel operations in several sectors. Spilferithimus-narlamos and the Squibs neglected to mention key facts: the system consisted mostly of garbage—including pieces of the Galactic Empire's destroyed Death Star battlestation—the \"quest object\" was a gravity well projector that kept the system from complete collapse, and the Squibs' hereditary rivals, the Ugors, controlled Paradise and considered the quest-object to be part of their holiest shrine.\nSpilferithimus-narlamos disguised himself to sneak past the Ugor officials who greeted the Rebel starship. However, he was discovered by the Ugor Tax Chaplain GrrKack, and the Rebels were forced to pay an exorbitant sum for bringing a \"demon of a Squib\" into the holy system. Nevertheless, Spilferithimus-narlamos led his charges into a large piece of Death Star wreckage, where he filled his many pouches with refuse amassed with a large garbage grabber until the group reached the \"quest object.\" The Rebels extricated the gravity well projector, slipped it past a band of crime lord Jabba the Hutt's pirates who sought the projector for their employer, and brought the loot back to their shuttle. However, the removal of the projector threw the delicate gravitational balance of the system off kilter, turning it into chaotic field of debris. Spilferithimus-narlamos manned the shuttle's tractor beams to deflect dangerous pieces of garbage from striking the vessel as it fought off the miffed Ugors in their battle-wagons and escaped into hyperspace. Back on the Squib Momship, Spilferithimus-narlamos and the Squibs exchanged the coordinates of the Elusive for the gravity well projector—an item for which they had no other use than to bother their rivals, the Ugors. After more spirited haggling, Ebareebaveebeedee handed over the projector for the Rebels to use in their continued hunt for the Elusive, and he declared a pact of mutual support between the Squibs and the Rebel Alliance, Spilferithimus-narlamos attesting.\nAs a member of the diminutive, trash-loving Squib species, Spilferithimus-narlamos—who went by the nickname Spilfer—traveled with his species' Reclamation Fleet, collecting garbage jettisoned by starships before they jumped to lightspeed. In the process, he learned Basic from studying examples of that language hidden among the detritus they collected. He rose through the ranks of his species' government, the Squib Polyanarchy, to become a full-fledged diplomat with a post aboard the Thrifty, Momship of the fleet.\nAt some point between 0 ABY and 2 ABY, the Thrifty traveled to the Dankayo system to collect the garbage jettisoned from the Elusive, an Imperial Armored Transport they had tracked there through the work of a Squib spy known as Dono, who was embedded on board. In the process, they surveyed a battle between the forces of the Alliance to Restore the Republic and the Galactic Empire. The Squibs noted both that the Rebels damaged the Elusive before it leapt to hyperspace, as well as the fact that the Rebels attempted to scan the starship's trajectory to pursue it to its next destination. The Squibs began to gather the Elusive's refuse with tractor beams, but they were interrupted when Salvage Dreadnoughts flown by the Squibs' hereditary enemies, the Ugors, arrived and opened fire on both the Squibs and the Rebels. The Ugor vessels gathered as much garbage as possible while fending off the other vessels before escaping to hyperspace.\nWith calm restored, the Squibs smelled an opportunity to cause mayhem for their foes, the Ugors: The Rebels' scanning proved they wanted to follow the Elusive to its next destination, and Dono would soon broadcast the coordinates of the Elusive so the Reclamation Fleet could locate it again. The Squibs could sell the coordinates to the Rebels in exchange for the outsiders running a little errand: travel to the Ugors' home, the Paradise system, steal an important artifact, and throw the entire star system into disarray. Accordingly, when they received Dono's hail on a pirate-band channel, the Squibs rebroadcast it on an open frequency so the Rebels would overhear. The Squib spy mentioned that the ship had established its new destination and that the coordinates would be transmitted soon. The Squibs then hailed the Rebels and invited them aboard the Momship to speak of Chieftain of All Junkyards to bargain for the coordinates.\nIn audience, the Chieftain, King Ebareebaveebeedee, promised to reveal the whereabouts of the Elusive provided the Rebels travel to the Paradise system for him to obtain a \"quest object\"—actually a gravity well projector from the debris of the Empire's destroyed Death Star battlestation, which was holding the junk-filled expanses of the Paradise system from falling into chaos. The King left the object's identity vague and sent Spilferithimus-narlamos to guide the Rebels to it as the \"Special-Ambassador-to-big-guys-who-are-not-Imperials.\"\nSpilferithimus-narlamos boarded the Rebels' ship, a Lambda-class T-4a shuttle called the Bonderium. Despite some difficulty communicating due to his thick accent when speaking Basic, the Squib led the Rebels to a star system known as J21-Z64 to the ship's computers, but as Paradise to the Squibs and Ugors. Upon arrival, the Ugors hailed them as religious \"pilgrims\" and sent a dreadnought to dock with the Rebel ship. Spilferithimus-narlamos, knowing dire consequences would follow should he be discovered, hid. Three Ugors boarded the ship and escorted the Rebels aboard their vessel to collect the proper \"ceremonial donation\" for permission to move about the system. From hiding, Spilferithimus-narlamos felt an overwhelming urge to participate in the haggling he knew must be transpiring across the cofferdam. He thus donned a disguise—a Human-sized blast helmet and tech-suit—and boarded the Ugor vessel. There, he entered a spirited round of bargaining with the Ugors, getting the officials to let the outsiders into their system for a mere twelve credits total. The Ugor Tax Chaplain GrrKack removed his glove to shake on the deal, but Spilferithimus-narlamos recoiled at the sight of the pseudopod. The appendage morphed into three eyestalks, which allowed GrrKack to recognize the negotiator as a Squib. The Ugors decried the Squib as the \"veritable pseudopod of the Anti-Prophet\" and threatened to sacrifice him on the altar of the Angel of Taxations and Imports. Fortunately for the Squib, the Rebels quickly bargained for his life, securing passage for Spilferithimus-narlamos by paying a hefty \"exorcism fee\" and by cooking a gourmet feast for the Ugors based on directions from L9-G8, a cooking droid aboard their vessel.\nSpilferithimus-narlamos guided the Rebels' ship through the debris-strewn system to a burnt-out hulk of debris from the Empire's destroyed Death Star, pronouncing them arrived at the location of the \"quest-object.\" Upon the Rebels' shock at having to haul away such a massive hunk of scrap, he clarified that the object of their quest was actually something held within the hulk. Despite a large number of Ugor ships guarding the wreckage—to the natives, considered their Holiest of Holies—the Rebel ship slipped past the patrols and landed on the wreckage.\nThe hulk still had artificial gravity but no breathable air. Spilferithimus-narlamos and the others donned breath masks, and the Squib led them through the twisting remnants of corridors and chambers. Along the way, the Squib diplomat filled his pouches with huge amounts of refuse, growing suspicious that the Rebels allowed him to do so without competing with him for the choicest pieces. Spilferithimus-narlamos led the group through the remnants of a stormtrooper locker room, helped the Rebels survive an encounter with rogue, power-seeking automata known as Void Droids, and led them through the personal chambers of Darth Vader, a Dark Lord of the Sith who had been stationed aboard the Death Star before its destruction. The group eventually reached the remnants of a garbage masher. There, Spilferithimus-narlamos was filled with glee to see so much garbage, and he busied himself retrieving items with his garbage grabber, filling his collection pouches. A dianoga in the water wrapped a tentacle around the Squib and attempted to strangle him. The Rebels at first dismissed Spilferithimus-narlamos's screams as excitement over the detritus there, but they eventually realized the danger and saved the ambassador.\nSpilferithimus-narlamos then led the group to the center of the hulk, where the gravity well projector sat, powered by Ugorian power plants. The Squib suggested they take it quickly before the Ugors showed up. He then took out a long tool and struck the projector, triggering an alarm. Spilferithimus-narlamos then closed his eyes and chose a dial at random to turn, only to have the knob come off in his hand. Nevertheless, the siren ceased, and a green light ignited within the device. Spilferithimus-narlamos pocketed the knob. He led the Rebels back toward their ship as the Paradise system began to collapse into chaos, robbed of the one thing that had brought order to it.\nBefore they could board their ship, the Squib and the Rebels came under attack by pirates led by a Human woman named Teehl, who worked for Jabba the Hutt, a crime lord who also wanted the projector. The Rebels talked the droid L9-G8 into maneuvering the ship close by and using its tractor beam to latch onto the gravity well projector and thus bring it—along with the Rebels holding onto it—into the vessel and away from the assailants. The Rebels fled the Paradise system, which was now devolving into an obstacle course after being robbed of its artificial focus. Spilferithimus-narlamos manned the ship's tractor beams to deflect junk that threatened the vessel. Nevertheless, four Ugor dreadnoughts attacked the group, angered by the theft of the projector, which to them was a religious artifact known as the Prime Mover. The Rebels avoided destruction and prepared to jump to hyperspace when a fleet of Squib needle ships—including the Momship, Thrifty—arrived and began swiping up garbage. The Ugors retreated.\nKing Ebareebaveebeedee hailed the Rebels and invited them aboard the Momship. There, he accepted the gravity well projector and revealed to the Rebels the coordinates of the Elusive, now undergoing repairs at the Tolan Navy Yards and scheduled to depart for the Imperial Intelligence Operations Center on the planet Coronar. The King also agreed to let the Rebels have the gravity well projector in exchange for salvage rights to the soon-to-be-destroyed Elusive. In closing, he gave the Rebels a sealed datapack for them to open only after their mission was completed. The Rebels used the projector to yank the Elusive from hyperspace and destroy it. When they opened the King's parting gift, it broadcast a gigantic hologram of the Squib leader, who declared a pact of mutual support between the Squib Polyanarchy and the Alliance to Restore the Republic, Spilferithimus-narlamos attesting to the agreement.\nSpilferithimus-narlamos was a male Squib with blue fur and a dark nose. During his mission to the Paradise system, sometime between 0 and 2 ABY, Spilferithimus-narlamos was still young for a Squib. At 0.97 meters tall, he was a bit short for his species and downright tiny by Human standards. As such, Spilferithimus-narlamos was fairly weak physically. Nevertheless, he made up for his diminutive nature with agility, alertness, and reflexes that allowed him to dodge harmful attacks. He possessed skill at bargaining, fast-talking, and searching, and the Squib was a masterful operator of tractor beams. As a diplomat, Spilferithimus-narlamos spoke Basic, although he thought his level of fluency higher than it was, unaware of the comprehension problems caused by his thick accent.\nSpilferithimus-narlamos wanted to earn esteem from his fellow Squibs by \"dealing the good deal.\" In his capacity as a diplomat, he possessed the power to sign treaties that were binding to the entire Squib species. He wore a formal Fizz-Pop Cap  as the sign of his office. Spilferithimus-narlamos covered his body in pouches and pockets—only \"clothing\" in a loose sense of the term—that accorded with his species' sense of fashion. These bags and satchels allowed the Squib to exercise his penchant for collecting random pieces of junk that caught his eye; in fact, the Squib experienced bliss at the sight of large amounts of garbage, and he was highly suspicious of anyone who did not share his glee at collecting it. He had no compunctions about begging people to give him items they possessed, and he tended to like anyone who succumbed to such pestering. The diplomat kept a garbage grabber slung across his right shoulder to aid him in this task: although the device appeared menacing, it merely allowed him to retrieve distant pieces of detritus with its built-in tractor beam. Spilferithimus-narlamos carried a tiny blaster pistol plated in tin for personal defense; the weapon resembled a toy and was ineffective beyond short range. Although he considered the Ugor-controlled Paradise system to be a paradise in every sense of the word, he shared his species' fundamental intolerance toward the Ugors. Indeed, Spilferithimus-narlamos recoiled at the mere idea of touching a member of the unicellular species.\nAuthor Brad Freeman introduced Spilferithimus-narlamos in Scavenger Hunt, an adventure published in 1989 for the first edition of West End Games' Star Wars: The Roleplaying Game. His portrait was drawn by artist John Robinson. In the adventure, Spilferithimus-narlamos is a non-player character controlled by the gamemaster. As such, the character adds comic relief to the adventure, such as when his poor language skills in Basic lead the player characters to believe they must cart away an enormous chunk of the destroyed Death Star rather than the much smaller gravity well projector stored within it. Including him in the Rebel characters' party also allows the gamemaster to provide clues and suggestions through the Squib in situations where the players have difficulty formulating plans to overcome the adventure's obstacles. For instance, during their escape from the Death Star hulk, the Squib suggests that the Rebels grab hold of the gravity well projector and then get their ship droid to pull it into the starship via a tractor beam should none of them come up with the idea first. Later, if the player characters cannot figure out how to successfully ambush the Elusive after learning of its location from the Squibs, Spilferithimus-narlamos suggests using the gravity well projector to yank it out of hyperspace.\nThe events recounted above assume a best-case outcome for the player characters. At certain points in the adventure, however, the adventure can become more difficult if certain events befall Spilferithimus-narlamos. For example, if the Ugors discover Spilferithimus-narlamos aboard the Rebel shuttle when they first board the vessel in the Paradise system, they take him prisoner as an \"enemy of Ugor\" and force the Rebels to leave the system, permanently banished—and thus fail their mission. Later, if the Rebels prevent Spilferithimus-narlamos from striking the gravity well projector, the device remains firmly ensconced in the Ugors' power plant and proves much more difficult to remove. Depending on where the Rebel operatives land their shuttle on the Death Star wreckage, the order of encounters within the hulk changes. The sequence above reflects the order in which the encounters appear in the published version of the adventure. In the 2003 sourcebook Ultimate Alien Anthology, for Wizards of the Coast's Star Wars Roleplaying Game, Spilferithimus-narlamos is an example name for the Squib species.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Squib/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Squib_Polyanarchy",
  "/wiki/Hair/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Species/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/King/Legends",
  "/wiki/Ebareebaveebeedee",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Operative",
  "/wiki/Paradise_system",
  "/wiki/Imperial_Armored_Transport",
  "/wiki/Elusive_(transport)",
  "/wiki/Sector/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Ugor/Legends",
  "/wiki/Prime_Mover",
  "/wiki/Holiest_of_Holies",
  "/wiki/Starship/Legends",
  "/wiki/Tax_Chaplain",
  "/wiki/GrrKack",
  "/wiki/Demon/Legends",
  "/wiki/Garbage_grabber",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Gravity/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Black_Hole-class_Salvage_Dreadnought",
  "/wiki/Hyperspace/Legends",
  "/wiki/Momship",
  "/wiki/Unidentified_Squib_pact",
  "/wiki/Squib_Reclamation_Fleet",
  "/wiki/Lightspeed/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Language/Legends",
  "/wiki/Thrifty",
  "/wiki/Fleet/Legends",
  "/wiki/Dankayo_system",
  "/wiki/Spy/Legends",
  "/wiki/Dono_(Squib)",
  "/wiki/Battle_of_Dankayo",
  "/wiki/Illustrious_Chieftain_of_Junkyards",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Bonderium",
  "/wiki/Computer/Legends",
  "/wiki/Docking_tube/Legends",
  "/wiki/Human/Legends",
  "/wiki/Blast_helmet/Legends",
  "/wiki/Tech-suit",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Glove/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Anti-Prophet",
  "/wiki/Angel_of_Taxations_and_Imports",
  "/wiki/L9-G8",
  "/wiki/Cooking_droid",
  "/wiki/Atmosphere/Legends",
  "/wiki/Breath_mask/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Void_Droid",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Garbage_compactor/Legends",
  "/wiki/Dianoga/Legends",
  "/wiki/Water/Legends",
  "/wiki/Power_plant",
  "/wiki/Teehl",
  "/wiki/Hutt/Legends",
  "/wiki/Needle_ship",
  "/wiki/Tolan_Navy_Yards",
  "/wiki/Imperial_Intelligence_Operations_Center",
  "/wiki/Coronar",
  "/wiki/Datacard/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Nose/Legends",
  "/wiki/Fizz-Pop_Cap_(with_foil_cluster)",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Tin/Legends",
  "/wiki/Brad_Freeman",
  "/wiki/Scavenger_Hunt",
  "/wiki/1989",
  "/wiki/Star_Wars:_The_Roleplaying_Game_(first_edition)",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/John_Robinson",
  "/wiki/Droid/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/2003",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Galaxy_Guide_4:_Alien_Races",
  "/wiki/Rookies:_Rendezvous"
 ]
}