{
 "name": "Spirit_protector",
 "display_name": "Spirit protector",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Alien"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Variable"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Translucent"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Shas Dovos"
     ]
    }
   ]
  }
 ],
 "content": "For more than a thousand years, the malevolent spirit of a long-dead Sith Master served as the protector of an ancient spellbook forgotten within a hidden armory of dark side lore deep in the jungles of the planet Onderon. Several years before the Great Sith War, the book over which the spirit protector maintained stewardship was discovered by a young blacksmith named Shas Dovos. The Sith specter corrupted Dovos and taught its unsuspecting apprentice for more than a decade until finally, under the Master's secret guidance, the blacksmith created a suit of armor imbued with Sith magic. The spirit then revealed itself and its true plan to restore the lost glory of the Sith Empire. It renamed the apprentice Warb Null and descended upon him with the magical armor, binding man to metal through the power of the dark side of the Force.\nThe spirit of a deceased Sith Master resided within the pages of a book of sorcery, to which it was also confined. The object of the spirit's imprisonment was also its charge, and for more than a thousand years it protected the volume from the adversities of time and toil alike. Unable to personally partake in restoration of the fabled Sith Empire of antiquity, the ghost hoped to one day encounter an individual whom it deemed worthy of its power. More than a decade before the Great Sith War, the spirit protector permitted the discovery of its literary accommodation, when a young blacksmithing student named Shas Dovos happened upon the tome in an ancient dark side bunker hidden deep in the jungles of the Inner Rim world of Onderon. Dovos stole the book, and the spirit protector recognized in him the potential to become its unwitting servant.\nFor more than ten years the spirit protector obscured its clandestine exploitation as it taught Dovos—albeit slowly and unconsciously—the intricacies of Sith magic. Nominal amounts of knowledge were imparted in such a manner that Dovos forsook all other aspects of life as he pursued the ancient spirit's wisdom. The protector routinely embellished the apprentice's dreams with suggestions of destined greatness realized through fruit born of his profession and given strength through the rituals of ancient Sith sorcery. Numerous attempts to craft an object of power were met with failure until, on the fourth evening of one such endeavor, the spirit protector's apprentice completed his masterpiece: a blackened suit of armor imbued with the dark side of the Force.\nAt first hesitant to make use of his creation, Dovos' misgivings were quickly eroded by the innuendos of the spirit protector, through whose mental coercion Dovos' confidence in his own fine craftsmanship was restored. Bewildered by the mental intrusion, Dovos cried out as the spirit protector, appearing before him as cinders, confessed its involvement in the blacksmith's affairs since he had found the spellbook in the jungles of his homeworld. With a burst of energy, the spirit protector changed its alien–like shape into that of a fiercely-expressive near-Human; it then advanced upon and commended its terrified thrall for doing exactly as it had commanded. The ability to comprehend the spellbook and the subsequent creation of the armor had been the spirit protector's design all along, and, but for its involvement, the young blacksmith would have been otherwise incapable on all fronts. Nevertheless, the spirit demanded remuneration for its granted endowments; Dovos had to become an extension of its will, to further the protector's agenda where and whence it could not.\nOblivion was the apprentice's expectation, but the spirit protector assured him that destiny had reserved a special place in history for him: Dovos was to participate in the restoration of the long-forgotten Sith Empire. Before he could perform his new task, however, the spirit protector needed to empower Dovos and chose the armor as the means by which he would do so. To symbolize his rebirth, Shas Dovos was renamed by the spirit protector \"Warb Null,\" which it thought suited a being whose new existence was to be an amalgam of flesh and metal. It then swarmed Null and, with the power of Sith magic, bound him to his armor—the crowning achievement of his former existence. Null went on to become a Dark Jedi and was selected to serve as the guardian of another Force entity, the spirit of the long-dead Dark Lord of the Sith Freedon Nadd, in whose name he participated in an attempted revival of Sith prominence, exactly as predicted by the spirit protector.\nThousands of years later, the failed Jedi Padawan Telloti Cillmam'n discovered Null's armor on the planet Nicht Ka. When he tried to take the armor's lightsaber, the suit seemed to come to life and clamped his wrist, and when he finally managed to rip the lightsaber from the suit's grasp, the armor fell over onto the floor. A cloud of bone dust was released into the air, and when Cillmam'n unintentionally breathed it in, he was subjected to visions of the past—memories of a warrior from the time of Adas, as well as Shas Dovos's creation of the armor, his corruption by the spirit protector, and his time as Warb Null. The dark side within the armor corrupted Cillmam'n, leading him to kill his companions and assume the name Malleus.\nThe spirit protector first appeared to Shas Dovos as a hovering gout of predominately red flame, occasionally accented by violent flares of yellow ember. Afterward it assumed the form of an identifiably near-Human guise, clad in long flowing robes, with the hood thrown back to expose an intense demeanor. Always translucent, the Spirit protector increased in size as it moved in the young man's direction, until it seemed as though its mass had taken up the entire room instead of simply moving toward him. The protector restricted knowledge of the existence of its lore book to only those whom it deemed worthy. It chose to guide the hand of Shas Dovos, despite the contempt it initially held for the young man's arrogance, secretly advancing him in power and knowledge while he remained none the wiser. The spirit availed itself of Dovos' metallurgist talents and subtly manipulated him into the creation of what the protector referred to as \"new skin.\" Even then, the spirit chose to reveal itself only after Dovos had proven himself suitable to the protector's purposes. Once visible, the spirit protector became extremely vocal and was moved to fits of sinister laughter at the terror its presence caused Dovos.\nIt was through the power of the spirit protector that the compendium to which it was restricted was able to withstand the ravages of time. Had it not been for its influence, the book would have disintegrated centuries prior to its discovery by Shas Dovos. Well-versed in Sith lore and magic, the spirit protector was also privy to the entirety of the book's secrets, and it refused to share them unless it felt the potential recipient worthy. It foretold Dovos' destiny as a champion in the quest to restore the Sith to galactic importance and was also skilled in the infusion of inanimate objects with dark side energies, knowledge that was imparted to Dovos. The protector was likewise able to permanently clad its apprentice in his magically-empowered armor. The ancient Sith spirit was able to enter minds and influence dreams or even compel beings into action. From bursts of flame to blinding flashes of light, humanoid to alien in likeness, the spirit protector was able to change its size, shape, and appearance at will.\nThe spirit protector was first mentioned in Warb Null's entry in the Tales of the Jedi Companion, a sourcebook for Star Wars: The Roleplaying Game, published by West End Games in August 1996. The protector is only referred to as \"spirit protector,\" \"protector,\" or \"Sith spirit,\" with no definitive specification of species other than \"alien,\" and no gender or name. The spirit protector was later mentioned in the entry for Warb Null in the 2008 release of The Complete Star Wars Encyclopedia.\nIn his personal blog, Star Wars author Edward M. Erdelac noted that the design of Warb Null's battle armor may be seen as an aesthetic allusion to King Adas, an ancient Overlord of Korriban whose story was created by George R. Strayton and developed by Abel G. Peña. For that reason, Erdelac theorizes that the spirit protector may have been that of the Overlord himself, which is why he included a vision of Adas in Hammer, a short story in which a troubled Exploration Corps member discovers and dons Null's armor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Alien/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Warb_Null",
  "/wiki/Standard_year/Legends",
  "/wiki/Force_ghost",
  "/wiki/Death/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Sith_spellbook/Legends",
  "/wiki/Sith_armory",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Onderon/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Metalsmith/Legends",
  "/wiki/Sith_training",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Sith_magic",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Magic",
  "/wiki/The_Force/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Time/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Color/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Near-Human",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Freedon_Nadd",
  "/wiki/Freedon_Nadd_Uprising",
  "/wiki/Force_vision/Legends",
  "/wiki/Malleus",
  "/wiki/Nicht_Ka",
  "/wiki/Duel_on_Nicht_Ka",
  "/wiki/Human/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Tales_of_the_Jedi_Companion",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/August",
  "/wiki/1996",
  "/wiki/Species/Legends",
  "/wiki/Gender/Legends",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars",
  "/wiki/Edward_M._Erdelac",
  "/wiki/King/Legends",
  "/wiki/Adas",
  "/wiki/Overlord",
  "/wiki/Korriban",
  "/wiki/George_R._Strayton",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Hammer_(short_story)",
  "/wiki/Exploration_Corps/Legends",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_147",
  "/wiki/Star_Wars_Insider:_The_Fiction_Collection_Volume_2",
  "/wiki/Tales_of_the_Jedi_(audio)",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Freedon_Nadd_Uprising",
  "/wiki/January_21",
  "/wiki/2014",
  "/wiki/May_9",
  "/wiki/2020",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/StarWars.com"
 ]
}