{
 "name": "Splendid_Ap",
 "display_name": "Splendid Ap",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bedlam Spirit"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Splendid Ap was one of the four Bedlam Spirits that inhabited the region near the Bedlam Pulsar. During the Galactic Civil War, they learned to take on physical forms and encountered Princess Leia Organa on the planet Bedlam, where she had been forced to land by Imperial forces. The spirits called Tilotny and Horliss-Horliss decided to play with Organa and her stormtrooper pursuers, eventually killing them all. After they tired of playing, Tilotny let Splendid Ap clean up the mess; he revived Organa and the stormtroopers but accidentally transported the latter 8,000 years into the past.\nAn omnipotent, transdimensional being, Splendid Ap was one of the Bedlam Spirits who existed in the stark whiteness that digested hyperspace near the Bedlam Pulsar. The spirits were generally non-corporeal beings but when they experimented with time, matter, and space the spirit known as Tilotny discovered how to take on a shape. Splendid Ap and his fellow spirits, Horliss-Horliss and Cold Danda Sine, copied Tilotny's newfound ability and materialized on the planet Bedlam at some point during the Galactic Civil War.\nAs the group discussed their new forms and surroundings, they met Princess Leia Organa, a member of the Alliance to Restore the Republic who had been forced to land on the planet and was being pursued by three Imperial stormtroopers. Tilotny, who believed herself to have created the world around them, claimed to have created Organa and her pursuers too and she and Horliss-Horliss began to play with the lifeforms. Before long, all four of the mortals were dead; Organa's heart was turned to diamond by Horliss-Horliss, while Tilotny crystallized one stormtrooper and merged the other two into a single mass of limbs. Soon tiring of their game, Tilotny, Cold Danda Sine and Horliss-Horliss decided to leave, with Tilotny instructing Splendid Ap to clean up the mess they had made. Splendid Ap restored the beings to life and their original forms but, failing to fully understand time and space, unwittingly sent the stormtroopers 8,000 years into the past.\nDespite his power, Splendid Ap struggled to understand time and space. After taking a physical form for the first time, he managed to produce six copies of himself, failing to understand that there should only be one copy of him at a time. Though he tried his best to overcome his lack of understanding of time when restoring the mortals to life, he accidentally sent the stormtroopers 8,000 years into the past, leaving them stranded on the planet. Splendid Ap was somewhat withdrawn from his peers; he spoke a different language and did not get involved in their discussions on time and space or their interactions with the beings they encountered on the planet. The others looked down on his inability to comprehend time and Tilotny considered him to be stupid. In his corporeal form, Splendid Ap had a conical shape and was pink in color.\nLike the other Bedlam Spirits, Splendid Ap was an omnipotent being, capable of manipulating time and mass, though his poor understanding of such things caused him difficulties when using his powers. An abstract entity by nature, he had the power to take on a physical form and was capable of creating several copies of himself that existed simultaneously. He could also levitate objects and alter the beings he encountered, restoring Organa and the stormtroopers to life and their original forms after they were killed by the others, and was capable of sending them back in time.\nSplendid Ap was created by Alan Moore for the comic story Tilotny Throws a Shape, which was published in the Marvel Comics UK comic book The Empire Strikes Back Monthly 154 in February 1982. Tilotny Throws a Shape was illustrated by John Stokes and was originally published in black and white. It was later colored when reprinted by Dark Horse Comics in 1996's Classic Star Wars: Devilworlds 2, giving Splendid Ap his pink appearance. The character is also mentioned in 2009's The Essential Atlas, which established him as a Bedlam Spirit. Author Joe Bongiorno planned to detail Splendid Ap and the other Bedlam Spirits in a Star Wars Gamer article entitled \"Supernatural Encounters in the Star Wars Universe,\" but the article was never completed after the magazine was canceled.\nWhereas the original comic shows Splendid Ap resurrecting Organa and the stormtroopers after Tilotny refuses, The Complete Star Wars Encyclopedia incorrectly states that Tilotny restored the beings. The error was acknowledged by author Pablo Hidalgo during a ForceCast interview in late 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bedlam_Spirits",
  "/wiki/Gender/Legends",
  "/wiki/Bedlam_Pulsar",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Planet/Legends",
  "/wiki/Bedlam/Legends",
  "/wiki/Mission_to_Bedlam",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Tilotny",
  "/wiki/Horliss-Horliss",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Three_stormtroopers",
  "/wiki/Death/Legends",
  "/wiki/Time_travel/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Time/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Cold_Danda_Sine",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Heart/Legends",
  "/wiki/Diamond/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Language/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Alan_Moore",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tilotny_Throws_a_Shape",
  "/wiki/Marvel_Comics",
  "/wiki/The_Empire_Strikes_Back_Monthly_154",
  "/wiki/February",
  "/wiki/1982",
  "/wiki/John_Stokes",
  "/wiki/Dark_Horse_Comics",
  "/wiki/1996",
  "/wiki/Classic_Star_Wars:_Devilworlds_2",
  "/wiki/2009",
  "/wiki/The_Essential_Atlas",
  "/wiki/Joseph_Bongiorno",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Supernatural_Encounters_in_the_Star_Wars_Universe",
  "/wiki/Pablo_Hidalgo",
  "/wiki/The_ForceCast",
  "/wiki/Category:Images_of_Splendid_Ap",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/November_7",
  "/wiki/2022",
  "/wiki/Star_Wars:_Blogs"
 ]
}