{
 "name": "Spy_189",
 "display_name": "Spy 189",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Proliferan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Proliferan Empire"
     ]
    }
   ]
  }
 ],
 "content": "Spy 189, or Red as he was known to the Rebellion was a Proliferan operative sent by the Proliferan Empire to discover and evaluate other empires near them. During his travels, he learned much about Humans and the Rebellion itself. Due to his orders, he landed on the planet Mandrine at the Rebel base but unfortunately they had all they could handle, and so he was stuck with Kelly Vermillion's group. He was interested in learning anything that he could and, when asked, Kelly informed Captain Scarlet Bloodhawk that he could handle his own in a fight too.\nHe was not a coward, but would use the strategies which were taught to him in training during combat. This would include getting under something  and waylay enemies when they got close. It was virtually impossible to tell much about his emotions as he communicated through body signals which were translated through an electronic device, as was the way with his species. He was also known to misunderstand beings occasionally as he had little knowledge of the intricacies of Galactic languages, often taking slang terms quite literally.\nAfter he left the planet Mandrine with Kelly's group he helped them acquire the Long Shot in the Kessel spice mines, which the group later renamed the Menagerie. Eventually the Rebel Alliance learned of his espionage activities for the Proliferan Empire, and he was imprisoned which was a blow to Kelly, as he trusted Red and believed he could be reformed.\n \"The New Rogues Gallery: Unsung Heroes of the Rebellion\"—Polyhedron 59",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Proliferan",
  "/wiki/Gender/Legends",
  "/wiki/Proliferan_Empire",
  "/wiki/Polyhedron_59",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Human/Legends",
  "/wiki/Mandrine/Legends",
  "/wiki/Kelly_Vermillion",
  "/wiki/Captain/Legends",
  "/wiki/Scarlet_Bloodhawk",
  "/wiki/Kessel/Legends",
  "/wiki/Menagerie",
  "/wiki/Polyhedron",
  "/wiki/The_New_Rogues_Gallery:_Unsung_Heroes_of_the_Rebellion"
 ]
}