{
 "name": "Sskeer",
 "display_name": "Sskeer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.70 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Keeve Trennis"
     ]
    }
   ]
  }
 ],
 "content": "Sskeer was a Trandoshan male Jedi Master of the Jedi Order during the High Republic Era. Gruff and opinionated, Sskeer trained the human Keeve Trennis as his Padawan and served on the Galactic Republic installation of Starlight Beacon in the Outer Rim Territories. Around 232 BBY, Sskeer fought under the the command of his friend and fellow Jedi Master Jora Malli against the Nihil pirates at the Battle of Kur. Sskeer was heavily traumatized by the battle, losing both his left arm and his friend, and it led him to gradually lose his connection to the Force, though his troubles did not stop him from putting Trennis through the Jedi Trials and seeing her achieve the rank of Jedi Knight.\nStruggling with the loss of his connection to the Force, Sskeer had trouble with the temptations of the dark side as he and Trennis investigated attacks by the Nihil and missing colonists on Sedri Minor, where Sskeer was infested by the parasitic plant creatures known as the Drengir. In an effort to understand the new threat, Sskeer embraced the Drengir infection and the new replacement arm it gave him, but nearly lost himself to the influence of the Drengir root-mind until Trennis helped him fight back against it. Using Sskeer's connection to the root-mind, the two were able to locate the Drengir's Great Progenitor on the planet Mulita, and Sskeer himself ripped out the Drengir infestation from his body.\nJoining forces with the Hutt Cartel, Sskeer and a contingent of Jedi under the command of Marshall Avar Kriss laid siege to Mulita, where they defeated the Drengir threat and returned it to hibernation. However, during the battle, the Republic Fair on Valo was attacked by the Nihil, and in the aftermath, Sskeer and Kriss hatched a plan to send Trennis undercover in the Nihil.\nSskeer was a Trandoshan male who served the Jedi Order as a Jedi Master during the High Republic Era, and during his lifetime he was renowned as both a tactician and a scholar. Around 238 BBY, Sskeer took his Padawan Keeve Trennis to Kirima in the Mid Rim Territories, where he tasked her with using the Force to leap across a chasm, though he had to use telekinesis to save her when her attempt left her only partway across the gap. Sskeer was among the Jedi who were stationed aboard the Starlight Beacon, a major space station built by the Galactic Republic to further the settlement of the Outer Rim Territories. Sskeer was assigned to be the aide of Jedi Master Jora Malli, who was intended to be the Marshal of Starlight beacon. Sskeer had also met Malli's Padawan, Reath Silas.\nAround 232 BBY, Sskeer was part of a Jedi contingent under the leadership of Jora Malli, a close friend and fellow Jedi Master, that was sent to confront the pirates known as the Nihil at the Kur Nebula. Sskeer's starfighter canopy was breached in the Battle of Kur, and though he survived, he lost his left arm. though his Trandoshan physiology meant that it would grow back eventually; however, he suffered a greater loss in the death of Malli, at the battle. Sskeer was the one who reported her death. The death of Jora Malli greatly affected Sskeer emotionally, and led him to partially cut himself off from the Force.\nA few weeks after the battle, Sskeer took Trennis in a Jedi Vector to the planet Shuraden for her to undergo the Jedi Trials, though he did not immediately tell her the reason for their visit—nor did he tell he other Jedi aboard the Starlight Beacon where he was going. During a sparring match, Sskeer ambushed Trennis while she was distracted by a local Ximpi named Kanrii, though she successfully defeated him by Force pushing him through a nearby tree. As another test, Sskeer hung a Tythonian pendant from the local rock formation known as the Needles, and charged Trennis with climbing them and retrieving the pendant. However, a swarm of star-locusts known as the ridadi interrupted Trennis's climb and destroyed part of the Needles, leading Sskeer's Padawan to take their starship in an effort to retrieve the pendant from the locust swarm. When he caught up to his Padawan, Sskeer was frustrated to find that she had abandoned it in order to lead the ridadi away from a nearby Ximpi village, and he contacted the Starlight Beacon for replacement transportation, seemingly ignoring her attempts to explain her actions.\nSskeer and Trennis traveled back to the Beacon aboard the Radiant Blessing, but before they arrived they stopped at the moon Wevo in the Haileap system, where they rescued a group that had been stranded there after the bombing of the Steady Wing, a Galactic Republic ship, in a Nihil attack. The passengers included the young Jedi Knight Vernestra Rwoh and Imri Cantaros as well as Honesty Weft, the son of Dalnan Ambassador Weft, and Avon Starros, daughter of Senator Ghirra Starros. Despite her failure to retrieve the pendant on Shuraden, Sskeer deemed Trennis's dedication to saving lives enough to earn her the rank of Jedi Knight, so when they arrived on Starlight Beacon he stood by her side as she was Knighted by Master Avar Kriss, the Marshal of Starlight Beacon. Sskeer attended the dedication ceremony of the Starlight Beacon not long afterwards, standing near Supreme Chancellor Lina Soh, but in the aftermath of the celebration, he retreated to his quarters and screamed in rage and horror at something only he could see.\nLater, sometime after the dedication, in Starlight Beacon's observation chamber, Sskeer approached Vernestra Rwoh, who he could sense was uneasy. Rwoh expressed that she was worried about Imri Cantaros, who had fought Rwoh in anger on Wevo after the loss of his Master, Douglas Sunvale. After that had happened, Cantaros had been withdrawn emotionally and Rwoh feared that the Order would lose him. Sskeer told Rwoh that if she was worried about Cantaros, then she should take him as her Padawan. Rwoh initially rejected this idea, believing she had failed Cantaros in the past, but Sskeer told her that temptation to the dark side was normal and that Imri would not be lost due to \"a series of bad days.\" Sskeer reminded Rwoh that she was the one who helped Cantaros back to the light, and greatly ecouraged her to take him on as her Padawan. Rwoh would follow Sskeer's advice and did take Cantaros to be her Padawan.\nSskeer accompanied Trennis on her first assignment as a Jedi Knight, though he no longer called her by her first name and instead referred to her as \"Knight Trennis.\" Along with the Kotabi bond-twins Terec and Ceret, they investigated a distress call from the Kazlin system, only to find a derelict ship. Trennis sensed survivors with the Force and so the Jedi boarded the ship to search for them. They found the ship filled with poison gas—a tactic they recognized as that of the Nihil—forcing the Jedi to don rebreathers. Sskeer decided that the party should split up and sent Trennis and Ceret to the flight deck while he explored with Terec. After Terec asked more about the Nihil and Sskeer's experience with them, Sskeer began to have flashbacks due to his trauma at the Battle of Kur where he fought the Nihil, causing Trennis to be concerned for him. Soon after, Trennis and Terec discovered a dead Hutt corpse and Sskeer noticed grain on the floor, guessing that it was barley. Just then, Sskeer and Terec were attacked by a lone Nihil marauder, who shot Terec. An enraged Sskeer chased down their foe, but lost them in the fog. Sskeer's anger began to grow even more when he realized that he could not sense the raider with the force. When the raider tried to ambush Sskeer, Sskeer lashed out in anger and quickly slew them, even continuing to slash at the bisected corpse in his rage. When Trennis arrived at the scene, Sskeer lied to her and told her that he couldn't have disarmed the attacker and had no choice but to kill them.\nSskeer reported back to Starlight that they had found no survivors, only an abandoned member of the Nihil, calling them animals that had no honor. Master Kriss warned Sskeer against demonizing their enemies, to which Sskeer responded that he would attempt to find peace through meditation. However, Kriss assigned him and Ceret the task of going to the Sedri system to find the origin of the shipment of Vratixia renanicus, the grain that Sskeer had discovered. Trennis said that she would go with Sskeer, but Sskeer denied her offer and ordered her to stay with Terec on the destroyed ship.\nSskeer and Ceret took a Jedi ship to the Sedri system as Trennis and Terec waited for Kriss to arrive with Jedi Knight Vernestra Rwoh. As they arrived on Sedri Minor, Sskeer was told by a local Artiodac Kalo Sulman that Jedi were not welcome in their independent colony. While he was talking with Sulman, Ceret wandered off into some brush after hearing a noise. When Sskeer realized that Ceret had disappeared, he ran through the brush in a rage in order to find them, slashing through all of the plants with his lightsaber. However all Sskeer found was Ceret's lightsaber sitting in the dirt.\nAfter Ceret's disappearance, Terec began to not act like themself, becoming wild, hostile, shouting seemingly nonsensical things, and frothing at the mouth as they lashed out at Sskeer. Onboard the Ataraxia on Sedri Minor, Sskeer and Master Kriss attempted to subdue and calm Terec, but the two of them were having conflict of their own. When Sskeer called Terec a fool, Kriss pointed out that Sskeer had murdered a NIhil in cold blood and had lost Ceret just minutes after landing on Sedri Minor. This further agitated Sskeer, who told Kriss that she had made mistakes too before he slammed Terec into the wall and declared that the situation was not about him, but about finding out what's happening on the planet.\nLater, after Terec had passed out and Sskeer had and placed them in a hover-stretcher, Sskeer commented to Kriss that he wished they knew what was causing Terec's condition. Kriss told Sskeer that he should know what was causing it: The Dark Side, and that he should have felt it when he first arrived on the planet. But before he could apologize for what he said and did on the ship in the Kazlin System, Master Estala Maru contacted Kriss from Starlight Beacon. As Kriss spoke to Maru, Sulman boarded the Ataraxia asking where Trennis had gone. Kriss agreed to help Sulman look for her and ordered Ssker to stay on the ship and watch Terec, which he reluctantly agreed to. However, while Sskeer watched Terec awoke. Sskeer tried to calm them and center them with the force, but it didn't work and Terec shot spores from their mouth and into Sskeer's causing Sskeer to be infected as he cried out with concern over why he couldn't help Terec with the force.\nSskeer, Ceret, and Terec had been infected and taken over by the Drengir, an ancient race of sentient plant-based amorphous carnivores that wished to consume all life across he galaxy. Sskeer, now under the control of the Drengir, traveled to the underground tunnels on Sedri Minor where Trennis and Kriss were fighting the Drengir and attempting to save Ceret and a boy named Bartol. Drengir vines grew throughout Sskeer's body, and grew him a new arm out of vines in place of the one he had lost. Sskeer confronted Trennis, Kriss, Ceret, and Bartol, and he and the Drengir captured them by tying them up in their vines.\nMaster Kriss attempted to get Sskeer to tell her what was going on, but he grew tired of it and had her mouth covered by a Drengir tentacle. Sskeer declared that it was time for Kriss to listen to the song of the Drengir. He told the group the history of the Drengir: their alliance and later betrayal at the hands of the Sith, their leader's imprisonment on the Amaxine Station by the Sith's totems, and their reawakening due to travelers ending up on the Amaxine station during the Great Hyperspace Disaster. Afterwards, while still captured by Sskeer, Trennis attempted to get through to him, telling him that he was not part of the Drengir and that she still believed in him. With Trennis's support, and his own strength of will, Sskeer broke free from the Drengir's control, revealing that he joined with the Drengir on purpose in order to understand them, and their weaknesses. Sskeer then used the force and his connection to the Drengir to push the monsters to the surface, and thus free Trennis, Kriss, and Ceret, from their grasp. However, the Drengir pulled Bartol up to the surface with them and still had him in their possession. Sskeer apologized to Kriss, and told Trennis that he would talk to her about the pain he was going through in the time since the Battle of Kur. At Kriss' insistence, Sskeer, Trennis, Kriss, and Ceret, began to fight against the Drengir in order to free Bartol from the Drengir's capture, and the group succeeded.\nAfter the rescue, Sskeer, Kriss, and Trennis confronted Kal Sulman. Sskeer insisted that Sulman had known the Drengir had taken root on his planet and started to threaten him. He used the force with his Drengir-vine arm to lift Sulman up and forcibly slam him against the ceiling. Trennis tried to keep Sskeer in control and calm her former master down. But before the interrogation could make any headway, Trennis interrupted the interrogation when she noticed a large vessel descending nearby. When the ship landed Sskeer told Trennis to ignite her saber, and implied that he was expecting a fight. The owners of the ship exited it and revealed themselves to be the Hutt Cartel, lead by the Hutt Myarga the Benevolent.\n\nMyarga revealed that the colonists had signed a contract with the Hutts, which Sskeer recognized to be a protection racket. This made him angry that Kriss was not taking offensive action and only negotiating with Myarga, and so he allowed the Drengir to influence him and used his vine arm to attack Myarga. Kriss told Sskeer to release Myarga, but he didn't listen. Trennis knocked both of them down by knocking them into the side of the Hutt ship. Sskeer exclaimed that he didn't know how to control the Drengir's influence, to which Trennis responded by telling him he didn't have to try on his own and cutting his vine arm in half. But then the Drengir spoke used Sskeer to speak to Trennis, telling her that severing the roots would not stop them and attacking her. The two fought, but Trennis refused to give up on Sskeer, telling him that she still believed in him, which gave Sskeer the strength to resist their influence and regain control.\nSskeer told Trennis that he didn't have much time to talk to her before the Drengir took over his mind again. He revealed that the reason he partially joined with the Drengir was not just because he wanted to find out what the Drengir had planned, but also because his connection to the force was fading. He admitted that because of it he had had no idea the swarm on Shuraden was coming during her trial and couldn't sense the Dark side on Sedri Minor when they arrived. He told Trennis he didn't tell her because he as ashamed and felt like he'd let her down. But before Trennis could say much he informed her that the Drengir were not defeated. He told her the only way to hold them back was to convince the Drengir that all of their meat was spoiled by performing a mind touch on Sskeer since he was connected to the Drengir through their telepathic root system. Trennis reluctantly agreed and performed the mind touch, telling the Drengir that all meat was rotten and unclean and getting them to retreat. This stopped the Drengir's attack on Sedri Minor, as well as their assault on Starlight Beacon, which was occurring concurrently. However, after Trennis completed the mind touch, Sskeer fell into an unconscious and comatose state, as Trennis cried out for him and held him in her arms.\nWhile unconscious, Sskeer was kept in a stasis field aboard Starlight Beacon for several months in order to keep his Drengir infestation under control. During this time, the Jedi Council asked Master Estala Maru to report to them on Sskeer's condition, but when pressed on the subject by Jedi Council member Master Stellan Gios, Maru revealed to him that there had been very little change. While comatose on Starlight Beacon, Sskeer was attended to by the Anacondan doctor Gino'le, who was serving as the Chief of Medical Operations on Starlight Beacon. Gino'le postulated that Sskeer's waning connection to the force was not a physical condition, but instead a crisis of faith.\nAfter Maru ordered Trennis to help Master Kriss in the assault against the Drengir, Trennis, who was attending to Sskeer at the time, Trennis decided to turn off the stasis field in order to reach Sskeer. Sskeer's vine arm grabbed hold of Trennis and traveled up her nose and into her mouth, connecting her to the Drengir's root-mind. Sskeer and Trennis were reunited with each other inside the root-mind, both having a very emotional reaction despite both of them recognizing that as Jedi, that was something they shouldn't do. Trennis wished to continue their conversation about what was ailing him, but Sskeer deflected saying that they should instead try to see what lied at the heart of the Drengir root system. As Sskeer and Trennis attempted to telepathically search for the center of the root-mind, the vines inside of the root system started to grab hold of and squeeze them. The two were not strong enough to fight against them until Master Maru and Jedi archivist OrbaLin arrived to where Sskeer was being held, reached into his and Trennis's minds with the force, and helped them push back against the Drengir root-mind's vines, successfully convincing them to retreat.\nSskeer ordered Trennis to grab onto the retreating vines and did so himself, believing they would pull them to the heart of the root-mind. He was right, and at the center of the root-mind the two found themselves face to face with the Great Progenitor, the oldest and greatest of all Drengir, who had been released from the Amaxine station earlier that year. Trennis attempted to reach into her mind to figure out where she was located, but because of that was stabbed by the Great Progenitor with a vine. Sskeer refused to stand for this, and ripped out his Drengir vine arm, disconnecting himself and Trennis from the root-mind. Because of this, Sskeer believed that they had failed at retreiving the location of the Great Progenitor, but Trennis revealed that she had managed to scratch it on her arm guard while connected to the Progenitor's mind. Trennis scratched the name 'Mulita' which Maru determined to be the name of a system deep within Wild Space. With this location and uncovered, the Jedi were ever closer to defeating the Progenitor and the Drengir.\nAfter the location of the Great Progenitor was discovered, Sskeer accompanied Marshal Kriss to Mulita with a group of Jedi that included OrbaLin, Terec, Ceret, Reath Silas, and Cohmac Vitus. The Jedi were also accompanied by Myarga and the Hutt Cartel due to their newly formed alliance, with Sskeer even riding one of their rancors into battle. However, the Jedi still felt as though they were outnumbered, and Sskeer called Master Maru to get them reinforcements, but Maru inisted that they already sent every Jedi they could muster and could not find more because they were dangerously close to \"stepping on the council's toes.\" The discussion was ended prematurely when the comms network failed, presumably because of the Nihil's efforts during the events of the Republic Fair on Valo.\nDuring the battle, Sskeer expressed to Myarga how he wished he had Trennis by his side in battle. His wish would be granted when Trennis arrived with Jedi Wayseeker Orla Jareni and saved him and Myarga from giant arthropods that the Drengir had weaponized. Trennis attempted to introduce Jareni to Sskeer, but Sskeer revealed that they had known each other a long time ago. Jareni flirted with Sskeer, calling him handsome and calling him by the pet name 'Gwa Culna.' Sskeer, shut it down, telling Jareni not to do that in front of the Hutts. Master Vitus commented that Sskeer and Jareni had been an \"explosive combination\" in the past, and still were.\nLater, Marshal Kriss weaponized her ability to create a telepathic network to connect all of the Jedi on Mulita, including Sskeer, and collectively use the force to cut off The Great Progenitor from the Drengir root-mind. This allowed the Jedi to trap the Progenitor in a stasis field, after which Sskeer declared with relief \"it is finished.\" However, containing the Progenitor was not good enough for Myarga, who wished to kill her instead. Sskeer stood with the other Jedi against Myarga to stop her from killing the Progenitor, as they believed that all life should be protecteed. They successfully coerced Myarga into fleeing, thus ending the Jedi's alliance with the Hutts. But before Sskeer and the Jedi could fully celebrate their victory, they got a communication from Master Maru, who revealed to them that the Nihil were back and had destroyed the Republic Fair on Valo.\nDuring the Jedi and Republic's engagement of the Nihil in the Dreighton Nebula as part of Operation: Counterstrike, which arised as a response to the Nihil attack on Valo, Sskeer had a conflict with Vuman trader Vane Sarpo aboard Starlight Beacon. Sarpo had crates of memorabilia based off of the Jedi—including statuettes of Avar Kriss and models of Jedi Vectors—that he claimed he was attempting to sell on Starlight. Sskeer saw this merchandise as an insult to the Jedi and was enraged by them, angrily ripping open crates and packages of the paraphernalia. He told Sarpo and Starlight Administrator Velko Jahen, who had been sent to assuage the conflict between Sarpo and Sskeer, that they would not be sold on Starlight or anywhere else.\nLater, Sskeer and Starlight Head of Security Ghal Tarpfen investigated Sarpo and discovered that his ship the Rapscallion's Heart had been under survelliance by the Republic Defense Coalition for a long time. This along with Jahen discovering blasters hidden at the bottoms of the crates of merchandise confirmed Sskeer's suspicion: Sarpo had been running weapons for the Nihil.\nSarpo and his partner the Peasle Clune were arrested and detained aboard Starlight. Sskeer discovered Jahen making an unauthorized visit to Sarpo's cell. He assumed that Jahen was attempting to use her and Sarpo's personal history as leverage against Sarpo. Jahen told Sarpo that if he gave them information about the Nihil they would protect him, but he denied this and declared that she, Sskeer, and Starlight would all burn in an attempt to get Sskeer and Jahen to leave. Jahen decided that there was no way she could get through to Sarpo and started to leave, but Sskeer didn't follow. He sensed something in the force that he originally identifed as anger but then realized was fear. Sskeer realized that Clune was unfurling from her ball and ingnited his lightsaber, then ordered the guards to drop the energy field. Velko instead ordered a lockdown, which the guards followed. Blinding light started to emanate from Sarpo's tatoos until there was an explosion that knocked everyone around down and freed many of the prisoners.\nSskeer was pinned to the floor by a Nihil Wookiee and was unable to use the force to recover. While he was down, Clune prodded Sskeer with a stunstick. She revealed that Sarpo's tatoos were laced with ion filaments and were triggered to explode by her using a control bangle she kept hidden by curling up into a ball. Clune revealed that she and the Nihil had forced Sarpo to help them through the tatoos which could also inflict pain upon him, and that Sarpo had said what he did to Sskeer and Jahen earlier so that they would leave and be safe from the explosion. The Nihil had planned to escape after the explosion, but due to Jahen's lockdown order, they were trapped. Clune came into possession of Sskeer's lightsaber when it was found strewn about after the explosion. She ignited it, planning to use it to hold Sskeer and Jahen hostage and cutt off their limbs until she and her compatriots were set free. Clune reached the blade out to Jahen to torture her, but before she could, Clune was shot and killed by Sarpo using Jahen's blaster, which she had lost when trying to fight back against the Nihil in the aftermath of the explosion. Clune's defeat and loss of Sskeer's lightsaber allowed Sskeer and Jahen to break free of and defeat the Nihil that were holding them. Sskeer reclaimed his lightsaber and Jahen took hold of a stunstick, so none of the remaining Nihil dared to attack them.\nLater, Sskeer guarded Sarpo's room in a secure wing of Starlight's medicenter to both prevent Nihil reprisals and make sure he did not try to run away. Sskeer also managed to get Sarpo a pardon for his crimes, which Sarpo thanked him for.\nDuring the Battle of Galov, Sskeer and Keeve Trennis boarded the Relay Post Epsilon One in order to secure it and defend against Nihil attack. The two managed to locate the Chief Technician of the station, Raleigh, and the Station Controller, Macken, who were sheltering, and defeated a Nihil raider who was attempting to break in to where they were hiding. At Raleigh and Macken's request, they used the force to clear the room of the Nihil's toxic gas. But soon after, Master Avar Kriss informed Sskeer and Trennis over comm that they needed to evacuate the station, because the Nihil were launching a wave of scavenger droids to dismantle the it. Sskeer and Trennis followed the instructions and began to search for a way to escape from the station with Raleigh and Macken in tow. When the scavenger droids arrived on the station and began to attack Sskeer and the others in their attempt to destroy the station, Trennis heard a message on a Nihil comm from Storm Tasia telling the Nihil forces to evacuate the station. Trennis realized what this meant and told the others to brace themselves as the station rocked from turbolaser fire from the Lourna Dee. The laser fire caused a hull breach in the station that threatened to pull the four of them out into space. Sskeer, with much effort, used the force to force a hull plate into a position where it would block the breach while Trennis held Raleigh with the force to stop him from being sucked out into space. Finally, after they were safe, Skeer and Trennis took Raleigh and Macken to their vectors and all four of them escaped to the Ataraxia before the station exploded and was thus destroyed.\nHowever, that would not be the end of the battle. Sskeer and Trennis would be part of the party that was sent by Master Kriss to board the Lourna Dee. As they exited the shuttle, Master Kriss felt in the force that there were Nihil nearby. Sskeer ignited his lightsaber while Kriss ordered hiding Nihil, who were Andrik Keller and Tasia, to come out from hiding or face consequences. To Trennis's dismay, Sskeer ignited his lightsaber, telling Trennis that he was adding validity to Kriss's threat. After taking a stim, Keller ran out of hiding and opened fire on the Jedi. After deflecting his blaster bolts for a while, Sskeer became fed up, so he moved the shuttle that Tasia was hiding behind to remove her cover. Sskeer chased after Keller and ordered Trennis to go after Tasia, who was under the shuttle, injured by Kriss deflecting blaster bolts at her leg.\nSskeer caught up to Keller and told him that he should stop running and surrender. But Keller shot at him and ran down the hall towards escape pods, but they were blocked by a collapsed corridor. He tried to crawl through a gap, but Sskeer caught up to him and told him to stop squirming or the metal he was tangled in would cut him. Sskeer pulled Keller's blaster away from him with the force, astounding him. Sskeer performed a mind touch on him, telling Keller to stop struggling so that he could cut him free, and then, still performing the mind touch, told Keller to surrender, which Keller repeated back to him. But before Sskeer could complete that, Lourna Dee charged up behind him and hit him with a vibro-ax. She was a Nihil Tempest Runner who the Jedi mistakenly believed was the Eye of the Nihil. However, she was wearing no armour and no mask, so Sskeer did not recognize her. Sskeer pushed her back into the wall with the force. She threw a flash grenade at him in retaliation. Lourna pushed Keller through the collapsed hallway so that he could prime and escape pod they could both escape in. But Sskeer pulled Dee out through the wreckage, before knocking her to the ground. Sskeer held his lightsaber towards her and in an uncontrolled moment of rage ordered her to stay down as Trennis arrived to the scene. Sskeer expressed to Trennis that for a moment he had been unable the use the force, to which Trennis responded that \"the force was with .\" She told him that he had remembered himself and kept control. She noticed Sskeer was bleeding and became concerned for him. He insisted he was okay, so Trennis turned from him for a second and searched for a pulse on Dee's body, confirming that she was alive. He explained to her what had happened and told her that Keller had ran off through a gap in the collapsed hallway next to him. So after telling Sskeer to stay where he was and that they would get him fixed up, Trennis raced after him, but was unable to catch him. Later, at Starlight Beacon, after the battle was won, Kriss convinced Sskeer to let Doctor Gino'le put him into a bacta tank to recover from his injuries.\nSskeer was present for a meeting between the Jedi of Starlight Beacon, including Marshal Kriss, with Jedi Council Member Master Stellan Gios, in which the defeat of the Nihil at many altercations and the organization's next moves were discussed. At this meeting, Sskeer insulted the Nihil and asked about their leadership. Trennis would get into an argument with Master Gios at the meeting, as she was arguing that the Jedi were not doing enough against the Nihil, a sentiment supported by Sskeer and Kriss. After Trennis stormed off from the meeting, Sskeer informed her about a plan Kriss was developing against the Jedi Council's wishes where Trennis would go undercover alongside Terec within the Nihil. Around this time, Sskeer also suggested to Vernestra Rwoh that she should train with her Padawan Imri Cantaros on Kirima, just like Sskeer did many years before with his then-Padawan Trennis.\nTo execute Kriss's secret plan, Trennis and Terec were put in a Nihil stormship scavenged from the Battle of Grizal, and Sskeer led a drift of Jedi Vectors called Gold Drift to 'attack' the two in a fake space battle. Trennis and Terec then called for help to the Nihil, and were taken in by the Nihil who believed they were their own.\nWhile onboard the Ataraxia which was keeping tabs on the undercover mission, Sskeer recieved a holo-transmission from Doctor Gino'le. Gino'le informed him that he had figured out what was causing him to lose his connection to the force. Gino'le suggested hearing the information in private, but Sskeer insisted on it being said in front of the others. Gino'le told him that he had a trandoshan condition called Magrak Syndrome which causes trandoshans to revert to their primal insticts of agression and rage. His body was subconsciously fighting it, but the effort caused him to slowly lose his connection to the force.\nLater, at a Nihil refinery on the planet Xais, Terec was attacked by the Great Leveler, weaponized by Lourna Dee, and Trennis was overcome by its fear inducing powers. Sskeer watched on as Ceret began to be husked due to their connection to Terec. Sskeer asked Ceret what was happening, and if what they felt was darkness, like the Drengir, but Ceret responded saying that it was not darkness but instead void and nothingness. Ceret would plot the course of the Ataraxia to Xais before they fell into a hibernation trance.\nWhen the Ataraxia arrived on Xais, Sskeer flew a Jedi Vector down near the surface, and expressed his desperation to find Trennis. He noticed some Nihil ships attempting to escape, so he shot them down, ignoring Kriss's earlier orders to only disable not distroy. When Kriss declared it was not the Jedi way, Sskeer declared that he had to use the only way he had left. Sskeer jumped out of his Vector to the surface, and used the force and his lightsaber to kill many Nihil fighters in a moment of rage. Lourna Dee told fellow Tempest Runner Zeetar that they should leave and not try to face Sskeer, having remembered him from their fight during the Battle of Galov and knowing that he was not like the rest of the Jedi. But Zeetar decided to attack Sskeer with projectile weapons from his powersuit, while Dee escaped. Zeetar tried to crush Sskeer with a massive metal hammer while he was down, but Sskeer used the force to throw the hammer out of Zeetar's grasp and then used his lightsaber to cut the legs off of Zeetar's powersuit.\nSskeer threatened Zeetar and demanded to know where Trennis was, until Trennis moved out of the spot she was hiding and called for Sskeer. He ran to her, and she tried to explain what had happened to her. But then she said that they needed to check on Terec. They found Terec in a partially husked state and in a hibernation trance, just like Ceret. Kriss attempted to stop Dee from leaving but failed, and then called the Ataraxia to track Dee's ship. But Sskeer suggested that they instead prioritize seeking help for Trennis and Terec, Kriss snapped at him, saying that he was no longer allowed to advise her after the atrocities he committed when he butchered the Nihil without rhyme or reason. She declared that his actions were not worthy of a Jedi and that she had left him no choice: she forced him to give up his lightsaber and relieved him of his duties as a Jedi pending judgement from the Jedi Council.\nAfter the events on Xais, Trennis eventually visited Sskeer in his quarters on Starlight Beacon. At her wondering, he expressed that Kriss was right in her decision and that he should have shared what was happening to him. When Trennis asked him why he didn't trust her, Sskeer retorted that he trusted her more than anyone else. He then revealed to her that he was suffering from Magrak Syndrome and explained what it was. Sskeer declared that he was a danger because of it, but Trennis refused to believe that, saying he couldn't give up. She also told him that she would need him by her side for when she would go on a mission with Kriss to the Great Hall of the Nihil in No-Space to capture Lourna Dee.\nLater, just as Trennis and Kriss were about to leave for No-Space, Sskeer arrived aboard the Ataraxia, declaring that until the council made a decision, he was still a Jedi, and he would come with them on the mission. Kriss was hesitant, but Trennis vouched for him, saying that she would stop him if he did anything out of line. It worked, and Sskeer left Starlight Beacon for No-Space aboard the Ataraxia with Trennis, Kriss, and her team.\nWhen the Ataraxia arrived at the Great Hall, it fired on the structure immediatley despite not being provoked, which surprised the Nihil and began the factions' battle. The ship docked at the main entrance where Sskeer, Trennis, Kriss, and Goonral Monshi cut their way through the front entrance of the hall and marched through, deflecting the shots of the Nihil. Kriss ordered them to 'take them,' to which Trennis objected to, but while declaring 'For light and life,' Kriss murdered a few Nihil, including Muglan. After Kriss then reflected Tempest Runner Zeetar's flamethrower back at him and thus killed him, Kriss told Sskeer and the others to deal with the stragglers while she went after Dee. But Kriss' behaivor concerned Sskeer, who called out Trennis' name, to which Trennis said she understood and went after Kriss.\nSskeer stayed behind and continued to fight off the Nihil. When Trennis confronted Kriss she reminded the Marshal that she had just taken Sskeer's lightsaber away from killing in cold blood, but added that he had been sick, and asked Kriss what her excuse was for doing the same thing. After on Lourna Dee's order the Nihil ships fired on the Great Hall, Sskeer and Monshi were rocked by an blast that hit them while they were fighting Nihil raiders, one of whom was Quin. While Monshi held on with one of his hands and held the Nihil with the force so that they wouldn't get sucked into space, Sskeer reached controls and activated the Hall's energy fields, keeping them from being sucked out. Sskeer activated his comm to speak with the Ataraxia, and asked why they were firing on the Hall. Nooranbakarakana responded to him, explaining that it had not been the Ataraxia that had fired on the Hall, but the Nihil raiders themselves. The Ataraxia then fired on the Nihil flagship, and informed Sskeer that the ship had been immobilized and that they would recover survivors, to which Sskeer replied that he understood. Monshi replied that he was glad Sskeer did, implying that he did not understand what was going on. Sskeer and Monshi then took the Nihil they saved prisoner and to safety.\nOn the return trip to starlight aboard the Ataraxia, Sskeer and Trennis were stationed on the bridge to watch over the Nihil prisoners. When Kriss sensed that something was wrong, she contacted Sskeer over comm to get the status of the prisoners, and he confirmed that they were secured and assured her that the 'Eye' would not escape that time. Trennis then noticed that Sskeer's arm was bleeding and showed concern. Sskeer explained that it was a shrapnel wound from the battle, and assured her that it would heal in time. Trennis then asked Sskeer if he had time, considering his condition. Sskeer told her that his condition would not change and could not be cured, so no matter what the council would decide it would be his last mission. Trennis didn't want to accept that, but Sskeer reminded her that no one can escape the truth. He also added that there was no better time for it to happen because he had got to see her become the Jedi he always knew she would be.\nSskeer then told Trennis that they should make their way to the flight deck and that the guards could handle it from there. But before they went, Trennis stopped Sskeer and told him that whatever happened, she would make him proud and would be his legacy. But Sskeer declared that that was the last thing she should be, as it wasn't about him, but about her. He insisted that she follow her own path, create her own legacy, and become her own Jedi. He told her that the the greatest reward of every master since before the dawn of the Luminous was to see that happen. That it was the greatest reward of them all. But as Trennis and Sskeer made their way to the flight deck, the Ataraxia was rocked by an explosion.\nStarlight Beacon had exploded, knocking the Ataraxia back in the blast and causing the ship to lose its deflectors and lose power on all of its decks. Jedi Nooranbakarakana confirmed that there had been an explosion in the engineering section and explained that they had no way of knowing what had happened, but also revealed that the station was drifting steadily towards the planet Eiram. Sskeer asked how long it would be until the station entered the planet's atmosphere, and Jedi archivist OrbaLin replied that it would be an hour or longer. Nooran insisted that they find a way to stop the station from moving. Kriss had Nooran bring the Ataraxia alongside the station and extend a docking tube, a difficult maneuver, but one they accomplished.\nKriss ordered OrbaLin to check on the prisoners and told Sskeer, Trennis, Moshi, and Nooran to come with her. Kriss also told them to put on their rebreathers, to which Sskeer and the others obliged. Trennis then noticed that something felt wrong. Sskeer said thaat much was obvious, but Trennis clarified that it was something wrong with the force, telling him that she wished he could feel it, to which he agreed. When the airlock wouldn't respond, Kriss cut a whole in the door with her lightsaber and led Sskeer and the others inside the station. The group of jedi then discovered a horde of people attempting to reach the escape pods to evacuate. Kriss told them not to panic and had Monshi escort them to the Ataraxia where they would be safe.\nAs Monshi led the civilians to the Ataraxia, Sskeer and the rest of the Jedi regrouped at an information panel near the security tower that Nooran accessed. Sskeer attempted to reach Master Maru on comm, telling him that they were on the station, but Nooran revealed to the group that the comms on the entire station were down and that the entire midsection of the station was flooded with radiation, almost completely cutting off the top and bottom halves of the station from each other.\nAfter hearing the situation from Nooran, Sskeer asked Kriss if she had any ideas. She decided that they should focus their energy to helping the people in the top half of the station and then maybe find a way to reconnect the two. She also added that the stabilizers could be operated from the Hub by Maru, but before she could finish, doubled over. Trennis and Nooran were also then immediately overwhelmed with a wave of pure fear and began muttering to themselves as foaming at the mouth. Sskeer asked her what was wrong, as he was not being affected like the others were. But Kriss, her view of the world distorted with horrifying visions, stood in between them, and told Sskeer to stay away from Trennis as well as calling him a monster. Sskeer asked Kriss with confusion what was happening and what she was doing, to which Trennis managed to respond that Kriss was not herself. Trennis explained that it was like what happened on Xais, and that the thing that had attacked her and Terec was now there on Starlight, except now there was a legion of them.\nThe monsters were called the Nameless, and due to his loss of connection to the Force, Sskeer was unaffected by the monsters' presence. Sskeer slashed at the monsters with his lightsaber and managed to scare them off just as small parts of Trennis's face had started to become like a husk. However, he could not prevent Nooranbakarakana from being turned into a husk. After scaring the creatures off, Sskeer yelled at a collapsed Trennis to get up and move. He explained what he had accomplished to her, but told her that the monsters would be back so she needed to go. Kriss agreed with Sskeer, telling Trennis that they should go to the hub to stop the station from crash landing on Eiram's surface. After Kriss revealed Nooran's death to Trennis, Sskeer reminded his former padawan that while Nooran had become one with the Force, she was still alive and could not forget that. He told Trennis that the monsters were not affecting him the way they were them, and that he would hold them back while they left. Trennis refused to leave Sskeer, but he told her that this was the reason the force blessed him with his condition. He told her that it was not the end, and that the two would see each other again. Trennis began to cry, and said Sskeer's name one last time before Sskeer told her to go. As Trennis and Kriss ran off, Sskeer declared that this was the way it was always meant to be. When the monsters returned, Sskeer declared that the force was with him, now and forever, and turned to face the monsters while still wielding his former Padawan's lightsaber.\nSskeer was a Trandoshan male with scaly green skin and yellow eyes. During the Battle of Kur Sskeer lost his left arm, and afterwards had a tiny one regrowing in its place.\nSskeer was brutal and passionate, unafraid to push boundaries within the Jedi Order, but was also deeply caring, especially for his Padawan, Keeve Trennis. He would be hard on her sometimes, but would try to show he cared. Sskeer was known to be no-nonsense; Padawan Reath Silas believed that if Sskeer said something was true, it was true. Sskeer was not afraid to insult and demonize his enemies, though Jedi were not supposed to. He often insulted the Nihil. Sskeer was easy to anger, especially for a Jedi, even yelling and ripping apart boxes that belonged to Vane Sarpo, who was attempting to sell toys of the Jedi that he saw as an insult. This also showed another key trait of Sskeer's: he was very proud. Sskeer cared about how he was percieved, especially to those of whom he valued their opinion. He suffered from severe post-traumatic stress after the Battle of Kur and was afraid to talk to Trennis about his conditions and the trauma and feelings he was feeling because he did not want her to think less of him.\nSskeer was deeply trusting of Trennis, but much less trusting of himself. His anger would cause him to have moments where he would lose control and cause him to descend into uncontrollable and even sometimes murderous rage. Sskeer admitted to Trennis that he was ultimately afraid of hurting those he cared about by losing control.\nSskeer was trained as a Jedi, and could tap into the Force for many tasks. He was able to telekinetically move objects and telepathically sense danger and feel others' emotions. Unusually, Sskeer tapped into the Dark side, and did so holistically when he was connected to the Drengir root-mind. He also gained the ability manipulate Drengir vines while connected to the root-mind.\nLike all Trandoshans, Sskeer had the ability to regrow lost limbs. Sskeer was also skilled with a lightsaber and was very knowledgeable about lightsaber combat forms. Sskeer was also able to pilot several types of ships, including the Jedi Vector, a highly dangerous starship that only a skilled Force-sensitive could properly operate.\nHowever, Sskeer would eventually begin to lose his connection to the Force due to a Trandoshan condition called Magrak Syndrome which caused Trandoshans to revert to their more primal insticts of rage.\nSskeer carried a blue single-bladed lightsaber. It had a gold and bronze hilt with a prominent knuckle guard protruding from it and a red emitter button. Additionally, he carried a rebreather for situations when air was toxic. He also flew a Jedi Vector.\nSskeer is a character created for the Star Wars: The High Republic publishing program who features in the Marvel Comics series of the same name, written by Cavan Scott. Scott was inspired to create Sskeer by early concept art drawn by Phil Noto that featured a Trandoshan. In the 2021 audio drama The High Republic: Tempest Runner, Sskeer was voiced by Marc Thompson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Keeve_Trennis",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Human",
  "/wiki/Padawan",
  "/wiki/Galactic_Republic",
  "/wiki/Starlight_Beacon",
  "/wiki/Outer_Rim_Territories",
  "/wiki/232_BBY",
  "/wiki/Jora_Malli",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Battle_of_Kur",
  "/wiki/Limb",
  "/wiki/The_Force",
  "/wiki/Jedi_Trials",
  "/wiki/Jedi_Knight",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sedri_Minor",
  "/wiki/Mission_to_Sedri_Minor",
  "/wiki/Drengir",
  "/wiki/Great_Progenitor",
  "/wiki/Planet",
  "/wiki/Mulita",
  "/wiki/Hutt_Cartel",
  "/wiki/Jedi",
  "/wiki/Marshall",
  "/wiki/Avar_Kriss",
  "/wiki/Assault_on_Mulita",
  "/wiki/Republic_Fair",
  "/wiki/Valo",
  "/wiki/Attack_on_Valo",
  "/wiki/238_BBY",
  "/wiki/Kirima",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Telekinesis",
  "/wiki/Space_station",
  "/wiki/Marshal",
  "/wiki/Reath_Silas",
  "/wiki/Kur_Nebula",
  "/wiki/Starfighter",
  "/wiki/Death",
  "/wiki/Standard_week",
  "/wiki/Jedi_Vector",
  "/wiki/Shuraden",
  "/wiki/Ximpi",
  "/wiki/Kanrii",
  "/wiki/Force_push",
  "/wiki/Tythonian_pendant",
  "/wiki/Needles",
  "/wiki/Star-locust",
  "/wiki/Ridadi",
  "/wiki/Starship",
  "/wiki/Unidentified_Ximpi_city",
  "/wiki/Radiant_Blessing",
  "/wiki/Moon",
  "/wiki/Wevo",
  "/wiki/Haileap_system",
  "/wiki/Steady_Wing",
  "/wiki/Attack_on_the_Steady_Wing",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Imri_Cantaros",
  "/wiki/Honesty_Weft",
  "/wiki/Dalnan",
  "/wiki/Ambassador",
  "/wiki/Weft",
  "/wiki/Avon_Starros",
  "/wiki/Senator",
  "/wiki/Ghirra_Starros",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Douglas_Sunvale",
  "/wiki/Kotabi",
  "/wiki/Bond-twins",
  "/wiki/Terec",
  "/wiki/Ceret",
  "/wiki/Kazlin_system",
  "/wiki/Breath_mask",
  "/wiki/Hutt",
  "/wiki/Sedri_system",
  "/wiki/Vratixia_renanicus",
  "/wiki/Artiodac",
  "/wiki/Kalo_Sulman",
  "/wiki/Ataraxia",
  "/wiki/Hover-stretcher",
  "/wiki/Estala_Maru",
  "/wiki/Bartol",
  "/wiki/Sith",
  "/wiki/Amaxine_space_station",
  "/wiki/Binding_statues",
  "/wiki/Amaxine_warriors",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Hutt_Clan",
  "/wiki/Myarga",
  "/wiki/Mind_trick",
  "/wiki/Assault_on_Starlight_Beacon",
  "/wiki/Stasis_field",
  "/wiki/Jedi_Council",
  "/wiki/Stellan_Gios",
  "/wiki/Anacondan",
  "/wiki/Gino%27le",
  "/wiki/Jedi_archivist",
  "/wiki/OrbaLin",
  "/wiki/Mulita_system",
  "/wiki/Wild_Space",
  "/wiki/Rancor",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Wayseeker",
  "/wiki/Orla_Jareni",
  "/wiki/Arthropod",
  "/wiki/Engagement_in_the_Dreighton_Nebula",
  "/wiki/Dreighton_Nebula",
  "/wiki/Operation:_Counterstrike",
  "/wiki/Vuman",
  "/wiki/Merchant",
  "/wiki/Vane_Sarpo",
  "/wiki/Administrator",
  "/wiki/Velko_Jahen",
  "/wiki/Head_of_Security",
  "/wiki/Ghal_Tarpfen",
  "/wiki/Republic_Defense_Coalition",
  "/wiki/Blaster",
  "/wiki/Peasle",
  "/wiki/Clune",
  "/wiki/Prison",
  "/wiki/Wookiee",
  "/wiki/Medcenter",
  "/wiki/Battle_of_Galov",
  "/wiki/Relay_Post_Epsilon_One",
  "/wiki/Raleigh",
  "/wiki/Macken",
  "/wiki/Salvage_droid",
  "/wiki/Storm_(rank)",
  "/wiki/Tasia",
  "/wiki/Turbolaser",
  "/wiki/Lourna_Dee_(cruiser)",
  "/wiki/Andrik_Keller",
  "/wiki/Lourna_Dee",
  "/wiki/Vibro-ax",
  "/wiki/Tempest_Runner",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Stormship",
  "/wiki/Battle_of_Grizal",
  "/wiki/Skirmish_in_the_Soola_system",
  "/wiki/Space_warfare",
  "/wiki/Hologram",
  "/wiki/Magrak_Syndrome",
  "/wiki/Great_Leveler",
  "/wiki/Void",
  "/wiki/Zeetar",
  "/wiki/Power_armor",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/No-Space",
  "/wiki/Battle_for_No-Space",
  "/wiki/Goonral_Monshi",
  "/wiki/Muglan",
  "/wiki/Quin",
  "/wiki/Nooranbakarakana",
  "/wiki/Eiram",
  "/wiki/Nameless",
  "/wiki/Eye",
  "/wiki/Lightsaber_combat",
  "/wiki/Force-sensitive",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_The_High_Republic_(Marvel_Comics_2021)",
  "/wiki/Cavan_Scott",
  "/wiki/Phil_Noto",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Marc_Thompson",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_The_Great_Jedi_Rescue",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/The_High_Republic:_A_Test_of_Courage_(audiobook)",
  "/wiki/The_High_Republic_(2021)_1",
  "/wiki/The_High_Republic_(2021)_2",
  "/wiki/The_High_Republic_(2021)_3",
  "/wiki/The_High_Republic_(2021)_4",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/The_High_Republic_(2021)_6",
  "/wiki/The_High_Republic_(2021)_7",
  "/wiki/The_High_Republic_(2021)_8",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Starlight:_Past_Mistakes",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Insider_206",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/Obi-Wan_5",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Sskeer",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/The_High_Republic_1_Behind-the-Scenes_Exclusive",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY",
  "/wiki/Galactic_standard_calendar",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/230_BBY",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/File:ScottSskeer.png"
 ]
}