{
 "name": "Ssoh",
 "display_name": "Ssoh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Trandosha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Slaver"
     ]
    }
   ]
  }
 ],
 "content": "Ssoh was a Trandoshan slaver, whose name in Dosh meant \"Stealth\".\nSsoh was a Trandoshan slaver and was once the captain of his own ship. He mainly trafficked in Wookiees, selling them to Commander Pter Nyklas and the Galactic Empire. In order to contain the Wookiees within the ship, he placed rival clans in the same cage to ensure that they would fight amongst themselves, rather than try to escape.\nThe warrior Chewbacca was sold to him by a Wookiee named Tvrrdko, who had a grudge against Chewbacca for killing his son, Tojjevvuk. While transporting captive Wookiees in his ships cells, Chewbacca aided them with tools for unlocking their shackles and cell doors, and the prisoners broke out, fighting through Ssoh's Trandoshan crew to claim the ship.\nChewbacca came upon Ssoh and proceeded to rip all four of his limbs from their sockets.\nSsoh miraculously escaped the mauling with his life, and eventually took up residence on a backworld, and regularly visited a local cantina, where he frequently drank liquor to numb the excruciating pain that still reverberated from his devastating beating.\nSsoh earned drinks from listeners impressed with his anecdote of his encounter with Chewbacca, and claim of being the only Trandoshan to have ever survived a one-on-one fight with the Wookiee.\nSsoh's ability as a Trandoshan to regenerate his limbs proved useful, but after more than 20 years since losing his limbs, the regenerated replacements were still very thin and frail in appearance. Ssoh's estimation of the pain level accompanied by their regeneration was that of \"seven hells\".\nR2-D2 and C-3PO interviewed Ssoh sometime after Chewbacca's death, which occurred in 25 ABY, for a project that honored the great Wookiee warrior.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandosha/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Dosh/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Pter_Nyklas",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Tvrrdko",
  "/wiki/Tojjevvuk",
  "/wiki/Limb/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Chaos/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Death/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Chewbacca_(2000)_2",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blood_Feud!",
  "/wiki/Star_Wars_Insider_124",
  "/wiki/Star_Wars:_Chewbacca_(Dark_Horse)"
 ]
}