{
 "name": "Sssp",
 "display_name": "Sssp",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 14 BBY and 12 BBY Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mustafarian"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kkkt's clan"
     ]
    }
   ]
  }
 ],
 "content": "Sssp was a Northern Mustafarian who lived on Mustafar during the Imperial Era. During that time, Sssp was part of a scouting group sent to investigate a nearby crash site their clan leader, Father Kkkt, was anxious about. There the group met the Sith Lord Darth Vader, who held with him the possessed Mask of Lord Momin. The Dark Lord attacked the Mustafarians, and Sssp was captured to be used as a host body for the spirit of Darth Momin. Following one of Momin's failures, Vader killed the Sith's host body as punishment, killing Sssp and leaving the two Sith Lords in need of a new body.\nSssp was a Northern Mustafarian who was a member of a clan on Mustafar that was led by Father Kkkt. Around 14 BBY, Father Kkkt and another Mustafarian, Zzzs, witnessed a burning fire crashing down onto their planet. Concerned, Kkkt sent Sssp, Bbbl, Rrrn, and another Mustafarian to investigate the site and report back. Unbeknownst to the clan leader, the fire he witnessed was in fact the burning ship of the Sith Lord Darth Vader, who planned to use Mustafar as the site for his fortress.\nTo the Mustafarians' curiosity, their search turned up no evidence of a crash. Sssp concluded that the debris must have landed in one of the lava flows and dissolved. Sssp stated the the minerals from the dissolved debris would eventually be harvested, and that the group should report back to Father Kkkt empty handed. Before the group could make their return trip, however, they were faced with the Sith Lord Darth Vader and the Mask of Lord Momin. Bbbl was immediately killed alongside the fourth Mustafarian of the group, while Rrrn made his escape on a lava flea. Sssp was taken hold of by the Dark Lord and was forced to wear the Mask of Lord Darth Momin, allowing the ancient Sith to possess Sssp's body.\nAs the host of the Sith Lord Momin's spirit, Sssp had no control over his own body. Momin used his new body to develop the design plans for the fortress Vader and Momin were planning to build over a Sith cave located on the Gahenn Plains. The fortress was meant to tap into the Dark Side locus present in the Sith cave, and open a door through The Force that would return to Vader his deceased wife.\nMomin's design proved to be a failure, after Vader's attempt to open the doorway resulted in the fortress' destruction. Momin redesigned the structure four more times, each yielding the same catastrophic result. By the fifth failure Vader had grown frustrated with the Sith spirit, and as punishment killed Momin's host body along with Sssp, leaving Momin in pain and without a host.\nSssp was a Nothern Mustafarian who was a member of Father Kkkt's clanhold. Like most Northern Mustafarians, Sssp towered over most Southern Mustafarians. Sssp was skeptical of Kkkt's claims of a fiery crash, and was quick to atribute Kkkt's claims as paranoia when no evidence of a crash was found.\nLike any other Mustafarian, Sssp wore armor and a breath mask as protection against Mustafar's heat. Sssp carried a Mustafarian blaster rifle and rode a lava flea during the search for Vader's ship.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/14_BBY",
  "/wiki/12_BBY",
  "/wiki/Mustafar",
  "/wiki/Mustafarian",
  "/wiki/Northern_Mustafarian",
  "/wiki/Kkkt%27s_clan",
  "/wiki/Imperial_Era",
  "/wiki/Time",
  "/wiki/Father_(title)",
  "/wiki/Kkkt",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mask_of_Lord_Momin",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Skirmish_on_Mustafar",
  "/wiki/Darth_Momin",
  "/wiki/Sith",
  "/wiki/Zzzs",
  "/wiki/Planet",
  "/wiki/Bbbl",
  "/wiki/Rrrn",
  "/wiki/Naboo_Royal_Starship",
  "/wiki/Fortress_Vader",
  "/wiki/Magma",
  "/wiki/Lava_flea",
  "/wiki/Sith_cave",
  "/wiki/Gahenn_Plains",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/The_Force",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Southern_Mustafarian",
  "/wiki/Breath_mask",
  "/wiki/Mustafarian_blaster_rifle",
  "/wiki/Darth_Vader_(2017)_22",
  "/wiki/Darth_Vader_(2017)_23",
  "/wiki/Darth_Vader_(2017)_24",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Death",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Template:DVDLotS18",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Fortress",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Darth_Vader_(2017)_21",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know"
 ]
}