{
 "name": "Stallo",
 "display_name": "Stallo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray",
      "with black beard"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  }
 ],
 "content": "Stallo was a human male who resided on the planet Carajam between 2 BBY and 4 ABY. He fought against the gang known as the Xan sisters and received a bounty on his head under the alias of \"Tal Joben.\" At one point, the bounty hunter Boba Fett claimed the bounty on the criminal Zingo Gabnit, inadvertantly saving the village where Stallo's sister lived. Stallo therefore asked Fett for his aid in fighting the Xan sisters, but the bounty hunter recognized Stallo as Tal Joben and held him at blaster-point.\nStallo was a human male who lived on the Outer Rim Territories planet Carajam. He took up the task of dealing with the Xan sisters and their criminal associates who were terrorizing local farms, killing two of them. Stallo had a dead or alive bounty posted for him by the Bounty Hunters' Guild, listed under the name Tal Joben. He had a sister who lived in a village on Carajam, and between 2 BBY and 4 ABY, the village was held hostage by Zingo Gabnit, an associate of the Xan sisters who was trying to set a trap for the bounty hunter Boba Fett. Ultimately, Fett freed the villagers and killed Gabnit, dragging his body into a town to receive his reward. Word of Fett's actions had already reached the town, so Stallo was quick to recognize the bounty hunter and thanked him for saving his sister's life, leading others in the crowd to do the same.\nTo Stallo's confusion, Fett wordlessly continued to drag Gabnit's body into a cantina. While the body was handed over to an agent of the Bounty Hunters' Guild, Stallo followed Fett and asked if he could have his help in fighting the Xan sisters. He informed him of their actions and that he had killed two of them, but Fett continued to ignore him. The Guild agent warned Stallo that the Xan sisters had allies within the Galactic Empire and that he could face trouble if he continued to pursue them. Stallo begged for Fett's help again, believing him to be a hunter of the wicked. At that point, Fett noticed a hologram advertising the bounty for Stallo, and responded that he only hunted bounties as he turned to point his blaster at Stallo.\nStallo fought against the Xan sisters because they were terrorizing farms on Carajam. He knew he was not capable of defeating them by himself and appealed for Boba Fett's aid, mistakenly believing that Fett shared his values. He continued to ask for Fett's help even when warned of the Xan sisters' Imperial connections. Stallo had tan skin, gray eyes, and graying hair with a black goatee. He also had a long scar running across the right side of his face.\nStallo was able to kill two members of the Xan sisters' organization but acknowledged that he was incapable of battling them further by himself.\nStallo wore a gray shirt with a neckscarf, brown pants, a satchel, and a belt. He also carried a rifle strapped to his back.\nStallo appeared in the one-shot comic Age of Rebellion - Boba Fett 1, published by Marvel Comics on May 8, 2019. The comic was part of the Age of Rebellion miniseries, written by Greg Pak, and pencilled by Marc Laming.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bounty",
  "/wiki/Racer",
  "/wiki/Thall_Joben",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Carajam",
  "/wiki/2_BBY",
  "/wiki/4_ABY",
  "/wiki/Xan_sisters",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Zingo_Gabnit",
  "/wiki/Unidentified_village_(Carajam)",
  "/wiki/Stallo%27s_sister",
  "/wiki/Hunting",
  "/wiki/Blaster",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Farm",
  "/wiki/Death",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Showdown_on_Carajam",
  "/wiki/Unidentified_town_(Carajam)",
  "/wiki/Cantina",
  "/wiki/Unidentified_Bounty_Hunters%27_Guild_agent",
  "/wiki/Galactic_Empire",
  "/wiki/Hologram",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Rifle",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Age_of_Rebellion_-_Boba_Fett_1",
  "/wiki/Marvel_Comics",
  "/wiki/May_8",
  "/wiki/2019",
  "/wiki/Star_Wars:_Age_of_Rebellion_(comic_series)",
  "/wiki/Greg_Pak",
  "/wiki/Marc_Laming",
  "/wiki/Category:Images_of_Stallo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}