{
 "name": "Stass_Allie",
 "display_name": "Stass Allie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tholoth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Saleucami"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tholothian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Indigo"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Circle of Jedi Healers",
      "Medical Corps",
      "Jedi assault team",
      "Jedi High Council",
      "Circle of Jedi Healers",
      "Medical Corps",
      "Jedi assault team",
      "Jedi High Council",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Stass Allie, a Force-sensitive Tholothian female, was a Jedi Master who lived during the final years of the Galactic Republic. She was also the cousin of Jedi Master and Jedi High Council member Adi Gallia. Allie became a Jedi General in the Grand Army of the Republic and gained a seat on the High Council of the Jedi Order late in the Clone Wars when Gallia was killed.\nAllie would not serve long before her demise on the planet Saleucami during the waning hours of the Clone Wars. Having received the command to execute Order 66 from Supreme Chancellor Sheev Palpatine, Clone Commander CC-8826 and another clone trooper opened fire on their general from their speeder bikes, killing her instantly.\nStass Allie was born on Tholoth prior to the Separatist Crisis. She was the cousin of Jedi Master Adi Gallia, who was born into a high-ranking diplomatic family on Coruscant. Allie was found to be Force-sensitive and brought to the Jedi Temple on Coruscant to start her Jedi training. She specialised in the art of healing, which would become an invaluable resource in the bloody years-long clone war. Like her cousin, Allie would also become a consular and rising star diplomat. She was eventually granted the title of Jedi Master, and became a member of the Circle of Jedi Healers, in addition to serving as an overseer of the Medical Corps.\nAllie was present in Supreme Chancellor Palpatine's office along with other senators and Jedi as the issue of whether Palpatine should take emergency powers was debated.\nAfter the Jedi Council received word that Senator Padmé Amidala, Jedi Anakin Skywalker and Obi-Wan Kenobi had been captured by the the leaders of the Confederacy of Independent Systems and the Geonosians resulting in a sentence to death, Stass Allie was recruited and joined Mace Windu's Jedi Strike team sent to rescue them. She and her fellow Jedi fought valiantly in the Petranaki Arena against the Separatist Droid Army. Most of the Jedi were killed in the ensuing battle, though Allie and others managed to survive long enough for the new clone army to arrive, which had arrived to escort the remaining Jedi off the planet or to lead the wider battle on the planet aboard Republic gunships. She and Bultar Swan, who she had been fighting back to back with, boarded the same gunship and were brought to the desert plain where the battle had spread to. The two shared a nod before they both charged forward to continue fighting the Separatist Droid Army.\nOver the course of the Clone Wars, Allie continued to hone her healing skills even while deployed as a Jedi General, though her diplomatic skills were tested as the Separatist threat loomed.\nAfter Jedi Master Adi Gallia was killed on Florrum, the Jedi Council gave Allie her cousin's seat and the title of Jedi Master.\nBy 19 BBY, Council member Stass Alliewas present in the infamous session when Anakin Skywalker was granted a seat as the Supreme Chancellor's representative member and denied Masterhood status and later seen in a hologram meeting when Yoda was sent to Kashyyyk and Obi-Wan Kenobi to Utapau.\nNear the end of the Clone Wars and in the days after the Battle of Coruscant, Allie was assigned to bring reinforcements to the active battlefield that was Felucia. After leaving Coruscant, she was then reassigned to a mop up operation on Saleucami with the mission of locating materials and information leftover after the Siege of Saleucami. She was accompanied by the 91st Mobile Reconnaissance Corps commanded by the clone commander Neyo. Unknown to Allie or any of the other Jedi, the clones had been programmed with inhibitor chips, which forced them to comply with the execution of Order 66, which meant the extermination of all the Jedi across the galaxy.\nAs the Order was played on their commlinks, Allie, along with Neyo and another clone trooper, were patrolling the bleak and barren landscape of the war-torn planet on BARC speeders in a mop up operation. She was completely caught off guard as Neyo and his wingman fell back behind her and fired upon her speeder repeatedly without hesitation. She was killed instantly as the speeder exploded and was blasted to pieces.\nStass Allie was a tall, stern woman with indigo eyes and dark skin with green patches. Her brown, scaled headdress tapered to a point, with eight pale, fleshy tendrils hanging down her back.\nStass Allie was talented at lightsaber combat and was one of the few survivors of the Battle of Geonosis, the opening battle of the Clone Wars. While her swordsmanship was impressive, her talent for Force healing was more so. She passed down this skill to other Jedi, including Barriss Offee.\nStass Allie had a green bladed lightsaber that she used during the Battle of Geonosis. She also wore tall travel boots, a utility belt, a gray tunic with dark robes, and adorned her head with a cultural headdress consisting of a brown scaled cranium betraying a dangle of eight limp, pale tendrils like hair towards her back and laced with a basic web of thin chains and a brown fabric band which framed her face.\nThe creation of the character of Stass Allie is in many ways a retcon that took place prior to the release of any Attack of the Clones products. The filmmaker intended to use the majority of Jedi High Council members in the film's climactic Battle of Geonosis; however, because most of the film was shot in Australia instead of England, local model Lily Nyamwasa replaced Gin Clarke, who portrayed Adi Gallia in Star Wars: Episode I The Phantom Menace. She filmed all of her scenes wearing Adi Gallia's costume, but the filmmakers eventually realized that she looked too different from Clarke's version of the character, so they created a new character for the film, who became known as Stass Allie.\nAfter the death of Adi Gallia in The Clone Wars, in January 2013 the supervising director for the series, Dave Filoni, stated that the animation team had created a character model for Stass Allie, and that she was to appear in the show in a later season. This never happened, however, before the show was initially cancelled as a result of The Walt Disney Company's purchase of Lucasfilm.\nRevenge of the Sith depicts Anakin Skywalker to be the one to utter the line \"A partial message was intercepted in a diplomatic packet from the chairman of Utapau.\" However, Star Wars: The Prequel Trilogy – A Graphic Novel mistakenly depicts Allie as the one to have said the line.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Stass_Allie",
  "/wiki/Stass_Allie/Legends",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Yoda_and_Other_Users_of_the_Force",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Stass_Allie",
  "/wiki/Tholoth",
  "/wiki/19_BBY",
  "/wiki/Saleucami",
  "/wiki/Tholothian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Circle_of_Jedi_Healers",
  "/wiki/Medical_Corps",
  "/wiki/Jedi_assault_team",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Republic_Era",
  "/wiki/Standard_year",
  "/wiki/Adi_Gallia",
  "/wiki/Jedi_General",
  "/wiki/Clone_Wars",
  "/wiki/Planet",
  "/wiki/Standard_hour",
  "/wiki/Cloning",
  "/wiki/Order_66",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Clone_Commander",
  "/wiki/CC-8826",
  "/wiki/Clone_trooper",
  "/wiki/Coruscant",
  "/wiki/Overseer_(assignment)",
  "/wiki/Emperor%27s_office",
  "/wiki/Senator",
  "/wiki/Jedi",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Anakin_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Geonosian",
  "/wiki/Death",
  "/wiki/Mace_Windu",
  "/wiki/Petranaki_Arena",
  "/wiki/Separatist_Droid_Army",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Bultar_Swan",
  "/wiki/Gunship",
  "/wiki/Florrum",
  "/wiki/Hologram",
  "/wiki/Utapau",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Felucia",
  "/wiki/Siege_of_Saleucami",
  "/wiki/91st_Mobile_Reconnaissance_Corps",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/The_galaxy",
  "/wiki/Comlink",
  "/wiki/BARC_speeder",
  "/wiki/Eye",
  "/wiki/Lightsaber_combat",
  "/wiki/Force_healing",
  "/wiki/Barriss_Offee",
  "/wiki/Stass_Allie%27s_lightsaber",
  "/wiki/Boot",
  "/wiki/Utility_belt",
  "/wiki/Jedi_robes",
  "/wiki/Retcon",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Lily_Nyamwasa",
  "/wiki/Gin_Clarke",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Duel_in_Palpatine%27s_office",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Yoda",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Oppo_Rancisis",
  "/wiki/Kit_Fisto",
  "/wiki/Coleman_Kcaj",
  "/wiki/Shaak_Ti",
  "/wiki/Eeth_Koth",
  "/wiki/Agen_Kolar",
  "/wiki/Depa_Billaba"
 ]
}