{
 "name": "Stavin_Thaal",
 "display_name": "Stavin Thaal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Carida"
     ]
    },
    {
     "name": "Born",
     "values": [
      "18 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Extremely tall"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tanned"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Vocabulator implanted in his throat"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Caridan Military Academy",
      "Caridan Military Academy",
      "New Republic",
      "Pop-Dogs",
      "Pop-Dogs",
      "Galactic Alliance",
      "Galactic Alliance Army",
      "Galactic Alliance Army",
      "Imperial-Alliance conspiracy"
     ]
    }
   ]
  }
 ],
 "content": "General Stavin Thaal was a male Human who served as the Chief of Army Operations of the Galactic Alliance Army in 44 ABY and was covertly a member of the Imperial-Alliance conspiracy. After an assassin had slashed Thaal's neck and left a scar, he was unable to speak with his own voice, so he used a vocabulator implanted in his throat.\nDuring the Galactic Civil War, Thaal served as a small-units instructor for the Galactic Empire at the Caridan Military Academy. When the planet was destroyed in 11 ABY by Jedi apprentice Kyp Durron, who turned Carida's sun into a supernova using the Sun Crusher, Thaal was one of the last of the officers to evacuate. Soon after this event, Stavin Thaal defected to the New Republic, integrating into its army.\nIn 12 ABY, Thaal, then a captain, married his first wife, Zehrinne.\nWhen the Yuuzhan Vong conquered Coruscant in 27 ABY, Colonel Thaal, who was stationed on the fallen planet, volunteered to lead a unit of elites on Vandor-3. Calling themselves the Pop-Dogs, Thaal and his men reported on the extra-galactic conquerors movements in the system and launched raids during the rest of the war. After the the Yuuzhan Vong defeat, Thaal was promoted to General for his heroic actions.\nIn 44 ABY, as a member of the Imperial-Alliance conspiracy, he planned to overthrow the governments of the Galactic Alliance and Empire, together with Haydnat Treen, Merratt Jaxton, Drikl Lecersen, and others. When the conspiracy fell apart due to its discovery by Natasi Daala and the secret manipulations of Abeloth and the Lost Tribe of Sith, Thaal arranged for the murder of many of the conspirators. He personally forced Jaxton to commit suicide.\nSeveral months after the death of the conspiracy, Thaal came under suspicion for his involvement thanks to fellow ex-conspirator Borath Maddeus, who was the head of the Galactic Alliance Security. Maddeus hired Garik \"Face\" Loran to reassemble Wraith Squadron in order to prove Thaal's guilt and bring him to justice. Loran however was suspicious of Maddeus, and secretly assembled two Wraith Squadrons, one led by Bhindi Drayson and the other led by Sharr Latt, to look into Thaal's guilt while Loran himself, while also helping the Wraiths, would determine Maddeus's guilt.\nThaal meanwhile, was planning to retire from the service and change his identity into that of Thadley Biolan. He had infamous identity forger Usan Joyl and his grandson Dashan kidnapped and imprisoned in one of the cells of the basement of the Caridan animal exhibit on Vandor-3 that Thaal secretly owned. Thaal underwent gene therapy facilitated by the elder Joyl so that his transformation into Biolan would be completely convincing. Thaal had this done to many other Pop-Dogs who were loyal to him as well, and had both his and their personal histories completely altered. Thaal planned to retire to the world of Kuratooine so that he could marry famous pop singer Ledina Chott. In the meantime, he was still publicly upholding his true identity by applying makeup that would make him still appear to be Stavin Thaal rather than Thadley Biolan.\nWhen Thaal returned to Vandor-3 to investigate the escape of a group of unknown hostiles from Mount Lyss Meteorological Station, he arrived just in time to witness the station's destruction, caused when one of his soldiers inadvertently activated a booby trap planted by the Wraiths. Thaal correctly attributed this action to Wraith Squadron, but wrongly believed that they were being led by the late Ton Phanan, whom he believed had only faked his death decades earlier.\nThaal was later tricked into returning to Kuratooine earlier than he had planned to by Wraith Squadron member Turman Durra, who was masquerading as a member of a species native to the planet's underground caverns who had many valuable gems to offer to Thaal. In exchange for the nonexistent valuables, Thaal decided to give the disguised Durra a fake deed to the Imperial capital of Bastion. A short time later, Thaal temporarily assumed his Thadley Biolan identity in order call on Chott, whom he had developed a romantic interest in. Upon arrival to her apartment however, Thaal was shocked to learn that she had been kidnapped a short time earlier.\nEventually, Thaal was lured into one of Kuratooine's public plazas after Wraith Squadron caused enough trouble on the planet to warrant his attention. As Thaal's suspicions of Ton Phanan still being alive had reached Wraith Squadron's ears, the squad decided to keep the facade going by having a droid mounted with a hologram depict Durra disguised as Phanan calling Thaal out as an impostor of himself. The accusation was seemingly proven when Thaal's recently divorced ex-wife, Zehrinne, arrived from Coruscant and claimed that Thaal was not the real Stavin Thaal, but was an impostor named Thadley Biolan, after she saw through his makeup. Thaal tried to escape arrest, but was paralyzed by a dart fired by Wraith Drikall Bessarah.\nSome time after, Thaal was freed from prison on Coruscant thanks to General Maddeus, and was hidden one level below Maddeus' office. However, Loran tricked Maddeus into admitting where Thaal was hiding by having a Wraith come in disguised as Thaal. Wraith Squadron then had him and Thaal placed back in prison for good.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Stavin_Thaal",
  "/wiki/Carida/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Vocabulator/Legends",
  "/wiki/Throat",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Academy_of_Carida",
  "/wiki/New_Republic/Legends",
  "/wiki/Pop-Dogs",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Army",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/General/Legends",
  "/wiki/Chief_of_Army_Operations",
  "/wiki/44_ABY",
  "/wiki/Assassin/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Sun_Crusher",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/12_ABY/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Zehrinne_Thaal",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/27_ABY/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Vandor-3",
  "/wiki/Star_system/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Haydnat_Treen",
  "/wiki/Merratt_Jaxton",
  "/wiki/Drikl_Lecersen",
  "/wiki/Natasi_Daala",
  "/wiki/Abeloth",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Suicide/Legends",
  "/wiki/Borath_Maddeus",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Garik_Loran",
  "/wiki/Wraith_Squadron",
  "/wiki/Bhindi_Drayson",
  "/wiki/Sharr_Latt",
  "/wiki/Thadley_Biolan",
  "/wiki/Usan_Joyl",
  "/wiki/Dashan_Joyl",
  "/wiki/Caridan",
  "/wiki/Kuratooine",
  "/wiki/Ledina_Chott",
  "/wiki/Mount_Lyss_Meteorological_Station",
  "/wiki/Ton_Phanan",
  "/wiki/Turman_Durra",
  "/wiki/Bastion/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Drikall_Bessarah",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)"
 ]
}