{
 "name": "Staz",
 "display_name": "Staz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 BBY",
      "Mimban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "224th Imperial Armored Division",
      "Imperial Officer Corps",
      "224th Imperial Armored Division",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Staz was a human male major that served in the Galactic Empire's 224th Imperial Armored Division. He led the division during the Mimban Campaign, and was killed by an explosion as he yelled orders to his troops.\nStaz was a human male who, by 10 BBY, had achieved the rank of major in the Armed Forces of the Galactic Empire and was in command of the 224th Imperial Armored Division. Staz led the division during the Mimban Campaign against the Mimbanese Liberation Army, who were resisting Imperial advancements.\nDuring the campaign on Mimban, Staz commanded his forces to capture a final ridge in their area. After Corporal Han Solo had been blown to the ground by an explosion, Staz helped him recover and informed him that they were almost to their objective. When Solo replied with confusion on where they were headed, Staz stated that they were headed just over the final ridge. As Staz began to proclaim that victory was at hand, he failed to notice a missile inbound from the Mimbanese lines and was promptly blown to bits by it, dying instantly.\nFollowing his death, Solo was shocked and fell back to a trench, where he witnessed what appeared to be an Imperial officer, who would in actuality be Tobias Beckett with the uniform of a captain, who was on Mimban attempting to steal a Y-45 armored transport hauler for a heist on Vandor. While Beckett was speaking with his crew, Solo joined into the conversation to inform him that Staz had ordered them to go the other way. Beckett responded by telling Solo to go that way and die, in which Solo responded by saying that that's what happened to Staz.\nStaz was a human male who had dark hair and light skin. Despite being a major, Staz led his forces on the front lines of heated combat, and in at least one example, helped a subordinate recover and motivated them to continue forward. However, his zeal for combat and rallying his troops in the name of the Empire caused him to be neglectful of his surroundings and he thus failed to notice a missile heading straight for him until it was too late to get out of the way.\nDuring intense combat, Staz was able to direct his subordinates and wield a E-10 blaster rifle.\nAs an officer of the Galactic Empire, Staz was equipped with an officer's uniform with a type of fitted, waterproof greatcoat and a plastoid chestplate armor piece. He also wore an unarmored cap and used a blaster rifle in combat.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/10_BBY",
  "/wiki/Mimban",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/224th_Imperial_Armored_Division",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Major",
  "/wiki/Division",
  "/wiki/Mimban_Campaign",
  "/wiki/Death",
  "/wiki/Imperial_Military",
  "/wiki/Mimbanese_Liberation_Army",
  "/wiki/Corporal",
  "/wiki/Han_Solo",
  "/wiki/Missile",
  "/wiki/Imperial_officer",
  "/wiki/Tobias_Beckett",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Captain",
  "/wiki/Thief",
  "/wiki/Y-45_armored_transport_hauler",
  "/wiki/Heist_on_Vandor",
  "/wiki/Beckett%27s_gang",
  "/wiki/Hair",
  "/wiki/E-10_blaster_rifle",
  "/wiki/Officer",
  "/wiki/Plastoid",
  "/wiki/Armor",
  "/wiki/Blaster",
  "/wiki/Rifle",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy"
 ]
}