{
 "name": "Stec",
 "display_name": "Stec",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "32 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Special Operations Brigade",
      "Muunilinst 10",
      "Grand Army of the Republic",
      "Special Operations Brigade",
      "Muunilinst 10",
      "Special Operations Brigade",
      "Muunilinst 10",
      "Muunilinst 10"
     ]
    }
   ]
  }
 ],
 "content": "An Advanced Recon Commando nicknamed \"Stec\" was an Alpha-class Lieutenant who fought in the Grand Army of the Republic during the Clone Wars. A clone of the Human male bounty hunter Jango Fett that was born in 32 BBY, Stec—along with the rest of the one hundred ARC troopers in the Alpha-class—was personally trained by the Jango Fett. He served in the Galactic Republic's Grand Army during the Clone Wars, which launched in 22 BBY. Throughout the war, he participated in the Battle of Hypori along with the rest of the Muunilinst 10, where the ARC Troopers were sent to rescue the surviving Jedi Knights from General Grievous.\nIn the year 32 BBY, the Kaminoans began building a clone army for the Republic. Stec was one of the 100 Alpha-class Advanced Reconnaissance Commandos created from the genome of his clone template and bounty hunter Jango Fett. In addition to the flash training, in which all soldiers received a basic lesson on the development of their military abilities, Fett subjected Stec and the Advanced Reconnaissance Commandos to separate training into ideal special mission groups, capable of operating solely behind enemy lines due to their unique abilities. Because of their lack of obedience, the ARC generation after Jango Fett's departure from Kamino was transferred to stasis and only reactivated two months after the beginning of the Clone Wars during the Battle of Kamino. Stec was integrated as a sergeant in the command operations of the Grand Army of the Republic.\nFollowing the Battle of Muunilinst, ARC captain Fordo was given the task of carrying out an emergency rescue operation on the planet Hypori to evacuate a group of Jedi who were under attack by forces led by General Grievous, the Supreme Commander of the Droid Armies. Stec was part of this task force, and carried a Z-6 rotary blaster, a heavy weapon for infantry support during missions with specific tactical requirements.\nIn the approach of their LAAT/i gunship to the wreck of the Acclamator-class assault ship where the Jedi were, the soldiers prepared their equipment for the upcoming deployment. When the gunship reached the inside of the destroyed assault ship, Stec and the rest of the Advanced Reconnaissance Commandos gathered behind Fordo. While two of the ARC Troopers were searching for the signs of life that Fordo had discovered in the ruins, Fordo ordered the other clone troopers to fan out. In the location where he had localized two other life signs, the soldiers witnessed a lightsaber duel between Grievous and the last standing Jedi, Ki-Adi-Mundi. When Grievous attempted to finish off the Jedi Master, he noticed the approaching clones, who immediately opened fire on him. Grievous was initially forced to flee further into the wreck in order to escape the ongoing firing of the clones, but eventually attacked the clones, cutting down four of them with his lightsabers. Fordo then called in the gunship for fire support. While Grievous retreated from the gunship's bombardment, Fordo ordered a retreat to ensure the survival of the three rescued Jedi; Shaak Ti, Aayla Secura, and Ki-Adi-Mundi. In the process, Stec sat down at the edge of the passenger cabin in order to be able to hold back Grievous after the Jedi were loaded onto the gunship. All three Jedi and the clones escaped and survived.\nLate into the war, he participated attempted to destroy the production facilities of the Colicoid factory on Colla IV, thereby destroying one of the most important companies for the production of battle droids for the confederation of independent systems. Stec belonged to the four battle groups, infiltrating the colicoid workshop surrounded by a protective shield. When the soldiers reached the inner wall of the establishment, they were attacked by a Scorpenek Annihilator droids. With his laser cannon he destroyed a wall of Durabeton, behind which the soldiers had sought cover, and destroyed within three minutes three of the four battle groups. The remaining soldiers, including Stec, withdrew from the factory. Afterwards, the ARC soldier told his superiors about the failed attempt on Colla IV. Although he did not know what kind of droids his clone brothers had fought and recommended that he not allow the colicoids to continue breeding on that planet.\nStec wielded high-powered rapid-firing weapons such as the Z-6 rotary blaster cannon and DC-17m Interchangeable Weapon System As a lieutenant, he wore distinguished blue Phase I clone trooper armor. He also wore a skirt-like kama that dampened blasts, had a rangefinder attached to his helmet, and wore a blue command shoulder pauldron.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Special_Operations_Brigade/Legends",
  "/wiki/The_Muunilinst_10",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Alpha-class_Advanced_Recon_Commando",
  "/wiki/Lieutenant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Battle_of_Hypori/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Kaminoan/Legends",
  "/wiki/First_Battle_of_Kamino",
  "/wiki/Hypori/Legends",
  "/wiki/Battle_of_Muunilinst/Legends",
  "/wiki/ARC-77",
  "/wiki/Supreme_Commander_of_the_Droid_Armies",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Colla_IV/Legends",
  "/wiki/Z-6_rotary_blaster_cannon/Legends",
  "/wiki/DC-17m_Interchangeable_Weapon_System",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Kama/Legends",
  "/wiki/Rangefinder/Legends",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Clone_Wars_Chapter_20",
  "/wiki/Clone_Wars_Chapter_21",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Clone_Wars_Campaign_Guide",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}