{
 "name": "Steela_Gerrera",
 "display_name": "Steela Gerrera",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Onderon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Onderon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.79 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Teal"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Onderon rebels",
      "Galactic Republic",
      "Royal Court of Onderon",
      "Royal Onderon Militia",
      "Royal Onderon Militia"
     ]
    }
   ]
  }
 ],
 "content": "Steela Gerrera was a female Onderonian human who lived on the planet Onderon during the Clone Wars. She fought with the Onderon rebels, and was their leader, taking the position from her older brother Saw Gerrera. The efforts of her movement, with assistance from the Jedi, saw the end of Separatist rule through their proxy, King Sanjay Rash, on Onderon and the restoration of the benevolent King Ramsis Dendup. She was romantically involved with the Onderon-born politician Lux Bonteri. Gerrera was killed in the final battle against Onderon's droid garrison and was mourned as a hero of her people.\nWhen the Confederacy of Independent Systems took control of Onderon, Gerrera, her brother Saw and other insurgents then fled into Onderon's wilderness. There, she and the other insurgents organized themselves into a resistance force. After her brother and former Separatist Senator Lux Bonteri contacted the Jedi Council, she then met the council's envoy, Jedi Master Obi-Wan Kenobi, Knight Anakin Skywalker, his Padawan Ahsoka Tano, and Clone Captain Rex.\nGerrera then brought them to their camp, where she, Bonteri, her brother and the other insurgents were trained. At first Gerrera did not like the idea of off-worlders being involved in Onderon's affairs. However, she knew that was how Ramsis Dendup was deposed of by Sanjay Rash. During their training, Gerrera proved herself as a talented sharpshooter. After eliminating a detachment of the droid army, Gerrera and the others planned to infiltrate the capital of Iziz by posing as hunters and foragers. She and the others then split up to gather supplies and meet during the night.\nGerrera knew they needed to win the people's trust. Thus, Gerrera planned an attack on the power generators. She, her brother and Bonteri then took out a droid patrol that then summoned a AAT. Together, they took the tank to the generators and destroyed them. Gerrera was then elected leader of the resistance, much to the chagrin of her brother. Steela then sent out a broadcast to the people, speaking out against Rash and the Separatist occupation forces. When news came that Rash planned on executing Dendup, Gerrera knew they did not have the resources to rescue him right away. She planned on rescuing him during his execution, but her brother was then captured by General Kalani's guards. During the execution, Gerrera and the others were able to stop the execution, but were then surrounded by battle droids. However, her brother was able to convince Royal Militia General Akenathen Tandin and his men to help them escape and free Onderon. Gerrera, her resistance, and the Royal Militia then fled to the Highlands.\nSteela, Ahsoka, and Lux arrived just in time to save the king from the droids. On the nearby battle field, Saw shot down the last of the enemy gunships, but the damaged unit careened out of control, right into the rebel camp. Steela was trapped on a collapsing rock on the edge of a cliffside, broken loose by the droid's impact, and while trying to jump to safety, she was caught hanging from the cliff. Lux rushed to save her, but nearly fell off himself. Ahsoka used the Force to float him to safety, but as she tried to do the same for Steela, the downed gunship fired a laser blast through Ahsoka's left shoulder, breaking her concentration and causing Steela to inadvertently fall to her death.\nEver since Steela died, Saw carried a hologram projector of his sister to remind him of her. When Saw's militia was confronted by Clone Force 99 following the Proclamation of the New Order, Saw lamented, stating that the Empire would undermine all that was fought for, as well as all those who were lost, such as Steela, during the Clone Wars.\nSaw later told the story of Steela's death to Jyn Erso during her childhood while she was under his care.\nDuring an investigation on Geonosis, Saw managed to drop the projector of her but it was recovered by Ezra Bridger who asked if the woman in the hologram was Saw's sister, him saying that the image was all he had left of her.\nDuring the Destruction of Jedha City, Saw called out to Steela in his last seconds of life after his Partisans' base on Jedha was destroyed by the Galactic Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Steela_Gerrera",
  "/wiki/Steela_Gerrera/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Onderon",
  "/wiki/20_BBY",
  "/wiki/Human",
  "/wiki/Onderonian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Onderon_rebels",
  "/wiki/Galactic_Republic",
  "/wiki/Royal_Court_of_Onderon",
  "/wiki/Royal_Onderon_Militia",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Saw_Gerrera",
  "/wiki/Jedi",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Sanjay_Rash",
  "/wiki/Ramsis_Dendup",
  "/wiki/Lux_Bonteri",
  "/wiki/Onderonian_Civil_War",
  "/wiki/Senator",
  "/wiki/Jedi_High_Council",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Capital",
  "/wiki/Iziz",
  "/wiki/Hunting",
  "/wiki/Onderon_power_generator",
  "/wiki/Droid",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/Tank_(vehicle)",
  "/wiki/Death",
  "/wiki/General",
  "/wiki/Kalani",
  "/wiki/Battle_droid",
  "/wiki/Akenathen_Tandin",
  "/wiki/Onderon_highlands",
  "/wiki/Hologram",
  "/wiki/Clone_Force_99",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Jyn_Erso",
  "/wiki/Mission_to_investigate_Geonosis",
  "/wiki/Geonosis",
  "/wiki/Ezra_Bridger",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Partisans",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Jedha",
  "/wiki/Galactic_Empire",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/A_War_on_Two_Fronts",
  "/wiki/Front_Runners",
  "/wiki/The_Soft_War",
  "/wiki/Tipping_Points",
  "/wiki/The_Gathering_(episode)",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Aftermath_(episode)",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Rebel_Rising",
  "/wiki/Rebel_Rising_(audiobook)",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Ghosts_of_Geonosis",
  "/wiki/Star_Wars_Rebels_Animation",
  "/wiki/Crossing_the_Line",
  "/wiki/Star_Wars_Rebels_Animation_4",
  "/wiki/Rogue_One_Adaptation_3",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Category:Images_of_Steela_Gerrera",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/The_Gathering",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}