{
 "name": "Stellan",
 "display_name": "Stellan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Stellan was a human male case officer at the Imperial Security Bureau for Bracchia, a Koorivar spy for the Galactic Empire. He and Bracchia were interrogated by Emperor Palpatine himself in an attempt to find conspirators within the Imperial security apparatus.\nStellan was an Imperial Security Bureau  officer who lived during the Imperial Era. He was stationed on the galactic capital Coruscant and served as a case officer for Bracchia, a Koorivar spy based on Mustafar. In 14 BBY, the ISB received a purported tip-off from Imperial Intelligence to investigate a communications cache on Murkhana. This tip-off was based on a fake holovid produced by Vice Admiral Dodd Rancit, the Director of the Naval Intelligence Agency, as part of a plot to lure Moff Wilhuff Tarkin to Murkhana.\nBelieving the video to be genuine, Stellan dispatched Bracchia to confirm the existence of the communications cache which included HoloNet jammers. Based on Bracchia's \"discovery\" of the communications cache, Emperor Palpatine dispatched Moff Tarkin and Darth Vader to investigate whether the communications cache was part of an insurgent plot to launch Separatist–style Shadowfeed attacks on the Imperial Holonet. There, the insurgent leader Berch Teller and his followers stole Tarkin's corvette Carrion Spike and attacked Imperial installations across the galaxy.\nWhile Tarkin and Lord Vader hunted the insurgents, the Emperor decided to investigate the communications cache. He summoned Bracchia and Stellan for questioning at the Imperial Palace on Coruscant. When Bracchia reported that he had received orders from Coruscant to investigate the existence of the communications cache, Stellan added that the ISB had been acting on information provided by Military Intelligence. Darth Sidious investigated the holovid and discovered that it was a fake video produced by someone with access to Imperial codes and to devices capable of subverting the HoloNet.\nLord Vader and Tarkin subsequently discovered that Vice-Admiral Rancit had been supplying information, weapons, and equipment to Teller's rebel cell. While Lord Vader executed Rancit, Tarkin defeated the insurgents in a battle near the Gulf of Tatooine.\nStellan was a thickset human man of indeterminate age. He had brown, wavy hair and large ears on a blockish head. He was familiar with Imperial intelligence protocol and procedure. Stellan feared the Emperor.\nStellan first appeared in James Luceno's 2014 novel Tarkin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Case_officer",
  "/wiki/Stellan_(species)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Bracchia",
  "/wiki/Koorivar",
  "/wiki/Spy",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Imperial_Era",
  "/wiki/Galaxy",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Mustafar",
  "/wiki/14_BBY",
  "/wiki/Imperial_Intelligence",
  "/wiki/Holovid",
  "/wiki/Vice_Admiral",
  "/wiki/Dodd_Rancit",
  "/wiki/Director",
  "/wiki/Naval_Intelligence_Agency",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/HoloNet",
  "/wiki/Anakin_Skywalker",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Shadowfeed",
  "/wiki/Berch_Teller",
  "/wiki/Berch_Teller%27s_rebel_cell",
  "/wiki/Carrion_Spike",
  "/wiki/Berch_Teller_campaign",
  "/wiki/Imperial_Palace",
  "/wiki/Battle_near_the_Gulf_of_Tatooine",
  "/wiki/Gulf_of_Tatooine",
  "/wiki/James_Luceno",
  "/wiki/2014",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}