{
 "name": "Stellan_Gios",
 "display_name": "Stellan Gios",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "230 BBY",
      "Starlight Beacon",
      "Eiram"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Crystal blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic",
      "Red Group",
      "Red Group"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Rana Kant"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Vernestra Rwoh"
     ]
    }
   ]
  }
 ],
 "content": "Stellan Gios was a human male Jedi Master who was part of the Jedi Order during the High Republic Era. At one point, Vernestra Rwoh was his Jedi Padawan before she was promoted to Jedi Knight, and he was stationed at the Jedi outpost on the planet Caragon-Viner. Stellan had risen through the ranks of the Order along with Avar Kriss and when they worked together they were seen as immense powerhouses on missions for the Order and the Galactic Republic. Gios was formerly the Padawan of Master Rana Kant, and formed close bonds with Kriss and Elzar Mann during their time as apprentices, often serving as a voice of reason in the trio.\nStellan Gios, a Force-sensitive human male born during the High Republic Era, was recruited into the Jedi Order at a young age. He eventually became the Padawan of Jedi Master Rana Kant. During his time as a Padawan, he formed close bonds with two other apprentices, Avar Kriss and Elzar Mann. The trio were so close that many fellow Jedi, even their masters, considered them inseparable. The three would always seek one another out the moment they returned from missions, eager to catch the others up on their latest adventure. It was speculated the three were closer than friends during their days as Padawans, although Gios later admitted he did not share the intimacy seen between Kriss and Mann. Beyond concerns on whether their relationship would violate the Order's rules, Gios deep down grew jealous that they shared a connection he was absent from, but he kept his jealousy hidden and continued their friendship.\nThough Gios would grow up to be a model Jedi, he struggled to keep up with his peers during his youth. When Gios and Mann began their knighthood trials, Gios was only able to pass thanks to secret help from Mann. Around this time, Gios was stationed at a Jedi outpost on the planet Caragon-Viner. He became close with Jedi Knight Indeera Stokes, who he went on a mission with on Theros Major. Gios rose through the ranks of the Jedi alongside Kriss, and on the occasions they worked together they were seen as powerhouses for the Order and Galactic Republic.\nEventually attaining the rank of Master himself, Gios was stationed at the Hynestian Temple on the Colonies planet Hynestia, and was assigned his own Padawan, the Mirialan Vernestra Rwoh. By 233 BBY, Rwoh arrived at the Hynestian Temple to begin her apprencticeship and found Gios sparring with Kel Dor Jedi Master Lynela Kabe-Oyu using the Force. Gios encouraged Rwoh to spar with him, and she eventually went along with it though she had some apprehension. Gios ran at Rwoh, but she pushed him back into a wall with the Force, telling her she did well despite her apology. Because of this, Gios and Kabe-Oyu decided to bring her to a banquet at the Hynestian royal palace.\nGios told Rwoh that he didn't attend many banquets, but that it was an exception because diplomacy was important for being a Jedi and they had managed to make a treaty between the Hynestians and the Hutts, though they did not want to gloat. Rwoh then noticed that Povo Punch was being served, which Hutts could not eat and if served to a Hutt was a great insult. Gios leapt into action and knocked over a serving tray with the drink that a droid was carrying before it could be served to the Hutts. He explained that they were going to be poisoned and that all danger was eliminated, but the Hutts decided to attack anyway and a firefight began. Gios told Kabe-Oyu to get the royal family to safety, before making sure she could use a lightsaber, reminding her that a Jedi only ever used it to defend life, and assured her that he didn't usually end up fighting Hutts though there was a first time for everything.\nOnce Kabe-Oyu got the royals to safety, Rwoh told Gios that she had an idea to stop the goons. He went along with it, and she vaulted onto and over him before slicing a banner's mounting with her lightsaber and trapping the goons beneath the fabric. Gios then jumped in front of the Hutts before they could get away, telling one of them, Jabba Desilijic Tiure, that they had a treaty, which Jabba only mocked. The Hynestian Queen Nyla then arrived and confronted the Hutts, and cornered them with her guards though Gios told her that she should have fled. The Queen congratulated Rwoh on discovering the plot, which Gios reiterated, telling her she did well. Rwoh then asked Gios why he hadn't been able to sense that the Hutts weren't going to sign the treaty, to which Gios told her that one could not always rely on the Force and that there were occasionally surprises. Rwoh said that she didn't like surprises which made Gios declare that they were going to work very well together before asking her to teach him the vault she had done earlier.\nGios had a firm hand with his teaching, and Rwoh was always slightly intimidated by him. Eventually, Rwoh, a prodigy, attained the rank of Jedi Knight at only fifteen, making her the youngest Knight in a generation.\nWhen the Legacy Run was torn apart in hyperspace Great Hyperspace Disaster occurred and the Outer Rim's Hetzal system was threatened by large amounts of hyperspace debris, Gios received the star system's distress signal and set out in a starship to help. Kriss, coordinating the Jedi and Republic's rescue effort on Hetzal Prime, sensed his approach from afar.\nWhen the Emergences, giant pieces of debris from the Legacy Run traveling at near-lightspeed, started occurring throughout the Galaxy, Gios traveled to the astronomical object Ta'klah, which was being threatened by an Emergence. He and a drift of Jedi Vectors arrived, with Gios jumping out of a Vector to protect a child from a piece of debris, holding it back with the Force. He warned the people that there had been an accident in hyperspace and that everyone needed to find shelter from the debris. A citizen thanked him, and he told her that his name was Stellan Gios but that they could just call him Stellan. He told them that they'd take it from there, and reminded everyone to hurry and stay inside.\nGios later attended the dedication ceremony of the new Starlight Beacon space station. There, he caught up with Kriss and Mann and the trio took a tour of the station. During the festivities that followed the opening of the Starlight Beacon, Gios spent his time conversing with the Jedi Council. Some time after the opening of the Starlight Beacon, his former master Rana Kant died, not only devastating Gios, but leaving a seat on the Jedi Council empty, which Gios was elevated to the Jedi Council to fill. Gios began carrying around Kant's lightsaber as a reminder that she was with the Force, and therefore always with him.\nDuring Life Day between 232 BBY and 230 BBY, Gios was on Coruscant strolling the streets during the festival. He was meant to have been in the Jedi Temple with other members of the council preparing for the Solstice feast in the Grand Refectory. Instead, he took time to enjoy the festivities. However, an Aleena male accidentally barged into Gios, and his packages flew in the air. Gios used Force to guide packages back to the Aleena before they hit the ground. The Aleena thanked him and moved along.\nWhile Gios was waiting at the festival carousel, he sensed something was wrong. After scanning the market, he saw a Gotal boy attempting to steal from a Chagrian waiting at the Spiced eggmilk stall. The boy stole a handful of credits from the Chagrian, as well as a lucryte bracelet off of a Vuvrian female after bumping into her. The boy realized Gios had seen him, and quickly made a break for it. Gios followed him as he headed to the Commercial District. Gios followed the boy into an alley, where he was attempting to use a hatch to get to the lower levels. Before Gios could catch him, he was interrupted by a bar-goer, who wished to help put Gios in the holiday spirit and to bask in the rare snow. Gios used a mind touch on the man to tell him that he didn't need to help Gios and should leave to go enjoy the festivities, before adding that he did so in moderation. While Gios was distracted, the boy used the hatch to head down to the lower levels. After making it to lower levels, Gios reached out with Force to find the boy. Gios found him in an alleyway surrounded by members of the Norikus gang gang. The gang was terrorizing the boy, Nittel Karkson , demanding Nit give them what he had looted. Gios approached the group and drew his lightsaber. While most of the group fled, one of the gang members, a Octeroid, began firing on Gios who deflected the blaster bolts with ease before slicing their twin blasters in half. The Octeroid then fled, leaving behind the Nit and his loot.\nNit stared in awe as Gios retrieved the loot. Nit asked if Gios was going to arrest him, and after Nit promised not to steal again, Gios let him on his way. Nit returned home to level 4000 where his grandmother was in bed, waiting for his return. Nit's grandmother was very cold and sick, which is why Nit had been stealing in the first place. Nit was surprised to see Gios had followed him home. After seeing Nit's grandmother, Gios gave her his Jedi robe to help keep her warm. Nit and his grandmother thanked Gios for the robe, and Gios thanked Nit for reminding him why he was a Jedi. Nit then offered for Gios to stay for dinner. Nit recognized it was hardly a Solstice feast, but the pair would be honored to share it with Gios. He happily obliged. Since the house had no chairs, Gios used Force to sit in the air. Nit was shocked, and Gios used Force to lift Nit in air as well. Gios said that after dinner, he would bring Nit and grandmother back to Jedi Temple where they would be provided fresh clothes and places to sleep. Gios also said that the following day he could discuss with Nit how to put his talents to better use.\nLater that year, Gios called Jedi Master Estala Maru, the head of operations of Starlight Beacon, regarding the crisis that was occurring due to the emergence of the Drengir, a species of ancient sentient carnivorous plant monsters. Gios asked Maru if he was concerned and informed him that they needed to talk about how much of the Jedi Council was uneasy about Marshal Kriss's alliance with the Hutt Clan against the Drengir in the Outer Rim. Maru informed Gios that the pact was working, and that the Drengir's advance was slowing, though Gios commented that their return should never have occured in the first place. He then inquired about the status Jedi Master Sskeer, who previously had his mind controlled by the Drengir, but Maru told him that there was very little change as Sskeer was still comatose.\nA year after the events of the Great Disaster, Gios, along with Jedi Master Nib Assek and her Padawan Burryaga Agaburry, were assigned to provide personal security to Supreme Chancellor Lina Soh for the entirety of the Valo Republic Fair, which was held by Soh to show that the Republic was united and recovering from the disaster. Gios and his fellow Jedi joined the Chancellor on the starship Coruscant Dawn as she began her journey to Valo. While aboard the Coruscant Dawn, Gios contacted Jedi Knight Indeera Stokes, who was on Cyclor overseeing the progress of the Innovator, a massive research vessel that would be shown at the Republic Fair. Stokes provided Gios an update on the ship's progress, and the two expressed their excitement for seeing each other at the Republic Fair. Gios thanked Stokes for the update and ended the conversation. Gios and Assek then performed a ceremonial lightsaber battle for GoNet reporter Rhil Dairo, a personal guest of the Chancellor who would be providing the official news coverage of the fair. Gios and Assek utilized ancient lightsaber forms during the battle, noting to Dairo that lightsaber battles used to be commonplace when the Sith were around but were now reserved only for ceremonies and Padawan training. The match ended with Gios besting Assek, and the group made their way to the Chancellor's chambers. They found her, along with her aide, Norel Quo, and her Vice-Chancellor, Larep Reza, participating in a conference call regarding the fair's status. On the call were Senator Izzet Noor, Senator Vaadu, and Jedi Master Kriss. After entering the Chancellor's chambers, Gios was personally invited to provide the group with an update on the Innovator.\nShortly after the call ended, the crew aboard the Coruscant Dawn received word that forces of the group of marauders called the Nihil, who had been found to have been behind the Great Disaster, had attacked the shipyards on Cyclor, where the Innovator was being held. Upon hearing of the attack, Gios immediately attempted to contact Stokes and her Padawan, Bell Zettifar. However, the pair were unable to receive Gios' transmission due to Nihil communication jammers. Gios quickly made his way to the Coruscant Dawn's communication deck, where he and his fellow Jedi joined Soh and her staff. The group observed the battle over Cyclor via a wall holoprojector, with footage being provided by the people building the Innovator, somehow bypassing the Nihil jammers. Desperate to provide Stokes and Zettifar with reinforcements, Gios reached out to Jedi Master Tera Sinube, the marshal of the closest Jedi Temple Outpost to Cyclor on Derra. After explaining the situation, Sinube reassured Gios that he had already dispatched a team piloting Jedi Vectors, led by Jedi Master Porter Engle, to Cyclor. After thanking Sinube, Gios returned to Soh, who was now conversing with Jedi Master and fellow council member, Pra-Tre Veter. Gios began informing both Soh and Veter about Engle's reinforcements when the trio was interrupted by a transmission from Senator Tia Toon, who used the attack as evidence that the Republic needed a stronger defense team, attempting to persuade Soh to approve Toon's Defense Force Program. However, Gios and Soh assured Toon that the current Republic forces and the Jedi were more than capable of defending the Republic. Soon thereafter, a communication from Engle came into the Coruscant Dawn, notifying the group that he and his squadron had made it to Cyclor and restored communications. Though Zettifar was gravely injured, the Jedi had fought off the Nihil forces.\nFollowing the attack, Elzar Mann, who was currently stationed on Valo, along with fair coordinator Samera Ra-oon, reached out to Gios and provided him with an update on the Innovator. Despite the damage, the Innovator remained on schedule to launch at the fair. Ra-oon also assured Gios that security was to be increased at the fair in response to concerns following the Nihil attack on Cyclor. Though Mann felt the increases were unnecessary, Gios disagreed. Gios explained that not only was the Senate was highly concerned following the attack, but the Togruta government and Jedi Council were too. Gios explained that the Togruta military had requested an additional security force for Regasa Elarec Yovet, who was already hesitant to attend the fair. The council had also ordered Engle's squadron to officially accompany the Innovator. Gios, Mann, and Ra-oon discussed potential Jedi candidates to lead the new security force for Yovet but could not decide on one. Gios then asked if he could think about the decision, to which Ra-oon approved before the group said their goodbyes.\nShortly after the attack on Cyclor, Soh, Gios, Assek, Agaburry, and the rest of Soh's party arrived on Valo. Upon arrival, the group was formally introduced to Samera Ra-oon and the rest of the fair's planning committee. Gios was dressed in full Temple attire, including a stole over his shoulder, which identified him as a recently elevated member of the High Council. Mann, who had accompanied Ra-oon and the planning committee, quickly reunited with Gios, and the two began catching up with each other. While the two were chatting, Gios could sense a deeper relationship between Mann and Ra-oon, who had developed romantic and sexual attractions to each other. Mann, sensing Gios' suspicions, quickly steered the conversation to the fair proceedings. Gios and Mann then joined Soh and her party as Ra-oon prepared to provide a tour of the fairgrounds. Shortly before the tour began, Senator Toon joined the group, using this chance as another opportunity to push his Defense Force Program to Soh. Following a brief, verbal argument, Vice-Chancellor Reza indicated to Gios to watch Toon, as he had suspicions the senator was up to trouble. Gios, however, reached out through the Force and sensed no danger or malice.\nOn the fair's opening day, Gios joined Soh and the rest of the welcome committee to welcome Regasa Yovet to Valo. Upon her arrival from Shili, Yovet was introduced to everyone in the welcome committee, including Gios. Gios and Yovet had a brief conversation. Yovet noted Gios' raiment and understood it meant he was a member of the Jedi Council. The two also discussed Jedi Master Jora Malli, a friend of Yovet who had recently died during the battle of Kur against the Nihil. Following Yovet's arrival, Gios joined her, Soh, and Soh's party as they watched a Jedi Vector airshow performed by Zettifar, Stokes, and Engle. Immediately following the airshow, Soh gave an opening speech to the fairgoers, declaring the Valo Republic Fair open.\nAfter the commencement ceremony, Soh and the rest of her party head to the Starlight Pavilion to mingle and celebrate. Gios, led by the Force, immediately sought out Zettifar, who was socializing with other Jedi. Upon greeting Zettifar, Gios could tell that the happy demeanor the Padawan exhibited was a facade. Sensing something was wrong with Zettifar but still unsure what, Gios offered him an exhibition tour. He happily agreed, and he and his pet Charhound Ember followed Gios through the pavilion. While talking with Zettifar, Gios sensed a deep sadness within him. When the pair arrived at the pavilion's exhibit, Gios asked Zettifar how his meditation was going. Taken aback, he explained to Gios that meditation had been difficult for him following his master Loden Greatstorm's disappearance. Upon hearing this, Gios finally realized what was wrong with Zettifar:he had cut himself off from the Force. Gios reassured him that he understood the Padawan's feelings and that he would eventually restore his connection to the Force. Gios offered his services with any assistance the Padawan may have needed going forward.\nGios and Zettifar's conversation was interrupted when Gios felt a disturbance in the Force. Realizing the disturbance was relating to Mann, Gios hurried to find him, Zettifar and Ember following him as he searched throughout the fairgrounds. Unsuccessful in his search, Gios enlisted the help of Ember by providing her with the scent of his leather holster. Gios explained to Zettifar that both he and Mann always used Muttamok oil to clean their holsters. Having determined the scent of the oil, Ember quickly led the pair on the path to Mann's location. The group found Mann on the roof of a building across from the Lake's Rest saloon, located in the heart of Lonisa City. Using the Force, Gios and Zettifar scaled the building and reached Mann on the roof. Mann quickly directed the pair to hide as he observed Senator Toon and his bodyguard on the third floor of the saloon, waiting for someone, before two other figures joined Toon and his bodyguard. Using a listening device, Mann allowed his fellow Jedi to listen to Toon's conversations.\nGios watched as Toon was met with Ty Yorrick and Mantessa Chekkat, the latter of whom was attempting to sell her invention\u0026emdash;the Four-seven nullifier—to Toon. However, Toon quickly realized that the device utilized Recainium, a substance illegal in every form and demanded Chekkat to shut down her machine, but Chekkat was intent on providing a demonstration. Chekkat then asked Yorrick to ignite her lightsaber, an action seen by Toon's bodyguard as a threat, and thus began firing on Yorrick. Seeing this, Gios lept from the roof of his building and crashed through the cantina's window, determined to protect Toon. Mann and Zettifar quickly followed Gios, who demanded that Yorrick drop her weapon. Yorrick then began fighting Gios, Mann, and Zettifar, before Chekkat's invention deactivated the group's lightsabers and ended the fight. Valo security officers quickly arrived on the scene and took Chekkat and Yorrick into custody, but not before Mann confiscated Yorrick's lightsaber. Toon thanked Gios for his protection and explained that despite his determination to see the Defense Force Program created, he valued the efforts of the Jedi Order.\nGios, who Yorrick injured during the fight, changed into fresh robes and was examined by Jedi Master Torban Buck, an expert healer. Gios then returned to Soh's company for the rest of the evening. The following day, Gios and the rest of Soh's party were set to tour the botanical gardens of the fair, located in the Tech and Science zone. Even though the party's mood was that of joy, Gios felt something heavy in the Force. Stokes also sensed a disturbance and realized Gios had sensed it too. The pair quietly discussed the matter, attempting to figure out what the cause could be. Upon observing Soh's party, Stokes mentioned to Gios that the chancellor's son, Kitrep Soh, and the Lonisa City Mayor's son, Jom Lariin were missing from the group. Gios then confirmed with coordinator Ra-oon, who was in the fair's security station, that the pair had snuck out of the gardens unnoticed. Determined to find the pair before anyone realized, Gios sent Zettifar to find them. Zettifar, who had socialized with the two boys the prior evening, explained they that they had likely gone to see the Innovator, and thus headed off to the ship with Ember to try and find the boys. Stokes attempted to calm Gios, saying that all would be well.\nWhen the Nihil began their attack on Valo, Gios was with Stokes, Jedi archivist OrbaLin, Soh, and the rest of her party at the fair's opera house. Stokes quickly left to find her Vector, and Gios ordered OrbaLin to find the city's communication tower and restore communications. After a repulsor platform fell, injuring fairgoers, Vice Chancellor Reza left the group to help the victims, leaving Soh, her pet targons, Quo, Yovet, and opera singer Madam Trangess Conserra under the protection of Gios and captain of the Togruta guard, Maramis. Gios explained that the group needed to reach the Valo Jedi Temple to ensure Soh and Yovet's safety. Though the temple itself was incomplete, the vaults underneath the temple were. Gios was sure that these vaults would be capable of protecting the group from any attack. As the group began heading to the temple, Nihil leader Pan Eyta deployed his war cloud on Lonisa City. The war cloud consisted of toxic gas that would blind and suffocate anyone caught in it without a respirator. Gios then ordered the group to huddle together to try and clear the air around them using the Force.\nThe group resumed their attempt to reach the Jedi Temple but at a much slower pace. Maramis, remembering the layout of the fairgrounds, recommended to Gios that they head to an Rothana experimental walker that was on display. The walker likely stood taller than the toxic gas, keeping the group safe, and would allow them to reach the temple faster. Gios agreed and began leading the group towards the walker. While on route to the display walker, the group picked up an injured mother and child to their, with Soh and Yovet determined to bring them to safety. The group finally reached the walker, and Gios ordered everyone to head up the walker's stairway. As the group ascended the walker, both Gios and Maramis sensed an immense looming danger, and the two prepared to defend the walker. Soh's targons, Matari and Voru, joined the pair as the rest of the group hurried up the stairway. Though Gios was already exhausted from the immense effort he expelled by keeping the air around the group clear, he still resolved to defend Soh to the end. Through the smoke, a group of Nihil marauders appeared, and the attack began. Maramis and the targons ran into the smoke, choosing to take an offensive route. Gios remained at the walker as he believed a Jedi should only defend, not attack.\nWhile defending the walker, Gios was ambushed by a Trandoshan member of the Nihil with a Vibro-ax and a shield. The two fought intensely, with both being severely injured in the process. Gios, in an attempt to incapacitate the Trandoshan, Force pushed his attack back, slamming him into a part of the walker. Gios soon realized his actions were ill-conceived, as he had slammed the Trandoshan into the walker's stairway. The stairway fell to the ground, taking Quo with it and gravely injuring him. Soh, too, had not yet made it up the stairway and was barely hanging on the ledge of the walker. Before Gios had the chance to help her, Soh's grip failed, leaving her hanging on ledge of walker, on verge of falling to ground. Gios attempted to use Force to keep Soh in air, but had extreme difficulty due to exhaustion, injuries, and because Trandoshan charged into him again. His attacker had pinned him to the ground, knocking his lightsaber out of his hand, and began punching Gios in the face. Gios then remembered he was carrying Kant's lightsaber, pulled it out, and impaled the Trandoshan, killing him. Gios raced to his feet and searched for Soh, who he thought had fallen to the ground. Luckily, though, Gios had been able to slow Soh's fall long enough for Yovet to grab her before she fell. However, the regasa was struggling to pull the chancellor aboard the walker. Though his energy and strength were running dangerously low, Gios helped lift Soh to the walker with the Force.\nMaramis, Matari, and Voru soon returned to the walker, having fought off the Nihil attackers for the time being. While the two targons kept a lookout for more attackers, Maramis and Gios began aiding Quo. The pair created a make-shift split and gurney from the fallen Trandoshan's vibro-ax and shield. Then, with his energy all but gone, Gios used the Force to lift Quo's gurney to the walker. After Soh called down that Quo was safely onboard the walker, Gios nearly collapsed from exhaustion\u0026mdsah;Maramis' catch the only thing stopping Gios from slumping to the ground. As Maramis helped hold Gios steady, the pair heard more Nihil attackers incoming. They hurried to get the fallen stairway upright again so they could make their ascent. Once they had righted the stairway, the pair raced up to the walker. Nihil attackers soon arrived, with Maramis as the sole defender to keep them back. As soon as Gios and Maramis reached the walker's safety, Gios used his last remaining energy to Force push the stairway to the ground. Soh then began operating the walker, slowly but surely moving towards the Jedi Temple.\nGios also worked with Bell Zettifar and the Force-sensitive monster hunter Ty Yorrick against the Nihil during the attack on the Republic Fair.\nTorban Buck, Jedi Healer, wanted Gios to take a bacta bath to heal his injuries, but Gios instead opted only for less effective rejuv washes. With Chancellor Soh left in coma after the attack, Gios joined holocall with Jedi Council to discuss the events of the day. Mann interrupted the call to inform Gios that Soh was awake and had requested to see him. Journalist Rhil Dairo was also in the private room, and Gios made sure to thank her for the distress signal but was impressed by her humility. Gios approached Soh and began discussing the events of the day with her. She claimed responsibility for the tragedy and Gios attempted to dissuade her feelings. Soh promised Gios that he and rest of the Jedi Order would have full resources of Republic to find Nihil and destroy them. Gios thanked Soh, but explained that Jedi are not warriors. Soh agreed, but also stated that the Jedi were symbols, especially Gios. Soh explained that the entire galaxy saw a recording of him holding Soh, and thus everyone had seen his compassion. She wanted Gios to be the poster-child of the Jedi order who would bring down the Nihil. Gios did not verbally reject her offer, but had many doubts in his mind. He felt there were much better choices, and did not like the spotlight.\nGios's conversation with Soh was interrupted by a transmission from Regasa Yovet on Shilli, who wanted to speak with Chancellor about forming an alliance with Republic. Yovet explained that the attack on the fair had shown there was strength in unity. After the transmission was over, Soh asked for privacy with Kitrep. Gios and Mann left and discussed Gios' lack of response to Soh's request before heading to intelligence to analyze a data package from Yovet.\nDuring his analysis of the data package, Gios realized that the Nihil had a pipeline into Republic communications. Gios and Mann continued to discuss the intelligence as well as Soh's offer to Gios, before Mann turned conversation to himself. Mann explained to Gios that he needed help, and revealed that he had used the dark side during the attack. Gios assured Mann that he would help him get through it and reminded him he was not alone. Gios told him that they would soon take a trip to Jedha together and visit its Kyber Mirrors to help get Mann back on track.\nJedi Archivist OrbaLin eventually approached Gios and Mann with data analysis and explained it appeared the Nihil were planning another attack on either Hetzal Prime or the Cyclor Shipyards. With this information, Gios devised plan to lure the Nihil into a trap. He used Senator Toon to stage a transmission on a compromised line to Cyclor, letting them know Jedi would not be defending the planet in the hopes of luring the Nihil to Cyclor. Dairo confirmed the transmission was transferred, but was unsure if Nihil had heard it.\nGios and Mann were soon notified by Yorrick and Mantessa Chekkat's daughter Klerin that the Nihil had stolen plans for the Four-seven nullifier, so Gios and the rest of the group devised a plan. They discovered Nihil member Quin Amarant on Valo, who was being lead by security to a transport that would take him off world. Gios and the others said they needed to speak with Amarant, and Gios faked turning against the Jedi and let Amarant escape in the transport. Stokes and Zettifar were secretly stowed away on the transport, the latter of whom having been given Rana Kant's lightsaber by Gios since his had been lost during the attack on Valo. Amarant headed to the Nihil base on Grizal, not knowing that Gios and the others had planted a tracker on the transport along with the stowaways.\nWhile Mann and Yorrick prepared to follow Amarant, Gios joined force at Cyclor to prepare for Nihil attack. Nihil leader Pan Eyta had taken the bait and attacked Cyclor, only to be met by Republic and Jedi forces, including Gios in a Vector. Pan Eyta's forces were quickly destroyed, but Eyta himself escaped. While battle was ending, Gios prepared those gathered at Cyclor to provide reinforcements to Mann once the location of the Nihil base confirmed.\nOnce the location of the Nihil base was confirmed to be Grizal, Gios gathered fellow Jedi to join him. Gios informed Soh, who was aboard the Coruscant Dawn returning to Coruscant, that they were preparing to engage. As Gios and rest of the drift of Vectors exited hyperspace above Grizal, Gios instructed the squadron to stop as many ships from leaving as possible, support Jedi on ground, and join them if necessary. The Jedi and Republic's engagement escalated into a full battle, with Gios aiding in the sky against the Nihil. As battle ended, Gios landed out of concern when he saw Mann's vector go down and crash on the surface. Gios raced to Mann's Vector as Yorrick pulled Mann from wreckage. Gios couldn't feel Mann's heartbeat and began chest compressions, eventually bringing Mann back to consciousness again. While Gios sat with Mann and Yorrick, Stokes called Gios over comlink, requesting his presence. As Gios arrived, he found Zettifar curled up on ground and Ember fiercely defending him. Gios then saw the petrified body of Loden Greatstorm next to him, Zettifar's former master who they had believed was dead. Gios went to touch Greatstorm's face, but the petrified body collapsed in on itself and crumbled to dust, leaving Gios more afraid than he had ever been since his childhood. Gios then walked away from the scene alongside Stokes and Zettifar.\nThe recording that Rhil Dairo had taken of Gios amid the wreckage of Valo had become a universal image of the event, bringing him to hero and celebrity status in the entire galaxy.\nA week after the Attack on Valo, Gios visited all of the Jedi temples in the planet Banchii's sector to check in on them. He spoke with Jedi Master Arkoff and Jedi Lily Tora-Asi about the latter's defeat of a special subspecies of Drengir on the planet during the Attack on Valo. Gios told her that they had faced the Drengir before recently, and that they were unlike anything the Jedi had ever faced. He told her that the Nihil had used the Drengir for their attack on the Republic fair, to which Tora-Asi expressed her condolences and sympathies and Gios insisted that the Republic would rebuild and that they had the Nihil on the run until they did. He told her that when Arkoff had reached out, he had come as quickly as he could because he feared the worst due to the fact that Banchii was not fully equipped. When Tora-Asi started to apologize, Gios told her that she was an exceptional Jedi Knight and was the reason the temple was still standing. He informed her that the Jedi took down a being called the Great Progenitor that was controlling the Drengir, and that once it was taken down all of the rest of the Drengir fell. He also told her that after Valo, the Jedi had taken the fight to the Nihil and refused to let them disrupt peace in the galaxy, telling her that Banchii was well protected with her there before informing her that the other reason he had come was because the Jedi Council summoned Arkoff to assist Gios. Tora-Asi promised to take care of things there, and noticed that Arkoff was strict with her and that it seemed to work for her even though she was still learning as they always were.\nGios told Arkoff that they would leave the next day, but he first wanted to make sure a doctor conduct an autopsy on the Drengir victims on Banchii, as those victims had been turned to wood even though the Drengir viewed all life as food, saying that he didn't want to leave anything to chance after Valo. He wanted to make sure that every Jedi was on alert, no matter where they were in the galaxy, including remote locations. Arkoff chided Gios for being too optimistic, to which Gios joked that he hadn't expected Arkoff to be strict with him too.\nBefore they left, Gios went to speak with Tora-Asi one last time. He told her that because people fear what they don't know, she needed to create a bridge between the Jedi and the people of Banchii. He also reminded her that difficulties and experiences are what help them grow and that all Jedi were still learning, even him.\nIn the weeks following, Gios eventually returned to Coruscant. There he reached out via comm droid to his former Padawan Vernestra Rwoh who was on Starlight Beacon. Once they established connection, Gios apologized for underestimating how long it would take to connect to Starlight. Rwoh immediately noticed that Gios had grown his beard out more, which Gios confirmed, explaining that he had been so busy he hadn't had a chance. Rwoh said that he looked good unkempt, and that he reminded her of the human hero from the adventure holo Frontier's Peril. Gios then admitted that he grown it out to look more dignified for the council, before shifting the conversation to ask her how she was after the events of the attack on Valo, apologizing to her for not connecting since the counterassault. She said that she was as well as she could be and that she had been worried. He agreed that Valo had changed everything, which he said was the reason why he was recalling her and her Padawan to Coruscant as her heroism had made her more distinguished and thus had been asked for by name by a Republic senator to help with in an issue in the Berenge sector. Gios acknowledged that there was nothing much there, and said he would explain when she arrived. Rwoh reminded him to run it past Master Kriss, which he assured her he was going to do immediately. Gios told her that it was an incredible opportunity for her and that it was amazing how distinguished she'd become at such a young age, before saying goodbye and ending the transmission.\nGios did contact Kriss, but the communication erupted into an argument as Kriss believed that him recalling Rwoh to Coruscant was poor timing because they needed as many Jedi as they could muster to be part of the counterstrike against the Nihil. Rwoh then entered Kriss's office where she was communicating with him and heard the argument, which Rwoh thought was unlike both of them. Gios heard Rwoh's voice and told Kriss that it was the perfect opportunity to work things out themselves, telling Kriss that he expected to meet Rwoh on Coruscant before signing off. After Kriss explained what they had been discussing, Rwoh asked Kriss for advice on whether or not she should show Gios that she had modified her lightsaber to become a lightwhip, with Kriss validating her caution by admitting that Gios was a stickler for the rules. She said that Gios had always taught her that lightsabers were meant to be used as defensive tools in the protection of life, but didn't know if the light-whip satisfied that. Kriss told her to tell him and the main temple when she was ready, but warned her not to wait too long. When Rwoh was initially denied a ship to Coruscant due to crashing ships previously, Master Cohmac Vitus asked her who her master was, and when she said it was Gios he expressed that it made sense, as Gios was a great Jedi but not a great pilot.\nGios met with Jedi investigator Emerick Caphtor in his office in the Jedi Temple on Coruscant, an office that was previously that of Gios's former master, Rana Kant. Gios then unconsciously began singing an old nursery rhyme, which Caphtor questioned, though Gios responded that he had no idea what he had been singing or what song it was. Caphtor reminded him that their old Jedi nursemaid Ruusstha Vidyarvrikt had sung it to them when they were younglings and wouldn't go to sleep to try and scare them into behaving, which Gios remembered.\nHe then shifted the conversation to ask about Caphtor's analysis of the dust that Master Greatstorm had crumbled into, with Caphtor revealing that nothing about it was identifiable as Greatstorm and there were no Midi-chlorians. Gios insisted he knew what I saw and that Stokes and Zettifar had seen it too, but Caphtor explained that there was very little evidence to go off of and the witnesses had conflicting stories and couldn't make sense of what had happened. But Gios pressed on, telling him that he had never seen or felt anything like what had happened in his entire life, revealing that he was still having nightmares about it, and emphasizing that it killed one Jedi and send two others to the shock ward. He recalled that one minute they had the Nihil on the run, and then Master Mann nosedived out of the sky, Zettifar was in shock, and Master Greatstorm was just gone. Gios told Caphtor that he was the best investigator in the Jedi order, and that even if he was unconvinced and wanted to investigate Valo instead, he needed to investigate if the Nihil had a weapon that could destroy Jedi so that they could stop it.\nGios then gave him a location to investigate, explaining that Vernestra Rwoh and Master Kantam Sy had discovered a small Nihil base on Vrant Tarnum just before the attack on Valo that was spoken about by Nihil prisoners with great reverence. He also told the investigator that a team of Galactic Republic troopers were already at the barracks ready to go. Gios called Caphtor via holo just before they were going to leave, and Caphtor told him that the troopers were gearing up and that they would be en route soon. Gios then told him that he realized why he had been singing the old nursery rhyme: he knew the song ended with the word dust, though he did not remember the rest of it.\nRwoh entered Gios's office for their meeting just as his meeting with Caphtor ended, Gios telling him to keep him notified about what he uncovers and to keep the larger mission in mind despite any difficult Republic liaison. Gios introduced Rwoh to Caphtor, who told her that Gios had spoke a great deal about her accomplishments. After Caphtor left, the two sat on meditation pads opposite each other and Gios asked her about the delay in her arrival. She explained that they had gone to help against Nihil on Tiikae, which Gios realized meant she had traveled with Master Cohmac Vitus. She attributed it to a lack of ships, but Gios knew that it was because she kept wrecking them and told her that Kriss had told him that she was as bad a pilot as he once was, but assured her that she would eventually get better and that she should have patience as one of the most difficult parts about becoming a Knight early was certain things taking longer to master than others. Rwoh asked him about a story about him flying a vector for the first time that Master Vitus had suggested she ask about, but he said they should discuss it another time.\nThey then discussed the difficulty of getting any mobilization against the Nihil underway due to coruscant politics, with Gios telling Rwoh that he had called her there to be a piece of the council's piecemeal response against the Nihil. He told her that she and her Padawan Imri Cantaros would accompany a member of the Graf family to the Berenge sector to investigate reported Nihil experimental tech, and see whether or not it was a hyperspace anomaly. Rwoh didn't believe a Jedi was necessary, but Gios told her he thought she would be a good fit because of her affinity for hyperspace, and asked her if she had been working on the ability, but she insisted it was just a fluke. He explained that he had never known anyone else with the ability to navigate in hyperspace using only the Force and told her that it could lead to a rare ability, adding that some believed the Jedi were the first to use hyperspace using only the Force. Rwoh shot that down and mocked the mission, but Gios insisted that she treat it as a serious assignment and go to Senator Ghirra Starros's office immediately after to begin it.\nShe agreed and started to leave, but Gios sensed that she had something else to tell him. She showed him a mysterious cube that she had recovered from a Nihil attacker on Tiikae. While he examined it, Rwoh noticed that Gios seemed both burdened by his mantle and noticed physical signs of distress, leading her to ask if he was alright. He admitted that he could have been better but insisted he was good, then told her that the box appeared to be a puzzle cube that had been popular a century earlier. The cube did not respond to his touch, and he admitted that he did not know what its symbols meant until he recognized one of them as an old hyperspace prospector symbol that he had seen similar images of when he had visited the temple on Hon-Tallos. He told her to speak to Professor Thaddeus Wolk in the Senate offices, remembering him bragging about interviewing old prospectors. As Rwoh left, Gios once again insisted that she try her old hyperspace exercises again to see what she was capable of, pointing out that recent events had shown them that they had a lot to learn about hyperspace.\nLater, Gios alongside Master Yarael Poof and four senators listened to Master Cohmac Vitus' report on the Genetian civil war until Gios ended the meeting and promised to send Vitus' report to those present. However, He told Vitus and his Padawan Reath Silas to stay, introducing them to Senator Ghirra Starros who asked them to help Rwoh and Cantaros with the investigation in the Berenge Sector to help Xylan Graf of the Graf family. Once she left, Silas expressed his disconcertion to Gios and Vitus. Gios said that it was certainly some form of trap, adding that he had suspected someone important was helping the Nihil, but did not expect it to possibly be the Graf family. Gios told them not to tell anyone but Rwoh, as they wanted to catch the family in the act. He hoped that if they cut off the Nihil from their resources and suppliers they could end the conflict and make sure that no more lives were lost. After the two Jedi left, Silas still had concerns, but Vitus assured him that Gios always did what was best for the order.\nAfter the Nihil had been largely pushed back due to the efforts of Operation: Counterstrike and the Unified Republic Task Force, Gios hosted a meeting with Master Kriss via hologram from Coruscant to update the Jedi on Starlight Beacon about the efforts. He proudly informed them that the Unified Task Force had taken on the Nihil on Aris, Port Haven, and Golrath, leaving them running scared. When the topic of the Nihil leadership arose, Gios addressed the rumors that a new Eye of the Nihil, their leader, had come to head after they mistakenly believed that Nihil Tempest Runner Lourna Dee was both the Eye of the Nihil and had been killed in the Battle of Galov. He provided an image of a candidate Talpini man that had been spotted by Togruta intelligence on Ashas Rine that unbeknownst to him was the individual Zeetar, who was only a Tempest Runner within the Nihil. He also showed an image of an individual that that been seen in garbled transmissions intercepted by the Leresai Assembly, that unbeknownst to Gios was actually the true Eye of the Nihil, Marchion Ro. However, Gios told the meeting that they had no evidence that either was the Eye.\nKriss then suggested that they might be able to get evidence, and when Gios questioned what she was wanting to share, she explained that they had found intel that Nihil Forces were gathering in the Soola System. But Gios insisted that the Task Force had already swept the area multiple times and assured her that they would not allow the Nihil to perform another atrocity like Valo again. She insisted that the response was not enough and asked to send a team to Zallo, which Gios denied. Then Jedi Knight Keeve Trennis, who was present at the meeting, spoke up, telling Gios that Kriss was right, adding that the Nihil had helped seed the Drengir across the Outer Rim to keep the Jedi of Starlight busy while they attacked the Republic Fair on Valo. Gios said that they didn't know that for sure, but Trennis pressed on, saying that they needed to show the Nihil that Starlight was not to be played with and they needed to act. Gios told all the Jedi gathered that they would act, but as part of the unified response, not by going on their own missions just to assuage their guilt. He then ended the transmission by telling them to stand by for further instruction.\nIn 230 BBY, Starlight Beacon was towed to the planet Eiram to assist in helping the injured and to help rebuild the infrastructure after a massive cyclone disaster on the planet. Gios met with Masters Maru, Kriss, and Sskeer, and Jedi Goonral Monshi, and Trennis via hologram to discuss the effort. Maru confirmed for Gios that work had begun on the relief effort after Starlight's transfer, which Gios said was excellent. But Kriss interrupted the meeting, asking if a Nihil hyperspace path drive had been attached to the Jedi cruiser Ataraxia, which Gios asked was the drive salvaged from the Nihil craft destroyed during the Battle of Galov. Kriss confirmed this and said that their assault on the main Nihil base could begin, which shocked Gios, reminding her that the Council recommended caution. Kriss said that the base was the Great Hall of the Nihil in No-Space and it had been recently fortified, which Gios recognized as even more reason not to attack and suggested they send one of the captured ships as a scout. Kriss refused, citing the Nihil's attacks on the Jedi, which Gios insisted were attacks on the republic, and left the meeting, with Gios trying and failing to stop her as she did.\nKriss ultimately did go off on a hasty mission to capture the supposed Eye of the Nihil Lourna Dee, though Gios warned her the council did not support her and that she would face consequences and even have her status as Marshal of Starlight revoked. Went she went anyway, Gios was made into the new Marshal of Starlight Beacon and oversaw the station when it moved to the When the Nihil conducted simultaneous attacks on the Echerta system, Aleen, Yeksom, Japeal, and Tais Brabbo, Gios oversaw as Starlight Beacon opened itself up to refugees. While this occured, Gios started suffering heavily from insomnia and nightmares, though he did not know the cause.\nArriving to the Eiram system in the Ataraxia, having captured Lourna Dee and much of her Tempest, Avar Kriss contacted Starlight and got involved in an argument with Gios about her actions. As this occurred, Nihil agents set off bombs, cutting off all communications within the station, blocking off the top half of Starlight from the bottom half, locking all hanger bays from opening, unleashing the creatures that fed on Force-sensitives called the Nameless  upon the Jedi, and pushing the station into Eiram's gravitational pull. Realizing all communications were failing, Gios, Elzar Mann, and Nib Assek met and discovered all of the station's lifts were disabled and the maintenance shafts were covered in dangerous levels of radiation. The Jedi in the bottom part of Starlight then met at the quartermaster's office to discuss what their next move was. Pilot Leox Gyasi was able to get through Starlight's communications block on his ship, the Vessel, which allowed Gios to contact the Jedi Council and inform them of the situation. However, he learned that by the time any Republic forces with the power to save them could arrive, they would likely already be dead.\nOn the Vessel, Stellan Gios warned Queen Thandeka of Eiram the situation. Although she grieved for the situation, she cautioned him that the second half of the station would likely fall onto one of their largest cities below, and they may eventually have to blow apart the station in order to save thousands on the ground. He approved, and she assured him that they'd give them as much time as possible to give them a chance to repair, save their half of the station, and save everyone remaining on the station. Meanwhile, Elzar Mann was able to get communications back online on what remained of Starlight.\nWhile walking the halls, Stellan Gios was confronted by one of the Nameless, causing him to be disoriented, assaulted with visions, and greatly weakened. Gios was able to use an airlock to cut himself away from the Nameless, saving himself. Meanwhile, Bell Zettifar was able to stabilize the auxiliary power and he and Burryaga Agaburry went to find Jedi Orla Jareni, only to find her corpse, having been killed by the Nameless, along with the corpse of Nib Assek, who had gone looking for Orla, and the two quickly contacted Gios to share the news. After Gios and Mann were informed of their deaths, they decided to ask for the help of the other non-Force-sensitive people on Starlight to seal off the corridors in order to contain the Nameless on what remained of the station, as they seemed to have no interest nor have any noticeable effect on those who didn't use the Force. Later, Master Kriss activated her Force network to give strength to the other Jedi still fighting aboard the station, including Gios.\nGios ordered Zettifar to return to the medical tower to find a way to evacuate the patients there. The trapped people's desire to escape fueled growing tensions, partly caused by one of the civilians on board the station, Koley Linn, leading to a fight breaking out within the docking bay. When Gios arrived on the scene, lightsaber in hand, Linn aimed his blaster at a kid and tried to force his reckless plan of escape, but then the Vessel's Navigator Geode jumped between Linn and the kid, causing Linn's blaster bolt to be shot back onto him, killing him.\nGios, still injured and weakened from the Nameless's attack, returned to the quartermaster's office and was alerted by Mann that his plan to use depressurization to allow people to escape had succeeded, but that while the ships had managed to escape, Agaburry was wrapped up by an escaped rathtar's tentacles and likely blown into space when the bay was depressurized. Mann also informed Gios that he was planning to reconfigure the beacon so that he could reach the thrusters on the lowest level and pilot the beacon back up. Gios stayed behind.\nAt Gios's order, Zettifar had come up with a plan to separate the medical tower from the rest of Starlight if he created a large enough explosion that could push the tower out of the station. After getting his plan approved by Gios, Zettifar detonated explosives and the tower blew away from the falling station, and was caught by the Eiram medical cruiser's tractor beam.\nAfter Mann made a costly mistake in killing the only people who could save them from certain doom because he believed they were saboteurs, Gios arrived at the bottom of the station to meet him. They realized that the station had fallen past the point of saving, but Gios took to the controls of the thrusters anyway.\nGios sent Mann back up the station to escape. Gios stayed on the station to the end, and knowing he couldn't save the station but could prevent it from destroying a city on Eiram below, gave his life to use the thrusters to move the station to fall into the ocean instead. Although he did not survive, Gios prevented potentially hundreds of more deaths as a result of his sacrifice.\nAfter Starlight Beacon fell, Gios's logistics droid that had been gifted to him by Mann, JJ-5145, arrived and informed a group of surviving Jedi that had gathered on the surface of Eiram that Gios had gone down with the station, and presented the Jedi's lightsaber to Mann, who had managed to escape in an escape pod due to Gios. Avar Kriss and Mann greatly mourned Gios's death, who they considered to be the polestar of their trio. Mann vowed to himself that he would strive to be the best Jedi possible so that he could live up to the legacy of Gios. Gios's death also left his seat on the Jedi council empty.\nStellan Gios was a human male with brown hair and light skin. He wore his hair slightly long, and had grown a beard. Considered optimistic and a natural teacher, Gios was well-respected by other Jedi. In his long friendship with Avar Kriss and Elzar Mann, Gios was considered the voice of reason and guide among the trio. Mann dubbed him the polestar of their friendship, but Gios himself doubted that claim; according to Gios, they were like a trio of stars, but the suns that represented Mann and Kriss were closer together because of the intimacy they showed each other. In truth, Gios was jealous of the connection he did not share in, but he could not bring himself to possibly violate Jedi rules to join in it. Gios also realized he was someone who let the Order define himself, whereas his friends were willing to forge their own paths as Jedi.\nOver the years, Gios shielded his vulnerability and openness slowly, resulting in Mann not even noticing the ways his friend had changed. During the destruction of Starlight Beacon, Gios finally let his defenses fall away, showing himself and his concerns to Mann in a way that made his fellow Jedi realize his friend had, in a certain manner, been gone for years, only for the true Gios to suddenly return before him.\nStellan Gios was considered strong with the Force among the Jedi Order. He was able to perform a mind touch which was less commonly used ability during the High Republic Era.\nStellan Gios wore cream-and-gold Jedi robes. He wielded a blue-bladed crossguard lightsaber with a collapsible physical crossguard that folded up when the weapon was turned off. He also wielded the green lightsaber of Rana Kant, his former master, following her death. He eventually gave it to Padawan Bell Zettifar after the Padawan's lightsaber was lost during the Attack on Valo.\nStellan Gios was created for the Star Wars: The High Republic multimedia project, a narrative initiative to explore the state of the galaxy and the Jedi centuries before the events of the Skywalker saga. He was revealed to the public ahead of the initiative's release on April 2, 2020 in a StarWars.com article that provided an overview of some of the Jedi Knights and Masters that would be introduced in the upcoming project. Gios first appeared in the initial release of High Republic media, debuting simultaneously in the novel The High Republic: Light of the Jedi by Charles Soule and the young-readers book The High Republic: The Great Jedi Rescue by Cavan Scott on January 5, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Expand",
  "/wiki/Template:Update",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/Star_Wars:_The_High_Republic:_Trail_of_Shadows",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/Star_Wars_(2020)_20",
  "/wiki/Halcyon_Legacy_1",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/Talk:Stellan_Gios",
  "/wiki/230_BBY",
  "/wiki/Starlight_Beacon",
  "/wiki/Eiram",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Red_Group",
  "/wiki/Rana_Kant",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_outpost_(Caragon-Viner)",
  "/wiki/Planet",
  "/wiki/Caragon-Viner",
  "/wiki/Avar_Kriss",
  "/wiki/Elzar_Mann",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Trials",
  "/wiki/Indeera_Stokes",
  "/wiki/Theros_Major",
  "/wiki/Temple_on_Hynestia",
  "/wiki/Colonies",
  "/wiki/Hynestia_Prime",
  "/wiki/Mirialan",
  "/wiki/233_BBY",
  "/wiki/Kel_Dor",
  "/wiki/Lynela_Kabe-Oyu",
  "/wiki/Hynestian_royal_palace",
  "/wiki/Hynestian",
  "/wiki/Hutt",
  "/wiki/Povo_Punch",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Legacy_Run",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Hetzal_system",
  "/wiki/Hyperspace",
  "/wiki/Star_system",
  "/wiki/Distress_signal",
  "/wiki/Starship",
  "/wiki/Hetzal_Prime",
  "/wiki/Emergences",
  "/wiki/Jedi_Vector",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Jedi_Council",
  "/wiki/232_BBY",
  "/wiki/Coruscant",
  "/wiki/Imperial_Palace",
  "/wiki/Grand_Refectory",
  "/wiki/Aleena",
  "/wiki/Gotal",
  "/wiki/Chagrian",
  "/wiki/Spiced_eggmilk",
  "/wiki/Lucryte",
  "/wiki/Vuvrian",
  "/wiki/Commercial_District_(Coruscant)",
  "/wiki/Mind_trick",
  "/wiki/Norikus_gang",
  "/wiki/Nittel_Karkson",
  "/wiki/Octeroid",
  "/wiki/Estala_Maru",
  "/wiki/Drengir_crisis",
  "/wiki/Drengir",
  "/wiki/Plant",
  "/wiki/Hutt_Clan",
  "/wiki/Sskeer",
  "/wiki/Nib_Assek",
  "/wiki/Burryaga_Agaburry",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Coruscant_Dawn",
  "/wiki/Valo",
  "/wiki/Cyclor",
  "/wiki/Innovator",
  "/wiki/Republic_Fair",
  "/wiki/Lightsaber_combat",
  "/wiki/GoNet",
  "/wiki/Journalist",
  "/wiki/Rhil_Dairo",
  "/wiki/Norel_Quo",
  "/wiki/Vice_Chair",
  "/wiki/Larep_Reza",
  "/wiki/Senator",
  "/wiki/Izzet_Noor",
  "/wiki/Vaadu",
  "/wiki/Nihil",
  "/wiki/Attack_on_Cyclor",
  "/wiki/Cyclor_Shipyards",
  "/wiki/Bell_Zettifar",
  "/wiki/Holoprojector",
  "/wiki/Tera_Sinube",
  "/wiki/Derra",
  "/wiki/Pilot",
  "/wiki/Porter_Engle",
  "/wiki/Pra-Tre_Veter",
  "/wiki/Tia_Toon",
  "/wiki/Defense_Force_Program",
  "/wiki/Samera_Ra-oon",
  "/wiki/Togruta_government",
  "/wiki/Togruta_military",
  "/wiki/Regasa",
  "/wiki/Elarec_Yovet",
  "/wiki/Shili",
  "/wiki/Jora_Malli",
  "/wiki/Battle_of_Kur",
  "/wiki/Starlight_Pavilion",
  "/wiki/Charhound",
  "/wiki/Ember_(charhound)",
  "/wiki/Loden_Greatstorm",
  "/wiki/Muttamok_oil",
  "/wiki/Lonisa_City",
  "/wiki/Ty_Yorrick",
  "/wiki/Mantessa_Chekkat",
  "/wiki/Four-seven_nullifier",
  "/wiki/Recainium",
  "/wiki/Ty%27s_lightsaber",
  "/wiki/Torban_Buck",
  "/wiki/Kitrep_Soh",
  "/wiki/Nas_Lariin",
  "/wiki/Jom_Lariin",
  "/wiki/Jedi_archivist",
  "/wiki/OrbaLin",
  "/wiki/Targon",
  "/wiki/Trangess_Conserra",
  "/wiki/Maramis",
  "/wiki/Pan_Eyta",
  "/wiki/War_cloud",
  "/wiki/Rothana_experimental_walker",
  "/wiki/Matari_(targon)",
  "/wiki/Voru_(targon)",
  "/wiki/Trandoshan",
  "/wiki/Vibro-ax",
  "/wiki/Bacta",
  "/wiki/Juvan",
  "/wiki/Jedha",
  "/wiki/Kyber_Mirrors",
  "/wiki/Klerin_Chekkat",
  "/wiki/Quin_Amarant",
  "/wiki/Grizal_camp",
  "/wiki/Grizal",
  "/wiki/Comlink",
  "/wiki/Banchii",
  "/wiki/Arkoff",
  "/wiki/Lily_Tora-Asi",
  "/wiki/Assault_on_Mulita",
  "/wiki/Great_Progenitor",
  "/wiki/Berenge_sector",
  "/wiki/Vernestra_Rwoh%27s_lightsaber",
  "/wiki/Lightwhip",
  "/wiki/Cohmac_Vitus",
  "/wiki/Jedi_investigator",
  "/wiki/Emerick_Caphtor",
  "/wiki/Shrii_ka_rai_ka_rai",
  "/wiki/Nurse",
  "/wiki/Ruusstha_Vidyarvrikt",
  "/wiki/Midi-chlorian",
  "/wiki/Kantam_Sy",
  "/wiki/Kharvashark_Ruins",
  "/wiki/Vrant_Tarnum",
  "/wiki/Galactic_Republic_trooper",
  "/wiki/Attack_on_Tiikae",
  "/wiki/Tiikae",
  "/wiki/Imri_Cantaros",
  "/wiki/Graf_family",
  "/wiki/Ghirra_Starros",
  "/wiki/Prospector",
  "/wiki/Hon-Tallos",
  "/wiki/Professor",
  "/wiki/Thaddeus_Wolk",
  "/wiki/Yarael_Poof",
  "/wiki/Reath_Silas",
  "/wiki/Xylan_Graf",
  "/wiki/Operation:_Counterstrike",
  "/wiki/Unified_Republic_Task_Force",
  "/wiki/Aris",
  "/wiki/Port_Haven",
  "/wiki/Golrath",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Battle_of_Galov",
  "/wiki/Talpini",
  "/wiki/Togruta_intelligence",
  "/wiki/Ashas_Rine",
  "/wiki/Zeetar",
  "/wiki/Leresai_Assembly",
  "/wiki/Marchion_Ro",
  "/wiki/Zallo",
  "/wiki/Keeve_Trennis",
  "/wiki/Eiram_cyclone_disaster",
  "/wiki/Goonral_Monshi",
  "/wiki/Path_engine",
  "/wiki/Cruiser",
  "/wiki/Ataraxia",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/No-Space",
  "/wiki/Battle_for_No-Space",
  "/wiki/Marshal",
  "/wiki/Echerta_system",
  "/wiki/Aleen",
  "/wiki/Yeksom",
  "/wiki/Japeal",
  "/wiki/Tais_Brabbo",
  "/wiki/Eiram_system",
  "/wiki/Tempest",
  "/wiki/Nameless",
  "/wiki/Leox_Gyasi",
  "/wiki/Vessel",
  "/wiki/Thandeka",
  "/wiki/Orla_Jareni",
  "/wiki/Avar_Kriss%27s_network",
  "/wiki/Koley_Linn",
  "/wiki/Navigator",
  "/wiki/Geode",
  "/wiki/Rathtar",
  "/wiki/Logistics_droid",
  "/wiki/JJ-5145",
  "/wiki/Hair",
  "/wiki/The_Force",
  "/wiki/Jedi_robes",
  "/wiki/Crossguard_lightsaber",
  "/wiki/Stellan_Gios%27s_lightsaber",
  "/wiki/Attack_on_Valo",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_galaxy",
  "/wiki/Standard_century",
  "/wiki/Star_Wars_saga",
  "/wiki/April_2",
  "/wiki/2020",
  "/wiki/StarWars.com",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Charles_Soule",
  "/wiki/The_High_Republic:_The_Great_Jedi_Rescue",
  "/wiki/Cavan_Scott",
  "/wiki/January_5",
  "/wiki/2021",
  "/wiki/First_Mission",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/The_High_Republic:_A_Test_of_Courage_(audiobook)",
  "/wiki/The_High_Republic_(2021)_1",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/A_Coruscant_Solstice",
  "/wiki/Life_Day_Treasury",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._1",
  "/wiki/The_High_Republic_(2021)_6",
  "/wiki/The_High_Republic_(2021)_7",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic:_Showdown_at_the_Fair",
  "/wiki/The_High_Republic_(2021)_8",
  "/wiki/The_High_Republic:_Trail_of_Shadows_1",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Trail_of_Shadows_2",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic:_Mission_to_Disaster_(audiobook)",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic:_Midnight_Horizon_(audiobook)",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/The_High_Republic:_The_Battle_for_Starlight",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Category:Images_of_Stellan_Gios",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Inside_Intel:_Jedi_of_the_High_Republic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Death",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Standard_year",
  "/wiki/Template:LightOfTheJediDate",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/Yoda",
  "/wiki/Ephru_Shinn",
  "/wiki/Lahru",
  "/wiki/Keaton_Murag",
  "/wiki/Ada-Li_Carro",
  "/wiki/Teri_Rosason",
  "/wiki/Oppo_Rancisis",
  "/wiki/Adampo",
  "/wiki/Soleil_Agra",
  "/wiki/Ry_Ki_Sakka"
 ]
}