{
 "name": "Sterling",
 "display_name": "Sterling",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "332nd Division",
      "332nd Division"
     ]
    }
   ]
  }
 ],
 "content": "\"Sterling\" was the nickname of a clone trooper of the 332nd Division within the Galactic Republic's 501st Legion who took part in the Siege of Mandalore. During the siege, Sterling and his unit traveled to reinforce C-deck in the Undercity of the planet Mandalore's capital city of Sundari, but they were ambushed by renegade Sith Lord Maul. While fighting in the ambush, Sterling was wounded by a blaster hit to the torso, and his unit sustained heavy casualties. Sterling reported to the division's military advisor, Ahsoka Tano, about the ambush and informed her that Advanced Recon Commando CT-5597 \"Jesse\" had been taken hostage by Maul.\nSterling was a clone of the human male Jango Fett and was born on the world of Kamino. In the final days of the galactic-wide conflict between the Galactic Republic and the Confederacy of Independent Systems known as the Clone Wars in 19 BBY, Sterling was part of the 332nd Division, which conducted the siege of the planet Mandalore under the leadership of the newly appointed Clone Commander CT-7567 \"Rex\" alongside former Jedi Padawan Ahsoka Tano, who acted as an advisor. Sterling was among the clone troopers who successfully arrived at Mandalore's capital city of Sundari, where he also participated in and survived the opening skirmishes against rogue Mandalorian super commandos.\nSometime later, Sterling's unit was sent with Advanced Recon Commando Clone Lieutenant CT-5597 \"Jesse\" to reinforce C-deck in Sundari's Undercity, but they were ambushed by renegade Sith Lord Maul, who brutally cut through the Republic forces. Sterling was wounded by a blaster shot to his chest, though he survived, unlike most of the unit, which sustained heavy casualties. Sterling also witnessed Maul capturing Jesse after determining through the use of a Force mind probe that he was older than the rest of his unit.\nShortly after, Ahsoka Tano was informed of Maul's attack and quickly made her way to the site of the skirmish alongside Commander Rex. Upon seeing her, Sterling, who was supported by a fellow clone and was sitting against a wall in pain from his injuries, summoned Tano to him, respectfully addressing her as \"Commander\" despite her lack of military rank. He explained to her what had occurred, recounting Maul's ferocity, and he reached out and grabbed her arm as he emphasized that Maul had taken Jesse captive.\nAs with the other clones of Jango Fett, Sterling stood 1.83 meters tall. He had brown eyes and tan skin and sported a short black haircut. Sterling addressed Ahsoka Tano with her former military rank, befitting her status as a former Jedi and leader of the clones. Sterling insisted that Tano needed to know what happened when Maul attacked.\nSterling was equipped with a set of Phase II clone trooper armor, which along with that of other troopers of the 332nd Division of the 501st Legion was decorated to match Tano's Togruta coloration and lekku markings.\nSterling appeared in \"The Phantom Apprentice,\" the tenth episode of Star Wars: The Clone Wars' seventh and final season, voiced by Dee Bradley Baker like all other clones in the episode. The episode was released on April 24, 2020, on the Disney+ platform, although Sterling had been featured in a preview clip of the episode that was released on April 14 of that year on the official Star Wars YouTube channel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sterling_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/332nd_Division",
  "/wiki/Clone_trooper",
  "/wiki/501st_Legion",
  "/wiki/Siege_of_Mandalore",
  "/wiki/C-deck",
  "/wiki/Undercity",
  "/wiki/Planet",
  "/wiki/Mandalore",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Sundari",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Blaster",
  "/wiki/Advisor",
  "/wiki/Ahsoka_Tano",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5597",
  "/wiki/Jango_Fett",
  "/wiki/Reproduction",
  "/wiki/Standard_day",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY",
  "/wiki/Clone_Commander",
  "/wiki/Rex",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Mandalorian_super_commando",
  "/wiki/Clone_Lieutenant",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/The_Force",
  "/wiki/Mind_probe_(Force_power)",
  "/wiki/Commander",
  "/wiki/Military_rank",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Trooper",
  "/wiki/Togruta",
  "/wiki/Lekku",
  "/wiki/The_Phantom_Apprentice",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Seven",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/April_24",
  "/wiki/2020",
  "/wiki/Disney%2B",
  "/wiki/April_14",
  "/wiki/Star_Wars",
  "/wiki/Category:Images_of_Sterling",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Old_Friends_Not_Forgotten"
 ]
}