{
 "name": "Stew_(clone_gunner)",
 "display_name": "Stew  (clone gunner)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Stew\" was the nickname of a clone gunner sergeant who served aboard the Galactic Republic Venator-class Star Destroyer Endurance under Admiral Shoan Kilian during the Clone Wars. In the year 21 BBY, he tested the clone cadets of the Clone Youth Brigade, including Boba Fett, who had infiltrated the group under the alias \"Lucky,\" with target practice while they were aboard the Endurance.\nA clone of the bounty hunter Jango Fett grown on the planet Kamino, the Clone Sergeant, nicknamed \"Stew,\" served the Grand Army of the Republic as a clone gunner aboard the Venator-class Star Destroyer Endurance under the command of Admiral Shoan Kilian during the Clone Wars. In 21 BBY, Stew tested the clone cadets of the Clone Youth Brigade with target practice during their tour of the Endurance. After two cadets, Jax and Whiplash, had failed to hit their targets, a third cadet, nicknamed \"Lucky,\" destroyed his mechanical skeet with a single shot.\nDismissing the feat as a lucky shot, Stew launched three more skeet in a tri-attack formation, but Lucky once again destroyed his targets without missing a shot, much to Stew's surprise. However, unbeknownst to the gunner, \"Lucky\" was actually Boba Fett, an unaltered clone of Jango Fett, the template of the clone troopers of the Grand Army of the Republic. The young Fett had boarded the Endurance with the intention of assassinating Jedi Master Mace Windu as revenge for killing his \"father\" during the First Battle of Geonosis. Shortly after the target practice session, Fett crippled the Star Destroyer by sabotaging its reactor, forcing the Endurance's crew to evacuate as the ship plummeted to the planet Vanqor's surface.\nLike all clones of the human male Jango Fett, Stew stood 1.83 meters tall and had brown eyes and tan skin. Stew showed a sense of humor during the clone cadets' target practice aboard the Endurance. When asked by Cadet Jax what they would be using for targets, he teasingly answered that they used malfunctioning droids, to the great distress of the astromech droid R2-D2. Stew was astonished by Boba Fett's ability to destroy all of his targets without missing a shot and agreed with Admiral Kilian's assessment that \"Lucky\" was \"a cadet to watch.\"\nStew was a skilled gunner capable of destroying a skeet in a single shot without missing.\nStew wore a personalized set of Phase I clone trooper armor. The armor's plating, knee-guards, and gauntlets were colored brown, as were his helmet's cheeks and neck-guard. A red symbol adorned his left shoulder plate, while his helmet featured a pair of yellow-and-black eyes on a red background above its visor.\nOriginally identified as \"Fury\" in a piece of concept art by David Le Merrer, Stew first appeared as an unidentified character in \"Death Trap,\" the twentieth episode of the canon animated series Star Wars: The Clone Wars' second season, which originally aired on April 17, 2010, in which he was voiced by Dee Bradley Baker. The character's new name was confirmed to be Stew by Leland Chee via Twitter, which was later repeated in the Star Wars: The Clone Wars The Complete Season Two home-video set, released on October 26, 2010.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Stew_(clone_gunner)",
  "/wiki/Stew_(clone_tank_gunner)",
  "/wiki/Clone_gunner",
  "/wiki/Stew",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/File:NearMiss-DT.ogg",
  "/wiki/Clone_Sergeant",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Endurance",
  "/wiki/Admiral",
  "/wiki/Shoan_Kilian",
  "/wiki/Clone_Wars",
  "/wiki/21_BBY",
  "/wiki/Clone_cadet",
  "/wiki/Clone_Youth_Brigade",
  "/wiki/Boba_Fett",
  "/wiki/File:NotEvenClose-DT.ogg",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Jax_(clone_cadet)",
  "/wiki/1174",
  "/wiki/Mechanical_skeet",
  "/wiki/Skeet",
  "/wiki/Gunner",
  "/wiki/Clone_trooper",
  "/wiki/Assassin",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Death",
  "/wiki/Parent",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Star_Destroyer",
  "/wiki/Sabotage_of_the_Endurance",
  "/wiki/Reactor",
  "/wiki/Starship",
  "/wiki/Vanqor",
  "/wiki/File:MalfunctioningDroids-DT.ogg",
  "/wiki/Eye",
  "/wiki/Cadet",
  "/wiki/Droid",
  "/wiki/R2_series_astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Clone_trooper_armor",
  "/wiki/Helmet",
  "/wiki/File:Fury_concept_art.jpg",
  "/wiki/David_Le_Merrer",
  "/wiki/Death_Trap",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/April_17",
  "/wiki/2010",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Two",
  "/wiki/October_26",
  "/wiki/Category:Audio_files_of_Stew",
  "/wiki/Category:Images_of_Stew",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Clone_template",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/CT-411",
  "/wiki/Lethal_Trackdown",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Clone_Wars:_Episode_Guide",
  "/wiki/File:Fury_Stew.png"
 ]
}