{
 "name": "Stormtrooper_X",
 "display_name": "Stormtrooper X",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Stormtrooper X's pirate gang"
     ]
    }
   ]
  }
 ],
 "content": "Stormtrooper X was the alias of a Human male mercenary who ran a pirate gang in the Outer Rim Territories. Donning a stormtrooper helmet with a red \"X\" painted over it, Stormtrooper X was wanted by the Empire and his identity was almost universally unknown, though many of his fellow criminals considered him to be dangerous. He was once hired as a smuggler and mercenary by the Hutt crime lord Narbuj Desilijic Preor. However, Stormtrooper X and his gang later raided one of Preor's safehouses, prompting the Hutt to post a bounty of 20,000 credits on him. This posting was eventually archived in the Imperial Enforcement DataCore.\nStormtrooper X was an alias used by a male Human mercenary in the Galactic Empire whose true identity was unknown to most. He made a name for himself by working as a pirate in the Outer Rim Territories and was eventually able to build up a gang of at least a dozen other outlaws. He had dealings with several different underworld organizations and was wanted by the Empire, although Imperial inquiries into the mercenary ultimately yielded no results. He was known to have flown an N-1 starfighter with the transponder code designation Rogue Imperial 5.\nStormtrooper X was contracted as a mercenary and smuggler by a Hutt crime lord named Narbuj Desilijic Preor, though he later ended up betraying Preor by breaking into one of the Hutt's safehouses with his pirate gang and running off with a substantial amount of the Hutt's stores of spice and credits. Preor placed a bounty of 20,000 credits on Stormtrooper X, wanted dead or alive. This bounty posting was later archived in the Imperial Enforcement DataCore.\nStormtrooper X and his pirate group were considered very dangerous by the denizens of the criminal underworld. He was a Human male, although his past remained a mystery to most. The Empire thought him important enough to issue a warrant for his arrest, though they offered no reward for his capture. He could speak several different languages, including Basic, Dosh, Huttese, Rodese, and Sullustese.\nStormtrooper X wore a modified stormtrooper helmet with a large red \"X\" painted across the faceplate. The helmet contained a comlink with a broadband antenna that increased its range to 400 kilometers, as well as a signal interceptor that allowed Stormtrooper X to eavesdrop on encrypted communications. He also wore a red and brown jacket and a belt to which a blaster was attached.\nStormtrooper X was first referenced in Star Wars Gamer 6 article Bounties to Die For, written by S. Mitch Ritchie and illustrated by Ramón Pérez. The article was presented as an in-universe database of bounties posted throughout the Empire and was published on August 14, 2001.\nThe cover of the comic book Boba Fett ½, illustrated by Timothy Bradstreet and published in December 1997, features an individual resembling Stormtrooper X in a law enforcement lineup. Like Stormtrooper X, this individual wore a stormtrooper helmet, albeit without a red \"X\" painted on it, and with normal clothing worn underneath. The back of the comic features a sketch of this cover and describes the individual as \"some mysterious fellow with an appreciation for used stormtrooper armor.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Stormtrooper_X%27s_pirate_gang",
  "/wiki/Mercenary/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Red",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Narbuj_Desilijic_Preor",
  "/wiki/Bounty/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Imperial_Enforcement_DataCore/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/N-1_starfighter/Legends",
  "/wiki/Transponder_code",
  "/wiki/Rogue_Imperial_5",
  "/wiki/Spice/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Dosh/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Rodese",
  "/wiki/Sullustese/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Helmet/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Broadband_antenna/Legends",
  "/wiki/Kilometer/Legends",
  "/wiki/Signal_interceptor",
  "/wiki/Jacket/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars_Gamer_6",
  "/wiki/Bounties_to_Die_For",
  "/wiki/S._Mitch_Ritchie",
  "/wiki/Ram%C3%B3n_P%C3%A9rez",
  "/wiki/In-universe",
  "/wiki/August_14",
  "/wiki/2001",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Boba_Fett_%C2%BD",
  "/wiki/Timothy_Bradstreet",
  "/wiki/December",
  "/wiki/1997",
  "/wiki/Star_Wars_Gamer",
  "/wiki/StarWars.com"
 ]
}