{
 "name": "Stripe",
 "display_name": "Stripe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "with a white stripe"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Stripe\" was the nickname of a clone trooper who served in the Grand Army of the Republic during the Clone Wars. He was recognized among his brothers by a white-colored stripe on his naturally black hair. In 22 BBY, he was stationed at a Republic tracking station in the Pastil system that was assigned to warn the Republic of any impending Separatist attacks. During an inspection of the base by Clone Commander CC-2224 and Clone Captain CT-7567, an MSE-series droid nicknamed \"Rodent\" that helped the clones maintain the station was revealed to be an undercover spy. Stripe helped the officers find the droid, and when the droid turned out to be merely a shell for the droid's wheels, which were individual droids on their own, he helped to hunt down and destroy all them, successfully eliminating the spy threat to the station.\nThe clone trooper nicknamed \"Stripe\" was born on the Wild Space planet of Kamino. Like all of his brothers, he was a clone of the famous bounty hunter Jango Fett, born and trained to fight for the Grand Army of the Republic. However, the escalating Clone Wars relentlessly demanded more troopers to fight in the Republic army, and many younger clones—including Stripe—were rushed into service before completing their intensive training. Stripe was assigned to a remote tracking station on the Outer Rim planet of Pastil, that was supposed to warn the Republic Navy in case of an attack by the Confederacy of Independent Systems.\nIn addition to a contingent of at least five clone troopers, the Pastil tracking station was also maintained by an MSE-series droid nicknamed \"Rodent\" by the clones. In 22 BBY, the Pastil station was inspected by Clone Commander CC-2224 and Clone Captain CT-7567, nicknamed \"Cody\" and \"Rex\" respectively. While Cody reminded the \"rookies\" of the importance of their seemingly boring duty, Rex noted that the station looked unusually clean. Stripe explained to his superior officers that Rodent spent a significant amount of time polishing the station, and that the clones believed the droid to have a glitch in its programming. The inspecting officers, however, immediately noticed the droid's action as traits of a spy and issued a Code Aurek alert on the station. Captain Rex ordered the clone troopers to comb the station and find the droid by whatever means necessary. During the search, fellow clone trooper \"Bouncer\" wondered whether the officers did this at every inspection, but Stripe replied and told Bouncer not to ask stupid questions.\nWhen the droid was finally spotted, Rex shot at it with his blaster. After the droid's body was destroyed, its four \"wheels\" activated and ran off in different directions, much to the surprise of the rookie troopers. Two of the four wheels were destroyed by the clone troopers, and Stripe disabled the third one by directing electrical energy from a loose wire at it. Stripe then noticed that the fourth wheel droid was heading toward a grate and realized that if it escaped, it would be impossible to find. Determined to stop the spy, Stripe threw a V-1 thermal detonator at the grate, destroying both the droid and a solid portion of the station's interior. When Captain Rex asked Stripe if such a radical solution was necessary, Stripe proudly responded that the clones did not leave anything half-done. Rex then told the troopers to clean up the mess caused by the thermal detonator's explosion before departing along with Cody. With the spy neutralized, Cody later reported to High Jedi General Obi-Wan Kenobi that the Pastil station was fully operational.\nStripe had a white dyed stripe in his naturally black hair. The trooper was loyal to the Republic, and although he initially didn't realize Rodent was a spy, he took Rex's Code Aurek alert seriously, telling Bouncer not to ask stupid questions when the latter mused that the alert was a simple drill. Stripe later improvised a plan to disable a wheel droid with electrical energy from a loose wire. When seeing that another wheel droid was about to escape, Stripe decided to stop it by using a thermal detonator, even if it meant damaging the station's interior. When asked by a superior officer if he considered his actions to be overkill, Stripe proudly responded that as a clone he never left anything half-done.\nThe character of Stripe made his only appearance in Mouse Hunt, a short five-page webcomic published on StarWars.com and preceding \"Rookies,\" an episode in the first season of the Star Wars: The Clone Wars television series. The planet on which Stripe served on was not named in the comic itself, but was identified as Pastil in the online episode guide for \"Rookies,\" also published on the Star Wars official website. The webcomic was written by Pablo Hidalgo and illustrated by Tom Hodges.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Pastil_tracking_station/Legends",
  "/wiki/Pastil_system",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-2224/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/CT-7567/Legends",
  "/wiki/MSE-series",
  "/wiki/Droid/Legends",
  "/wiki/Rodent_(droid)",
  "/wiki/Spy/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Army/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Pastil/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Code_Aurek",
  "/wiki/Captain/Legends",
  "/wiki/Bouncer_(clone_trooper)",
  "/wiki/DC-17_hand_blaster/Legends",
  "/wiki/V-1_thermal_detonator",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/High_Jedi_General/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Hair_dye",
  "/wiki/The_Clone_Wars:_Mouse_Hunt",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/StarWars.com",
  "/wiki/Rookies",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_Clone_Wars_Episode_Guides",
  "/wiki/Star_Wars",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tom_Hodges",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Mission_to_Florrum",
  "/wiki/Ohnaka_Gang/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/The_Gungan_General",
  "/wiki/Galactic_Standard_Calendar"
 ]
}