{
 "name": "Strom_Dubrok",
 "display_name": "Strom Dubrok",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darth Krayt's Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Strom Dubrok was a male Human who held the rank of lieutenant in the navy of Lord Darth Krayt's Galactic Empire during the Second Imperial Civil War. In 137 ABY, Dubrok was stationed on the Mon Calamari Shipyards, where the Imperious-class Star Destroyer Imperious was under construction. During Dubrok's time at the shipyards, former Galactic Alliance Triumvir Gial Gahan and his niece, Monia Gahan, made an unauthorized flight around the Imperious to secretly discuss the Galactic Alliance Remnant's plans to capture the new Star Destroyer. When they landed, Dubrok confronted Gial but was manipulated by the former Triumvir, who took him to speak with the commander of the Imperial base.\nA male Human, Strom Dubrok was a lieutenant in the navy of Dark Lord of the Sith Darth Krayt's Galactic Empire during deposed Emperor-in-exile Roan Fel's insurgency against the Sith-controlled Empire. In 137 ABY, Dubrok was stationed on the Mon Calamari Shipyards orbiting the planet Dac. The Imperious-class Star Destroyer Imperious was under construction at the shipyards, and the remnants of the Galactic Alliance were preparing to launch an attack to capture the vessel. After former Galactic Alliance Triumvir Gial Gahan and his niece, Monia Gahan, made an unauthorized flight around the Imperious—during which the pair secretly discussed the Alliance Remnant's plans—Dubrok confronted Gial as the former Triumvir disembarked from his ship. Gial deflected the Lieutenant, however, and took him to speak with the commander of the Imperial base, allowing Monia to leave and report to Alliance Remnant commander, Admiral Gar Stazi.\nStrom Dubrok was a brown-haired Human with dark eyes. When Dubrok attempted to confront Gial Gahan about the unauthorized flight around the Imperious, the former Triumvir was able to manipulate the Lieutenant in order to allow his niece to leave.\nStrom Dubrok made his first appearance in the twentieth issue of the Star Wars: Legacy comic series, Indomitable, Part 1, released in February 2008. The issue was written by John Ostrander and penciled by Omar Francia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Lieutenant/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sector_Commander",
  "/wiki/Strom",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/137_ABY",
  "/wiki/Mon_Calamari_Shipyards/Legends",
  "/wiki/Imperious-class_Star_Destroyer",
  "/wiki/Alliance_(Imperious-class)",
  "/wiki/Time/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Triumvirate_(Galactic_Alliance)",
  "/wiki/Gial_Gahan",
  "/wiki/Monia_Gahan",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Empire-in-exile",
  "/wiki/Roan_Fel",
  "/wiki/One_Sith",
  "/wiki/Orbit/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dac",
  "/wiki/Starship/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_20",
  "/wiki/February",
  "/wiki/2008",
  "/wiki/John_Ostrander",
  "/wiki/Omar_Francia"
 ]
}