{
 "name": "Styles",
 "display_name": "Styles",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "18 BBY",
      "a Gozanti-class cruiser"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Depa Billaba's battalion",
      "Depa Billaba's second battalion",
      "Depa Billaba's battalion",
      "Depa Billaba's second battalion",
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "\"Styles\" was the nickname of a clone trooper captain who served in the Galactic Republic's Grand Army under Jedi General Depa Billaba.\nDuring the Clone Wars, Styles fought under Jedi Master Depa Billaba and her Padawan Caleb Dume during the battle of the planet Kaller, in which the Republic defeated the Confederacy of Independent Systems. After the battle, Styles and Clone Commander CC-10/994 \"Grey\" accompanied the two Jedi to see the Kalleran Gamut Key. Billaba informed the Kallerans that the Separatists would no longer trouble them, but the natives claimed they saw no difference between Separatist and Republic occupation. Dume, Styles and the Commander became angry at the Kallerans, but Billaba remained calm and informed Gamut Key that the Republic forces would spend the night in fields nearby. While camping later that night, the two clones and the two Jedi sat together and discussed why Billaba had not said anything to the Kallerans who compared the Republic and the Confederacy. Styles and Grey strongly disagreed when Billaba said she did not agree with Jedi taking up the rank of general, but were amused when they learned Dume had been infamous for asking too many questions during his time at the Jedi Temple on the planet Coruscant.\nAfter Separatist forces reengaged the clones on Kaller, Grey received Order 66 from Chancellor Palpatine, which branded all of the Jedi Order as traitors to Republic and called for their immediate execution. The clones of the whole battalion quickly surrounded Billaba, who was preparing to move the troops on a counter-attack. As Billaba began to be overwhelmed, Dume ran as his master told him to do. After killing Billaba, Styles was ordered by Grey to hunt down Dume and cut him off. Eventually, Grey and Styles sent the whole battalion to hunt for Dume from the forest to the Kalleran city.\nA year later, Grey and Styles managed to capture a disguised Caleb Dume and took him aboard their freighter. When Dume tried to explain that it was Palpatine, not him and the Jedi, who had betrayed the Republic before it was turned into the Empire, they were unconvinced. Dume was then rescued by General Kleeve and Janus Kasmir, and a fight began. When Grey asked why did they, clones, obey Order 66 so blindly, Styles disagreed, seeing Caleb Dume only as a traitor to the Empire. Realizing the mistake he made earlier during Order 66, Grey fired his blaster at the clone pilot's control, taking down the shields. Both the Kasmiri and the Escape fired at the freighter. The ship exploded with Grey, Styles, and two other clones on-board.\nStyles first appeared in Kanan 1, a comic book written by Greg Weisman, illustrated by Pepe Larraz and published in 2015. Although many characters from the series make an appearance in the premiere episode of Star Wars: The Bad Batch, \"Aftermath,\" Styles does not. The episode's subsequent portrayal of Order 66 does not match the comic, which portrayed Styles, Grey, and the other clones killing Billaba at their campsite in the evening following their initial assault against Kleeve. Instead, the episode shows the clones turning on Billaba in broad daylight, with Styles being absent from the event completely.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kanan_2",
  "/wiki/Star_Wars:_Kanan_Book_II:_First_Blood",
  "/wiki/Star_Wars:_Kanan",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Kamino",
  "/wiki/18_BBY",
  "/wiki/Grey_and_Styles%27_Gozanti-class_cruiser",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Depa_Billaba%27s_battalion",
  "/wiki/Depa_Billaba%27s_second_battalion",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Clone_trooper",
  "/wiki/Clone_Captain",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_General",
  "/wiki/Depa_Billaba",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_Master",
  "/wiki/Padawan",
  "/wiki/Kanan_Jarrus",
  "/wiki/Conquest_of_Kaller",
  "/wiki/Planet",
  "/wiki/Kaller",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Clone_Commander",
  "/wiki/CC-10/994",
  "/wiki/Jedi",
  "/wiki/Kalleran",
  "/wiki/Gamut_Key",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Kasmiri",
  "/wiki/Escape",
  "/wiki/Kanan_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Greg_Weisman",
  "/wiki/Pepe_Larraz",
  "/wiki/2015",
  "/wiki/Aftermath_(episode)",
  "/wiki/Kanan_8",
  "/wiki/Kanan_9",
  "/wiki/Kanan_10",
  "/wiki/Kanan_11",
  "/wiki/Kanan_3",
  "/wiki/Kanan_4",
  "/wiki/Kanan_5",
  "/wiki/Kanan_6",
  "/wiki/Kanan_12",
  "/wiki/Star_Wars_Rebels",
  "/wiki/The_Lost_Commanders",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Ghost",
  "/wiki/Fulcrum",
  "/wiki/Gathering_Forces",
  "/wiki/Ezra_Bridger",
  "/wiki/Ezra_Bridger%27s_lightsaber",
  "/wiki/Path_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Empire_Day",
  "/wiki/4_BBY",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}