{
 "name": "Styrak",
 "display_name": "Styrak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3638 BBY",
      "Darvannis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dread Masters"
     ]
    }
   ]
  }
 ],
 "content": "Lord Styrak, styled as the Corrupter of Darvannis, was a Lord of the Sith and a member of the Dread Masters. His powers were close to those of fellow Dread Master Raptus.\nFollowing three consecutive failures of their joint cause, Dread Master Styrak went to the planet of Darvannis. It was there, from the shadows beneath Oasis City, that he corrupted the various mercenary and Cartel groups to defend him as the Empire/Republic tore through the Hutt seized world. When confronted, Styrak stood at his throne next to his prized pet, a kell dragon and behind a vast number of his Dread Guards. During the battle the Dread Guards were destroyed along with his dragon. Undaunted, Styrak took to the battlefield himself, using his mastery of the Force to fight the strike team. In desperation, Styrak revived his dragon and soon used it and his leeching powers to try and finish the strike team off. When his pet fell once more, Styrak used the last of his powers to grow to a god like size and began to rampage at the team, only to be struck down again.\nStyrak's death severely affected the Dread Masters, as their union required six members in order to maintain stability. After he was struck down, the Masters began to be overwhelmed with madness, and changed their plans from creating an Empire to slaughtering everyone in the galaxy, and then killing themselves,\nThe Empire and the Republic attacked the Dread Masters' Palace on Oricon. After fellow Dread Master Brontes's death, the Masters' true base of operations, the Dread Palace, was attacked by both Republic and Imperial forces. During the final assault, the Republic/Imperial strike team fought the last four surviving Dread Masters. The Masters brought back the spirits of Styrak and Brontes to fight off the strike team while they recovered enough strength to resume combat. Styrak appeared with the apparition of his kell dragon and fought the strike force, only to be defeated again.\nStyrak possessed incredible power in the Dark side of the Force, and was responsible for the Dread Masters strength, which was gained through his rituals. A master of Sith alchemy, he was infamous for his experiments on both living and dead subjects. He was also the most individualistic of the Masters, and often pursued the group's goals on his own. This ultimately led to his own demise.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3638_BBY",
  "/wiki/Darvannis",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dread_Masters",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Raptus",
  "/wiki/Battle_of_Denova",
  "/wiki/Raid_on_Asation",
  "/wiki/Section_X",
  "/wiki/Planet/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Kell_dragon/Legends",
  "/wiki/Dread_Guard",
  "/wiki/The_Force/Legends",
  "/wiki/Oricon",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Styrak",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/2013",
  "/wiki/Standard_year/Legends",
  "/wiki/2014",
  "/wiki/3637_BBY",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/3636_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}