{
 "name": "Suba_(lieutenant)",
 "display_name": "Suba  (lieutenant)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Death Squadron",
      "Imperial Navy's officer corps",
      "Death Squadron",
      "Imperial Navy's officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Suba was a human male lieutenant in the Imperial Navy who served as Chief of Security on board the Executor, flagship of the Sith Lord Darth Vader and the head of the Death Squadron fleet. In 3 ABY, Suba was present with Admiral Firmus Piett when Vader executed Captain Lorth Needa for losing the rebel freighter known as the Millennium Falcon after the Battle of Hoth.\nVader then ordered Death Squadron to calculate all possible destinations which the Falcon could have escaped too. The Empire later tracked the Falcon to the planet Bespin, and Suba stood on the bridge while the Executor's tractor beam was prepared to capture the vessel. The Falcon however managed to escape into hyperspace.\nSuba was a human male who served in the Imperial Navy and Imperial Officer Corps of the Galactic Empire. By 3 ABY, Suba held the rank of lieutenant and worked as the Chief of Security on board the Executor-class Star Dreadnought Executor, flagship of the Sith Lord Darth Vader and head of his fleet, Death Squadron. The Executor took part in Project Swarm, a hunt for the Alliance to Restore the Republic's secret base, which culminated in Death Squadron blockading the planet Hoth.\nFollowing the Battle of Hoth, Vader had the fleet pursue the escaping rebel freighter known as the Millennium Falcon, as it was known to carry allies of the rebel pilot Luke Skywalker. After the Falcon was lost from Imperial sensors, Captain Lorth Needa came to the Executor to personally apologize for the failure. Suba stood with Admiral Firmus Piett at a bank of monitors in one of the Executor's corridors while Vader choked Needa to death behind the pair. While naval troopers dragged Needa's corpse away, Piett and Suba turned to Vader and the admiral confirmed that there was no trace of the Falcon.\nVader gave the order for all possible destinations for the Falcon to be calculated based on the ship's last known trajectory, warning Piett not to fail him again. Vader then left as Piett ordered Suba and the other officers around him to deploy the fleet, prompting Suba and the others to depart. Ultimately Vader and the Empire tracked down the Falcon on the planet Bespin, where they captured its captain, Han Solo. The rest of the freighter's crew managed to escape from the city in the Falcon, and Suba was on board the Executor's bridge as Piett gave the order to prepare the Star Destroyer's tractor beam to capture the rebel ship. However, the Falcon was able to jump to hyperspace before they could capture it, escaping the Empire once again.\nSuba did not approve of Vader's obsession with capturing Skywalker, but never objected to the Sith Lord's orders. He had fair skin, blue eyes and brown hair.\nSuba wore the olive-gray uniform of an Imperial naval officer, including one code cylinder, a rank insignia plaque with two red bars above two blue, and a cap.\nSuba first appeared 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. In Suba's final scene in the film, he and Piett's rank badges originally appeared on the wrong side of their uniforms, but this was corrected in the 2004 DVD release of the film. In the new Star Wars canon, Suba was first used in the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon. The name originated in the Star Wars Legends continuity, where it was first used on a card in the 1997 Dagobah Limited set for the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Suba_(lieutenant)",
  "/wiki/Suba_(lieutenant)/Legends",
  "/wiki/Imperial_officer",
  "/wiki/Suba",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Death_Squadron",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Lieutenant",
  "/wiki/Imperial_Navy",
  "/wiki/Chief_of_Security",
  "/wiki/Executor",
  "/wiki/Flagship",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Fleet",
  "/wiki/3_ABY",
  "/wiki/Admiral",
  "/wiki/Firmus_Piett",
  "/wiki/Death",
  "/wiki/Captain",
  "/wiki/Lorth_Needa",
  "/wiki/Freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Battle_of_Hoth",
  "/wiki/Planet",
  "/wiki/Bespin",
  "/wiki/Bridge",
  "/wiki/Tractor_beam",
  "/wiki/Hyperspace",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Executor-class_Star_Dreadnought",
  "/wiki/Project_Swarm",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Echo_Base",
  "/wiki/Blockade",
  "/wiki/Hoth",
  "/wiki/Rebel_pilot",
  "/wiki/Luke_Skywalker",
  "/wiki/Sensor",
  "/wiki/Telekinesis",
  "/wiki/Imperial_Navy_Trooper",
  "/wiki/Han_Solo",
  "/wiki/City",
  "/wiki/Star_Destroyer",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Imperial_kepi",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/2004",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars_Legends",
  "/wiki/1997",
  "/wiki/Dagobah_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Imperial_Survivor",
  "/wiki/Star_Wars_Insider_197",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Doctor_Aphra_(2016)_37",
  "/wiki/StarWars.com",
  "/wiki/File:Leland_Chee_Force_Collection.png",
  "/wiki/In-universe"
 ]
}