{
 "name": "Subject_1157",
 "display_name": "Subject 1157",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 1 BBY",
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 BBY",
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Subject 1157 was a clone of the Human male Galen Marek, the Sith Lord Darth Vader's apprentice. Subject 1157 was raised in a cloning tank at a cloning facility on the planet Kamino around 1 BBY by the Galactic Empire. A cloning technician monitored his progress and recorded a number of observation logs. Subject 1157 underwent growth acceleration and received genetic memory imprints, and he developed consciousness and later \"hallucinations\" from the life of Marek. Over time, Subject 1157 was able to access the Force, as his template was able to, and the clone cracked the inside of his tank with Force lightning. During his development, he was frequently sedated after a breach in security, but as his capacity grew and his behavior became uncontrollable, the sedation had no effect. Later, during the Battle of Kamino, Subject 1157 was going to be released into the facility's training area, but before that could happen, his tank was hit by a Force push by an individual referred to as Subject 1138, and Subject 1157 expired.\nSubject 1157 was a clone of Galen Marek, a Human male chosen as the Sith Lord Darth Vader's secret apprentice. He was held within a cloning tank at the cloning facility on the planet Kamino around one year before the Battle of Yavin. Like Marek, Subject 1157 was under the control of the Galactic Empire. As he was growing, he received genetic memory imprints. A cloning technician kept a log recording the development of Subject 1157.\nDuring Phase 13B of his development, Subject 1157 showed signs of sporadic consciousness, followed by trembling. He was subjected to mindscans to ascertain the cause of the trembling. By Phase 16D, his vital signs pointed to complete motor control, and he was able to counter stressors from the genetic impulses and memory imprints. The cloning technician was pleased with 1157's development compared to other subjects and subjected 1157 to growth acceleration. After entry 21 in the technician's log, the technician updated a nearby training room with an isolation chamber and PROXY droids in response to Subject 1157's development. The day after entry 25, Darth Vader was going to visit Subject 1157, who was more stable by that point, and the cloning technician said he was proud of the scientific advancements in the process. By entry 32, 1157 was experiencing \"hallucinations\" or \"memories,\" shocking him. He learned to manipulate Force lightning and used it to crack the inside of his tank. Prior to entry 42, some equipment was damaged by lightning; as a result, the medical droids, including a 2-1B droid, were forced to manually administer treatment, leading to inconsistency in his training. When not sedated, Subject 1157 could access the Force and reach outside the tank, attacking the droids.\nHe had access to a number of minigames to test his reflexes, including mazes, pong, and others which increased in difficulty over time, and he could hear sounds from the outside world. During Phase 22A, genetic imprints brought on hallucinations about a Human woman and made the clone anxious. In entry 29, the technician mentioned the anxiety and planned on enacting new desensitization techniques. A breach in security—the escape of another clone—resulted in systematic restraints on 1157. Darth Vader visited his tank around that time. By Entry 65, the technician hypothesized that the clone would end in aberration, and experimented with new sedation techniques. Although the restraints weakened the clone, they did not change his temperament.\nSubject 1157 had periodic visions of the life of Galen Marek and the escaped clone. Some of the visions seemed to be of events happening at that moment. The cloning technician frequently sedated or activated restraints for Subject 1157 in response to the clone's unsteady emotions. Subject 1157 also received a stormtrooper guard. The cloning technician revealed in the first entry for phase 37B that constant droid attention was needed, as the Subject's behavior was uncontrollable, and Subject 1157's capacity meant that sedation had no effect. The clone also damaged the inside of his tank with Force lightning again.\nJust prior to entry 77, an evacuation order had been given in response to the return of \"Subject 1138,\" the clone who had previously escaped the facility, and the cloning technician was going to work on getting Subject 1157 to accept the memory imprint. As a result, Darth Vader had ordered the abandonment of all nonviable test subjects, and Subject 1157 was going to be released into the training chamber. The cloning technician hoped his life's work had not been in vain during those last minutes. Later, as the Battle of Kamino went on outside Subject 1157's tank, a Force-wielding individual referred to as Subject 1138 approached the tank. As the individual approached, Subject 1157 pounded the inside of the tank with his hand in vain before the other individual hit his tank with a Force push. Subject 1157 expired.\nSubject 1157, like his clone template, had light skin, and he had a stable capacity early in his development, unlike other test subjects. The cloning technician who monitored Subject 1157 was pleased at the clone's developments. During his development, Subject 1157 underwent rapid acceleration and received memory imprints. As time went on, he developed hallucinations, which disturbed him and caused tremors in his body. As a result, he was systematically sedated. He grew in capacity, though, and sedation had no effect. Until the end of Subject 1157's life, the cloning technician tried to get the clone to accept the memory imprints.\nSubject 1157 was Force-sensitive, as was his template. The clone learned to manipulate the Force to affect the environment outside his tank and could also use Force lightning.\nThroughout summer 2010, Subject 1157 was a character in the official website for the LucasArts Star Wars: The Force Unleashed II video game, before the site changed to an interactive database and removed the content. During the time when the website featured Subject 1157, the viewers saw the room outside of a tank from 1157's perspective, and could listen to audio about his development, view visions of the player character—Starkiller, another clone of Galen Marek—and view a countdown clock, which listed the time in Aurebesh before the site's next update. Successful completion of minigames such as mazes or pong unlocked visions, which served as teasers for the game itself and came from in-game videos as well as scenes from 2008's Star Wars: The Force Unleashed. The website was frequently updated with new content. The content was also accessible through Star Wars: The Force Unleashed II cloning tank website. After \"Subject 1138,\" revealed in The Force Unleashed II to be Starkiller, destroyed the tank, viewers were no longer able to view the visions or listen to the audio recordings. Though it was still running, the countdown clock to the next update was also no longer readable. It is not possible to recreate this scene in the actual game, as the only action that can be taken while passing the cloning tanks is walking, and Subject 1157 is not referenced in the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Kamino/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galen_Marek",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Cloning_tank",
  "/wiki/Timira_City",
  "/wiki/Planet/Legends",
  "/wiki/Unidentified_cloning_technician",
  "/wiki/Memory_flash",
  "/wiki/Force_vision/Legends",
  "/wiki/Time/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Escape_from_Kamino_(1_BBY)",
  "/wiki/Assault_on_Kamino",
  "/wiki/Telekinesis/Legends#Force_push",
  "/wiki/Subject_1138",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/File:Subject_1157_minigame.jpg",
  "/wiki/Brain/Legends",
  "/wiki/Technician/Legends",
  "/wiki/PROXY_droid",
  "/wiki/Darth/Legends",
  "/wiki/Medical_droid/Legends",
  "/wiki/2-1B/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Pong",
  "/wiki/Juno_Eclipse/Legends",
  "/wiki/Aberrant_clone",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Limb/Legends",
  "/wiki/File:Starkiller_profile.png",
  "/wiki/2010",
  "/wiki/LucasArts",
  "/wiki/Star_Wars:_The_Force_Unleashed_II",
  "/wiki/Video_game",
  "/wiki/Aurebesh/Legends",
  "/wiki/2008",
  "/wiki/Star_Wars:_The_Force_Unleashed_(video_game)",
  "/wiki/Star_Wars:_The_Force_Unleashed_II_(comic)"
 ]
}