{
 "name": "Sugi_(bounty_hunter)",
 "display_name": "Sugi  (bounty hunter)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Iridonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.82 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sugi's bounty hunters",
      "Hutt Clan"
     ]
    }
   ]
  }
 ],
 "content": "Sugi was a female Zabrak bounty hunter who operated during the Clone Wars. She befriended the Jedi Obi-Wan Kenobi, Anakin Skywalker and Ahsoka Tano while protecting a farming village on Felucia from Hondo Ohnaka and his pirate gang.\nHer sister was the mother of Jas Emari, who ventured into bounty hunting by the time of the Galactic Civil War.\nSugi was a Zabrak female who was born on Iridonia. She eventually became a bounty hunter, active during the Clone Wars.\nAlong with her fellow bounty hunters Embo, Rumi Paramita and Seripas, Sugi was hired as protection by the Felucian elder Casiss Midagatis to protect his village from the Ohnaka Gang, who were threatening farmers in exchange for a portion of their precious nysillin crops, the meager amount of which just kept them able to afford food and fuel. Meanwhile, Jedi Master Obi-Wan Kenobi, Jedi Knight Anakin Skywalker, and his Padawan Ahsoka Tano came to the planet to verify the destruction of a medical station. Their shuttle was shot down by vulture droids, and they came to the village seeking help off the planet. The villagers hid, and the bounty hunters confronted them at gunpoint, but Midagatis defused the situation on realizing the intruders were Jedi and could help.\nThat night, Sugi confronted the Weequay pirates who came to the village. Their leader, Hondo Ohnaka, offered to pay her double what the Felucians offered, but she refused. Kenobi tried to bribe Hondo. However, he refused and warned he would return after the Felucians harvested their crop. At a subsequent discussion, Skywalker suggested they train the farmers to help them stop the coming attack. Sugi oversaw the transportation of the nysillin into the barn, and told the villagers to hide there to make them easier to defend. When she spotted a pirate scout, Embo caught and killed him, prompting Ohnaka to go on the offensive. Embo was injured by tankfire, and Sugi carried him into the barn before resuming fighting beside Kenobi. Skywalker confronted Hondo on his tank and almost killed him, prompting the pirate captain to declare the operation unprofitable and flee. Afterwards, as the Felucians rebuilt, Sugi offered the Jedi a lift home.\nIn 20 BBY, Sugi was hired by the Wookiee General Tarfful to transport him and his soldiers to the Trandoshan moon Wasskah to rescue Chewbacca. Among the other Trandoshan prisoners they rescued were Ahsoka and the Jedi younglings Jinx and O-Mer. After dropping them off at the Jedi Temple on Coruscant, Sugi spoke with Grand Master Yoda and Master Mace Windu before departing. Between those missions, Sugi and Embo hung out on Tatooine. She was in Jabba the Hutt's palace during Baron Notluwiski Papanoida's visit, and at Mos Eisley's cantina when Asajj Ventress took the bounty on Savage Opress.\nSugi and Embo took a job guarding Gardulla Besadii the Elder's palace—the gathering place of the Grand Hutt Council—on Nal Hutta with Latts Razzi and Dengar. When the commanders of the Shadow Collective—Opress, his brother Maul and Death Watch leader Pre Vizsla—came demanding the Hutt Clan's submission, Jabba, who was attending via hologram, ordered the bounty hunters to kill them. Sugi threw a knife at Maul, which Opress stopped with the Force and handed to Maul, who threw it back at Embo's anooba Marrok. A fight ensued, with Sugi just opening fire instead. She jumped out of the way of Vizla's flamethrower and pursued the crime lords, only to be pushed back as Bo-Katan Kryze's Nite Owls entered the fray. She snuck up on Maul and Vizsla, engaging the Sith Lord in hand-to-hand combat after Marrok knocked him away from his lightsaber. After Maul threw her aside, Razzi and Dengar threw smoke bombs at the Sith, prompting her to follow Razzi's suggestion that she and Embo flee. Maul let her go, remarking they were only bounty hunters.\nAt some point, Sugi encouraged her niece Jas Emari, who had a difficult upbringing on Iridonia, to run away. She inspired her to take up bounty hunting too. During the Imperial Era, Sugi and Emari worked with Embo and Dengar. While Sugi and Emari got along with Embo and Marrok, they did not get along with Dengar. Despite their differences, the bounty hunters maintained a sense of mutual respect for each other.\nAt some point, Sugi's debts fell onto Emari, who was forced to work to pay them off. During the Battle of Jakku, Emari appealed to Embo and Dengar's partnership with Sugi to convince them not to let the bounty hunter Mercurial Swift hand her over to Black Sun.\nSugi was an honorable mercenary who would take jobs because she believed in them, not just because she would be paid. She cared for her companions and was one for stopping in mid-battle to check on a comrade if they were hurt. She disliked the Jedi, quipping they were peacekeepers who failed to keep it during the Clone Wars, and was antagonistic towards Kenobi for implying she was only on Felucia for the credits, although he had initially refused to help the locals. However, after fighting alongside him against the pirates, they developed a mutual respect. On Nal Hutta, Sugi displayed her hand-to-hand combat skills when fighting Maul, temporarily hanging with the renegade Sith Lord before being overpowered.\nSugi used a sawed-off EE-3 carbine rifle but was also capable with a knife, able to wield it in hand-to-hand combat as well as throw it with great accuracy. She owned an SS-54 assault ship, the Halo, which was painted with a tooka doll holding a knife that read \"Nice playing with ya.\" The ship was inherited by her niece.\nSugi was voiced by Anna Graves in the Star Wars: The Clone Wars TV series episodes \"Bounty Hunters\" and \"Wookiee Hunt.\" She studied Russian at college and was aiming to give Sugi that accent; she also mixed in some Middle Eastern accents for the alien. Her character is one of the few known creatures in the Star Wars canon to speak with a Slavonic accent. Graves recorded some subsequent appearances for the character before the show's cancellation.\nBefore the cancellation of Star Wars: The Clone Wars TV series, two members of Sugi's bounty hunters were set to appear during a four-episode arc starring Boba Fett and Cad Bane. In a clip revealed during the \"Animated Origins and Unexpected Fates\" panel at Celebration Orlando in 2017, Embo was seen throwing an EE-3 carbine rifle to the ground, hinting that Sugi was set to not only appear, but also be killed off in a battle with Embo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sugi_(bounty_hunter)",
  "/wiki/Sugi_(bounty_hunter)/Legends",
  "/wiki/Sugi",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Iridonia",
  "/wiki/Zabrak",
  "/wiki/Iridonian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Sugi%27s_bounty_hunters",
  "/wiki/Hutt_Clan",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Ahsoka_Tano",
  "/wiki/Farm",
  "/wiki/Felucia",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Ohnaka_Gang",
  "/wiki/Sugi%27s_sister",
  "/wiki/Jas_Emari",
  "/wiki/Time",
  "/wiki/Galactic_Civil_War",
  "/wiki/Embo",
  "/wiki/Rumi_Paramita",
  "/wiki/Seripas",
  "/wiki/Felucian",
  "/wiki/Casiss_Midagatis",
  "/wiki/Farmer",
  "/wiki/Nysillin",
  "/wiki/Foodstuff",
  "/wiki/Fuel",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_Knight",
  "/wiki/Padawan",
  "/wiki/Haven-class_medical_station",
  "/wiki/T-6_shuttle",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Weequay",
  "/wiki/Pirate",
  "/wiki/Skirmish_on_Felucia",
  "/wiki/WLO-5_battle_tank",
  "/wiki/20_BBY",
  "/wiki/Wookiee",
  "/wiki/General",
  "/wiki/Tarfful",
  "/wiki/Trandosha",
  "/wiki/Moon",
  "/wiki/Wasskah",
  "/wiki/Chewbacca",
  "/wiki/Trandoshan",
  "/wiki/Prisoner",
  "/wiki/Jedi_Initiate",
  "/wiki/Jinx",
  "/wiki/O-Mer",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Mace_Windu",
  "/wiki/Tatooine",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Baron",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Mos_Eisley",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Asajj_Ventress",
  "/wiki/Bounty",
  "/wiki/Savage_Opress",
  "/wiki/Gardulla_Besadii_the_Elder",
  "/wiki/Gardulla_the_Hutt%27s_Palace",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Nal_Hutta",
  "/wiki/Latts_Razzi",
  "/wiki/Dengar",
  "/wiki/Shadow_Collective",
  "/wiki/Nightbrothers",
  "/wiki/Maul",
  "/wiki/Death_Watch",
  "/wiki/Pre_Vizsla",
  "/wiki/Hologram",
  "/wiki/The_Force",
  "/wiki/Anooba",
  "/wiki/Marrok",
  "/wiki/Mission_to_Nal_Hutta",
  "/wiki/Flamethrower",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Nite_Owls",
  "/wiki/Sith_Lord",
  "/wiki/Smoke_bomb",
  "/wiki/Imperial_Era",
  "/wiki/Battle_of_Jakku",
  "/wiki/Mercurial_Swift",
  "/wiki/Black_Sun",
  "/wiki/Mercenary",
  "/wiki/Credit",
  "/wiki/EE-3_carbine_rifle",
  "/wiki/SS-54_assault_ship",
  "/wiki/Halo",
  "/wiki/Tooka_doll",
  "/wiki/Anna_Graves",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Bounty_Hunters_(episode)",
  "/wiki/Wookiee_Hunt",
  "/wiki/Alien",
  "/wiki/Star_Wars",
  "/wiki/Boba_Fett",
  "/wiki/Cad_Bane",
  "/wiki/Celebration_Orlando",
  "/wiki/2017",
  "/wiki/Blaster_carbine",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Sphere_of_Influence",
  "/wiki/Revenge_(episode)",
  "/wiki/Eminence_(episode)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_99",
  "/wiki/Starship_Fact_File",
  "/wiki/No_Disintegrations_(Fantasy_Flight_Games)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_9",
  "/wiki/Ships_and_Vehicles",
  "/wiki/Star_Wars_Inside_Intel:_Bounty_Hunters",
  "/wiki/Star_Wars:_The_Secrets_of_the_Bounty_Hunters",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ghosts_of_Mortis",
  "/wiki/Water_War",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/April_1",
  "/wiki/2015",
  "/wiki/September_23",
  "/wiki/2020",
  "/wiki/September_16"
 ]
}