{
 "name": "Sul_Fansord",
 "display_name": "Sul Fansord",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Partisans"
     ]
    }
   ]
  }
 ],
 "content": "Sul Fansord was a human male who served as a member of Saw Gerrera's Partisans on the moon Jedha. In 0 BBY, he was part of the Partisan forces that ambushed an Imperial TX-225 GAVw \"Occupier\" combat assault tank carrying kyber crystals through Tythoni Square in Jedha City, signaling the other Partisans when the vehicle arrived at an inflection point. He and two others then emerged in front of the tank and opened fire on the Imperials.\nThe human male Sul Fansord was a member of the Partisans, a group of freedom fighters led by the Onderonian Saw Gerrera who had established themselves in the Catacombs of Cadera on the moon Jedha in order to disrupt the Galactic Empire's kyber crystal mining operations on the moon. In 0 BBY, the Partisans planned to ambush an Imperial convoy carrying a shipment of kyber crystals in Jedha City's Tythoni Square. Prior to the attack, the Partisans hid themselves around the square, with Fansord waiting on top of one of the archways leading into the square as a lookout.\nAfter the convoy, which consisted of members of the Imperial Hammers Elite Armor Unit—including several stormtroopers on foot and a TX-225 GAVw \"Occupier\" combat assault tank—entered the square, Fansord signaled the other Partisans on a comlink when the tank reached an inflection point. As the other Partisans prepared to attack, Fansord moved down to ground level and met up with two other human Partisans. When one of the other two gave the signal, the trio started walking out into the square as another Partisan who was stood on a balcony above the square hurled a grenade down in front of the tank.\nAfter the grenade detonated, Fansord and the two Partisans with him revealed the blaster rifles they had hidden under their coats and opened fire on the Imperials while blocking one of the entry points into the square. The trio managed to gun down three stormtroopers in front of them, although one of Fansord's companions was then killed by return fire. Ultimately, the Partisans managed to disable the tank and kill its escort, allowing them to steal the kyber crystals on board before Imperial reinforcements arrived. The city and the catacombs were destroyed shortly afterwards by the Death Star superweapon, killing many of the Partisans.\nSul Fansord had light skin, black hair, and brown eyes. When signaling the other Partisans, he spoke in an alien language.\nFansord wore a dark brown robe with a light brown coat over it that had red cuffs. He also wore dark red hood, a brown backpack with gray straps, and black boots. During the ambush, he used a silver comlink and a black blaster rifle.\nSul Fansord appeared in the 2016 Anthology Series film, Rogue One: A Star Wars Story, portrayed by an uncredited actor. The character was then identified in the 2021 reference book Star Wars: Battles that Changed the Galaxy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Partisans",
  "/wiki/File:Fansord-Signal.ogg",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Saw_Gerrera",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/0_BBY",
  "/wiki/Battle_on_Jedha",
  "/wiki/Galactic_Empire",
  "/wiki/TX-225_GAVw_%22Occupier%22_combat_assault_tank",
  "/wiki/Kyber_crystal",
  "/wiki/Tythoni_Square",
  "/wiki/Jedha_City",
  "/wiki/TX-225_Occupier",
  "/wiki/Onderonian",
  "/wiki/Catacombs_of_Cadera",
  "/wiki/Mining",
  "/wiki/Crystal",
  "/wiki/Imperial_Hammers_Elite_Armor_Unit",
  "/wiki/Stormtrooper",
  "/wiki/Limb",
  "/wiki/Comlink",
  "/wiki/Grenade",
  "/wiki/Tank_(vehicle)",
  "/wiki/Blaster_rifle",
  "/wiki/Clothing",
  "/wiki/Death",
  "/wiki/City",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Alien",
  "/wiki/Language",
  "/wiki/Backpack",
  "/wiki/Boot",
  "/wiki/Blaster",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/2021",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Category:Images_of_Sul_Fansord",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Battlefront_II:_Inferno_Squad"
 ]
}