{
 "name": "Suljo_Warde",
 "display_name": "Suljo Warde",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chandrila"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "A female Jedi"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Gel Marcolf"
     ]
    }
   ]
  }
 ],
 "content": "Suljo Warde was a Human male Chandrilan Jedi Knight who served the Jedi Order during the Clone Wars between the Galactic Republic and Confederacy of Independent Systems. During his time with the Order, Warde created a holocron in which he stored information on his unusual form of foresight.\nWarde was rescued from assassins on the planet Eriadu by the Mirialan Gel Marcolf, leading Warde to bring Marcolf along with him in the hopes of training him as a Jedi. Warde traveled to the planet Arbooine, but not before stopping on the way to hide his holocron on a craggy planet. There, Warde removed the three information-storing kyber crystals from the holocron. He gave one to Marcolf, whom he appointed the temporary head of one of Arbooine's cities, and subsequently traveled to Cato Neimoidia for his new assignment.\nAfter defeating Separatist forces in the planet's city of Jorra, Warde was tasked with maintaining Republic control of the city. As he did so, Warde became harsher and more irrational, falling closer to the dark side of the Force. Eventually, Warde met with a group of Separatist delegates, fell to the dark side, and slaughtered them, forcing his two fellow Jedi to try to kill him, but Warde killed them instead in a duel. He then fled in his starfighter to the Sith world of Moraband, where he remained for years until the arrival of a group of Force-sensitives who had discovered Warde's holocron and gathered two of its crystals. Warde met the group on Moraband, at first hiding his identity before revealing himself and challenging the discoverers to a duel.\nSuljo Warde was a male Human born on the Core Worlds planet of Chandrila. Warde joined the Jedi Order in his youth and was eventually apprenticed to a female Jedi Master who would regularly invent heavy-handed wisdom. At some point during the apprenticeship, Warde's master made him run laps around the Jedi Temple after he joked that she was not very wise.\nDuring the Clone Wars of 22–19 BBY, which was fought between the Galactic Republic and Confederacy of Independent Systems, Warde, then a Jedi Knight, served as a general in the Grand Army of the Republic. During his service, Warde became proficient at a form of precognition that allowed him to view the future actions of other individuals, making him a more skilled fighter and allowing him to turn the tide of multiple battles, sometimes before they actually occurred. Because of the war, Warde knew that his life could be cut short at any time, and so created his holocron after seeing disturbing visions of the future.\nWhile on a tour of duty with the Grand Army, Warde was attacked by Separatist assassins on the Outer Rim Territories planet Eriadu, where he was saved by a teenage Mirialan named Gel Marcolf. Warde, who would later save Marcolf's life in return, believed that the Force-sensitive Marcolf had the potential to join the Jedi Order. As such, he brought the Mirialan with him to the planet Arbooine—where Warde had been laying the groundwork for a Republic outpost—with plans to eventually bring him to Coruscant, the capital of the Republic. Even though Marcolf was potentially too old to begin Jedi training, Warde hoped that he might be able to take Marcolf as an apprentice. However, he did not share that information with Marcolf, whom he believed to be too immature to learn it. Warde hoped that the trip would teach Marcolf about conflict resolution and a Jedi's responsibilities.\nAs Warde and Marcolf traveled to Arbooine, the Jedi considered the notion that knowledge was a heavy burden on its possessor. He believed that that idea might have been stated by his master, but acknowledged that it might have simply resembled the type of things that she said, and decided that he would have to ask his master when he returned from his tour of duty. After being asked by Marcolf if he was talking to himself, Warde remarked that he was becoming more and more like his master, and that he would have to introduce Marcolf to her when they reached Coruscant.\nFollowing that exchange, Warde felt his holocron tugging at his mind and peered into a potential future of an endless war. Shaken by the vision, Warde withdrew his personal holocron from his robes—an act that allowed him to view more potential futures, including one of a group of desperate, skulking figures. Warde became lost in thought until he was awakened by Marcolf. In light of his visions, Warde decided to remove the holocron's kyber crystals, which contained much of the holocron's data, although he would continue to add to them for some time. When he had done so, Warde redirected their starship to a craggy planet, where he would leave the holocron.\nOn the planet's surface, Warde tossed one of the holocron's crystals to Marcolf, who caught it. Warde explained what the crystal was and asked him to keep it safe for him. Marcolf agreed, and would keep the crystal for many years. Warde, still shaken by his vision despite the knowledge that it would not necessarily come true, thought it risky to leave the information stored in his holocron for unknown future individuals. Ultimately, he concluded that doing so would be no different than the risk taken by other teachers, and took comfort in the fact that the gatekeeper, an artificial personality inside the holocron, would remain to guide the finders of the holocron. Additionally, he made sure that the three crystals were separated so that the power contained within could not fall into the wrong hands. He knew it would be difficult to assemble the holocron, but believed that it was possible. Finally, Marcolf and Warde continued their trip to Arbooine, with the latter committed to focusing on the present, rather than the future.\nWhile on Arbooine, Warde scouted for a location for his Republic base. He eventually reached the town of Quolas, in which two rival families feuded for control. Knowing that he had to resolve the conflict before continuing his search, Warde used his authority as a Republic general to appoint Marcolf the temporary reeve, or community leader, of Quolas. Warde then left the planet, telling Marcolf to wait for the arrival of more Republic forces and promising that he would find a more permanent peaceful solution. Warde's destination was Cato Neimoidia, a central world of the Neimoidian species.\nAt some point before leaving Arbooine, Warde gave Marcolf a sword made of cortosis, which Warde requested that he train with. Marcolf continued training for many years and would ultimately embrace the dark side of the Force, becoming a cruel tyrant who oppressed the people of Quolas. By the Imperial Period, many of the city's older residents felt a strong dislike of Warde for allowing Marcolf to take power, although they were also reluctant to speak about him, with some younger residents of the city having no concrete knowledge of Warde.\nWarde arrived on Cato Neimoidia and used his Force abilities to predict the actions of the Separatist leaders, allowing the Republic to destroy several Separatist factories that were preventing the capture of the city of Jorra, which had been holding out against Republic forces for some time. In addition to contributing to the assault strategically, Warde fought on the ground and rescued a Neimoidian named Tieka Dalken and her family when they were endangered by the battle. After the city's fall, Warde and two fellow Jedi, Kaddo Moll and Jiv Durael, worked to maintain Republic control of the city alongside the clone trooper TH-313, known as \"Tacker,\" who held Warde in high esteem. Although Warde requested that the Jedi High Council allow him to return to Arbooine, his request was denied, forcing Warde to continue to take part in a grueling mission against his wishes.\nJorra was filled with Separatist sympathizers, which led to frequent attacks on the Republic forces. To prevent such attacks, Warde initially relied primarily on Tor Haido, a Neimoidian whom Warde had singled out as an informant soon after the conquest because he foresaw that Haido would not betray him. Over the months that Haido worked with Warde, the Jedi began to rely more and more on his own prognostication instead of Haido's information. Each time that Warde was unable to predict one of those attacks, he blamed himself, which sent him on a spiral toward the dark side of the Force and led him to begin arresting a number of Neimoidians—including a child named Gren Olpan—based only on his visions of potential futures.\nWarde also became increasingly moody and angry with his allies. Because Warde's predictions were not enough evidence to hold civilians, Warde began to feel that the other Jedi and the laws of the Republic were constraining him, furthering his frustration. Warde began to view his darkest visions more often, to see the darkest possible future outcomes as certain, and to believe that his own actions were predestined. Meanwhile, he also grew suspicious of his fellow Jedi and the clones under their command, and started to act alone more and more often, eventually beginning to illegally hold prisoners.\nEventually, Warde and his fellow Jedi made plans to meet with a delegation of Neimoidian Separatists—Onrein Hasar, Niot, Petri, and Morm—who wanted to engineer a cease-fire for the entire planet. After seeing a future in which the Neimoidians betrayed the Jedi, took over the planet, and prolonged the war, Warde informed the other Jedi, who dismissed his vision. As a result, a furious Warde, believing that the Jedi had betrayed him, attacked the group preemptively, slaying each delegate except for Hasar. His actions were perceived as murder by the city's residents and by Moll and Durael.\nThe other Jedi attempted to arrest Warde, but he resisted. The Jedi fought throughout Jorra's Sankar Palace, yet Warde ultimately was able to win due to his precognition. He cut Durael's lightsaber in half and used his own lightsaber to run Durael through, killing him and causing the still-alive Moll to determine that Warde needed to be stopped at any cost—even if it meant killing him. She struck back at Warde, and when his precognition temporarily failed, she inflicted a mortal wound upon him. Moll was also left dying after being struck by Warde's sabers. Before her death, Moll sent a message to the Jedi Council that informed them of Warde's fall while the former Jedi fought his way through clone troopers to reach his starfighter. Warde fled the planet, leaving one of his holocron's three crystals in Durael's hand. From Cato Neimoidia, Warde traveled to Moraband, the Sith homeworld. Knowing the extent of his injuries, the other Jedi believed him to be dead.\nAlthough Warde, his emotions in turmoil, expected to die on Moraband, he survived and became a hermit. He was never able to understand why he had chosen to come to Moraband, even after years of contemplation; he had been unknowingly driven to do so because he had seen that he would die on the planet. Soon after arriving on the planet, a delirious Warde began communicating with the echoes of long-dead Sith, who claimed they could help him atone for his actions, and embraced the dark side even more openly than he had previously. While living on the planet, Warde established a camp inside a Sith palace, where he kept a datapad full of ranting prophecies.\nDuring the Imperial Period, a group of Force-sensitives retraced Warde's steps and spoke with the people who had known him, ultimately allowing them to find Warde's holocron and two of its crystals. Eventually, they arrived on Moraband, looking for the final kyber crystal. There, they met Warde, who recognized the discoverers from his visions and refrained from revealing his identity. The untalkative Warde, who then had a gray beard and a walking cane, initially shared little with the group, although he did give them water and tell them that he found his solitude agreeable, as opposed to Moraband's atmosphere. Later, he told a story about a time many years ago when a Jedi by the name of Suljo Warde had arrived on Moraband and died, but not before informing the hermit that the discoverers of Warde's holocron would come to Moraband in search of him. Warde claimed that the discoverers had been described to him perfectly, but that their motivations were unknown to him. He did promise, however, to take the group to Warde's tomb in exchange for a small price, yet he refused to elaborate any further on what that price might be.\nWarde was being less than truthful about more than who he was; instead of bringing the group to Warde's tomb, he slowly led them to the Sith palace. Warde believed that the group had come to kill him, and that they would succeed. In that sense, he did genuinely believe that the palace would ultimately become his tomb. However, despite his conviction about the preordained outcome of the meeting, Warde's visions were clouded by the dark side of the Force, meaning that his knowledge of the discovers' motives was flawed; his death at the hands of the holocron's discoverers was only one possible outcome. To an extent, Warde hoped for death so that he could eliminate his guilt, but was still bitter enough to attack and try to kill the discoverers.\nWarde had dropped his cane after entering the palace, as he did not truly need it to walk or fight. Soon after, he stood up straight, pushing his robe aside to unveil a lightsaber. Announcing to the holocron holders that the Jedi Masters had been wrong and that the future was truly fixed, his true identity became clear to the discoverers. Drawing his lightsaber, Warde held up the final kyber crystal and placed it in his robes. He then challenged the discoverers, themselves lightsaber wielders, to draw their own weapons.\nWarde attacked aggressively, using both his lightsaber and his Force abilities. The battle began in the central chamber of the Sith palace. As the fight continued, the Sith spirits in the temple began to appear, causing impossible shadows to form and creating strange voices and tendrils of darkness.\nA light-skinned Chandrilan with gray hair, Warde was well-liked by most of the troops serving under his command. Although a skilled warrior and tactician, Warde's losses in battle weighed heavily upon him. Additionally, Warde's slide toward the dark side changed his personality dramatically, making him more paranoid, withdrawn, moody, cynical, and resentful. By the time he met with the discoverers of his holocron, Warde's appearance had been dramatically altered by unnatural aging caused by his use of the dark side to the extent that even the his holocron's gatekeeper, which was based on Warde's own memories, could not recognize him. By this point, Warde was relatively untalkative. Despite his taciturnity, Warde was willing to quip about Moraband's weather.\nAs a Jedi, Warde was Force-sensitive. He was particularly skilled at the power of foresight, which allowed him to see the likely future actions of other sentients. During his time fighting in the Clone Wars, Warde's foresight improved dramatically, eventually allowing him to see battles before they happened, which in turn allowed him to save lives and learn how to win battles before they began. Many Jedi had the ability to sense the future, but Warde's ability was unique in that it focused on the decisions that other beings would make rather than just events.\nWhile serving as a general in the Clone Wars, Warde also used his foresight to predict the movements of his opponents in combat, which gave him a reputation as a master of the use of the lightsaber. However, his foresight had major limitations; for example, it could not show Warde his own future, and its unclear visions helped to put him on a path toward the dark side. According to Tacker, Warde was a good tactician and strategist, albeit not a great one.\nWarde wielded a green-bladed lightsaber in combat. He also used a personal holocron to store his collected wisdom and to aid him in his foresight. During his time on Moraband, Warde wore heavy robes and carried a cane.\nSuljo Warde was introduced as the focus of the 2015 roleplaying adventure Chronicles of the Gatekeeper, published by Fantasy Flight Games as part of the Star Wars: Force and Destiny roleplaying module. The book contradicts itself by stating that Warde finished his holocron on Arbooine, but also that he left the holocron on an unnamed planet before going there. As the latter version of events is described in greater detail, this article assumes that it is correct. In Chronicles, the final challenge for the player characters —who are the discoverers of Warde's holocron—is to obtain the last of his crystals from Warde, which can be done successfully by either defeating him or \"guiding him to the path of redemption.\"\nWhen Warde first meets the PCs on Moraband, his identity is not revealed to them. If the PCs ask him outright who he is, Warde simply says that he is \"a seeker of truth.\" Additionally, while Chronicles suggests several possible ways in which the player characters can meet Warde, it does not describe a specific, canonical meeting. Likewise, while the text of the book assumes that the PCs believe what Warde is saying, the book also suggests ways that a game master might help the player characters see through Warde's untruths.\nThe roleplaying adventure provides several other responses to possible questions asked by the player characters. However, whether or not these responses were ever stated canonically is unclear. For example, if the PCs ask Warde why he was expecting them, he states that \"time reveals all secrets, even those we keep from ourselves.\"\nThe duel between Warde and the player characters is especially open to the decisions of the players. The book states that the fight \"should be exciting and memorable,\" and that the environment should be used to make the fight interesting. It suggests multiple possibilities for how the game master might do so, such as having Warde or the PCs shatter the temple's skylight. Chronicles also gives the option to make the spirits in the temple participate in the battle. Additionally, Chronicles states that if any player character is temporarily incapacitated, Warde will focus on another target.\nWarde's ultimate fate is not specified, although details are given on two potential paths: Warde's death at the hands of the player characters and Warde's redemption. In order for the latter path to be taken, the PCs are required to communicate with Warde. Chronicles suggests that this might be done by convincing Warde that his death in the duel is not preordained, by appealing to his humanity, by convincing him that it is not too late to undo the damage he has done, or through some other manner. Meanwhile, the Sith phantasms are suggested as antagonists for this section, attempting to keep Warde aligned with the darkness. If Warde is successfully redeemed, he deactivates his lightsaber and, now full of compassion, thanks the PCs for what they have done, telling them that the Force is strong with them and that his knowledge is now with people who are wiser than him. Warde then gives the third kyber crystal to the PCs and decides that he must redeem himself alone. The book does, however, suggest that Warde could be used as part of a later adventure.\nIf the other path is taken, Warde eventually lets his guard down so he can be killed, while pressing the attack in a way that requires that the PCs kill him. When this happens in the fight is at the game master's discretion, but it must happen if one of the PCs is dead and/or it appears that Warde will win the battle. When Warde is mortally wounded, he lies on the ground and smiles, telling the PCs that all of them have fulfilled their destinies. He also states that although he has many regrets, the duel was not one of them, and that he is content to have his power end up in the PCs' hands. He wishes that the Force be with the player characters and dies. His kyber crystal can be found in a pouch in his robes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Chandrila/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Suljo_Warde%27s_master",
  "/wiki/Gel_Marcolf",
  "/wiki/Chandrilan/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Time/Legends",
  "/wiki/Holocron_of_Suljo_Warde",
  "/wiki/Precognition/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Eriadu/Legends",
  "/wiki/Mirialan/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Arbooine",
  "/wiki/Holocron/Legends",
  "/wiki/Unidentified_craggy_planet",
  "/wiki/Lightsaber_crystal",
  "/wiki/Reeve",
  "/wiki/Quolas",
  "/wiki/City/Legends",
  "/wiki/Cato_Neimoidia/Legends",
  "/wiki/Confederacy_military/Legends",
  "/wiki/Jorra",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Death/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Korriban",
  "/wiki/Standard_year/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/22_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Gatekeeper",
  "/wiki/General/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Species/Legends",
  "/wiki/Sword/Legends",
  "/wiki/Cortosis/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Force_power/Legends",
  "/wiki/Battle_of_Jorra",
  "/wiki/Factory/Legends",
  "/wiki/Tieka_Dalken",
  "/wiki/Kaddo_Moll",
  "/wiki/Jiv_Durael",
  "/wiki/Clone_trooper/Legends",
  "/wiki/TH-313",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Tor_Haido",
  "/wiki/Information_broker/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Gren_Olpan",
  "/wiki/Cloning/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Onrein_Hasar",
  "/wiki/Niot",
  "/wiki/Petri_(Neimoidian)",
  "/wiki/Morm",
  "/wiki/Sankar_Palace",
  "/wiki/Lightsaber/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Hermit/Legends",
  "/wiki/Unidentified_Sith_palace",
  "/wiki/Datapad/Legends",
  "/wiki/Cane/Legends",
  "/wiki/Water/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Weapon/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/2015",
  "/wiki/Roleplaying_game",
  "/wiki/Chronicles_of_the_Gatekeeper",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Force_and_Destiny",
  "/wiki/May_the_Force_be_with_you/Legends",
  "/wiki/Category:Images_of_Suljo_Warde",
  "/wiki/Strongholds_of_Resistance",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Atlas"
 ]
}