{
 "name": "Sumalee",
 "display_name": "Sumalee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red",
      "white",
      "gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Sumalee was a female Togruta Jedi Master who served the Jedi Order and the Galactic Republic during the Galactic War. She was on Corellia during the fighting with the reconstituted Sith Empire.\nDuring the Cold War Sumalee was good friends with Risha Drayen and Shariss Kartur, and the three women were referred to as \"the Triple Threat\" during their extravagant young years. Eventually, the three parted ways: Risha went into organized crime, Shariss became an Agent of Republic Strategic Information Service, and Sumalee joined the Jedi Order. By the time of the Galactic War she earned the rank of a Jedi Master, though her scoundrel background did show through her training and she was noticeably more sarcastic, cynical and ready to use violence compared with the average Jedi.\nSumalee stayed in contact with Shariss during the years. In 3642 BBY Shariss had been investigating the activities of the Voidwolf, but her Republic escort had been killed by the Imperials, forcing her to hide on Hoth in one of the Voidwolf's private vault, and she had to call Sumalee for extraction. Because no Republic forces were available, Sumalee choose to seek help from Risha, now traveling in the company of a famous smuggler and a Republic privateer on behalf of Senator Bevera Dodonna known as the Voidhound. Sumalee asked Risha and the Voidhound to extract Shariss, which they completed with little difficulty, allowing Shariss to return safe and sound and report her findings to the SIS. Sumalee was impressed by the smuggler's actions and promised to stay in touch.\nSumalee later personally met with the Voidhound at the Gilded Descent Casino in the Coronet City on Corellia while the latter was chatting up her Drall assistant Hreda. She assumed that the smuggler was on a mission for Dodonna, only to learn that the Senator had betrayed the Republic to the Voidwolf. Though the news was shocking, Sumalee stated that they needed proof to incriminate Dodonna.\nThe proof they needed was Darmas Pollaran, an undercover agent of the Imperial Intelligence. With Hreda's aid, they were able to identify a privately owned residence belonging to Pollaran, which the Voidhound went to investigate. The smuggler later called Sumalee on a holo and informed her that Pollaran had duped Corellian Resistance leader Nevis Kitt into attempting to unseal Supply tunnel 26, suggesting it would help the Resistance, while in truth it would only give the Empire an opening. The smuggler went to intercept the agent, while Sumalee commandeered a Republic squad and arrived to the scene after the smuggler had exposed Pollaran. Kitt then took note of the assassin droids Pollaran summoned before he fled, identifying them as being manufactured at Councilor Caicos' droid factory. Sumalee explained that the factory had been re-purposed into a medical center and that Pollaran would've likely fled there. She instructed the Voidhound to launch staged attacks to draw the Imperial guards away from the factory before infiltrating the place as a patient.\nAfter the Voidhound had arrested Pollaran, who gave up all the evidence incriminating Dodonna, he reunited with Sumalee at Republic safe house in the Axial Park. Sumalee informed the Voidhound that Senator Dodonna had escaped from Republic forces and went to ground in the Museum of Alien History, now an Imperial POW camp. Sumalee instructed the Voidhound to infiltrate the museum via the Selonian tunnels with the help of Selonian Curske.\nThe smuggler apprehended Dodonna and later returned with news that the Voidwolf was amassing a pirate fleet to attack the Republic shipyards and then invade the Core Worlds. Dodonna has regretted her betrayal after mistreatment at the hands of the Imperials and confirmed the news, begging Sumalee to send the Voidhound after the Voidwolf personally. The best way to find the Voidwolf was through Senator Caicos, who had holed up in his residence since ever Corellian citizenry learned of his treachery. Sumalee instructed the smuggler to take out the security systems around Caicos' residence before getting a guard to cooperate and let them in.\nThe Voidhound managed to acquire Caicos' shuttle to the Voidwolf's flagship, the Regnant. Sumalee informed her ally that the Republic was too preoccupied against other Imperial offensives to send aid immediately. She promised that if the Voidhound succeeded in stopping the Voidwolf, the Republic would give him highest honors.\nThe Voidhound managed to succeed in killing the Voidwolf and took command of his pirate fleet, and had them aid the Republic instead of selfishly using it for pirating. Reuniting back on Corellia, Sumalee introduced the smuggler to Senator Rone, Fleet Admiral Helik, Supreme Commander Rans and Supreme Chancellor Leontyne Saresh, who commended the Voidhound's action and bestowed on the Voidhound the Senatorial Medal of Service, the highest civilian award the Republic could offer. The Jedi Master also offered to continue to sponsor the Voidhound as a privateer under her advisement and promised to stay in touch.\nDuring the flashpoint \"The Nathema Conspiracy\", if the Outlander is a Smuggler who made the Dark Side choice to keep Voidwolf's fleet for themselves, Sumalee will seek to stop them and join the Order of Zildrog led by Vinn Atrius, only to be sacrificed as fuel to awaken Zildrog by GEMINI 16 on Nathema. If the smuggler made the Light Side choice to pledge Voidwolf's pirate fleet to the Republic, Nexia Kirill will appear instead of Sumalee, while the other classes face antagonists from their own class stories.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Sumalee_Montano",
  "/wiki/Togruta/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_War",
  "/wiki/Corellia/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Risha_Drayen",
  "/wiki/Shariss_Kartur",
  "/wiki/Agent/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Jedi/Legends",
  "/wiki/3642_BBY",
  "/wiki/Harridax_Kirill",
  "/wiki/Hoth/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Bevera_Dodonna",
  "/wiki/Voidhound",
  "/wiki/Gilded_Descent_Casino/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Drall_(planet)",
  "/wiki/Hreda",
  "/wiki/Darmas_Pollaran",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Nevis_Kitt",
  "/wiki/Supply_tunnel_26",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Councillor/Legends",
  "/wiki/Caicos",
  "/wiki/Droid/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Axial_Park",
  "/wiki/Museum_of_Alien_History",
  "/wiki/Selonian/Legends",
  "/wiki/Curske",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Regnant",
  "/wiki/Rone",
  "/wiki/Helik",
  "/wiki/Supreme_Commander_(Alliance/Republic)",
  "/wiki/Rans",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Leontyne_Saresh",
  "/wiki/Senatorial_Medal_of_Service",
  "/wiki/Alliance_Commander",
  "/wiki/Order_of_Zildrog",
  "/wiki/Vinn_Atrius",
  "/wiki/Zildrog",
  "/wiki/GEMINI_16",
  "/wiki/Nathema",
  "/wiki/Nexia_Kirill",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}