{
 "name": "Sumari",
 "display_name": "Sumari",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pilgrims"
     ]
    }
   ]
  }
 ],
 "content": "Sumari was a female Twi'lek and the Matriarch of Kalikori village on the planet Tython. Succeeding Kolovish as leader of the Pilgrims, Sumari brought her daughter, Ranna Tao'Ven, with her to Tython, where the Pilgrims built their small settlement in the Tythos Ridge mountains near the Jedi Order's new Temple. Sumari served as Matriarch for several years until she fell ill around 3643 BBY, when the native Flesh Raiders began to attack both the Jedi and the villagers in greater numbers. Despite her sickness, Sumari directed her villagers while aiding the Order in investigating the causes of the natives' recent activities. Ultimately, however, the Twi'lek succumbed to her illness and died, leaving her daughter as the new Matriarch.\nA Twi'lek female, Sumari joined the Pilgrims, a religious group founded by Matriarch Kolovish on the planet Ryloth, during the Pilgrims's travels between Twi'lek colonies during the Great Galactic War between the Republic and the Sith Empire. Sumari and her daughter Ranna Tao'Ven were among the Pilgrims who settled on the planet Tython and refused to depart after the Republic's denial of their settlement request, establishing Kalikori village at the base of the Matriarch's Summit in the Tythos Ridge. Sumari eventually became the Matriarch of the village when Kolovish retired to an ancient stone tower atop the summit.\nAround 3643 BBY, the native Flesh Raider began to attack the village in greater numbers and with rising frequency. Also around this time, Sumari fell ill, and was plagued by weakness and feelings of fatigue and exhaustion. Whenever her mother's illness was too much for her, Sumari's daughter, Tao'Ven, would take over her duties as Matriarch, as she did during the crisis involving Nalen Raloch and the Fount of Rajivari. Raloch, a Force-sensitive villager, discovered the mystical Fount and was corrupted to the dark side and driven insane. He then attempted to destroy the Forge machine that the Jedi Order used to construct lightsabers, but was stopped by the apprentice of Jedi Master Yuon Par and healed of his insanity. Raloch was trained as a Jedi as a way of easing tensions between the Order and the village, but the people of Kalikori Village remained resentful of the Jedi for their lack of aid.\nWhen a group of Flesh Raiders under the leadership of a Human Dark Jedi named Callef attacked the region known as the Tythonian Gnarls, a Jedi apprentice fought and defeated Callef. Having witnessed the apprentice's skill, Jedi Master Orgus Din took the young Jedi on as his own Padawan, and sent the apprentice to Kalikori to see if the villagers had noticed anything strange lately.\nThe apprentice met with Sumari and her daughter, and the Matriarch expressed her anger with the Jedi about their refusal to aid the village before directing the young apprentice to speak with her Scout Chief, Moorint. Sumari would have continued the conversation, but her illness had taxed her strength too much, and she was forced to retire. Sumari rested while the Padawan recovered a supply of weapons from the Flesh Raiders for the villagers, but by the time the Padawan returned to the village after several missions, Sumari had passed away, leaving Tao'Ven as the new Matriarch.\nA green-skinned Twi'lek female with blue eyes, Sumari cared deeply for her people. Even when she fell deathly ill, she continued to serve as Matriarch until her illness had weakened her to the point where she could no longer walk. Sumari held a deep grudge against the Jedi Order for refusing aid to her village, but swallowed her pride when Orgus Din's apprentice approached the village with an offer of help. Her devotion to her people overrode her personal feelings and safety, and her passing greatly affected her daughter, Ranna Tao'Ven.\nSumari was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. She appears in the Jedi Knight class story mission \"High-Tech Savages,\" but is forced to retire and allows her daughter and Moorint to continue the conversation with the player. She does not appear again, as she dies of her illness while the player is taking out a shield generator in the later quest \"The Face of the Enemy.\"\n Sumari on Star Wars: The Old Republic Wiki",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tython/Legends",
  "/wiki/3643_BBY",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pilgrims",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Matriarch",
  "/wiki/Kalikori_village",
  "/wiki/Planet/Legends",
  "/wiki/Kolovish",
  "/wiki/Ranna_Tao%27Ven",
  "/wiki/Tythos_Ridge",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Temple_(Tython)/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Flesh_Raider",
  "/wiki/Flesh_Raider_uprising",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Matriarch%27s_Summit",
  "/wiki/Kolovish%27s_tower",
  "/wiki/Time/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Search_for_the_Fount_of_Rajivari",
  "/wiki/Nalen_Raloch",
  "/wiki/Fount_of_Rajivari",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Forge",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Barsen%27thor",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Yuon_Par",
  "/wiki/Jedi_training/Legends",
  "/wiki/Human/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Callef",
  "/wiki/Tythonian_Gnarls",
  "/wiki/Hero_of_Tython",
  "/wiki/Duel_in_the_Gnarls_cave",
  "/wiki/Orgus_Din",
  "/wiki/Padawan/Legends",
  "/wiki/Scout_Chief",
  "/wiki/Moorint",
  "/wiki/Raid_on_the_Flesh_Raider_weapons_cache",
  "/wiki/Skirmish_at_the_ancient_shrine",
  "/wiki/Raid_on_the_Tythos_Ridge_shield_generator",
  "/wiki/Eye/Legends",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}