{
 "name": "Sunmantle",
 "display_name": "Sunmantle",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kynachi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gold"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "KynachTech Industries"
     ]
    }
   ]
  }
 ],
 "content": "Sunmantle was a male Kynachi, who was a pilot for KynachTech Industries. In 21 BBY, he and Pikkson were assigned to escort Commissioner Langu Sommilor to Coruscant. Sommilor and the two pilots were replaced by Black Sun impostors, who were later assassinated. The real Sunmantle was soon discovered with the others onboard their TL-1800 freighter, and completed the voyage to Coruscant with Breakout Squad and the Jedi Nuru Kungurama.\nSunmantle was a Kynachi male pilot for KynachTech Industries. In 21 BBY, along with the pilot Pikkson, he was assigned to escort Commissioner Sommilor to Coruscant. Sunmantle and the others were accosted at the landing pad and replaced by Black Sun imposters. The imposters arrived on Vaced to meet with their escort, the Jedi Nuru Kungurama, and were killed by a sniper. In the aftermath of the battle at Bilbringi Depot, the real Sunmantle, Pikkson, and Sommilor were discovered by the clone trooper Breakout Squad tied up in their TL-1800 freighter's hold. Sunmantle and Pikkson then piloted the freighter to Coruscant. While in hyperspace, Sunmantle provided a status report to the young Jedi. At Coruscant, they landed at the Senate Building. While Sommilor was led to a meeting with Supreme Chancellor Palpatine, the two KynacTech pilots took Kungurama and Breakout Squa] to the Jedi Temple. En route, Jedi Master Harro Kelpura received notification that his research lab in the Dacho District had been broken into, and ordered a change of course. Once there, the freighter was impacted by a dropship belonging to a bounty hunter assisting in the break-in. The ship was damaged and crashed. Kungurama ordered Pikkson to take off, but the landing gear had been snagged. Kungurama cleared it and they took off again, but upon approaching the lab, they were hit by a missile, causing Breakout Squad to fall out. Sunmantle and Pikkson then piloted the freighter out of sight.\n\"Sunmantle\" first appeared in Ryder Windham's young readers book, The Clone Wars: Secret Missions 3: Duel at Shattered Rock, but was revealed to be an impostor in the following book, The Clone Wars: Secret Missions 4: Guardians of the Chiss Key. The real Sunmantle joined with Breakout Squad for the voyage to Coruscant.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kynachi_(species)",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/KynachTech_Industries",
  "/wiki/Pilot/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Pikkson",
  "/wiki/Commissioner/Legends",
  "/wiki/Langu_Sommilor",
  "/wiki/Coruscant/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Mission_to_Vaced",
  "/wiki/TL-1800_freighter",
  "/wiki/Breakout_Squad",
  "/wiki/Jedi/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/Vaced/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/Bilbringi_Depot",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Senate_Building",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Harro_Kelpura",
  "/wiki/Dacho_District",
  "/wiki/Sleight_of_Hand",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Missile/Legends",
  "/wiki/Ryder_Windham",
  "/wiki/The_Clone_Wars:_Secret_Missions_3:_Duel_at_Shattered_Rock",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/Star_Wars_Annual_2011",
  "/wiki/Battle_of_the_Kaliida_Nebula/Legends"
 ]
}