{
 "name": "Supi",
 "display_name": "Supi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Supi was a green-skinned Twi'lek female who served the corrupt Senator Orn Free Taa as a loyal aide. She had a bitter rivalry with another of Taa's aides named Pampy, and the two fiercely competed for his favor. In 22 BBY, Supi accompanied Taa and other members of the Galactic Senate's Loyalist Committee to a meeting in the office of Supreme Chancellor Sheev Palpatine on the planet Coruscant.\nSupi was a Twi'lek female who served as an aide to Senator Orn Free Taa, the corrupt representative of the planet Ryloth in the Galactic Senate of the Galactic Republic. During the Separatist Crisis in 22 BBY, Taa served as a member of the Loyalist Committee, and Supi accompanied him and Pampy, another of his aides, along with the other members of the committee, to a meeting in the office of Supreme Chancellor Sheev Palpatine in the Senate Office Building.\nUpon the committee's arrival, Palpatine's assistant Dar Wac let the chancellor know that Supi and the others had arrived. Palpatine then had Wac send them into the office just as he concluded a meeting with the members of the Jedi High Council. Before the committee sat down, the two groups discussed the recent attempts on the life of Senator Padmé Amidala, another member of the Loyalist Committee. The Jedi then left after agreeing to provide additional protection to Amidala, leaving the committee to begin their meeting with Palpatine.\nSupi was loyal to Orn Free Taa and competed fiercely for his favor with Pampi, with whom she had a bitter rivalry. Supi had green skin and blue eyes.\nSupi wore a maroon robe and a silver headpiece to the meeting in Palpatine's office.\nSupi first appeared in the film Star Wars: Episode II Attack of the Clones, released May 16, 2002. In the current Star Wars canon, Supi was identified in the 2017 reference book Star Wars: The Visual Encyclopedia. The name originated in the Star Wars Legends continuity, where Supi was first named in Star Wars: Attack of the Clones: The Visual Dictionary, a 2002 reference book written by David West Reynolds.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Supi",
  "/wiki/Supi/Legends",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Senator",
  "/wiki/Orn_Free_Taa",
  "/wiki/Aide",
  "/wiki/Pampy",
  "/wiki/22_BBY",
  "/wiki/Loyalist_Committee",
  "/wiki/Emperor%27s_office",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Ryloth",
  "/wiki/Separatist_Crisis",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Dar_Wac",
  "/wiki/Jedi_High_Council",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/May_16",
  "/wiki/2002",
  "/wiki/Star_Wars",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Attack_of_the_Clones:_The_Visual_Dictionary",
  "/wiki/David_West_Reynolds_(author)",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_Attack_of_the_Clones_Graphic_Novel_Adaptation",
  "/wiki/Category:Images_of_Supi",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_42",
  "/wiki/Databank_A-Z",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_Updated_and_Expanded_Edition"
 ]
}