{
 "name": "Sura",
 "display_name": "Sura",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Five Brothers Resort and Casino"
     ]
    }
   ]
  }
 ],
 "content": "Sura was an athletic red-skinned female, Twi'lek who, during the Galactic Civil War, worked on Centerpoint Station for the Five Brothers Resort and Casino. She worked renting equipment on Conical Six, a mountain located on Centerpoint and at one stage sent one of her employees, Jek Bannon up the mountain to capture several promotional images. Bannon was saved after he collapsed from heat exhaustion by a group of spacers who also climbed the mountain, and Sura was extremely thankful for their help.\nSura was a female Twi'lek who worked for the Five Brothers Resort and Casino on Centerpoint Station during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. After the casino purchased exclusive rights to the use of Conical Six, one of the South Conical Mountains in the space station, Sura was stationed at the bottom of the mountain to sell climbing supplies. She offered various climbing equipment for rent including magnetic boots for 15 and repulsor packs for 45. Whilst Sura was stationed at the mountain she remained near the base at a fence built to enclose the Conicals and wore a shirt emblazoned with her employers logo. On one occasion she sent one of her employees, a boy named Jek Bannon, to climb the mountain so that he could capture several images of the peak for promotional use by the casino.\nOn the same day that Surra sent Bannon up the mountain she was told to expect a group of spacers who had been hired by the casino to clear out a vynock infestation on Conical Six. When they arrived she greeted them and offered to rent them her equipment, giving them details on the mountain and mentioning that she had already sent Bannon up the mountain. The climbers then ascended the mountain where they found Bannon collapsed due to heat exhaustion. The group killed several vynocks before waking the boy, who then called Sura and asked for her to send up a transport to pick up both him and the spacers which she did. Upon their return Sura met the transport at the nearest landing pad and thanked the spacers for rescuing Bannon, paying them in vouchers to exchange at the casino for helping and giving them some extra credits for bringing down Bannon's equipment with him.\nWhen Sura met the spacers she greeted them in a friendly manner and when they saved Bannon she was extremely relieved and thankful, rewarding them for their actions.\nSura was an athletic, red-skinned, female Twi'lek.\nSura first appeared as a character in the adventure module \"Conical Six Summit\", one of several modules included in the Suns of Fortune sourcebook for the Fantasy Flight Games Star Wars: Edge of the Empire roleplaying system. The book, which was released in 2014, gave several reasons why the players might be climbing the mountain when they find Bannon, although hunting vynocks is the reason used throughout the adventure text and so this article assumes this to be the case.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Five_Brothers_Resort_and_Casino",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Centerpoint_Station",
  "/wiki/Conical_Six",
  "/wiki/Mountain/Legends",
  "/wiki/Jek_Bannon",
  "/wiki/Spacer/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Casino/Legends",
  "/wiki/South_Conical_Mountains",
  "/wiki/Space_station/Legends",
  "/wiki/Magnetic_boot/Legends",
  "/wiki/Credit",
  "/wiki/Repulsor_pack/Legends",
  "/wiki/Canon",
  "/wiki/Standard_day/Legends",
  "/wiki/Vynock/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Conical_Six_Summit",
  "/wiki/Suns_of_Fortune",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire",
  "/wiki/2014"
 ]
}