{
 "name": "Suribran_Tu",
 "display_name": "Suribran Tu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tibrin"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21.38 BBY",
      "Tibrin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ishi Tib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Suribran Tu's regime",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Suribran Tu was a male Ishi Tib politician who lived during the final years before the rise of the Galactic Empire. During the Clone Wars, Tu was ruling his homeworld of Tibrin as a dictator with the backing of the Galactic Republic—an interstellar superpower that operated under the ideals of democracy and freedom. Tu was left to conduct his governance as he saw fit, and his regime ruled with an iron fist and ultimately killed a considerable number of its own people through political assassinations. With the outbreak of the Clone Wars in 22 BBY, the citizens of Tibrin placed their loyalty with the Confederacy of Independent Systems, causing the separatist government's Head of State, Count Dooku, to travel to the world and meet with Tu. The Ishi Tib premier offered to switch allegiance from the Republic to the Confederacy and rule Tibrin at Dooku's command, but the Confederate leader instead executed Tu when Dark Acolyte Quinlan Vos suggested that murdering Tu would engender the loyalty of the people of Tibrin.\nSuribran Tu was an Ishi Tib male native to his species' homeworld of Tibrin. In the years prior to the rise of the Galactic Empire, Tu lived as a politician and eventually came to be the premier of his home planet and a dictator to his people. Although his regime was marked by low approval from the Ishi Tib and an iron-fist approach to governance, it held the support of the Galactic Republic—the preeminent interstellar government that dedicated its rule to the ideals of freedom and democracy. Between 24 and 22 BBY, a separatist government known as the Confederacy of Independent Systems formed in opposition to the Republic, which was increasingly seen as corrupt and stagnant. By the outbreak of the Clone Wars between the two superpowers in 22 BBY, the Ishi Tib populace of Tibrin was calling for their planet to join the Confederate uprising under the leadership of Count Dooku.\nTu resisted the will of his people and instead employed strong-arm tactics and ordered many political assassinations to maintain his own position, as well as his planet's allegiance to the Republic. Dooku eventually learned of the situation on Tibrin and so traveled to the planeton 21.38 BBY—seven and a half months following the Battle of Geonosis—with a posse of his Dark Acolytes to engage in negotiations with Tu. The Confederate Head of State's arrival on the world was met with jubilation from the populace, who organized a welcoming rally outside Tu's palace while the Count and their dictator met within. During the meeting, Dooku requested the rights to use Tibrin as a Separatist base, but Tu could see where the balance of power lay in the negotiations—given the Confederacy's support from his people and the presence of the Count's Acolytes, Tu understood that Tibrin now belonged to Dooku. The Ishi Tib explained to the Count that he could accept this new reality, and that it would be in the best interest of both parties if the Confederacy left him in charge of Tibrin so that he might be able to rule his people in Dooku's name.\nDooku sought advice on the matter from two of his Dark Acolytes—former Jedi Kadrian Sey and Quinlan Vos. While Sey argued that leaving Tu in charge of Tibrin would allow for continuity of administration and experienced leadership, Vos asserted that leaving the dictator in place would prove to the populace that there was no difference between the Confederacy and the Republic. Vos further insinuated that Tu's willingness to swap allegiances could be a liability, an argument to which the Count was receptive. Dooku agreed with Vos and so abruptly executed Suribran Tu by beheading the dictator with his lightsaber. The Count proceeded to appoint his student Sora Bulq as Tibrin's provisional governor, with the duty of killing all members of Tu's inner circle, including political and military advisors, as well as family members. Acolytes Sey and Tol Skorr took Tu's body to be displayed to the public fashion; Dooku ordered that the dictator's head be mounted somewhere highly visible. Meanwhile, the Count himself greeted the crowds outside the palace, who welcomed him as a hero and quickly joined the Confederate cause.\nAlthough Suribran Tu was seen as a cruel dictator by both his people and later historians, he merely believed himself to be a practical being. Because the Republic government had propped up Tu's regime despite the dictator's transgressions against his own people, Tu chose to remain loyal to the ancient democracy and fight his own people and their Separatist sympathies. These actions earned him the scorn of the Ishi Tib and the suspicion of Count Dooku and Quinlan Vos, who saw his reign as a prime example of why the Republic had to be replaced. When the dictator finally chose to defect to the Confederacy, he did so on the grounds that both he and Dooku were reasonable, and that the two could both be satisfied with Tu serving as a proxy governor. Dooku disagreed and was hailed as a liberator for his execution of Suribran Tu.\nSuribran Tu first appeared in Jedi: Count Dooku, a comic book written by John Ostrander and illustrated by Jan Duursema. The comic was published by Dark Horse Comics and published on December 3, 2003.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tibrin/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Ishi_Tib/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Orange",
  "/wiki/Green_(disambiguation)",
  "/wiki/Suribran_Tu%27s_regime",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi:_Count_Dooku",
  "/wiki/Politics/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Death/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Tibrin_revolution",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Premier",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Species/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Suribran_Tu%27s_palace",
  "/wiki/Jedi/Legends",
  "/wiki/Kadrian_Sey",
  "/wiki/Sai_cha/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sora_Bulq/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Advisor/Legends",
  "/wiki/Tol_Skorr",
  "/wiki/Star_Wars_comic_books",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Dark_Horse_Comics",
  "/wiki/December_3",
  "/wiki/2003",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_134",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Official_Starships_%26_Vehicles_Collection_25",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Unknown_Regions",
  "/wiki/Databank_(original)"
 ]
}