{
 "name": "Surna",
 "display_name": "Surna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Surna was a Rebel Alliance soldier during the Galactic Civil War. She was stationed on the planet of Toprawa and participated in the liberation of the Death Star Superlaser plans and destruction of the Imperial research station located on the planet in 0 BBY.\nShortly after the raid Surna became close friends with fledgling Jedi and fellow Rebel Havet Storm, and following the decimation of the Rebel base two years later, Surna and Havet, along with the remaining Rebel troops planned to break through the Imperial blockade orbiting the planet and join up with the rest of the Rebel Alliance, using her brother Tann's starship The Rust Bucket.\nDuring their escape from the planet, Havet was separated from the rest of the group, remaining behind in order to ensure his friends could escape safely. Fearing they would never meet again, Surna confessed her love to Havet and the ship entered hyperspace\nSurna and the remaining Rebels eventually found the Rebel Alliance. Surna accompanied war hero Han Solo to the planet Marranis, where she was finally reunited with her love Havet Storm.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Toprawa/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Superlaser/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Havet_Storm",
  "/wiki/Tann",
  "/wiki/Starship/Legends",
  "/wiki/The_Rust_Bucket",
  "/wiki/Hyperspace/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Jedi_Dawn",
  "/wiki/The_Bounty_Hunter",
  "/wiki/The_Lost_Jedi_Adventure_Game_Book"
 ]
}