{
 "name": "Suudaa_Nem%27ro",
 "display_name": "Suudaa Nem'ro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nal Hutta"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 4241 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 3640 BBY",
      "Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "One red",
      "one white"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green and tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Kajidic",
     "values": [
      "Nem'ro"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Cartel",
      "Nem'ro's gang",
      "Nem'ro's gang",
      "Sith Empire",
      "Star Cabal"
     ]
    }
   ]
  }
 ],
 "content": "Suudaa Nem'ro was a Hutt crime lord who lived during the Great Galactic War and the subsequent Cold War between the Galactic Republic and the reconstituted Sith Empire. He was most often known simply by his cuirvas, Nem'ro. Secretly, Nem'ro was also a member of the Star Cabal, an intergalactic secret society dedicated to destroying both galactic powers.\nIn the decades leading up to his success, Nem'ro was a cunning leader in the gangs of Jiguuna, an industrial town on the Hutts' adopted homeworld of Hutta. He was an ambitious Hutt, using blackmail and savage cunning to systematically muscle his way into complete control over the town. His businesses included shvash gas mining, dealing spice, and trafficking weapons. His path to success earned him enemies along the way including fellow Hutt Voontara Fa'athra, \"Huttsbane,\" and even Black Sun.\nDuring the Cold War, his rivalry with Fa'athra became so intense that Fa'athra sent forces into Jiguuna to attack Nem'ro's interests.\nLike most Hutts who reach the peak of their career, Nem'ro left the day-to-day operation of his enterprises to underlings while he concentrated on food and revelry in his palace on Nal Hutta. His closest associates, for a time, included the lieutenants Karrels Javis and Toth'lazhen, as well as the enforcer Kaliyo Djannis, and his street gang leader, Rex Geer.\nHis operations did not go unacknowledged for long during the Cold War, as the Sith Empire took a keen interest in the Hutt and his control over the gas industry. The Imperial Intelligence spymaster known as \"Keeper\" sent an operative to infiltrate Nem'ro's court and gain his allegiance. Assuming the identity of the space pirate known as the \"Red Blade,\" the agent gained the trust of Nem'ro and his closest men, carrying out several tasks on their behalf.\nIn the end, after framing the Galactic Republic for having aided Fa'athra in assassinating Karrels Javis and his bodyguards inside Nem'ro's palace itself, and gaining holodisc evidence of this, the agent succeeded in driving Nem'ro to the Imperials. The Hutt soon contacted nearby Sith embassies, and Keeper expected to have him on the Empire's side within the month.\nNem'ro also eventually sponsored the protégé of the late bounty hunter Braden after the protégé assisted the Hutt with his business, killing several targets, and finally killing the Trandoshan hunter Rarsk in Fa'athra's Palace, acquiring the sponsorship token Nem'ro had given him. Nem'ro's sponsored hunter would go on to win the competition.\nIt was later revealed that Nem'ro was infected with a seemingly incurable disease, which was eventually cured by Doctor Archiban Kimble. Despite the doctor's hard work, Nem'ro was then killed by Skadge, the Houk having escaped Belsavis and eventually tracking him down, ending the Hutt's life.\nNem'ro the Hutt was first mentioned in a development diary for the video game Star Wars: The Old Republic released by BioWare, and later appeared in the opening storylines for both the Bounty Hunter and Imperial Agent classes on Nal Hutta.\nNem'ro's biography page on the official website contained several phrases in Aurebesh. When transliterated, they read \"Supports Hutt Cartel Neutrality,\" \"Houk and Rattataki Bodyguards,\" and \"Betrayed Skadge.\"\nWhile not explicitly identified as Nem'ro, the  NPC that appears in the cutscenes on the Star Chamber during the Imperial Agent's class story finale is identical to Nem'ro; analysis of the character model shows that it uses the  blueprint, which features different colored eyes and is used only by the various Nem'ro NPCs throughout the game. Thus, as several other members of the Star Cabal are characters who appear in the other classes' storylines, such as Kolovish and Nok Drayen, it can be concluded that Nem'ro was a member of the Star Cabal.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Suudaa_Nem%27ro",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/3640_BBY",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nem%27ro_clan",
  "/wiki/Hutt_Cartel",
  "/wiki/Nem%27ro%27s_gang",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Star_Cabal",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Crime_lord/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Cuirvas",
  "/wiki/Jiguuna",
  "/wiki/City/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Shvash_gas",
  "/wiki/Spice/Legends",
  "/wiki/Voontara_Fa%27athra",
  "/wiki/Huttsbane",
  "/wiki/Black_Sun/Legends",
  "/wiki/Fa%27athra_gang",
  "/wiki/Nem%27ro%27s_Palace",
  "/wiki/Karrels_Javis",
  "/wiki/Toth%27lazhen",
  "/wiki/Kaliyo_Djannis",
  "/wiki/Rex_Geer",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Keeper_(Imperial_Intelligence)",
  "/wiki/Cipher_Nine",
  "/wiki/Red_Blade",
  "/wiki/Holodisc",
  "/wiki/Sith/Legends",
  "/wiki/Carnus",
  "/wiki/Hunter_(individual)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Braden",
  "/wiki/Trandoshan/Legends",
  "/wiki/Rarsk",
  "/wiki/Fa%27athra%27s_Palace",
  "/wiki/Archiban_Frodrick_Kimble",
  "/wiki/Journal_of_Xenomedicine",
  "/wiki/Suudaa_Nem%27ro%27s_disease",
  "/wiki/Doctor/Legends",
  "/wiki/Skadge",
  "/wiki/Belsavis/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Aurebesh/Legends",
  "/wiki/Star_Chamber_(space_station)",
  "/wiki/Kolovish",
  "/wiki/Nok_Drayen",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Battle_of_Ilum",
  "/wiki/Standard_year/Legends"
 ]
}