{
 "name": "Suuda",
 "display_name": "Suuda",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sleheyron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Suuda was a male Hutt. Along with Moosh, he was one of four rival Hutt gangsters to reside on the planet Sleheyron in 3956 BBY during the Jedi Civil War. He was involved in an intra-planetary smuggling plot which culminated with the Jedi Revan being asked to assassinate Suuda.\nAfter working several jobs involved with the smuggling plot, Revan was asked to kill Suuda. Revan gained an audience with Suuda and, instead of attacking the Hutt, revealed the plot and was given a reward.\nSuuda, like the planet on which he resided, was originally planned to be part of the 2003 video game Star Wars: Knights of the Old Republic, but was cut from the final release. This was revealed in a post on the now-defunct Knights of the Old Republic forums by the game's lead writer, David Gaider. He responded to a question about an in-game mention of Sleheyron by the Twi'lek Yuthura, elaborating on the planet, Moosh, Suuda and the planned role they had in the game.\nFour Hutts, of which only Moosh and Suuda are named, were to give the player's character jobs known as side quests. The assassination which was to conclude Suuda's subplot was planned to have an alternate ending, with the player killing Suuda and completing the assassination. Gaider liked Suuda, feeling the Hutt was \"catty\". He expressed the opinion that the decision to cut the Sleheyron content was sound, feeling the planet and it's subplots were too complex in comparison to the entirety of the rest of the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Sleheyron/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Moosh",
  "/wiki/Gangster/Legends",
  "/wiki/Planet/Legends",
  "/wiki/3956_BBY",
  "/wiki/Jedi_Civil_War",
  "/wiki/Smuggler/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Death/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/David_Gaider",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Yuthura_Ban",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}