{
 "name": "Suzu",
 "display_name": "Suzu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Herdessa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance of Free Planets"
     ]
    }
   ]
  }
 ],
 "content": "Suzu was a Human female native to the planet Herdessa. She was romantically tied to another Herdessan, Finn, and the two of them struggled against the oppressive government under the Herdessan Guild. When the Alliance of Free Planets arrived to negotiate with the guild, Suzu and Finn were disturbed that their oppressors might gain even more power. The two attended the arrival of the Alliance delegation, and when they introduced the Alliance diplomat, Leia Organa, they booed her. The two then threw mud at the woman, hitting her in the face with a mudball. The guild's security forces chased Suzu and Finn through the streets, and Finn was captured in the slums of the city in guild sector three. Suzu was able to elude capture, but she too was eventually captured by the security forces' leader, Lumiya.\nBefore Lumiya could bring Suzu back to be processed and perhaps execute her, Leia Organa arrived, and shocked at Lumiya's brutality, objected to Suzu's capture. Suzu used the distraction to escape Lumiya, and she fled to a bombed out ruin in the sector which held several other oppressed citizens. Organa followed Suzu to the hideout, where Suzu explained to the Princess that the guild was allied with the Galactic Empire. Before Organa could decide what to do, the building was attacked by Lumiya and her forces. Suzu and Organa were able to escape, but the rest of the Herdessan rebels were captured. Lumiya brought her captives to the city's courtyard, where she announced to the rest of the populace that she would begin killing prisoners if Organa was not turned over to her. Immediately before Lumiya could execute Finn, Suzu revealed herself, pointing Lumiya to the nearby bushes where Organa was hiding.\nHowever, Suzu had pulled a trick on the Imperials, and Organa ambushed the group from the opposite side of the courtyard. The princess freed the prisoners and armed them, causing an uprising. Suzu and Finn were reunited, and they helped the Herdessans defeat the Imperials, eventually capturing the guild members. Organa and the Alliance departed the world soon after, needing to warn the rest of the Alliance of the increased capacity of the Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Herdessa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_of_Free_Planets",
  "/wiki/Planet/Legends",
  "/wiki/Finn_(Herdessan)",
  "/wiki/Herdessan_Guild",
  "/wiki/Diplomat/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Herdessan_shocktrooper",
  "/wiki/Guild_sector_three",
  "/wiki/Lumiya",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Herdessa_(Nagai%E2%80%93Tof_War)",
  "/wiki/Star_Wars_(1977)_88"
 ]
}