{
 "name": "Swain",
 "display_name": "Swain",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Security Bureau"
     ]
    }
   ]
  }
 ],
 "content": "Swain was a young human female Imperial officer. At the time of the insurgency on the planet of Lothal, she trained under Kallus to become an agent of the Galactic Empire's Security Bureau. However, after Grand Moff Tarkin arrived on the planet to find out why the local Imperials could not manage to crush a band of rebels, Swain reconsidered her career choice. Upon realizing that she did not want to be part of an organization that punished ordinary citizens without justified reason, the woman chose to defect. Along with Cogon, another officer disgusted with the Empire, she stole a Lambda-class T-4a shuttle and left Lothal in a hurry. They went in hiding on the planet Thrad, with the secret support of Imperial Senator Nadea Tural, and the help of a male Thradian named Beneda. From Thrad, Swain and Cogon were supposed to take a transport to the planet Klonoid, where they would join a rebel cell.\nHowever, Swain's former mentor traced the stolen shuttle's signal and ended up locating the defectors' hiding place, in a spaceport of Thrad's eastern continent. Swain and Cogon tried to flee, but Kallus pursued them in the streets. The defectors managed to corner the Security agent for a moment, and Swain verbally confronted her former mentor. Her triumph, however was only short-lived, as a duo of stormtroopers barged in the alley and shot Cogon in the back. Although Kallus himself had lost hold of his signature bo-rifle, the young woman had not expected him to keep a backup weapon under his fleximetal cuirass, and she fell to a surprise stun blow. Swain, still unconscious, was brought aboard the shuttle she had stolen, where Kallus' men started torturing her for information.\nUnlike many other Imperial officers, Swain cared deeply for the people of Lothal and attempted to defect to the rebellion after Tarkin's brutal subjugation of the innocent citizens. She was seen as a bright prospect by her mentor Agent Kallus, and owing to her training she was a formidable fighter in hand-to-hand combat, besting even Kallus, who had to resort to stunning her with his blaster to subdue her.\nSwain was a tanned-skinned woman with auburn hair, chestnut brown eyes, and two beauty marks on the right cheek.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Imperial_officer",
  "/wiki/Time",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Agent",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Spectres",
  "/wiki/Cogon",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Thrad",
  "/wiki/Senator",
  "/wiki/Nadea_Tural",
  "/wiki/Thradian",
  "/wiki/Beneda",
  "/wiki/Klonoid",
  "/wiki/Rebel_cell_(Klonoid)",
  "/wiki/Spaceport",
  "/wiki/Stormtrooper",
  "/wiki/Bo-rifle",
  "/wiki/Fleximetal",
  "/wiki/Armor",
  "/wiki/Stun",
  "/wiki/Torture",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/No_Sympathy",
  "/wiki/Star_Wars_Rebels_Magazine_14"
 ]
}