{
 "name": "Sweitt_Concorkill",
 "display_name": "Sweitt Concorkill",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vurk"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Delegation of 2",
      "000",
      "Delegation of 2",
      "000"
     ]
    }
   ]
  }
 ],
 "content": "Sweitt Concorkill was a Vurk senator for the Galactic Republic Senate who joined the Delegation of 2,000 during the Clone Wars. In 19 BBY, Concorkill spoke with Jedi Master Coleman Kcaj before attending a performance of Squid Lake at the Galaxies Opera House on the planet Coruscant and sat in the private box of Supreme Chancellor Sheev Palpatine.\nSweitt Concorkill was a Vurk senator who served in the Galactic Senate of the Republic during the Clone Wars. Concorkill joined the Delegation of 2,000, a group of senators who were concerned with Supreme Chancellor Sheev Palpatine's continued use of emergency powers during the war.\nShortly after the Battle of Coruscant in 19 BBY, Concorkill attended a performance of the opera Squid Lake at the Galaxies Opera House on the planet Coruscant. Before the performance commenced, Concorkill conversed with Jedi Master Coleman Kcaj outside the opera house. The senator then sat in Palpatine's private viewing box along with Vice Chair Mas Amedda, senior administrative aide Sly Moore, and the Supreme Chancellor himself.\nMidway through the performance, Palpatine calmly dismissed Concorkill, Amedda, and Moore from the box upon the arrival of Jedi Knight Anakin Skywalker, whom Palpatine had invited to watch the opera with him. Together, the two proceeded to have a private conversation on matters relating to knowledge of the Force.\nConcorkill had green skin and light-blue eyes.\nThe senator wore red-and-white-patterned robes while at the opera, very similar to those worn by Junior Representative Jar Jar Binks.\nSweitt Concorkill first appeared in the 2005 film Star Wars: Episode III Revenge of the Sith, the final installment of the Star Wars prequel trilogy. For the new Star Wars canon, the character was first identified by name in 2016 by the Star Wars: Card Trader app. That name had originally been introduced in the 2005 Star Wars Legends reference book Star Wars: Revenge of the Sith: The Visual Dictionary, which was written by James Luceno.\nConcorkill was originally meant to be an Ongree senator based on the design of character Pablo-Jill from Star Wars: Episode II Attack of the Clones. However, once the Pablo-Jill model was redesigned for Revenge of the Sith, the Ongree senator's clothes were changed to Jedi robes, and the character was renamed Coleman Kcaj. As a result, the name Sweitt Concorkill was mistakenly applied to an image of Kcaj in Revenge of the Sith The Visual Dictionary. This error was ultimately rectified for Star Wars Legends in the 2005 Star Wars Insider 85 article \"Who's Who in the Delegation of 2000,\" written by Daniel Wallace.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sweitt_Concorkill",
  "/wiki/Sweitt_Concorkill/Legends",
  "/wiki/Vurk",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Delegation_of_2,000",
  "/wiki/File:Palpatine-Leave_Us.ogg",
  "/wiki/Senator",
  "/wiki/Galactic_Senate",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY",
  "/wiki/Jedi_Master",
  "/wiki/Coleman_Kcaj",
  "/wiki/Squid_Lake",
  "/wiki/Galaxies_Opera_House",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Opera",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Aide",
  "/wiki/Sly_Moore",
  "/wiki/Gender",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Force",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Junior_Representative",
  "/wiki/Jar_Jar_Binks",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/2016",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Revenge_of_the_Sith:_The_Visual_Dictionary",
  "/wiki/James_Luceno",
  "/wiki/Ongree",
  "/wiki/Pablo-Jill",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Jedi_robes",
  "/wiki/Star_Wars_Insider_85",
  "/wiki/Who%27s_Who_in_the_Delegation_of_2000",
  "/wiki/Daniel_Wallace",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider"
 ]
}