{
 "name": "Swift_(clone_trooper)",
 "display_name": "Swift  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Between 22 BBY and 21 BBY",
      "Tambor Deep Space Centre"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "\"Swift\" was the nickname of a clone trooper sergeant who fought in the Grand Army of the Republic during the Clone Wars. Early in the war, he participated in a raid on the Confederacy of Independent Systems' Tambor Deep Space Centre. During the battle, he led a squadron of clone troopers on AT-RT walkers in an attempt to break into a bunker, wherein the enemy chief mechanic, Gorgol the Handy, was hiding. In response, Gorgol activated his hidden defense turrets, which eliminated Swift and his entire squad.\n\"Swift\" was the nickname of one of the numerous clones of the Human male bounty hunter Jango Fett created on the planet Kamino with the purpose of serving in the Grand Army of the Republic. During the first two years of the Clone Wars, Swift held the rank of clone trooper sergeant. During this time, under the command of Jedi Masters Obi-Wan Kenobi and Mace Windu and Clone Commanders CC-2224 and CC-6454, Swift participated in a Republic raid on the Tambor Deep Space Centre, an installation that served as a starship repair facility for the Confederacy of Independent Systems. After a heavy fight, the Republic troops were able to secure most of the facility, and only a small enemy force remained locked in a well-protected security bunker.\nBelieving that they would be able to open the bunker's doors by force, Commander CC-2224 ordered Swift to take a squadron of clone troopers on All Terrain Recon Transports and breach the bunker; Swift believed that several thermal detonators would be sufficient to do so. As Swift and his men approached the bunker, however, hidden blaster turrets rose from the floor, remotely activated by the station's Geonosian chief mechanic, Gorgol the Handy, from inside the bunker. Swift was determined to complete the mission and ordered his men to stay on course, but the turrets opened fire and killed Swift and the entire squadron, much to CC-2224's shock, who blamed himself for their deaths. The two Jedi and the two Clone Commanders eventually came up with a plan to lure Gorgol out of the bunker, and they successfully captured him.\nSergeant Swift was intent on carrying out his orders and reaching the enemy bunker, even after he witnessed the Separatists' deployment of blaster turrets. He was unable to complete his mission, however, and was killed. Like all clone troopers, Swift had the same height as their genetic template Jango Fett, 1.83 meters.\nSwift's only appearance was in the short comic The Droid Deception, written by Robin Etherington, illustrated by Andres Ponce, and published in Star Wars: The Clone Wars Comic UK 6.4 in February of 2010.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Swift",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Tambor_Deep_Space_Centre",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Siege_of_Tambor_Deep_Space_Centre",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/All_Terrain_Recon_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Gorgol/Legends",
  "/wiki/Autoturret/Legends",
  "/wiki/Death/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-2224/Legends",
  "/wiki/CC-6454",
  "/wiki/Starship/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Geonosian/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_Droid_Deception",
  "/wiki/Robin_Etherington",
  "/wiki/Andres_Ponce",
  "/wiki/Star_Wars:_The_Clone_Wars_Comic_UK_6.4",
  "/wiki/February",
  "/wiki/2010",
  "/wiki/Databank_(original)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_35",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Galactic_Standard_Calendar"
 ]
}