{
 "name": "Syke",
 "display_name": "Syke",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "White Worms"
     ]
    }
   ]
  }
 ],
 "content": "Syke was a human male member of the White Worms gang on the planet Corellia. He and Rebolt were the favored thugs of the Grindalid senior gang member Moloch, who encouraged competition between them. Rebolt was the better of the two at handling the gang's Corellian hounds, but Syke was gentler with the beasts and quickly gaining on his competitor in skill.\nIn 13 BBY, Rebolt and Syke dragged the scrumrat Han before the gang's leader, Lady Proxima, in the Den of the White Worms. Han had returned from a negotiation with nothing to show for it, but managed to escape the angered Proxima with his friend Qi'ra by distracting Proxima with light, which burned her skin. Moloch, Syke and Rebolt chased Solo in the gang's A-A4B landspeeder and eventually caught up with him in a Coronet City spaceport; however, they only managed to capture Qi'ra, as Han fled into an Imperial recruitment center.\nSyke was a human male from the planet Corellia who served as a member in the White Worms gang of Coronet City. He and Rebolt were the favored thugs of the senior gang member Moloch, who was amused by the competition between the pair. Both acted as hound handlers for the gang, looking after the pack of Corellian hounds that they kept.\nIn the year 13 BBY, Rebolt and Syke sought out the scrumrat Han within the Den of the White Worms in Coronet City after the lower-ranking gang member returned from negotiating a deal with nothing to show for it. The pair then dragged Han before the gang's leader, Lady Proxima, who was angry with his failure; however, before Proxima could enact punishment on Han, he hurled a rock behind her and shattered a shutter, bathing Proxima in light. As the gang leader was a Grindalid, the light burned her skin and distracted her, allowing Han and his friend Qi'ra to make a run for it.\nMoloch ordered the White Worms to give chase, and Rebolt and Syke joined him on board the gang's A-A4B landspeeder with a pack of Corellian hounds. Their vehicle soon caught up with Han's stolen M-68 landspeeder, and a high-speed chase ensued, ending when Han wedged his landspeeder down an alley too narrow for the A-A4B.\nWith both parties forced to continue on foot, Syke and Rebolt released the hounds from the vehicle and pursued Han and Qi'ra with Moloch into a spaceport. The thugs were unable to spot their targets at first, but managed to grab Qi'ra just as she was trying to pass through the spaceport's barriers. Han had already passed through, however, and evaded his pursuers by heading into an Imperial recruitment office.\nSyke showed a gentle fondness for the Corellian hounds he cared for, and although in 13 BBY he was not as good a handler as Rebolt, he was quickly catching up. His favorite hound was Taomat, and one day he hoped to set it on Rebolt and end their competition for Moloch's approval. Syke had tan skin, black hair, and brown eyes.\nSyke wore a black brine-stained coat with protective padding along with a pair of heavy, puncture-proof gloves for hound handling and a light-filtering headband. His boots and pants were black, with the footwear being waterproof. Due to his rank within the White Worms, he also used a breathing collar with atmospheric treatment tubes that hung over his chest.\nSyke first appeared in the 2018 film Solo: A Star Wars Story. The character was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Syke_(clone_trooper)",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/White_Worms",
  "/wiki/Planet",
  "/wiki/Rebolt",
  "/wiki/Grindalid",
  "/wiki/Moloch",
  "/wiki/Corellian_hound",
  "/wiki/13_BBY",
  "/wiki/Han_Solo",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Den_of_the_White_Worms",
  "/wiki/Qi%27ra",
  "/wiki/A-A4B_truckspeeder",
  "/wiki/Coronet_City",
  "/wiki/Spaceport",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_year",
  "/wiki/Scrumrat",
  "/wiki/M-68_landspeeder",
  "/wiki/Landspeeder",
  "/wiki/Taomat",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Salt",
  "/wiki/Clothing",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Water",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_Meet_the_Crew",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Databank_(website)",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}