{
 "name": "Syl",
 "display_name": "Syl",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bright red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Satele Shan's followers",
      "Satele Shan's followers"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Satele Shan"
     ]
    }
   ]
  }
 ],
 "content": "Syl was a Force-sensitive Human female. Syl was one of Satele Shan's students during the third Galactic War. Shan and her students, including Syl, were all infected by Tenebrae's curse and held within a massive ship by Kira Carsen and Scourge. However, they were released by the Commander of the Eternal Alliance who ended Tenebrae for good. Syl was thought to be dead but miraculously survived the ordeal.\nSyl was one of many force users that became part of a crop of students that Jedi Master Satele Shan started to train on a secret Jedi academy on Coruscant after the end of the war against Zakuul.\nWhen Satele Shan unknowingly became infected by the plague of the deceased Emperor Tenebrae, Syl and the rest of the followers also became infected. They were all left in a nightmarish sleep before slowly merging into a hive mind. Sith Lord Scourge and Jedi Knight Kira Carsen kept them quarantined in the latter's ship, flying an undetermined course through unsettled sectors of the Outer Rim Territories.\nAfter most of the followers were released from the curse by the Commander of the Eternal Alliance, who ended Tenebrae for good, Syl was believed to be dead like fellow student Trad, but in reality she miraculously survived the infection.\nBack on Coruscant after the incident with Tenebrae, Syl watched how the former Jedi Aryn Leneer went to met up with Master Satele Shan. The young student later interrupted the conversation the two had by telling Satele that Master Sal-Deron wanted to speak with her, if she could spare the time, barely giving a glance at Aryn before she left the room. Both Satele and Aryn briefly talked about Syl after she left before meeting Sal-Deron.\nA young Human female with bright red hair, Syl was discribed by Satele Shan as a complicated student with whom she has to pick her battles wisely. Syl seems to be very informal as she addresses her master simply as Satele, something that surprised Aryn Leneer.\nSyl first appeared in Star Wars: The Old Republic: Onslaught as part of the \"Echos of Oblivion\" flashpoint, where the student's name was first revealed by Kira Carsen.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Satele_Shan%27s_followers",
  "/wiki/Satele_Shan",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Third_Galactic_War",
  "/wiki/Tenebrae",
  "/wiki/Tenebrae%27s_curse",
  "/wiki/Kira_Carsen%27s_ship",
  "/wiki/Kira_Carsen",
  "/wiki/Scourge",
  "/wiki/Mission_to_Kira_Carsen%27s_ship",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/Death/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Coruscant/Legends",
  "/wiki/War_against_Zakuul",
  "/wiki/Mindscape",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Trad",
  "/wiki/Aryn_Leneer",
  "/wiki/Sal-Deron",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Category:Images_of_Syl",
  "/wiki/Quite_A_Story_To_Tell",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}