{
 "name": "Sylas",
 "display_name": "Sylas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Black Talon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Sylas was a Human female lieutenant and executive officer of the Black Talon, an Imperial transport ship serving the Sith Empire under Captain Revinal Orzik during the Cold War. Under article 27-A of the Imperial Code of Military Conduct should anything happen to the Black Talon's captain, as executive officer, command of the Black Talon would automatically be transferred to her with promotion to captain.\nDuring the Cold War, Sylas served as an officer in the war fleet of the True Sith Empire, where she rose to the rank of lieutenant and during this time as first officer on the Black Talon, a Gage-class transport ship commanded by Captain Revinal Orzik, who was known to be very subordinate. Since he was always on the bridge during a flight, it was their responsibility to receive and look after passengers and guests of honor.\nIn 3643 BBY, the supply ship was serving on the route between the Vaiken Spacedock and the Imperial homeworld Dromund Kaas when her commander received orders from Grand Moff Rycus Kilran to intercept the Republic warship Brentaal Star and eliminate an Imperial defector. Orzik disregarded this, however, as he considered it impracticable, and continued the course to Dromund Kaas. The Grand Moff found out about battle-hardened passengers and had them contacted by his protocol droid NR-02, who was also on board, in order to convince the captain of the transport ship of the mission or to take over the command of the transport ship directly. Since Sylas would greet all guests of honor personally, he asked her to send these battle-hardened guests directly to him, but did not inform them of the real motives. During the flight, Sylas was on the navigation bridge when it was stormed by these guests and NR-02 and Orzik was confronted.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Black_Talon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Lieutenant/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Gage-class_transport",
  "/wiki/Captain/Legends",
  "/wiki/Revinal_Orzik",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Imperial_Code_of_Military_Conduct",
  "/wiki/Vaiken_Spacedock",
  "/wiki/Dromund_Kaas",
  "/wiki/Commander/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Rycus_Kilran",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Brentaal_Star",
  "/wiki/Protocol_droid/Legends",
  "/wiki/NR-02",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}