{
 "name": "Sylvestri_Yarrow",
 "display_name": "Sylvestri Yarrow",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 249 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Byne Guild"
     ]
    }
   ]
  }
 ],
 "content": "Sylvestri Yarrow, nicknamed Syl, was a human female pilot and hauler who lived during the High Republic Era. The daughter of Chancey Yarrow, Sylvestri inherited her mother's starship, the Switchback, at the age of eighteen after Chancey's apparent death in a Nihil attack. Sylvestri, her copilot Neeto Janajana, and her ancient security droid M-227 attempted to make a living as traders, but the galactic instability caused by the pirates led to them barely scraping by. An encounter with the Nihil in the Berenge sector, during which Sylvestri and Janajana discovered that the pirates had somehow developed the ability to knock ships out of hyperspace, led them to abandon the Switchback. Sylvestri had wanted to stay and fight, but Janajana persuaded her that a last stand was futile and that it was imperative they report the Nihil's new capabilities to the Galactic Republic and Jedi.\nSylvestri Yarrow, nicknamed Syl, was a human female who lived during the High Republic Era. Born around the year 249 BBY to Chancey Yarrow, Sylvestri grew up on her mother's starship, the Switchback. Sylvestri was unaware that her mother had been educated in hyperspace theory at the Academy of Carida, a military college, or that she had even gone to college. Chancey's interest in inventing a gravity well projector had gotten her ejected from the program, and it had brought her to the attention of Lourna Dee, a Tempest Runner of the Nihil marauder organization. Sylvestri was raised believing her mother to be a mere hauler and member of the Byne Guild who championed the oppressed and opposed the Nihil, not a collaborator and hyperspace genius.\nChancey Yarrow would later describe her daughter as having always been a sulky child. When Sylvestri was twelve years old, Chancey had enraged her by refusing to allow her to attend a festival on Zeltros with a friend.\nAmong the many lessons that Chancey taught Sylvestri was that politics was where truth went to die. Before Sylvestri was allowed to pilot the Switchback, her mother taught her how to to navigate the old-fashioned way: using a star chart, not relying on the navicomputer. Once, she mistakenly transposed the numbers in her flight calculations, causing them to fly toward Hynestia instead of Haileap; from that mistake, she learned to always double- and triple-check, and she had certain coordinates memorized. Another of her mother's lessons was that despite the galaxy being a vast and uncaring place, they should be neither selfish nor irresponsible.\nAt thirteen, Sylvestri spent a year with her \"auntie Lourna\" learning from the Twi'lek woman how to defend herself in close quarters. During that time, Dee knocked the girl unconscious, broke her arm twice, and possibly fractured her jaw more than once; Dee told Sylvestri that no one would pull their punches with her and that she was lucky to be alive. The girl took for granted why she was being taught so much about self-defense and security, as the life of a hauler was dangerous. She did not question why her mother made her repeatedly do exercises with a drill instructor's precision.\nThe Yarrows and their crew members had been part of the Byne Guild, a merchant guild that was supposed to represent the interests of its members. Some of the Yarrows' friends in the guild were on the Legacy Run when it was destroyed in the Great Disaster of 232 BBY by the Nihil. In the aftermath, the Byne Guild was dissolved for forcing members into abusive contracts as indentured crew. Around the time of the disaster, Lourna Dee made contact with Chancey Yarrow to present an opportunity to build her gravity well projector with the assistance of Mari San Tekka, who was held captive by Marchion Ro to provide unique hyperspace navigational paths. Dee believed that the device, later dubbed Gravity's Heart, would weaponize hyperspace. The genius was interested in pursuing the work.\nChancey and Sylvestri Yarrow journeyed to the planet Tiikae, a small world that was overseen by the San Tekka clan and had a temple of the Jedi Order. At the temple, Chancey had smiled at the Jedi; she had always spoken highly of them, though she had also advised her daughter that their mind tricks would not work on a being who was wary, focused their thoughts, and fortified their mind against the Jedi's telepathy. The few months that Sylvestri spent on Tiikae were the happiest time of her life. At one point, Chancey left her there for a month, possibly to meet with the Nihil and broker a contract for her services. However, she told Sylvestri that she was to study repairing hyperdrives and sublight engines with Roy and Klanna, a family of Ugnaughts.\nA San Tekka cousin, Jordanna Sparkburn, had left her speeder bike with the Ugnaughts for repairs. Sylvestri Yarrow was partway through repairing the repulsorlift when Sparkburn came to check on the progress. Yarrow and Sparkburn quickly fell in love, and for four weeks, the happy couple spending their days together and stayed up late to watch auroras in the night sky. Yarrow began to entertain the thought of her mother never returning, freeing her to move in with Sparkburn, when she learned that her mother would be arriving to collect her. The night before her departure, Yarrow asked Sparkburn to leave and tour the galaxy with her. Sparkburn, who was training to become the next deputy on Tiikae after her aunt retired, could not set aside those responsibilities or leave her home, and declined to leave with her. When Yarrow's mother returned the next morning, Sparkburn did not show up to say goodbye before the Yarrows left the planet.\nLess than two weeks after leaving Tiikae and breaking up with Sparkburn, Sylvestri Yarrow suffered another loss. The Nihil attacked the Switchback with their gas, knocking the young woman unconscious. When she recovered, she found blood in the maintenance hallway. The attack successfully convinced her to believe her mother was dead.\nYarrow was a human female who had dark brown skin, dark eyes, and dark kinky-curly hair that was like a cloud around her head. She was shorter than Vernestra Rwoh by a few centimeters and about a head shorter than Jordanna Sparkburn. Physically, she had a strong resemblance to her mother.\nYarrow's tendency to start rambling and let her speech get ahead of her thoughts was something her mother chided her for. Her mother had taught her to count her breaths when her emotions ran amok, and she would also twist her hands in her coveralls and picture the joyous sensations of lifting off in the Switchback.\nYarrow was a skilled pilot and was capable of performing flight calculations without relying on a navicomputer.\nYarrow's favored weapon was a modified snub-barreled blaster rifle that was given to her by her mother, named \"Beti\" after her childhood doll. She often carried the rifle Beti in a backpack holster of her own design that had straps crisscrossed over her chest.\nWhen she believed her mother was dead, Yarrow inherited the cargo hauler, the Switchback, that had served as both vehicle and home throughout her life. Many of its systems had problems she could not afford to fix, including its hyperdrive, engine, coaxium regulator, and outdated navicomputer.\nAfter the incident on the Gravity's Heart, the Graf family's experimental starship, the Vengeful Goddess, was signed over to Yarrow. The ship's specifications exceeded the Switchback, such as its four sublight engineers, laser cannons, and far faster navicomputer.\nSylvestri Yarrow first appeared in the novel The High Republic: Out of the Shadows, written by Justina Ireland and published on July 27, 2021 as part of the multimedia project Star Wars: The High Republic. The character was first pictured during the January 4 launch event for the project and identified in an excerpt from the then-upcoming novel included in The High Republic: Into the Dark, which was published February 2. She was also featured on the March 29 episode of Star Wars: The High Republic Show, a show on YouTube hosted by Krystina Arielle.\nDuring Ireland's initial drafting for Out of the Shadows, she had expected to write a love triangle between Sylvestri, ex-girlfriend Jordanna Sparkburn, and Xylan Graf. As she wrote, however, she found that Sylvestri would instead find Xylan unlikeable and have no sizzle between them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Silvestri",
  "/wiki/Yarrow",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/249_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Byne_Guild",
  "/wiki/Pilot",
  "/wiki/Merchant",
  "/wiki/High_Republic_Era",
  "/wiki/Chancey_Yarrow",
  "/wiki/Starship",
  "/wiki/Switchback",
  "/wiki/Death",
  "/wiki/Nihil",
  "/wiki/Neeto_Janajana",
  "/wiki/Security_droid",
  "/wiki/M-227",
  "/wiki/The_galaxy",
  "/wiki/Pirate",
  "/wiki/Berenge_sector",
  "/wiki/Hyperspace",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi",
  "/wiki/Standard_year",
  "/wiki/Parent",
  "/wiki/Carida_Academy",
  "/wiki/Gravity_well_projector",
  "/wiki/Lourna_Dee",
  "/wiki/Tempest_Runner",
  "/wiki/Youngling",
  "/wiki/Zeltros",
  "/wiki/Star_map",
  "/wiki/Navigation_computer",
  "/wiki/Hynestia_Prime",
  "/wiki/Haileap",
  "/wiki/Twi%27lek",
  "/wiki/Limb",
  "/wiki/Bone",
  "/wiki/Guild",
  "/wiki/Legacy_Run",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/232_BBY",
  "/wiki/Mari_San_Tekka",
  "/wiki/Marchion_Ro",
  "/wiki/Path",
  "/wiki/Gravity%27s_Heart",
  "/wiki/Planet",
  "/wiki/Tiikae",
  "/wiki/San_Tekka_clan",
  "/wiki/Jedi_temple",
  "/wiki/Jedi_Order",
  "/wiki/Mind_trick",
  "/wiki/Telepathy",
  "/wiki/Standard_month",
  "/wiki/Hyperdrive",
  "/wiki/Sublight_engine",
  "/wiki/Roy",
  "/wiki/Klanna",
  "/wiki/Ugnaught",
  "/wiki/Jordanna_Sparkburn",
  "/wiki/Speeder_bike",
  "/wiki/Repulsorlift",
  "/wiki/Standard_week",
  "/wiki/Aurora",
  "/wiki/Deputy",
  "/wiki/Jordanna_Sparkburn%27s_aunt",
  "/wiki/Gas",
  "/wiki/Blood",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Centimeter",
  "/wiki/Blaster_rifle",
  "/wiki/Beti_(rifle)",
  "/wiki/Beti",
  "/wiki/Breast",
  "/wiki/Cargo_hauler",
  "/wiki/Engine",
  "/wiki/Coaxium_regulator",
  "/wiki/Graf_family",
  "/wiki/Vengeful_Goddess",
  "/wiki/Laser_cannon",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/Justina_Ireland",
  "/wiki/July_27",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/January_4",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/February_2",
  "/wiki/March_29",
  "/wiki/Star_Wars:_The_High_Republic_Show",
  "/wiki/Krystina_Arielle",
  "/wiki/Category:Images_of_Sylvestri_Yarrow",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/231_BBY",
  "/wiki/July_26",
  "/wiki/2020"
 ]
}