{
 "name": "Syphacc",
 "display_name": "Syphacc",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Head implant"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Syphacc's Bountiful Bounties"
     ]
    }
   ]
  }
 ],
 "content": "Syphacc was a human male who operated Syphacc's Bountiful Bounties, an organization that handed out bounties to bounty hunters. When the infamous former bounty hunter Nakano Lash resurfaced, Syphacc attempted to contact the cyborg hunter Beilert Valance, but was forced to allow Ooris Bynar to take the job after Valance rejected the offer, despite the collateral damage the Thisspiasian was known to cause. After Bynar departed, Syphacc contacted Boba Fett, who took the offer without wanting credits in return.\nDuring the Imperial Era, Syphacc operated Syphacc's Bountiful Bounties, handing out bounties to willing bounty hunters. Around 3 ABY, he began contacting the cyborg hunter Beilert Valance after the notorious Nakano Lash resurfaced with a large bounty on her head. While attempting to contact Valance, the bounty hunter Ooris Bynar, who accompanied him, offered to take the job at half the price. Syphacc rejected the Thisspiasian's offer, citing the hunter's reputation of incurring heavy costs with collateral damage.\nWhen Syphacc finally reached Valance, he explained that he had a \"big job\" for the cyborg, but was cut off after Valance stated he was disinterested and closed the communication. Syphacc was then strangled by Bynar, who demanded that he let the hunter take the job. After he accepted and was freed, he decided to contact another bounty hunter, Boba Fett. Through a hologram, Syphacc revealed to Fett that Lash had reemerged, and offered the bounty to him. Fett, who had previously worked with Lash, accepted and told Syphacc to keep the credits for the job.\nSyphacc was a human male with light skin. He initially rejected Bynar's offer to take the job due to the hunter's reputation for causing collateral damage and costing Syphacc heavily, but allowed the Thisspiasian to take it after being strangled by the hunter's tail.\nSyphacc wore brown clothing with a pouch by his left hip and a long cape around his back. He also had a cybernetic implant around his head.\nSyphacc first appeared in the first issue of Star Wars: Bounty Hunters, a comic book series written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on March 11, 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bounty_Hunters_3",
  "/wiki/Bounty_Hunters_8",
  "/wiki/Doctor_Aphra_(2020)_6",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Bounty_Hunters_23",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Syphacc%27s_Bountiful_Bounties",
  "/wiki/Bounty",
  "/wiki/Bounty_hunter",
  "/wiki/Hunting",
  "/wiki/Nakano_Lash",
  "/wiki/Cyborg",
  "/wiki/Beilert_Valance",
  "/wiki/Ooris_Bynar",
  "/wiki/Thisspiasian",
  "/wiki/Boba_Fett",
  "/wiki/Credit",
  "/wiki/Imperial_Era",
  "/wiki/3_ABY",
  "/wiki/Hologram",
  "/wiki/Skirmish_on_Corellia",
  "/wiki/Clothing",
  "/wiki/Bounty_Hunters_1",
  "/wiki/Star_Wars:_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Paolo_Villanelli",
  "/wiki/Marvel_Comics",
  "/wiki/March_11",
  "/wiki/2020",
  "/wiki/Category:Images_of_Syphacc",
  "/wiki/Bounty_Hunters_12",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Bounty_Hunters",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year"
 ]
}