{
 "name": "Syril_Karn",
 "display_name": "Syril Karn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Preox-Morlana",
      "Pre-Mor Security Inspection team",
      "Pre-Mor Security Inspection team",
      "Galactic Empire",
      "Fuel Purity",
      "Fuel Purity"
     ]
    }
   ]
  }
 ],
 "content": "Syril Karn was a human male civil servant who was employed by the Imperial Bureau of Standards of the Galactic Empire, and had prior worked for the Preox-Morlana as a Deputy Inspector during the Imperial Era. Due to an incident on Ferrix, Karn was stripped of his duties and left utterly disgraced by his superiors and returned home to his mother on Coruscant.\nSyril Karn was a human male born to a strict mother, Eedy Karn. He also had an uncle named Harlo, who possessed a great deal of influence. Karn grew up on the Core Worlds planet Coruscant. He had several action figures of clone troopers that he left in his childhood bedroom. At some point, Syril Karn joined the Pre-Mor Security Inspection team, the tactical forces of the corporate conglomerate Preox-Morlana in the Morlani system, and moved to Morlana-1 where the corporate security headquarters were located. He never invited his mother to see him, instead vaguely letting her know that she could visit any time, an open invitation which she considered to be no invitation at all. She never actually visited him and they didn't see each other until 5 BBY. Karn took his duties more seriously than most of his fellow Pre-Mor employees, even having his uniform tailored to fit tighter and adding pockets and piping for a more decorative outfit.\n\nAs Deputy Inspector, Karn took charge on a case where two Pre-Mor security officers had been killed outside the Leisure Zone on the planet Morlana One. Karn prepared an extensive report for his immediate superior, including the fact that an employee at the brothel the two officers were seen alive at had seen Cassian Andor arguing with them, Andor had earlier asked the girl about another girl from Kenari.Chief Inspector Hyne, who was about to leave for an Imperial security meeting, was dismissive of Karn's eagerness to investigate the case and told him to instead prepare an accident report stating the officers had died heroically. After Hyne's departure, however, Karn continued to investigate the murders. He first identified a rogue vessel departing Morlana One, ordering the comms officer in charge to filter the entire night in order to find where the vessel traveled to.\nAfter discovering that the vessel had traveled to Ferrix, Karn had his officers attempt to identify anyone from Kenari on the planet. He was frustrated to learn the last Imperial census was six years prior, and ordered his officers to flood the communications channels to Ferrix with an alert requesting information on a suspect from Kenari. After his officers received a tip about Andor from a local named Timm Karlo, Karn's officers were able to find a picture of Andor. Karn then had the girl at the brothel come in to confirm that the man she had seen arguing with the officers was Andor.\nHaving identified Andor as his target, Karn summoned a sergeant who commanded a Pre-Mor security team, Sergeant Linus Mosk. Karn was impressed by Mosk's enthusiasm to capture Andor, finally finding a kindred spirit in someone who took their duties as seriously as he did. Mosk recommended the two of them lead a 12-man team to capture Andor on Ferrix promptly. Karn agreed and the two later departed with twelve men to Ferrix to arrest Andor.\nDuring the trip to Ferrix, Mosk appraised his team of the situation, warning that Andor was likely armed and dangerous. He then allowed Karn a moment to speak to the men, with Karn delivering an awkward and uninspired speech to the team. Upon arrival at Ferrix, Mosk and Karn attempted to deliver the arrest warrant to Andor's adoptive mother Maarva. Upon discovering Andor was not present, the Pre-Mor soldiers ransacked her home in an attempt to coerce her into giving up Andor's location. This upset many locals who were friends of Maarva, however, and many more were upset to see security officers mistreating an old woman. The town quickly began to turn on the Pre-Mor soldiers, sabotaging them by ringing alarms to warn of their location and taking down street signs to prevent the soldiers from knowing where they were.\nEventually Andor and his new compatriot Luthen Rael were found, but the pair were able to escape, injuring numerous Pre-Mor soldiers in the process. When Karn and Mosk heard reports that Andor and Luthen were headed their way, they and the remaining Pre-Mor security officers attempted to set an ambush for the two, setting up in positions along the street they expected them to come down.\nAs Karn got into position, however, he was easily ambushed and disarmed by Andor and Luthen, and when threatened quickly gave up the numbers of the Pre-Mor security team. Despite Luthen's urging to kill Karn Andor instead gagged and hogtied him, leaving him in a nearby home. Karn was soon discovered by another Pre-Mor security officer and released. Karn saw a speeder departing and, assuming it was Andor and Luthen, called all Pre-Mor soldiers to begin firing on the speeder. After disabling the speeder Karn was shocked to see a second speeder carrying Luthen and Andor to safety, while the first speeder, rigged with explosives, detonated, killing and injuring more Pre-Mor security officers. Stunned by the loss of so many men and in shock at the situation, Karn simply stared blankly as Sergeant Mosk attempted to gather his men for evacuation. Mosk urged Karn to evacuate with him and when Karn did not respond Mosk screamed into Karn's face. When even this did not work Mosk physically grabbed Karn and dragged him to the evacuation craft.\nKarn, Mosk, and Hyne were summoned to a meeting with Lieutenant Supervisor Blevin, who was the Imperial Security Bureau officer tasked with overseeing the sector the Morlani System was located in. Blevin heavily berated the three for their incompetence, stating that out of all the disastrous fiascos he'd seen corporate security involved in this incident was by far the worse. He specifically singled out Karn, stating that Karn should at least take comfort in the fact he would not be replaced because all corporate security in the Morlani system was being dissolved and the Empire would now assume direct control over the system. Karn was then fired and returned home to his mother in disgrace. His mother at first slapped him before embracing him crying and inviting him into her home.\nTraumatized by the Ferrix disaster, Karn returned to living in his childhood bedroom, with no hope for the future and no desire for a new start. He refused his mother's offers to ask his uncle Harlo for help in finding him a new job, and instead spent his time staring at a hologram of the fugitive Cassian Andor. Despite his reluctance though his mother did speak to Harlo who was able to offer Karn a job in the Imperial Bureau of Standards. Three days after returning to Coruscant, Karn visited the bureau and rather reluctantly accepted a job opening on the fuel purity department.\nDuring his first week in the fuel purity department, Karn submitted six reports regarding Cassian Andor, naming him as a missing fuel specialist, an unresponsive energy engineer and a fuel purity field officer suspected of forging Imperial reports. The false reports caught the attention of ISB Supervisor Dedra Meero, who called in Karn for interrogation regarding the reports. Karn explained that he was attempting to use his limited power to track down the man responsible for the disaster on Ferrix and clear his name, a revelation which led the ISB in also identifying Cassian as a member of the heist on Aldhani and an accomplice of the \"Axis\", a suspected connection to multiple rebel cells across the galaxy. Karn was allowed to read former supervisor Blevin's full report and submit his corrections.\nSyril found many inconsistencies in the signed Blevin's report, later trying to more accurately identify the \"Axis\". In the end, Karn offered Dedra cooperation as opposed to her suggestion to stop sending false reports about Cassian, finding his usefulness to the Empire in the search for a criminal and a murderer, but Meero rejected this offer, suggesting that he forget about their meeting.\nSoon after the interrogation, Karn returned to the Bureau of Standards, where he received a promotion from his boss for \"a service rendered to the Empire\". During a conversation with his mother, he was outraged that she had secretly began to spy on him, although she was unhappy with such a reproach from Syril, and framed it as him being ungrateful for all she'd done for him. Syril was not deterred by his addiction to Meero, and sometimes he stopped near the Central Office of the ISB in the hope of seeing her and continuing their conversation.\nUpon finally meeting Meero, he expressed his sincere gratitude, as well as the revival of his dream of the possibility of justice and beauty in the galaxy, inspired by her. Despite the fact that Dedra categorically replied to him that she was not responsible for his promotion and indicated only an attempt to clear his name, Syril was filled with her and saw in her a person capable of reviving his life. Meero warned Karn that he was creating problems for himself by meeting with the ISB supervisor, and threatened him with arrest when he tried to continue their conversation and tried to stop her by grabbing her arm. Syril stopped thoughtfully and slightly smiled after Dedra left their place of conversation on her way to the ISB meeting.\nSyril Karn is portrayed by Kyle Soller. He first appeared in Andor and was first shown in a LEGO set reveal during Celebration Anaheim. His live-action depiction was first showcased in promotional images released by The Walt Disney Company on Getty Images.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Syril_(disambiguation)",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Preox-Morlana",
  "/wiki/Pre-Mor_Security_Inspection_team",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Bureau_of_Standards",
  "/wiki/Deputy_Inspector",
  "/wiki/Imperial_Era",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Ferrix",
  "/wiki/Eedy_Karn",
  "/wiki/Reproduction",
  "/wiki/Parent",
  "/wiki/Harlo",
  "/wiki/Core_Worlds",
  "/wiki/Planet",
  "/wiki/Clone_trooper",
  "/wiki/Morlani_system",
  "/wiki/Morlana_One",
  "/wiki/Corporate_Security_Headquarters",
  "/wiki/Uniform",
  "/wiki/Officer",
  "/wiki/Death",
  "/wiki/Leisure_Zone",
  "/wiki/Unidentified_brothel_hostess",
  "/wiki/Leisure_Zone_brothel",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Kenari",
  "/wiki/Chief_Inspector",
  "/wiki/Hyne",
  "/wiki/Starship",
  "/wiki/Standard_year",
  "/wiki/Timm_Karlo",
  "/wiki/Sergeant",
  "/wiki/Linus_Mosk",
  "/wiki/Luthen_Rael",
  "/wiki/Blevin",
  "/wiki/Hologram",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Supervisor",
  "/wiki/Dedra_Meero",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani",
  "/wiki/Galaxy",
  "/wiki/ISB_Central_Office",
  "/wiki/Kyle_Soller",
  "/wiki/LEGO",
  "/wiki/Celebration_Anaheim_(2022)",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Kassa_(episode)",
  "/wiki/That_Would_Be_Me",
  "/wiki/Reckoning_(episode)",
  "/wiki/Aldhani_(episode)",
  "/wiki/The_Axe_Forgets",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/August_10",
  "/wiki/2022"
 ]
}