{
 "name": "T%27Jaleq_Kith%27Araquia",
 "display_name": "T'Jaleq Kith'Araquia",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kirtania"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Araquia"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "T'Jaleq Kith'Araquia was an Araquia doctor on his species' homeworld of Kirtania, working with the Ho'Din Sirta Kum.\nA native of the planet Kirtania, the Araquia male T'Jaleq Kith'Araquia was a noted doctor and pharmacologist. Alongside the Ho'Din Sirta Kum, he was responsible for developing a cure for the Direllian Plague utilizing the Shiarha Root native to Kirtania's rain forest. During the Galactic Civil War, the Galactic Empire started a campaign of deforestation on Kirtania. Doctor Kith'Araquia attempted to stop them using reasoned logic, and then legislation. When both failed, he was labeled as a Rebel sympathizer by the Empire. Forewarned, Kith'Araquia and the rest of his tribe escaped into the rain forest and began a guerrilla war against the Imperial workforce stripping the area.\nActing as his tribe's witch doctor and military strategist, Kith'Araquia led attacks on the Imperial work camp in the rain forest, destroying equipment and log transports but refrained from killing any Imperial soldiers or workers. During the campaign, a group of Rebel agents were captured in the rain forest in the company of a Ho'Din, Kutu, and the Human Pierce Mantrell. During an interrogation, Kith'Araquia learned that the Rebels were looking for him to help them cure an outbreak of the Direllian Plague at their base. Kith'Araquia immediately pledged to help them, but his tribe were planning a major attack on the Imperial work camp and that took priority. He asked for the Rebels help in the attack, and they agreed.\nThe attack destroyed all of the Imperial equipment at the site. En route back to the Araquia camp, they found that the Imperials had set fire to the forest in an attempt to kill the Araquia. The doctor directed his fellow Araquians to pick as many Shiarha Roots as they could while fleeing, and led his compatriots to safety. The Rebels thanked him for his help, and the doctor asked them to take the Araquian non-combatants off planet, which they agreed to. Kith'Araquia decided to remain on Kirtania and continue to resist the Empire.\nA dedicated and compassionate individual, T'Jaleq Kith'Araquia was a devoted doctor and pharmacologist. An advocate of natural medicine and sound ecological practices, he was dedicated to eradicating disease through the galaxy. Intelligent and scholarly, Koth'Araquia possessed a wicked sense of humor predicated on other beings' natural aversion to his spider-like features. Like all Araquia, he was a pacifist, but did question whether or not his species' stance would be enough to stand against the Empire.\nKith'Araquia could construct and shoot sticky webs as part of his physiology, and was adept at gliding on his constructs. He had knowledge of alien species, languages and cultures, and was able to survive in a jungle environment. His medicinal training gave him extensive training in first aid and medicine, with specialities in diseases and pharmacology.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kirtania",
  "/wiki/Araquia",
  "/wiki/Gender/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Ho%27Din/Legends",
  "/wiki/Sirta_Kum",
  "/wiki/Planet/Legends",
  "/wiki/Direllian_Plague",
  "/wiki/Shiarha_Root",
  "/wiki/Kinkosa_rain_forest",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Witch_doctor",
  "/wiki/Imperial_work_camp",
  "/wiki/Log_transport",
  "/wiki/Soldier/Legends",
  "/wiki/Kutu",
  "/wiki/Human/Legends",
  "/wiki/Pierce_Mantrell",
  "/wiki/Tiragga_Alliance_outpost",
  "/wiki/The_galaxy/Legends",
  "/wiki/Spider/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Quality_of_Mercy",
  "/wiki/Star_Wars_Adventure_Journal_1"
 ]
}