{
 "name": "T%27ongor",
 "display_name": "T'ongor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 10 BBY and 3 ABY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nakano Lash's crew"
     ]
    }
   ]
  }
 ],
 "content": "T'ongor was a human male bounty hunter and the brother of T'onga. He was one of several bounty hunters hired by Khamus of the Mourner's Wail Syndicate as part of a team led by Nakano Lash, whose mission was to attack a sanctuary of the Unbroken Clan on the planet Corellia. During the mission, Lash killed Khamus as revenge for the murder of his target, and T'ongor contacted the other hunters, warning them of Lash's betrayal and the mission's failure. As they made their escape, Boba Fett attempted to kill Lash for her betrayal, but due to the intervention of Lash's protégé Beilert Valance, T'ongor was instead killed. Years later T'onga swore to avenge his death by hunting down Lash.\nBorn as the twin brother of T'onga, T'ongor and his sister worked as bounty hunters in the galaxy. The siblings were associates of the Nautolan hunter Nakano Lash as well as the Abednedo technician Jhorstek. At some point after 10 BBY, the four criminals shared a drink in Phelar Port on the planet Eriadu when a young thief was apprehended by stormtroopers. Although Lash wanted to help the boy, Jhorstek and T'ongor decided against it, not wanting to cause trouble. The group looked on as the ex-Imperial soldier Beilert Valance rose to defend the boy and attack the troopers. When Valance was shot down, Lash came to his aid and had her companions assist the wounded hunter.\nSometime later, T'ongor was part of a team led by Lash, who had been hired by Khamus, heir of the Mourner's Wail Syndicate. Khamus paid the bounty hunters to attack a sanctuary of the rival Unbroken Clan on the planet Corellia in order to get him close to his target.\nT'ongor accompanied Lash and Khamus while fellow hunters Valance, Bossk, and Boba Fett eliminated the Unbroken Clan's guards. When one of the sentries escaped Bossk, Khamus began to complain about the quality of the bounty hunters' work, but T'ongor jammed the escaped sentry's comms, preventing him from warning the rest of the Unbroken Clan. Lash killed the sentry, and she, T'ongor, and Khamus entered the Unbroken Clan facility once the other hunters had killed the remaining guards. Upon learning the identity of Khamus' target, Lash attempted to stop him. Khamus killed the target, and was shot dead by Lash in revenge. T'ongor was shocked by Lash's murder of their client, and contacted the other hunters about her apparent betrayal, insisting that they escape before facing the consequences of Khamus' death.\nAfter being informed by T'ongor of Lash's actions, Fett attempted to kill the Nautolan but due to Valance's intervention the shot missed Lash and instead hit T'ongor and killed him. T'onga, unaware of the truth behind her brother's death, blamed it on Lash, who went into hiding following the botched mission, and swore to kill her. When Lash eventually resurfaced around 3 ABY, T'onga returned to her former life of bounty hunting in order to get revenge on her for the death of T'ongor and the loss of their family's honor.\nT'ongor was a human male with black hair and dark eyes and skin. He and T'onga were born to a culture that felt a special bond between twins.\nT'ongor wore red clothing and white gauntlets, which contained both a wrist comm and technology that could jam another individual's communications. During the job on Corellia, T'ongor carried a brown satchel on his left shoulder.\nT'ongor appeared in a flashback sequence in Bounty Hunters 1, a comic written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on March 11, 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bounty_Hunters_3",
  "/wiki/Bounty_Hunters_4",
  "/wiki/Bounty_Hunters_5",
  "/wiki/Bounty_Hunters_13",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Special:Upload",
  "/wiki/10_BBY",
  "/wiki/3_ABY",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nakano_Lash%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/T%27onga",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Khamus",
  "/wiki/Mourner%27s_Wail_Syndicate",
  "/wiki/Nakano_Lash",
  "/wiki/Skirmish_on_Corellia",
  "/wiki/Unbroken_Clan_sanctuary",
  "/wiki/Unbroken_Clan",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Boba_Fett",
  "/wiki/Beilert_Valance",
  "/wiki/Reproduction",
  "/wiki/Twin",
  "/wiki/The_galaxy",
  "/wiki/Nautolan",
  "/wiki/Abednedo",
  "/wiki/Technician",
  "/wiki/Jhorstek",
  "/wiki/Phelar_Port",
  "/wiki/Eriadu",
  "/wiki/Stormtrooper",
  "/wiki/Imperial_Army",
  "/wiki/Soldier",
  "/wiki/Trooper",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Signal_jammer",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Gauntlet",
  "/wiki/Wrist_comm",
  "/wiki/Bounty_Hunters_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Paolo_Villanelli",
  "/wiki/Marvel_Comics",
  "/wiki/March_11",
  "/wiki/2020",
  "/wiki/Bounty_Hunters_2",
  "/wiki/Bounty_Hunters_10",
  "/wiki/Bounty_Hunters_18",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Bounty_Hunters",
  "/wiki/Target_Vader_5",
  "/wiki/Mimban_Campaign",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars_Insider",
  "/wiki/TK-462_(short_story)",
  "/wiki/Star_Wars_Insider_166",
  "/wiki/Databank_(website)"
 ]
}