{
 "name": "T%27Teknulp",
 "display_name": "T'Teknulp",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Farquar III"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "T'Teknulp was a male Chadra-Fan Jedi General during the Clone Wars who fought in many perilous battles. When the planet Farquar III aligned with the Separatists, the Republic sent its forces to destroy a droid factory on the world, giving T'Teknulp command of a division of clone troopers. During the battle of Farquar III, T'Teknulp and his division were en route to reinforce General Obi-Wan Kenobi and his 7th Sky Corps when they encountered enemy forces in planetary orbit. T'Teknulp did not survive the engagement, and Kenobi was forced to continue the battle unaided.\nA male Chadra-Fan, T'Teknulp was one of the many Jedi called to lead the Republic forces against the Separatists when the Clone Wars broke out in 22 BBY. T'Teknulp developed a reputation as a skilled general while serving in the Clone Wars, with General Obi-Wan Kenobi having complete confidence in his abilities. By the weeks leading up to the battle of Farquar III, he had been involved in many dangerous battles but had not once been injured.\nWhen the planet Farquar III aligned with the Separatists, the Republic sent its forces to destroy a droid factory on the world, giving T'Teknulp command of a clone trooper division. During the battle, T'Teknulp's division was en route to reinforce Kenobi's 7th Sky Corps when they encountered enemy forces in planetary orbit. T'Teknulp assured Kenobi that he would be at his position within five minutes; however, T'Teknulp and his division were killed. After Kenobi's Padawan, Anakin Skywalker, arrived and destroyed a number of enemy droidekas that were harassing his Master, the clone commander of the 7th Sky Corps, Cody, gave them the news of T'Teknulp's fate. Both Kenobi and Skywalker were stunned by the news, with Skywalker reacting with disbelief, stating that T'Teknulp had been just behind him. The two mourned the loss of yet another Jedi in the Clone Wars before they proceeded to attack the droid factory.\nT'Teknulp was well respected during the Clone Wars, having been involved in many dangerous battles, but had not once been injured. Obi-Wan Kenobi regarded T'Teknulp as a skilled general, holding complete faith in the Chadra-Fan's ability to reinforce him during the battle of Farquar III despite having encountered enemy forces in planetary orbit. T'Teknulp was unsuccessful, however, as he was killed before reaching Kenobi. T'Teknulp was known by others to have a strangely jovial and high squeaky voice; Kenobi noted that he always sounded happy no matter the circumstances.\nT'Teknulp made his first and only appearance in the 2008 young adult novel The Life and Legend of Obi-Wan Kenobi, written by Ryder Windham. He is never present but is spoken to over a comm unit. Since Anakin Skywalker was still a Padawan at the time of the Farquar III battle, T'Teknulp must have died in 22 BBY.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/22_BBY/Legends",
  "/wiki/Farquar_III",
  "/wiki/Chadra-Fan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Droid_factory",
  "/wiki/Division/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Battle_of_Farquar_III",
  "/wiki/General/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/7th_Sky_Corps/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Droideka/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-2224/Legends",
  "/wiki/Droid/Legends",
  "/wiki/2008",
  "/wiki/The_Life_and_Legend_of_Obi-Wan_Kenobi",
  "/wiki/Ryder_Windham",
  "/wiki/Comm_unit/Legends",
  "/wiki/Time/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars:_The_Clone_Wars_(novelization)"
 ]
}