{
 "name": "T%27ra_Saa",
 "display_name": "T'ra Saa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "138 ABY",
      "Taivas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neti"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown tendrils"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow-green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "New Republic",
      "New Jedi OrderJedi High Council",
      "Jedi High Council",
      "Galactic Federation of Free Alliances"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Mace Windu"
     ]
    }
   ]
  }
 ],
 "content": "T'ra Saa was a female Neti Jedi Master who served the Jedi Order during the final centuries of the Galactic Republic. In the years leading up to the end of the Republic, Master Saa fell in love with her fellow Jedi Master Tholme, and served as his successor as the Jedi Watchman of the Kiffu sector.\nAfter the onset of the Clone Wars, the Neti Jedi Master served with distinction as a Jedi General in the Grand Army of the Republic. Saa proceeded to survive Order 66, along with Tholme and fled to Kashyyyk, where she took refuge with Tholme's former Padawan, Quinlan Vos and his family.\nAfter the rise of the Galactic Empire, Tholme passed away, while Saa lived on to survive the Great Jedi Purge, and reclaim her position as a Jedi Master in the New Jedi Order. Due to the natural long life span of her species, Saa survived to the aftermath of the Sith–Imperial War, during which she was a member of the Jedi High Council alongside the Whiphid Jedi Master K'Kruhk, whom she had served with more than a century before during the times of the Old Republic.\nNear the conclusion of the Second Imperial Civil War, T'ra Saa sacrificed herself on the planet Taivas, where the Hidden Temple of the Jedi was located. Forces of the reborn Darth Krayt launched a massive assault on the Temple, and were also prepared for a counterattack from Roan Fel's Empire-in-exile and the Galactic Alliance Remnant. Saa directed the energy of the Temple's reactor with the force and created a massive beam of light that tore a hole in the Sith fleet, allowing her fellow Jedi and allies to escape and eventually win the war.\nAlthough T'ra Saa seldom spoke of her youth, she joined the Jedi Order and gained the rank of Jedi Master centuries before the fall of the Republic. She was involved in the training of Jedi Master Mace Windu while he was still a Jedi apprentice.\nPrior to the Stark Hyperspace War, she was appointed Jedi Watchman of the Kiffu sector; an area of space including the twin worlds of Kiffu and Kiffex. Her close friend, Tholme, had stepped down from that post, so as to take Quinlan Vos as his Padawan. Later, Master Saa assisted Quinlan Vos in defeating Volfe Karkko's Anzati uprising on Kiffex. As she made her way to Kiffex, Tinté Vos had failed to tell the Kiffu Guardians of her passing, which Saa suspected was on purpose. The Guardians then opened fire on the Jedi Master and after a struggle her ship was brought down. She survived the crash landing and was soon contacted by the Jedi Council and told about Volfe Karkko. T'ra Saa avoided detection in tree form and when Quinlan Vos was captured by feral Anzati she freed him and helped him destroy his captures.\nJust then Jedi Masters Tholme, Zao and a Devaronian appeared. T'ra Saa told them all about Karkko and his wicked history and that Vos had to choose to either stay and fight or return to Coruscant, he chose to fight. After failing to convince Vilmarh Grahrk to join them, Saa led the three Jedi in the direction where she saw Aayla Secura and her Anzati forces travel. Master Saa, Tholme and Zao fought off many Anzati while Vos engaged Secura and Karkko. After the Anzati were defeated the three powerful Jedi Masters joined their minds and went into a Jedi meld to help Quinlan Vos, who then killed Karkko and saved Secura. They then met with Tinté Vos, Mace Windu, Adi Gallia and Plo Koon back on Kiffu.\nAt some point during their association, Masters Saa and Tholme fell in love, but managed, in Tholme's opinion, to avoid the selfishness, jealousy, and attachment that so often came with love; meaning that the pair believed that they had managed to find a way to love in a way that avoided the lure of the dark side. At the same time, the pair recognized that Saa was centuries older than Tholme, and accepted that Saa would likely outlive him.\nAlong with Masters Yoda and Fay, Jedi Master T'ra Saa was among the very oldest of the Jedi to fight in the Clone Wars, being at least several hundred years old. Saa was a combatant in the opening battle of the war, the Battle of Geonosis, and fought as part of Mace Windu's strike team. Indeed, Saa was among the few Jedi to survive that devastating battle.\nLater, Jedi Masters Saa, Tholme, An'ya Kuro, Kit Fisto and Jedi Knight Aayla Secura, were assigned the mission of investigating Confederacy raids on Republic supply ships near the Corellian Trade Spine. The Jedi task force discovered that the raiders' base was located on Devaron, after Saa received information from her old friend Senator Elsah'sai'Moro indicating that this was so. However, the senator was killed by failed Jedi Aurra Sing before she could reveal the name of the traitor who was aiding the Separatists locate the Republic supply ships.\nWhile Masters Saa and Fisto remained in orbit around the planet, Tholme led the strike team to the surface of Devaron so as to investigate the late Moro's claims. Tholme's task force disguised themselves, with Secura acting as a rich Twi'lek's daughter, and the remainder of the team as her servants, all the while staying with Devaron Senator Vien'sai'Malloc. Kuro and Tholme attempted to discover the Separatist base, only to fall into the trap of Aurra Sing, who had been assisted by Senator Vien'sai'Malloc, who was revealed as the traitor. However, Aayla Secura apprehended both the Senator and Aurra Sing, saving the two more experienced Jedi.\nAfter Master Quinlan Vos, formerly Tholme's apprentice, infiltrated the Confederacy by feigning a fall to the dark side, fears began to arise on the Jedi High Council as to whether Vos continued to serve the Republic or truly had fallen under the sway of Count Dooku's dark influence. Saa supported Tholme during his communication with Masters Yoda and Windu, as he informed them that Vos had failed to contact him as designated.\nDuring a battle on Null, T'ra Saa acted as ranking member of the Republic forces stationed there. While using the Force to heal injured troops and Jedi, Saa and Jedi Knight Barriss Offee were unexpectedly attacked by bounty hunters working on behalf of the Crimson Nova, who had placed significant bounties on the heads of Jedi.\nDuring the fighting vast fires raged towards the camp, while Saa's lightsaber was knocked from her hand and stolen by a fleeing bounty hunter. To protect the injured, Saa was compelled to put on a masterly display of her skills with the Force, to down trees and protect against the approaching blaze. However, Saa was grievously injured, saved only by the timely arrival of Master Windu, who had her placed in a bacta tank to recover. Windu then led a mission to the Rig, which led to destruction of the Crimson Nova, during which he recovered Saa's lightsaber from the Nova's leader, Mika.\nAfter returning to Coruscant, Windu located Saa in the Temple meditation gardens. There she was with a comatose Depa Billaba, trying to restore to her mind, which she had lost after falling to the dark side during her last mission on Haruun Kal. Windu asked her if it was best given her recent injuries, but Saa replied that she would heal in time. After Windu returned her weapon to her, she asked him what was troubling him. He told her of Quinlan Vos' apparent defection to the Sith on an operation that he had supported, and that he felt guilty for Billaba's condition, as it was he who had sent her on the mission and was her Master when she was a Padawan. Saa, however, who was one of Windu's masters when he was a Padawan, retorted that the two made their choices, and that they were responsible, not him. Windu noted his perception of shatterpoints was often misshaped by hope, and that some, like Billaba, just could not be reached. Saa replied there was nothing they could do but to trust in the Force and believe they would find their way back.\nSaa was on Nar Shaddaa with Tholme and the pregnant Khaleen Hentz in the final days of the Clone Wars, where they evaded Order 66. After Order 66 all three fled Nar Shaddaa and hid on Kashyyyk along with Quinlan Vos, who was stationed on the Wookiee homeworld during the Clone Wars.\nSome time after the rise of the Galactic Empire, Tholme passed away. T'ra Saa was later said to have taken root at the site of Tholme's funeral pyre on Anzat. Sometime between the aftermath of the Galactic Civil War and the Second Galactic Civil War, in which the New Jedi Order, that had been restored following the defeat of the Empire and Saa subsequently joined, was nearly destroyed, T'ra Saa became a member of the Jedi High Council alongside Masters K'Kruhk, and Tili Qua who had joined the Order much later than the two survivors of the Clone Wars, during the events of the Third Jedi Purge enacted by Darth Krayt and the One Sith.\nHaving taken refuge at the Hidden Temple, Master Saa and the Council were present when Cade Skywalker and Emperor Roan Fel's Imperial delegation arrived seeking refuge. Saa, along with the rest of the Council, listened to Princess Marasiah Fel's offer for the Order to join forces with Roan Fel and the truth that Fel was not responsible for the war or the Massacre at Ossus. Saa saw the truth in her words but believed the Jedi needed to regroup and increase in numbers before confronting the Sith again. Master Saa refused to believe Skywalker when he said that Darth Krayt was really A'Sharad Hett, but K'Kruhk believed it, saying that there was always a darkness in Hett and that the Clone Wars had changed many Jedi.\nAt this point, Skywalker suggested assassinating Krayt. Master Saa was stunned by the suggestion, saying that the Jedi hold all life sacred, and that actively seeking to destroy it was not the Jedi way. Despite this, the Council agreed to discuss it. They spent the night discussing Skywalker's suggestion with Nat Skywalker. Saa said that they had to help the Mon Calamari fight against the genocide the Sith were wreaking on them, but was concerned because they didn't have enough Knights and Masters at the Temple, and was worried if the Galaxy would be given to the Sith if they acted now. After long deliberation and meditation, Masters Qua, K'Kruhk and Saa unanimously decreed that the Jedi would play no part in the assassination of Krayt; they felt it would be wiser to give the Order time to grow stronger, while the Sith undermined each other.\nHowever, Skywalker continued with his plan to assassinate Krayt despite the Council's decision; the plan ending with the Dark Lord's death, though it was his most trust adviser Darth Wyyrlok III who ultimately murdered and replaced him as the new Dark Lord. Subsequently, Skywalker asked his companion Jedi Knight Shado Vao, who was returning to the Temple, to inform the Council that Krayt was dead.\nLater, the Council learned that Krayt had in fact survived death, and killed Wyyrlok in a duel; reclaiming his titles of Dark Lord of the Sith and Emperor. When Imperial Knight Antares Draco revealed the location of the Hidden Temple under torture, the Council discussed how best to repel the imminent Sith attack. Saa implored to evacuate the younglings before the battle began, but Skywalker exclaimed that they, and any safe location they would head to, would become vulnerable and destroyed. He explained that everyone had their part to play, and that if victory was to be attained, risks would need to be taken. They ultimately decided to follow through with Skywalker's plan and fought side by side with Roan Fel's forces and the remnants of the Galactic Alliance.\nT'ra Saa proceeded to direct the Jedi's defense with Battle meditation from the Council chamber. When Krayt's Sith Troopers launched their trap, Nat and Cade Skywalker as well as the Jedi Masters Sayar Dun'La, Te Corso, and Drok stayed to protect her until the evacuation of the Hidden Temple could be completed. Finally, all of her defenders had fallen except for the Skywalkers, the older of the pair Force-pushed his nephew away from the building just as a crashing Annihilator-class starfighter rammed into it. The chain reaction created a blast that killed the two Jedi Masters, but with their dying thoughts T'ra Saa and Nat Skywalker focused the energy into a massive beam of light. It traveled upwards towards the enemy fleet, creating an opening that allowed the rest of the Jedi to escape.\nAlthough she had perished in the intense battle, T'ra Saa's sacrifice was not in vain. The remaining Jedi, Imperial, and Alliance forces regrouped at Bastion, where they decided to launch an attack on the vulnerable Coruscant. There Cade Skywalker killed Darth Krayt, while Roan Fel was killed by his own Imperial Knights for attempting to wipe the planet of all life. With Krayt's Empire in shambles, the Galactic Federation of Free Alliances reemerged as the dominant galactic government, with T'ra Saa's long time comrade K'Kruhk as one of its Triumvirs. Sometime after her death, on the ruins of the Hidden Temple, Neti saplings born from T'ra Saa's sacrifice began to grow, thereby allowing the legacy of the famous Jedi Master to live on for years to come.\nT'ra Saa was a calm and thoughtful Jedi who never lost her temper or jumped to conclusions. Saa had a tendency to speak in riddles or metaphors and possessed great wisdom, which she had gained through centuries of experience.\nT'ra Saa was in love with Jedi Master Tholme despite their species differences and Tholme felt the same way towards her. However, they both believed that they had found a way to love without the selfishness, jealousy, and attachment that could come with love. Saa and Tholme also realized and accepted that Saa would most likely live much longer than Tholme. When Tholme finally passed into the Netherworld of the Force, Saa engrained herself at his resting place and remained in meditation for many years. She would speak very little to others about that time.\nT'ra Saa was a master of Force healing and was very adept with her lightsaber, having had many centuries to improve her skills. She was very skilled with Telekinesis, and used it with great effect to down trees during the battle on Null.\nT'ra Saa's fighting style involved slaying her enemies with her lightsaber while simultaneously using the Force to defend against other attackers. When Saa fought she seemed to stay in the same place and never give up her ground. T'ra Saa proved to also be a skilled pilot as she managed to survive the attack of the Kiffu Guardians. Although her courier was destroyed she survived the crash landing. As with masters Zao and Tholme, Saa had great skill with the Force power of Jedi meld which allowed the Jedi to join in thought.\nBy the time of the Second Imperial Civil War, T'ra had become skilled in the rare art of Battle meditation, which she utilized in the defense of the Jedi Hidden Temple. As she died, with the aid of Nat Skywalker, she was able to focus the explosion consuming her and the Force energy of Taivas into a massive beam of light that shot into space, allowing an opening for the Jedi and their allies to escape. By the time of her death, she was also capable of absorbing blaster shots with her bare hands.\nAs a Neti, Saa had the ability to change her appearance at will. Her preferred form was similar to that of a human woman the most notable differences being no nose and brown tendrils instead of hair.\nT'ra Saa was created by John Ostrander and Jan Duursema for the Star Wars: Republic series of comics. The two wanted to create a long lived Jedi, and Duursema had always been interested by the character of Ood Bnar, a Neti Jedi Master who made his debut in Tales of the Jedi 5. When designing her, Duursema tried to maintain most of the phenotypical characteristics exhibited by Ood Bnar, while still making her younger and more attractive. On her website, Duursema also stated that she believed the Jedi Master was fairly young for a Neti, aged between four and nine centuries old during the last decades of the Galactic Republic.\nIt was never explained why T'ra Saa, a plant-based life form, had the breasts of a mammal. It is possible this was done by the artist  simply to emphasize her femininity, as Neti are a shapeshifting species, though of course a plant based humanoid may still have sexual dimorphism.\nT'ra Saa's action figure became available with Tholme on the 22 July 2009.\nIn Darkness Saa has a golden lightsaber and a green one in most of her other appearances.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/138_ABY",
  "/wiki/Taivas",
  "/wiki/Neti/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tholme/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Kiffu_sector",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Whiphid/Legends",
  "/wiki/K%27Kruhk",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Planet/Legends",
  "/wiki/Hidden_Temple_(Sith%E2%80%93Imperial_War)",
  "/wiki/Darth_Krayt",
  "/wiki/Attack_on_the_Hidden_Temple",
  "/wiki/Roan_Fel",
  "/wiki/Empire-in-exile",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Beam_of_light",
  "/wiki/Sith/Legends",
  "/wiki/File:TraSaaandBarriss2.jpg",
  "/wiki/Stark_Hyperspace_War/Legends",
  "/wiki/Kiffu/Legends",
  "/wiki/Kiffex/Legends",
  "/wiki/Volfe_Karkko",
  "/wiki/Anzat_(species)",
  "/wiki/Tint%C3%A9_Vos",
  "/wiki/Zao",
  "/wiki/Devaronian/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Vilmarh_Grahrk",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Fay",
  "/wiki/Clone_Wars/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/File:Tra_Saa_saber.jpg",
  "/wiki/An%27ya_Kuro",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Corellian_Trade_Spine/Legends",
  "/wiki/Devaron/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Elsah%27sai%27Moro",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Vien%27sai%27Malloc",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/File:Null2.jpg",
  "/wiki/Null/Legends",
  "/wiki/Battle_of_Null_(Crimson_Nova)",
  "/wiki/The_Force/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Barriss_Offee/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Crimson_Nova",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Mission_to_the_Rig",
  "/wiki/Mika_(Farghul)",
  "/wiki/Jedi_Temple_Meditation_Garden",
  "/wiki/Depa_Billaba/Legends",
  "/wiki/Battle_of_Haruun_Kal/Legends",
  "/wiki/Haruun_Kal/Legends",
  "/wiki/Shatterpoint/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Khaleen_Hentz/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/File:Legacy_-25_council.jpg",
  "/wiki/137_ABY",
  "/wiki/Jedi_funeral/Legends",
  "/wiki/Anzat/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Tili_Qua",
  "/wiki/Third_Jedi_Purge",
  "/wiki/One_Sith",
  "/wiki/Cade_Skywalker",
  "/wiki/Emperor/Legends",
  "/wiki/Marasiah_Fel",
  "/wiki/Massacre_at_Ossus",
  "/wiki/Rawk",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Genocide_on_Dac",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Shado_Vao",
  "/wiki/File:TraBattleMeditation.jpg",
  "/wiki/Antares_Draco",
  "/wiki/Battle_meditation",
  "/wiki/Darth_Krayt%27s_Sith_troopers",
  "/wiki/Sayar_Dun%27La",
  "/wiki/Te_Corso",
  "/wiki/Drok",
  "/wiki/Annihilator-class_starfighter",
  "/wiki/Bastion/Legends",
  "/wiki/Battle_of_Coruscant_(Great_Hyperspace_War)",
  "/wiki/Omega_Red",
  "/wiki/Triumvirate_(Galactic_Alliance)",
  "/wiki/T%27ra_Saa%27s_descendants",
  "/wiki/File:TraSaaTholme-SWREP34.jpg",
  "/wiki/Netherworld_of_the_Force/Legends",
  "/wiki/File:TraNatBeamofLight.jpg",
  "/wiki/Telekinesis/Legends",
  "/wiki/T%27ra_Saa%27s_courier",
  "/wiki/Tutaminis",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Tales_of_the_Jedi_5",
  "/wiki/Breast/Legends",
  "/wiki/Mammal/Legends",
  "/wiki/Changeling/Legends",
  "/wiki/Star_Wars:_Republic:_Darkness",
  "/wiki/Lightsaber/Legends",
  "/wiki/Category:Images_of_T%27ra_Saa",
  "/wiki/Star_Wars_(1998)_32",
  "/wiki/Star_Wars_(1998)_33",
  "/wiki/Star_Wars_(1998)_34",
  "/wiki/Star_Wars_(1998)_35",
  "/wiki/Republic_49",
  "/wiki/Jedi:_Aayla_Secura",
  "/wiki/Star_Wars:_Republic:_Show_of_Force",
  "/wiki/Republic_72",
  "/wiki/Republic_73",
  "/wiki/Republic_75",
  "/wiki/Republic_77",
  "/wiki/Republic_83",
  "/wiki/Lone_Wolf:_A_Tale_of_Obi-Wan_and_Luke",
  "/wiki/Star_Wars:_Legacy:_The_Hidden_Temple",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Legacy%E2%80%94War_4",
  "/wiki/Legacy%E2%80%94War_6",
  "/wiki/Wizards.com",
  "/wiki/T%27ra_Saa_(article)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Star_Wars:_Panel_to_Panel_Volume_2:_Expanding_the_Universe",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Toy_Wars",
  "/wiki/Star_Wars_Insider_107",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Welcome_to_the_Star_Wars_Jungle",
  "/wiki/Republic_66",
  "/wiki/Legacy_(2006)_25",
  "/wiki/Republic_65",
  "/wiki/August_8",
  "/wiki/2007"
 ]
}