{
 "name": "T%27doshok_(bounty_hunter)",
 "display_name": "T'doshok  (bounty hunter)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "T'doshok was a male Trandoshan bounty hunter during the Clone Wars, the conflict between the Galactic Republic and a separatist faction that had seceded from the galactic government. He had planned to capture Republic Senator Shayla Paige-Tarkin from the planet of Coruscant to give her over to the Separatists in exchange for a large bounty; however, he was intercepted by Clone Commander \"Fox\" and the Coruscant Guard, a group of specially trained clone troopers attached to the Senate. Though he tried to run, the Trandoshan was quickly disarmed by the commander and arrested.\nT'doshok, a Trandoshan male bounty hunter, tried to capitalize on the large bounty for members of the Galactic Senate offered by the Confederacy of Independent Systems during the Clone Wars between them and the Galactic Republic. He traveled to Coruscant, the Republic's capital planet, in an attempt to capture Senator Shayla Paige-Tarkin. Espionage brought news of his plan to Clone Commander \"Fox,\" leader of a task force of clone troopers called the Coruscant Guard charged with defending the Senate and its members. Fox knew of him before his starship had landed and he mobilized a trooper unit to confront T'doshok with orders to take him alive. Upon seeing Fox, alone, the bounty hunter attacked with his ACP scatter gun. T'doshok's initial shots missed and he took shelter behind an old speeder, a position from which he let a volley go that barely missed Fox's head. The clone raised his blaster and took aim, but did not fire as that would have breached his objective. His target fled through the streets.\nFox gave chase and contacted his team. The clones quickly surrounded the T'doshok who, with nowhere else to run, used his hidden jetpack to fly to a nearby rooftop. Fox used an ascension gun to scale the building and climb to the roof while the Trandoshan fired at him. The clone took cover and fired several warning shots before telling T'doshok to surrender. The bounty hunter refused and squeezed the trigger of his gun. However, Fox took advantage of the Trandoshan species' naturally slow firing rate and shot the gun out of the alien's hands. Fox once again told the bounty hunter to surrender, but the commander noticed that he was looking for a way to escape. He threatened to shoot the Trandoshan out of the sky if he tried to use his jetpack again. T'doshok knew that he had lost, so he gave in and was taken into custody by the Guard.\nT'doshok, a male Trandoshan, worked as a bounty hunter in the galaxy and had brown scales and orange eyes. He knew at least some of his native language, Dosh, and could speak Galactic Basic Standard, though not well grammatically. Armed with an ACP scatter gun as his primary weapon, he also carried a jetpack on his back for quick escapes.\nThe bounty hunter was willing to attempt a bounty that no-one had ever collected successfully as a quick way to a large sum of credits. When he was confronted by Fox, he became visibly nervous, but he refused defiantly to surrender and opened fire on the clone. T'doshok showed that he was not very accurate with his blaster, though some of his shots nearly hit their mark. He had a slow trigger finger, but that was not uncommon for his species. The tenacious bounty hunter only surrendered, reluctantly, to Fox's men when there was no chance of escape.\nT'doshok appeared in the four-page eBook \"Out Foxed\" by Rob Valois, published in 2008. In the story, he uttered the phrase \"T'doshok no surrender,\" which may have been a reference to his species, as the Ultimate Alien Anthology  stated that that is the name for the species in their native language. This would have made sense with his species' backstory, as they worshiped a deity called the Scorekeeper, who tallied jagannath points for everything a Trandoshan hunter did. Trandoshans did not surrender because to be caught alive or shamed meant that the Scorekeeper would reset an individual's tally and invalidate their life's work. However, four years later, The Essential Reader's Companion by Pablo Hidalgo stated in a small dramatis personae for the short story that this was the bounty hunter's name, so he was speaking in the third person.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Dosh/Legends",
  "/wiki/Language/Legends",
  "/wiki/Species/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Shayla_Paige-Tarkin",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-1010/Legends",
  "/wiki/Coruscant_Guard/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Accelerated_Charged_Particle_Array_Gun",
  "/wiki/Airspeeder/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Ascension_gun/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/EBook",
  "/wiki/Out_Foxed",
  "/wiki/Rob_Valois",
  "/wiki/2008",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/2003",
  "/wiki/Scorekeeper/Legends",
  "/wiki/Jagannath_point/Legends",
  "/wiki/2012",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Militaries_of_Star_Wars",
  "/wiki/The_Prize_Pelt:_The_Tale_of_Bossk"
 ]
}