{
 "name": "T%27onga",
 "display_name": "T'onga",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Khel Tanna's crew",
      "Nakano Lash's crew",
      "T'onga's crew",
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "T'onga was a human female bounty hunter who was the twin sister of fellow hunter T'ongor. T'onga eventually left the life of bounty hunting behind and lived as a farmer on the Moon of Logal Ri with Losha Tarkon. After learning that T'ongor was killed, T'onga was deeply affected, and blamed her brother's former ally, Nakano Lash, for his death. When Lash resurfaced with a bounty on her head, T'onga swore to hunt her down and departed the moon, leaving Losha behind. She found Lash with the help of Beilert Valance, but was incapacitated by Boba Fett.\nNarrowly escaping death, T'onga was healed on Ruusan, where Tarkon returned for her. The two soon assembled a crew and set off to find Cadeliah, the heir to Mourner's Wail and Unbroken Clan crime syndicates.\nBorn as the twin to T'ongor, T'onga and her brother worked in the galaxy as bounty hunters. The two siblings were associates of the Nautolan hunter Nakano Lash, accompanying her to discuss business with the Abednedo technician Jhorstek at some point after 10 BBY. As they talked in Phelar Port on the planet Eriadu, the criminals noticed a young thief plead for help as he was apprehended by stormtroopers. Although Lash wanted to help the child, Jhorstek cautioned against it, not wanting to be arrested. When T'onga asked her brother if they should help the boy, he sided with the Abednedo. The group looked on as the ex-Imperial soldier Beilert Valance rose up to attack the troopers. Lash then came to Valance's aid, helping the cyborg when he was shot down.\nSome time later, T'ongor was killed after a botched mission on the planet Corellia. Although she was not involved with the mission, T'onga was able to feel her brother's death as it happened and blamed Lash, who was responsible for the mission's failure. T'onga later retired from bounty hunting, became a farmer, and settled at a homestead on the Moon of Logal Ri with her lover Losha Tarkon, promising her companion that she would never return to the life of a hunter. Around 3 ABY, Lash resurfaced following a period of hiding with a large bounty on her head, attracting the attention of several bounty hunters.\nWhen T'onga learned about the Nautolan's resurgence, she attempted to depart the moon to hunt Lash down before being stopped by Losha, who wished for her to stay behind and live the rest of her days as a farmer. After touching foreheads with Losha, T'onga explained the special bond she had with her brother, stating that she felt his death and wanted to restore her family's honor by exacting her revenge on Lash as a result. Despite Losha reminding T'onga of the hunter's promise to retire from bounty hunting, she told the farmer not to worry and stated that there would not anything left to bury if she were to fail, before leaving on her starship.\nT'onga traveled to Dotharian, where the headquarters of the Mourner's Wail Syndicate was located, seeking information on Lash's return. After infiltrating the fortress and killing several guards, she was apprehended by Lord Khamdek, the leader of the Syndicate. Khamdek, who assumed she had come to assassinate him, was impressed by her skills, and allowed her to speak before he would have her killed. T'onga kneeled before him and vowed to kill Lash for the Syndicate, as the Nautolan was also responsible for the death of Khamdek's son, Khamus. She requested all the information the Mourner's Wail had in regards to Lash, promising to avenge both Khamus and T'ongor. This lead her to the Graveyard Planet of Galmerah, where she snuck onboard Beilert Valance's ship the Broken Wing.\nOnboard, T'onga held Valance at gunpoint, forcing him to wear a restraining bolt as they followed Lash's path to Ruusan, where they found the corpse of Ooris Bynar, another hunter on her trail. From there, they moved onto a village looking for information, but were attacked by a Nexu belonging to an ally of Lash, hoping to protect her. After the skirmish, the man realized Valance was a friend, and gave up Lash's location, in the shipwrecks orbiting the world. In orbit, Valance and T'onga finally found Lash, protecting the child heir of both the Unbroken Clan and Mourner's Wail crime syndicates, trying to end the war between the two. Lash also revealed that she was terminally ill, and planned to protect the girl until she passed. Upon realizing the truth about Lash motivations, T'onga felt jaded about her mission. Just after she decided to return home to Losha, Boba Fett arrived, and blasted her through the abdomen, incapacitating her.\nOn Ruusan, Losha Tarkon arrived, following the trail of her wife. There, she found T'onga in a hospital bed, being treated for her injuries. Once T'onga had recovered more, the two state their love for each other, and decide to track down and bring Nakano Lash's killers to justice. The man who healed T'onga then offered the pair his Nexu for help. Soon after, they observed that Jabba the Hutt placed a bounty on Fett's head.\nBack on Dotharian, T'onga and Tarkon visited the Fortress of the Mourner's Wail, and found devastation there, with scorch marks all over. T'onga ventured inside, only to find Khamdek and several soldiers, who warned her to leave as soon as she can. This warning was too late, however, as Crimson Dawn was already inside the building. A battle ensued as the two syndicates faced off. At one point, T'onga, aiding the Mourner's Wail, was knowcked over and pinned down by a Crimson Dawn enforcer, but was saved by the Nexu and Tarkon. The team together took out several more Crimson Dawn enforcers, as T'onga went to an injured Khamdek's side. She informed the man that he has a granddaughter, and he instantly felt remorse for the situation. He then hired the wives, enlisting them to assemble a crew and rescue Cadeliah.\nT'onga and Tarkon recruited Tasu Leech from the Fighting pits of Nar Kanji, and Zuckuss from the Gand floating sanctuary. In the Edgehawk, the crew arrived on the planet Jekara, where Crimson Dawn was holding an auction for Han Solo, finding the location through Zuckuss's tracking skills. The team discovered a bound Bossk, who tricked Zuckuss, stealing his knife and revealing that Valance was there as well to a shocked T'onga.\nT'onga was a human female with black hair, brown eyes, and dark skin. As a retired bounty hunter and farmer, T'onga deeply cared for her brother, maintaining a bond that she considered \"special\" among the twins of her people. When leaving the Moon of Logal Ri, she stated to Losha that she felt T'ongor's death and vowed to hunt his killer down to restore her family's honor, going so far as to break her original promise of living as a farmer.\nT'onga spent time with Valance trying to track down his suspected killer. This lead to her being supposedly killed by Boba Fett. She demonstrated her survivalist tendencies by somehow surviving the interaction in the orbit of Russan, and reuniting with her beloved, as the two set off to assemble a crew and hopefully bring peace to the galactic underworld.\nWhile leaving the Moon of Logal Ri, T'onga wore a green shirt under a brown coat and a blue scarf around her neck. She also wore brown pants and black boots with a holster around her waist. T'onga possessed at least two weapons, one that was holstered on her right hip and another that she wrapped in cloth. Boarding her personal starship, she carried a black backpack with her. She also possessed gadgets given to her by the technician Jhorstek, which allowed her to set off proximity alarms within the Fortress of the Mourner's Wail. At one point, T'onga used a restraining bolt on Valance as she tracked down Nakano Lash with the cyborg.\nT'onga first appeared in the first issue of Star Wars: Bounty Hunters, a comic book series written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on March 11, 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Han_Solo_%26_Chewbacca_6",
  "/wiki/Bounty_Hunters_17",
  "/wiki/Bounty_Hunters_18",
  "/wiki/Bounty_Hunters_19",
  "/wiki/Bounty_Hunters_20",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Bounty_Hunters_22",
  "/wiki/Bounty_Hunters_23",
  "/wiki/Bounty_Hunters_24",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Bounty_Hunters_27",
  "/wiki/Bounty_Hunters_28",
  "/wiki/Halcyon_Legacy_5",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Khel_Tanna%27s_crew",
  "/wiki/Nakano_Lash%27s_crew",
  "/wiki/T%27onga%27s_crew",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Bounty_hunter",
  "/wiki/Hunting",
  "/wiki/T%27ongor",
  "/wiki/Bounty",
  "/wiki/Farmer",
  "/wiki/Moon_of_Logal_Ri",
  "/wiki/Losha_Tarkon",
  "/wiki/Death",
  "/wiki/Nakano_Lash",
  "/wiki/Moon",
  "/wiki/Beilert_Valance",
  "/wiki/Boba_Fett",
  "/wiki/Ruusan",
  "/wiki/Cadeliah",
  "/wiki/Mourner%27s_Wail_Syndicate",
  "/wiki/Unbroken_Clan",
  "/wiki/Reproduction",
  "/wiki/Twin",
  "/wiki/The_galaxy",
  "/wiki/Nautolan",
  "/wiki/Abednedo",
  "/wiki/Technician",
  "/wiki/Jhorstek",
  "/wiki/10_BBY",
  "/wiki/Phelar_Port",
  "/wiki/Planet",
  "/wiki/Eriadu",
  "/wiki/Stormtrooper",
  "/wiki/Imperial_Army",
  "/wiki/Soldier",
  "/wiki/Trooper",
  "/wiki/Cyborg",
  "/wiki/Skirmish_on_Corellia",
  "/wiki/Corellia",
  "/wiki/T%27onga_and_Losha_Tarkon%27s_homestead",
  "/wiki/3_ABY",
  "/wiki/Standard_day",
  "/wiki/Starship",
  "/wiki/Dotharian",
  "/wiki/Fortress_of_the_Mourner%27s_Wail",
  "/wiki/Lord",
  "/wiki/Khamdek",
  "/wiki/Khamus",
  "/wiki/Galmerah",
  "/wiki/Broken_Wing",
  "/wiki/Restraining_bolt",
  "/wiki/Ooris_Bynar",
  "/wiki/Nexu",
  "/wiki/Unidentified_human_(Ruusan)",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Crimson_Dawn",
  "/wiki/Tasu_Leech",
  "/wiki/Fighting_pits_of_Nar_Kanji",
  "/wiki/Zuckuss",
  "/wiki/Gand_floating_sanctuary",
  "/wiki/Edgehawk_(starship)",
  "/wiki/Jekara",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Han_Solo",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Knife",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Scarf",
  "/wiki/Boot",
  "/wiki/Holster",
  "/wiki/Backpack",
  "/wiki/Bounty_Hunters_1",
  "/wiki/Star_Wars:_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Paolo_Villanelli",
  "/wiki/Marvel_Comics",
  "/wiki/March_11",
  "/wiki/2020",
  "/wiki/Category:Images_of_T%27onga",
  "/wiki/Bounty_Hunters_2",
  "/wiki/Bounty_Hunters_3",
  "/wiki/Bounty_Hunters_4",
  "/wiki/Bounty_Hunters_5",
  "/wiki/Bounty_Hunters_9",
  "/wiki/Bounty_Hunters_10",
  "/wiki/Bounty_Hunters_12",
  "/wiki/Bounty_Hunters_13",
  "/wiki/Bounty_Hunters_14",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Bounty_Hunters_16",
  "/wiki/Revelations_1",
  "/wiki/Bounty_Hunters_30",
  "/wiki/Bounty_Hunters_31",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:T%27onga",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Bounty_Hunters",
  "/wiki/Galactic_Empire",
  "/wiki/Target_Vader_5",
  "/wiki/Mimban_Campaign",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Mimban",
  "/wiki/TK-462_(short_story)",
  "/wiki/Star_Wars_Insider_166",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back"
 ]
}