{
 "name": "Taanab_mutant_rancor",
 "display_name": "Taanab mutant rancor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "14 ABY",
      "Taanab"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mutant rancor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "14 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "4",
      "285 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan",
      "mottled with gray and black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Disciples of Ragnos"
     ]
    }
   ]
  }
 ],
 "content": "In 14 ABY, Jedi Knight Jaden Korr discovered a mutant rancor within a Tanaab spaceport that was created by the Disciples of Ragnos. They planned on releasing the rancor into the city so that they could steal arms, credits, and other needed goods during the chaos. The beast was significantly larger than normal rancors, had green capsules on its back, could breathe a stream of green toxic gas, and had an unnatural green hue to its skin.\nOnce released, the rancor began attacking the Disciples themselves, who were unable to stop it, as the mutant was immune to conventional weapons. It then began wreaking havoc across the facility, while Jaden tried to stop it. Eventually, Jaden managed to kill the beast by pinning it between a force field and a large crate on a conveyor belt, crushing the savage beast to death.\nThe mutant rancor was quite a bit larger than a regular rancor. It had two massive plates of bone jutting out from its shoulders and two durasteel plates fused on top of its vulnerable eyes. Massive spines jutted out from its head and shoulders, and six green glowing capsules protruded out of its back. These mechanical pods created toxic gas, which could be exhaled through the rancor's mouth.\nMutant rancor skin was extremely thick and was able to deflect blaster bolts and even glancing lightsaber blows. Because of its tough skin, it was extremely hard to kill . It had an immunity to poison due to the venomous pods on its back and moved unusually fast for a rancor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/14_ABY/Legends",
  "/wiki/Taanab/Legends",
  "/wiki/Mutant",
  "/wiki/Rancor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Color/Legends",
  "/wiki/Disciples_of_Ragnos",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaden_Korr",
  "/wiki/Mission_to_Taanab",
  "/wiki/Durasteel/Legends",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy"
 ]
}