{
 "name": "Tai_Cordan",
 "display_name": "Tai Cordan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Balmorra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Balmorran resistance",
      "Rift Alliance",
      "Galactic RepublicGalactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Tai Cordan was a Human male trade secretary of the Balmorran government during the Great Galactic War. During the Galactic War, he joined the Rift Alliance and with the aid of the Barsen'thor of the Jedi Order, he became President of Balmorra to formally bring his homeworld back into the Republic. Sometime afterwards, he resigned the presidency to become Balmorra's senator.\nWhen Balmorra was ceded to the Sith Empire, Cordan was one of the few members of the government to be exiled from the planet and joined the Rift Alliance; during the Cold War, the Galactic Republic decided to retake his planet, so Cordan fought on Balmorra during the world's liberation, and worked with a Jedi Consular to restore the Balmorran government and eliminate the Imperial presence. Cordan directed the Barsen'thor into gaining the support of Resistance leader Zenith and the corporations before sending the Jedi to rescue President Retheus Galthe. Unfortunately, Galthe was tortured into insanity, thus the Balmorran people decided that Cordan would inherit his office. Thus, Cordan upheld his promise to the Barsen'thor by appealing for Republic membership and sending them Balmorra's array of battle droids. He remained on Balmorra, maintaining holo-correspondence with his colleagues as the Barsen'thor traveled the galaxy assisting the Rift Alliance and unmasking the Children of the Emperor.\nSometime before or after the Eternal Empire's conquest of the galaxy, Cordan resigned the presidency to represent Balmorra in the Galactic Senate. Later on, Cordan desired to join the Outlander's Alliance against Zakuul, but had no idea where to find them. In searching, he came into contact with Imperial Admiral Zasha Ranken and exiled Zakuulan holo-performer Malita Tal, who were also seeking to join the Alliance. Inspired by a common cause, the trio formed an alliance of their own. Eventually, they were discovered and captured by Arcann's forces and were being transported to Zakuul, as the Emperor was under the impression they knew the Outlander's whereabouts. Luckily, their transport was raided by the Alliance, seeking to commandeer the ship.\nIn one of his many visions of possible futures, Jedi Master Kutri O'a foresaw a descendant of Tai Cordan named Lara Cordan, who would try to found a new Rift Alliance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tai_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Tai_Cordan",
  "/wiki/Balmorra/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Balmorran_resistance",
  "/wiki/Rift_Alliance",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Galactic_War",
  "/wiki/The_Barsen%27thor",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Battle_of_Balmorra_(Great_Galactic_Wars)",
  "/wiki/Zenith",
  "/wiki/Retheus_Galthe",
  "/wiki/Children_of_the_Emperor",
  "/wiki/File:Tai_Cordan_captured.jpg",
  "/wiki/Eternal_Empire",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/Zasha_Ranken",
  "/wiki/Malita_Tal",
  "/wiki/GEMINI_trap",
  "/wiki/Force_vision/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kutri_O%27a",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}