{
 "name": "Tajin_Crosser",
 "display_name": "Tajin Crosser",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Dan G'vash"
     ]
    }
   ]
  }
 ],
 "content": "Tajin Crosser was a human male Jedi Master of the Jedi Order. Crosser was a noted explorer, and some stories of his travels claimed that he had visited more planets than any other Jedi. With his Padawan, Dan G'vash, Crosser patrolled sectors in the Outer Rim Territories for the Order. On one such mission, Crosser sensed a disturbance in the Force, which he and his Padawan tracked down to the near-isolated planet Habo.\nOn Habo, Crosser and G'vash learned of a mysterious elder being from the locals. The two split up to investigate, and Crosser began to suspect that the elder was somehow related to the long-dead Sith, the ancient enemies of the Jedi. G'vash contacted Crosser to alert him that he had encountered the elder, but ignored Crosser's warnings and dueled him. Crosser rushed to his Padawan's location, where he too dueled the elder and managed to defeat him with help from his injured apprentice. The elder blew up his ship before he crumbled into dust as he died, leaving Crosser and G'vash unable to discover his identity.\nTajin Crosser was a Jedi Master of the Jedi Order hundreds of years after the destruction of the Sith. Crosser often patrolled areas of the Outer Rim Territories and became familiar with many cultures across the areas he went to. He was greatly traveled and was said to hold the record of most planets visited by a Jedi, though he doubted he could claim the achievement. At some point, he took Dan G'vash as his Padawan learner, and he gave up patrolling to train his apprentice.\nAt some point during G'vash's training, Crosser decided to volunteer himself and his Padawan to take up missions patrolling the Outer Rim. Crosser chose to volunteer for work in several areas in the Outer Rim whose patrolling had been postponed until he filled in the position. Though he seemed eager to return to his old duties, Crosser wanted to go back to the Outer Rim because he believed it would be good for G'vash's training. G'vash was underwhelmed by the experience at first, as he thought the Outer Rim would be full of action and stimulation, but found it was mostly peaceful.\nOne day while on patrol, Crosser entered the cockpit of his ship, where G'vrash was watching hyperspace through the window. Crosser asked G'vrash if everything was okay, which the apprentice confirmed. Tajin told G'vrash that they would be making another jump to hyperspace soon. G'vrash told Crosser that he hadn't been to the sector they were in before, intriguing Tajin, who sat down in the seat beside his Padawan. G'vrash turned to his master and asked him if he knew how many planets he had been to, but Crosser didn't know off-hand. G'vrash began talking about the stories revolving around Crosser and told him that he must hold the Jedi record for the most planets visited. Tajin snickered at the notion and told Dan that he doubted that that was true.\nG'vrash questioned Crosser on his motivation for returning to the Outer Rim, but Crosser assured him that he had chosen to return for the purpose of his apprentice's training. Dan told Crosser that the Outer Rim was different than what he had expected, citing the lack of action and more peaceful nature of their mission as reasons. Crosser replied that misfortune was easy to overlook when it took place in peace. Suddenly, Crosser was struck by a disturbance in the Force. G'vrash asked him if he sensed something, and Crosser explained that he felt a disturbance. He and G'vrash dropped out of hyperspace, and the Padawan asked Crosser if he could still sense it, but he could not.\nCrosser asked G'vrash if he had felt anything. G'vrash had not sensed anything earlier and asked Crosser to describe what he had felt. Crosser described the disturbance as a sinister and ancient darkness. Dan theorized that it could be the Sith, but Crosser denied it because the Sith had been dead for hundreds of years. Despite this, he decided that they needed to investigate. G'vrash declared that they would need to fight, but Crosser chastised his apprentice for being so eager to go to battle. After the two repeated a Jedi mantra, Crosser told G'vrash that the nearest inhabited planet was Habo and that they should start their investigation there. G'vrash commented that their mission would finally be more exciting than their normal patrolling, bothering Crosser.\nOnce on Habo, which Crosser had visited various times in the past, the two Jedi landed their ship in a field not far from a small farming village. G'vrash noted the beautiful mountain ranges and said that he was going to like it there, and Crosser recommended he try the local dish Oon-Doon. As they approached the village, Crosser informed G'vrash that the people of Habo were known to be shy and asked him to stay behind while he spoke with them. From two locals, Crosser learned that a mysterious elder from an unknown tribe had passed through a couple of days before and who had headed into the mountains alone.\nWhen Crosser returned to G'vrash, he noticed that his Padawan had already encountered some Habo children. Crosser told G'vrash about the old man, whose ship had landed elsewhere in the region. G'vrash asked Crosser if the old man was the disturbance he had felt earlier, but Crosser was unsure. Dan questioned if they had been misdirected, but Crosser instead suggested that the old man was hiding his presence from them. Though he was troubled by the situation, Crosser decided that they would have to investigate whoever the elder was. Crosser disagreed with G'vrash that they should head into the mountains after the old man and wanted to stay in the village and wait for him to reveal himself. G'vrash proposed that they split up, with Crosser staying in the village and him going into the mountains. Crosser agreed to his plan but warned his Padawan about native creatures called Vamga and urged him to take a guide.\nWhile G'vrash and his guides, the Habo children, traversed the mountain terrain, Crosser and the two village leaders went to the location of the old man's starship. Upon seeing the ship, Crosser contacted G'vrash to tell him that, although he didn't recognize the model, he knew its design resembled ancient Sith vessels. G'vrash asked if the old man was a Sith, but Crosser was unable to confirm or deny this and simply told his apprentice that he had a bad feeling. G'vrash saw a dead Vamga nearby and told Crosser that its throat had been slashed by a lightsaber. Worried, Crosser ordered G'vrash to return to the village. Before he could do so, G'vrash was confronted by the elder. Sensing the old man take out a pair of lightsabers, Crosser told Dan to run, but the Padawan took out his own blade instead. Crosser began running up the mountain to find his apprentice. As he made his hasty ascent, Crosser felt G'vrash being cut down with a cut to the abdomen by the old man. It began to rain, and Crosser continued to run up the mountainside.\nWhen Crosser came across the old man, he found him sitting on a rock with G'vrash's body in front of him. The elder told Tajin that it had been a long time since he had faced an opponent as strong as him, and the two readied their lightsabers. The two began dueling, and Crosser easily managed to gain the upper hand and use the old man's arrogance against him. Crosser destroyed one of the elder's lightsabers, enraging him. The elder reached out his hand and started generating lightning from his limb, which Crosser recognized as an ancient Sith technique. While Tajin used his lightsaber to deflect the lightning, the old man lifted his lightsaber to strike him down. Before he could deliver the blow, however, he was hit by G'vrash's blade, which the still-alive G'vrash sent hurling towards him using the Force. Using this distraction to his advantage, Crosser took his saber and ran it through the old man's chest. While Crosser ran to Dan to check on his apprentice, the dying elder used a remote to detonate his ship before crumbling into dust and ash.\nCrosser and G'vrash stayed on Habo for some time afterward, during which Dan recovered from his injury. Following the duels, G'vrash went to the village to see if the ship was still intact, but found that it had been completely destroyed. Without any way to find the identity of the old man, Crosser decided not to speculate on whether or not he was a Sith, but admitted that from what he said to G'vrash he could have once been affiliated with them. Looking down on the remains of the elder, Crosser told G'vrash that he had never confronted such darkness before and, had the old man been in his prime, the outcome would have been much different. G'vrash countered that his master had defeated him, but Crosser denied his victory and stated that time and age had caught up to him and that his power would not last forever. G'vrash asked Crosser if he was saying that power was meaningless, but Tajin explained that power could help those without it at the cost of impermanence. Crosser added that he too was growing less powerful with age and told G'vrash that he would grow more powerful, but only if he remembered his training and his kindness. Down in the field below, the Habo children looked to Dan, and Crosser told him to say goodbye. As G'vrash went to the children, Crosser looked to the remains of the elder and then gazed at the sky above.\nTajin Crosser was a male human with light skin, brown eyes, and long black hair he kept messily pulled back. Crosser had a scar across his left eyebrow and a thin amount of facial hair. Because of his history as a traveler and his work patrolling the Outer Rim Territories, Tajin was very knowledgeable of various planets and their terrain, wildlife, culture, and cuisine. Tajin was dismissive of legends and stories told about him, finding G'vash's claim that Tajin held the record for most planets visited by a Jedi amusing but doubtful. Crosser dutifully believed in the Jedi moral code and felt that balance and stillness were more valuable than aggression, no matter how confident an individual was. Tajin thought that power was useful because it could be used to help those without it, but recognized its impermanence and acquiesced pride in his abilities because he knew that they would one day wane. Tajin remained composed even in the face of danger.\nTajin and Dan had a close bond, and both master and apprentice were cordial and faithful with each other, even though they had some differences in how they approached situations. Crosser enjoyed the peaceful nature of his work, unlike his Padawan. Where G'vash was eager and yearning for action and adventure, Crosser was content with simply patrolling regions and waiting for misfortune to rear its head. Despite their differences, they did not fight and Crosser gave G'vash leniency to make his own choices, such as letting him go into the Habo mountains without him. Crosser and G'vash also had a casual tone when speaking to each other, although Crosser remained calm and measured in his speech. G'vash was free to comment on issues he had with Crosser or their work. Tajin believed that G'vash would one day become a strong Jedi because of his training but made sure that his Padawan would remember his kindness, which he felt was an important quality for a Jedi to have.\nThough wary of fighting as a means to an end, Tajin was a strong Jedi Master and was skilled in combat, despite his age and dimming abilities. Crosser wielded a green lightsaber, which he used to duel the elder on Habo. During the duel, Crosser used quick defensive techniques to counter his opponent, who overconfidently tried to impale the Jedi with a series of fast strikes. The elder's overconfidence gave Tajin the opportunity to grab his hand when he attempted a strike, and Crosser was able to toss the old man aside and maneuver one of his lightsabers from him. Tajin was strong enough to block Force lightning with his saber, and, using his quick reflexes, he was able to kill the elder with a well-timed attack when the old man was distracted by G'vash.\nCrosser was likewise powerful in the Force. He was able to sense the presence of the elder while aboard his ship, which Dan could not. The elder himself greatly anticipated to fight him, having sensed his strength in the Force.\nTajin Crosser appeared in \"The Elder,\" a short film in the Star Wars: Visions series directed and written by Masahiko Otsuka, produced by Trigger, and released on Disney+ on September 22, 2021. He was voiced by Takaya Hashi in the original Japanese film and by David Harbour in the English dub.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Dan_G%27vash",
  "/wiki/Jedi_Master",
  "/wiki/Planet",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Sector",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/Habo",
  "/wiki/The_Elder",
  "/wiki/Mission_to_Habo",
  "/wiki/Sith",
  "/wiki/Lightsaber_duel",
  "/wiki/The_Elder%27s_starship",
  "/wiki/Death",
  "/wiki/Hyperspace",
  "/wiki/Oon-Doon",
  "/wiki/Vamga",
  "/wiki/Force_lightning",
  "/wiki/The_Force",
  "/wiki/The_Elder_(short_film)",
  "/wiki/Trigger,_Inc.",
  "/wiki/Disney%2B",
  "/wiki/September_22",
  "/wiki/2021",
  "/wiki/David_Harbour",
  "/wiki/Category:Images_of_Tajin_Crosser",
  "/wiki/The_Elder_(manga)",
  "/wiki/Gangan_Comics",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210"
 ]
}