{
 "name": "Taka_Jamoreesa",
 "display_name": "Taka Jamoreesa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "14 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Non-binary"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Taka Jamoreesa was a non-binary Alderaanian human pilot and aspiring scoundrel. About two years after the Battle of Jakku, Jamoreesa was in a crew with Han Solo and Lando Calrissian trying to thwart Fyzen Gor's plot to take over the galaxy using the Phylanx Redux Transmitter. Jamoreesa lost both of their parents in the destruction of Alderaan and acted as a New Republic agent under Leia Organa. They were a fan of the musical group Snograth and the Mogwars.\nTaka Jamoreesa first appeared in the 2018 novel Last Shot by Daniel José Older. Jamoreesa is notable as the second named and third overall non-binary character in the current Star Wars canon, preceded in 2016 by Eleodie Maracavanya from Chuck Wendig's Aftermath: Life Debt and an unidentified Black Sun agent in Ahsoka by E. K. Johnston. Although Older had intentionally indicated Jamoreesa's gender by utilizing the gender-neutral singular they as their correct pronouns, controversy arose when the French, Polish, and German language editions of Last Shot incorrectly used masculine pronouns to refer to them. Author Daniel José Older expressed his displeasure at the change on his Twitter and considered the misgendering of Jamoreesa unacceptable and erasure of a type of character rarely seen in Star Wars. The French publisher Pocket Imaginaire ultimately posted a statement explaining their reasoning for the translation, though not issuing an apology. Sandy Julien, the book's French translator, also reached out directly to Older on Twitter and explained that he suggested \"iel\" as an alternate pronoun for Jamoreesa which was not approved by the book's editor and personally apologized for the change, vowing the push harder to use accurate pronouns, should the situation arise again.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Alderaan",
  "/wiki/14_BBY",
  "/wiki/Human",
  "/wiki/Alderaanian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Pilot",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Jakku",
  "/wiki/Han_Solo",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Fyzen_Gor",
  "/wiki/The_galaxy",
  "/wiki/Phylanx_Redux_Transmitter",
  "/wiki/Parent",
  "/wiki/New_Republic",
  "/wiki/Agent",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Music",
  "/wiki/Snograth_and_the_Mogwars",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Taka_Jamoreesa",
  "/wiki/2018",
  "/wiki/Last_Shot",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/Star_Wars",
  "/wiki/2016",
  "/wiki/Eleodie_Maracavanya",
  "/wiki/Chuck_Wendig",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Unidentified_Black_Sun_agent",
  "/wiki/Ahsoka_(novel)",
  "/wiki/E._K._Johnston",
  "/wiki/Last_Shot_(audiobook)",
  "/wiki/April_16",
  "/wiki/File:DJO_Taka_Jamoreesa_Tweet.png",
  "/wiki/File:DJO_on_Last_Shot_Translation.png",
  "/wiki/File:DJO_Jamoreesa_Tweet.png",
  "/wiki/September_18",
  "/wiki/File:Sandy_Julien_on_LS_French_Trans.png"
 ]
}