{
 "name": "Takara%27s_rancor",
 "display_name": "Takara's rancor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "10 ABY",
      "Takara's stronghold"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rancor"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Takara's organization"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Takara"
     ]
    }
   ]
  }
 ],
 "content": "The crime lord Takara owned a pet rancor that he kept in his stronghold. During the year 10 ABY, the New Republic Jedi Mara Jade was captured by Takara's lieutenant Abron Mar and sent to a holding cell in Takara's stronghold. Jade escaped, and eventually encountered the rancor's lair. Retrieving her lightsaber from a nearby crate, Jade fought the rancor and killed it. She later escaped the stronghold.\nBy the year 10 ABY, the crime lord Takara came into contact with a rancor, which he decided to keep as a pet. The rancor lived in Takara's stronghold, where it had its own dungeon like dwelling. It was locked off from the rest of the stronghold by a gate that was guarded by a Gamorrean, and the rock-walled room contained a pool of sewage that was connected to a large, damaged sewage pipe. Usually, those who met the rancor were killed by it.\nDuring 10 ABY, Takara's agents stole a Global Communications Transponder from Takara's rival, Ka'Pa the Hutt. However, Ka'Pa encountered the Jedi Mara Jade, who had come to him to secure supplies for the New Republic. In exchange for the supplies, Jade was to retrieve the transponder. Jade's search brought her to the planet Katraasii, where she was captured by Takara's top lieutenant Abron Mar, and imprisoned in Takara's stronghold. Jade stole a key, unlocked her cell, and after evading guards, she crawled into the damaged sewage pipe and swam in the only possible direction: the rancor's lair. When Jade crawled out of the sewage, the rancor lumbered out of a cove and prepared to attack. However, Takara's men had placed Jade's confiscated lightsaber on the other side of the lair's gate entrance, guarded by the Gamorrean. Using the Force, Jade grabbed her lightsaber and dueled the rancor. Despite the rancor's efforts in trying to grab Jade with its massive clawed hands, it was unsuccessful in capturing its prey, and fell victim to the Jedi's attacks. The gate opened seconds later, and Jade made her escape. She eventually retrieved the stolen transponder and was rescued from Takara's lair by Ka'Pa's men.\nTakara's rancor was a large creature, with brown skin and yellow eyes. Upon sighting Mara Jade, the rancor roared at her before engaging.\nTakara's pet rancor first appeared in the 1998 video game Star Wars: Jedi Knight: Mysteries of the Sith, where it appeared in-game, on the original box art, and on the game's manual. The rancor was impervious to any weapons but the lightsaber, and as a result, players would need to obtain the lightsaber with the Force and kill the rancor before they could progress any further in the game. Takara's stronghold and the rancor encounter were all designed by Don Sielke, and LucasArts continuity supervisor Ryan Kaufman would later recount the rancor encounter as one of his favorite moments in the level.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Takara%27s_stronghold",
  "/wiki/Rancor/Legends",
  "/wiki/Color/Legends",
  "/wiki/Takara%27s_organization",
  "/wiki/Takara",
  "/wiki/Crime_lord/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Abron_Mar",
  "/wiki/Lightsaber/Legends",
  "/wiki/Death/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Global_Communications_Transponder",
  "/wiki/Ka%27Pa",
  "/wiki/Hutt/Legends",
  "/wiki/Mission_to_negotiate_supplies_from_Ka%27Pa_the_Hutt",
  "/wiki/Planet/Legends",
  "/wiki/Katraasii",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Eye/Legends",
  "/wiki/1998",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Jedi_Knight:_Mysteries_of_the_Sith",
  "/wiki/Don_Sielke",
  "/wiki/LucasArts",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/5_ABY/Legends"
 ]
}