{
 "name": "Takeel",
 "display_name": "Takeel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cadomai Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Snivvian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Takeel was a Snivvian male who worked as a mercenary and was addicted to spice. He and his brother Zutton frequented Chalmun's Spaceport Cantina on the planet Tatooine and were present in the cantina in 0 BBY when the local moisture farmer Luke Skywalker and the Jedi Obi-Wan Kenobi entered.\nTakeel sat a table near the entrance to the cantina with a variety of other patrons throughout his stay, including the moisture farmer Eyvind, the Jawa Het Nkik, and the Nimbanel Mosep Binneed.\nTakeel was a spice-addicted Snivvian who worked as a mercenary and frequented Chalmun's Spaceport Cantina in Mos Eisley on the planet Tatooine with his brother Zutton. As with most Snivvians, the brothers were frequently referred to as \"snaggletooths.\" Takeel and Zutton were present in the cantina in 0 BBY when the local moisture farmer Luke Skywalker entered with his droids, R2-D2 and C-3PO.\nWhile Skywalker stood in the entryway to the cantina with the droids, Takeel sat down opposite a human patron at a table at the base of the steps down into the cantina, taking the seat of another human who had been sitting there when Skywalker entered. The moisture farmer Eyvind then took the place of the human Takeel was sat opposite, and there pair were sharing a drink together when the Jedi Obi-Wan Kenobi defended Skywalker from the thugs Doctor Cornelius Evazan and Ponda Baba.\nWhen a group of sandtroopers entered the bar searching for Skywalker, Takeel watched them walk past his table. A Ranat and the Jawa Het Nkik were sat next to Takeel at the table when the smuggler Han Solo shot the bounty hunter Greedo, which caused the trio to all quickly look up toward the source of the blasterfire. The Nimbanel Mosep Binneed then took the seat opposite Takeel before the Snivvian watched Solo exit the cantina.\nTakeel had light skin, black eyes, and patchy brown hair with bald spots.\nWhile in Mos Eisley, Takeel wore a red tunic over a black shirt with brown pants and shoes.\nTakeel was portrayed by Alf Mangan in Star Wars: Episode IV A New Hope.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Takeel",
  "/wiki/Takeel/Legends",
  "/wiki/Cadomai_Prime",
  "/wiki/Snivvian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mercenary",
  "/wiki/Spice",
  "/wiki/Zutton",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Cantina",
  "/wiki/0_BBY",
  "/wiki/Moisture_farmer",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Eyvind",
  "/wiki/Jawa",
  "/wiki/Het_Nkik",
  "/wiki/Nimbanel",
  "/wiki/Mosep_Binneed",
  "/wiki/Mos_Eisley",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Human",
  "/wiki/Doctor",
  "/wiki/Cornelius_Evazan",
  "/wiki/Ponda_Baba",
  "/wiki/Foot_Patrol_7",
  "/wiki/Desert_stormtrooper",
  "/wiki/Ranat",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Bounty_hunter",
  "/wiki/Greedo",
  "/wiki/Blaster",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Alf_Mangan",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Category:Images_of_Takeel",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Yavin"
 ]
}