{
 "name": "Talandro_Starlyte",
 "display_name": "Talandro Starlyte",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Starlyte Station"
     ]
    }
   ]
  }
 ],
 "content": "Talandro Starlyte was most famous for renting the Gateway Space Station from the Galactic Empire, which he renamed Starlyte Station. His various criminal enterprises were for the most part overlooked by the Empire. This was due to the large bribes he gave to the station's Imperial Liaison, Lieutenant Arissa Fawn.\nNot much was known of his history and some believed that even his name was an alias. He claimed to be a born on Coruscant. Before he acquired the Starlyte Station, he spent time working in Cloud City, where he met Scizzic, whom he hired to repair the space station. During his time on Bespin he was also rumored to have done some business with Lando Calrissian.\nStarlyte became one of the premier fences in the Outer Rim Territories. His station was infamous for its black market operations.He kept contact with criminals all over the galaxy, including Jabba the Hutt, Ploovo Two-For-One and the Sabrin Ring. Although he was willing to deal with almost any criminal, he steered clear of Imperial or Rebel operations. He also kidnapped and enslaved visitors to his station and impounded their equipment and starships. Most of the slaves were turned over to the Twi'lek Dahz Thulaka who conducted illegal experiments on them. The ones he could not used were sold to the Karazak Slavers Cooperative.\nStarlyte was a very shady individual. He danced a fine line between good and evil in a moral grey zone. His merchandise was not cheap but neither was it junk nor overpriced compared to other black markets. A shrewd businessman, Starlyte was quick with a smile, tenacious when he desired something and overall a consummate rogue. He showed a great disdain for Corellians. He was considered handsome with a ponytail of straight black hair and rugged good looks. He kept his appearance immaculate and was always draped in expensive clothes.\nA jack of all trades, Starlyte had talent to mastery in a wide variety of skills. He was competent with his fists and with a blaster, he could pilot transports and starfighters and could slice his way past security. His true talents were in black market operations where he truly excelled.\nBeneath his expensive clothing and jewelery, Starlyte was well prepared in case of trouble. He typically carried a blaster pistol and a hold-out blaster as well as a vibroknife. He also had a voice-locked datapad.\nTalandro Starlyte was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997. He was illustrated by Joe Corroney.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Starlyte_Station",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Liaison",
  "/wiki/Lieutenant/Legends",
  "/wiki/Arissa_Fawn",
  "/wiki/Cloud_City/Legends",
  "/wiki/Scizzic",
  "/wiki/Space_station/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Black_market/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Ploovo_Two-For-One/Legends",
  "/wiki/Sabrin_Ring",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Kidnapped",
  "/wiki/Slavery/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Dahz_Thulaka",
  "/wiki/Karazak_Slavers_Cooperative",
  "/wiki/Corellian/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Vibroknife",
  "/wiki/Datapad/Legends",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Joe_Corroney",
  "/wiki/Dark_Tremors"
 ]
}