{
 "name": "Talas_Piran",
 "display_name": "Talas Piran",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Loce"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Locan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mytaranor Slaving Council"
     ]
    }
   ]
  }
 ],
 "content": "Talas Piran was a Locan male who had been a slave. Later in his life, he became the leader of the Mytaranor Slaving Council. From the world of Loce, he had light purplish-blue skin and black mottled arms.\nAs a young man, Piran was captured by slavers and taken from Loce. He was then sold to a great Imperial-backed resource company and sent to Hintivan II, a frigid, forest world. For years, he worked felling trees in the northern part of the planet with a vibro-ax. Due to the work, he became a big, stout man.\nPiran eventually earned enough money to buy his own freedom, and then decided to send his skills and knowledge of slavery rings to the highest bidder. His new company was the Mytaranor Slaving Council, and during this time he used his old vibro-ax as a personal weapon, and a snowtrooper chest plate he \"obtained\" on Hintivan. He also began favoring short black hair.\nPiran was prompted among the slavers in little time, and he became the assistant of the chief slavemaster. He was more efficient than his boss, and eventually replaced him. He worked hard to provide corporations with being power, including Wookiees, Mon Calamaris, and Bothans.\nIn this role, Piran traveled to Corulag to deal with the Rodian Chordak; he intended on buying some two dozen slaves. He was seen by Rebel Alliance officer Derembus Sitnalta, Alton Lochner, and Sasnak Toxis. Sasnak noticed that one of the slaves was a person he knew, and he had disliked Chordak for a time. The event became a fight until the prefect arrived; the Rebels ran away and the slaves were freed. Due to this, Piran kept a grudge towards those three Rebels, or so Sitnalta thought.\nTalas Piran acquired the Mandalorian Dungeon Ship Vanquisher during a business trip to Kessel, some years before 2 ABY. The Vanquisher would soon become the Mytaranor Slaving Council mobile HQ, with most of its actives  at any moment.\nPiran eventually found a caché of TholCorp Neuronic whips on a forgotten compartment of the Vanquisher. He pleasantly distributed this new toy to his slave handlers.\nPiran and another high-ranking member of the Council, Tir'uh, hooked up with a failed Krish smuggler by the name of Karalan. Karalan managed to get their sympathies and they hired him as a part of the Vanquisher security team.\nPiran also captured a fugitive Twi'lek dancing girl, C'ar L'andara, only hours after her escape. However, he decided that L'andara could be of some use, so instead of returning her to her owner, he decided to keep her. Soon, L'andara became a high-ranking member of the Myatanor Slaving Council.\nOn 1 ABY or 2 ABY, Piran presumably kidnapped Rebel Alliance member Fru Kalg in Mon Calamari shipyards.\nSome months after Kalg's capture, Rebel Alliance General Airen Cracken wrote a detailed report on Piran, with Derembus Sitnalta's contribution . None of them could keep a neutral point of view on Piran.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Loce",
  "/wiki/Locan",
  "/wiki/Gender/Legends",
  "/wiki/Mytaranor_Slaving_Council",
  "/wiki/Commander/Legends",
  "/wiki/Derembus_Sitnalta",
  "/wiki/Slavery/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hintivan_II",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Cold_assault_stormtrooper",
  "/wiki/Wookiee/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Corulag/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Chordak",
  "/wiki/Alton_Lochner",
  "/wiki/Sasnak_Toxis",
  "/wiki/Prefect/Legends",
  "/wiki/Kiltirin-class_dungeon_ship",
  "/wiki/Vanquisher_(Kiltirin-class)",
  "/wiki/Kessel/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/TholCorp",
  "/wiki/Neuronic_whip",
  "/wiki/Tir%27uh",
  "/wiki/Krish_(species)/Legends",
  "/wiki/Karalan",
  "/wiki/Twi%27lek/Legends",
  "/wiki/C%27ar_L%27andara",
  "/wiki/1_ABY/Legends",
  "/wiki/Fru_Kalg",
  "/wiki/Dac",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}