{
 "name": "Talak",
 "display_name": "Talak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Reigalius"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Reigat"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.1 meters"
     ]
    }
   ]
  }
 ],
 "content": "Talak was a Reigat bruiser who worked on a meleenium heist on the New Republic's mines located in Qua'Tahc, the capital of Af'El.\nTalak was believed to have previously frequented Malthor. Alliance Intelligence believed he resided in Fabrillan for some time before deciding to hire out his considerable strength and combat abilities. It was known for certain the Reigat moved from job to job, and that he eventually found himself in the Minos Cluster, where he worked for some of the various underworld elements. His stay in there lasted nearly three years.\nDuring that time, Talak made acquaintance with the Sullustan smuggler Rani Quanic. After Quanic reappeared on the Minos scene  looking for accomplices in a recently-devised heist, Talak and his most recent partner, the Lowen saboteur Ostan Atur, agreed to accompany her.\nHis \"protecting\" the thieves who made away with the Qua'Tahc mines shipment brought him trouble with New Republic law enforcement agencies. During the raid, the trio was pursued by a group of Alliance security operatives. While Quanic secured the escape craft and loaded the stolen meleenium, Atur covered with heavy fire from the craft's gun emplacements and Talak dealt with them while engaging all three in a fierce brawl, seriously wounding Agent Oollj and the Ug'Ggeran technician Cith Sninif. Only Kichiir, a Wookiee member of the elite Lightning Tech Squadron of the Special Forces Eclipse Team, was able to match the Reigat's immense size and strength. But with the combined ferocity of Talak's attack and the constant cover provided by Atur's guns, even Kichiir was beaten. Before reinforcements could be called, Talak rushed back to the Lathien Leth and the thieving trio fled the Ka'Dedus system with 100 kilograms of meleenium.\nTalak was something of a departure from the normal Reigat. Whereas most of them were solitary individuals, he, though not overly social, was known to work with others. He thoroughly enjoyed his occupation and became increasingly overconfident of his abilities, especially after defeating Kichiir. According to Airen Cracken, Talak was generally a high-profile character, as he enjoyed drawing attention to himself and his physical prowess, and that his image of himself further inflated since his \"victory\" against the Wookiee, which could possibly lead him to make a mistake and be apprehended.\nTalak had considerable skill in brawling parry and melee combat and parry, complemented further his advanced abilities in climbing and jumping and his stamina. Furthermore, he was able to match a Wookiee's strength and use the natural intimidation that many species felt towards the Reigat to his advantage.\nDue to his reliance on strength, he only carried a blaster pistol.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Reigalius",
  "/wiki/Reigat",
  "/wiki/Gender/Legends",
  "/wiki/Bruiser",
  "/wiki/Meleenium/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Qua%27Tahc",
  "/wiki/Af%27El",
  "/wiki/Malthor",
  "/wiki/Alliance_Intelligence",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Rani_Quanic",
  "/wiki/Lowen",
  "/wiki/Saboteur/Legends",
  "/wiki/Ostan_Atur",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Oollj",
  "/wiki/Ug%27Ggeran",
  "/wiki/Technician/Legends",
  "/wiki/Cith_Sninif",
  "/wiki/Kichiir",
  "/wiki/Wookiee/Legends",
  "/wiki/Lightning_Tech_Squadron",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Eclipse_Team",
  "/wiki/Lathien_Leth",
  "/wiki/Ka%27Dedus_system",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_10"
 ]
}