{
 "name": "Tala_Durith",
 "display_name": "Tala Durith",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 BBY",
      "Jabiim"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Mapuzo battery",
      "Imperial Officer Corps",
      "Mapuzo battery",
      "Hidden Path"
     ]
    }
   ]
  }
 ],
 "content": "Tala Durith was a human female dissident during the height of the Galactic Empire, where she was stationed as an officer on the planet Mapuzo and served as a captain in the Imperial Military. While she initially joined the Galactic Empire with the goal of making a difference, she became disillusioned and eventually saw the Empire for its tyranny. This led to her secretly becoming a member of Hidden Path, an underground resistance movement that helped smuggle Jedi survivors of the Order 66 massacre and other Force-sensitive individuals to safety.\nWhen Obi-Wan Kenobi arrived on Mapuzo while in the process of returning Princess Leia Organa to her homeworld of Alderaan, he was recognized and engaged by several stormtroopers. Tala killed the three troopers with her, before fleeing with Kenobi and Organa. She attempted to help Jedi Master Obi-Wan Kenobi return Organa of Alderaan,taking her through an underground tunnel system while Kenobi distracted their pursuers, but later left Leia to meet with one of her companions and saved Kenobi from being captured by Darth Vader.\nTala later infiltrated Fortress Inquisitorius on the Mustafarian moon Nur alongside Kenobi to rescue Organa from the Inquisitorius. After the successful rescue, Tala and her compatriots retreated to Jabiim but were tracked by the Empire and Lord Vader. In the resulting Imperial attack on Jabiim, Tala was shot in the abdomen by stormtroopers and chose to detonate a thermal detonator when they were approaching to sacrifice herself rather than be captured.\nDuring the era of the Galactic Empire, Tala Durith joined up with the galactic-government and eventually became an Imperial officer with the military rank of captain. One day, she was deployed to the planet Garel under orders to round up people that had apparently not paid their taxes. Durith complied and carried out the roundup with the Imperial forces, gathering four families, fourteen individuals including six children, that were Force-sensitive. She then watched as members of the Inquisitorius, the Empire's Jedi-hunting group made up of former Jedi that turned to the Dark side of the Force, executed the families.\nFollowing the executions the officer became disillusioned with the Empire and began working with an underground, anti-Imperial network known as \"the Path.\" The Path operated through a number of safehouses on worlds across the galaxy and helped Force-sensitives and Jedi alike reach the planet Jabiim, where they could get new identities. Durith maintained her position as an Imperial officer as a cover, operating officially at a battery on the Mid Rim mining planet Mapuzo. In her work with the Path, she worked with the operative Kawlan Roken, who had lost his Force-sensitive wife to the Inquisitors, as well as the Jedi Quinlan Vos, who helped younglings reach safety. Durith also maintained communications with Haja Estree, a con artist on the planet Daiyu who posed as a Jedi for profit while also helping Force-sensitives reach the Path.\nIn 9 BBY, Estree encountered Jedi Master Obi-Wan Kenobi as he was being hunted by Inquisitors and bounty hunters and helped him reach a transport to Mapuzo, informing Durith of a pickup arrangement at a set of coordinates. She began making her way to the designated meeting location in an Imperial ground troop transport with three stormtroopers, but was unable to rendezvous with Kenobi and Organa before an Imperial probe droid spotted the pair. As Kenobi and Organa fled the area, Durith's troop transport intercepted the pair and the officer's stormtroopers surrounded them. Durith proceeded to use her blaster to shoot the Imperial soldiers with her, shocking the Jedi and his charge.\nAfter explaining that she had been on her way to meet them at Estree's coordinates, Durith led Kenobi and Organa into a nearby mining village and into one of the Hidden Path's safehouses. There, the officer discussed how she had come into Imperial service, and why she no longer believed in the government's ideals.\nWhen an Imperial force led by Darth Vader and Imperial Inquisitors began sweeping the town they were in, Kenobi left to draw Vader away, asking Durith to promise him that she would remain with Organa. Leaving through some tunnels that would lead to the spaceport, Organa talked Durith into finding Kenobi to bring him to safety.\nShe found Kenobi, who was losing a battle with Vader. After dragging Kenobi through some flames Vader ordered his stormtroopers to bring Kenobi to him. Tala fired a shot at a pile of flammable stones, cutting Vader and his people off from Kenobi, who was retrieved by a loader droid working for Tala. After getting some distance from Vader, Tala had the loader set Kenobi down and told the badly burned Kenobi he would be ok.\nWith Organa being captured by the Third Sister, Tala helped Obi-Wan infiltrate the Fortress Inquisitorius where Leia was being held and helped him rescue the young princess.\nWhen Darth Vader and the Inquisitorius attacked Jabiim, Tala sacrificed herself to buy others in the underground time to escape.\nHaving held on to Tala's blaster holster, Obi-Wan gave it to Leia when they left Jabiim.\nWhen she asked why the holster did not come with a blaster, Kenobi said that he was not going to give a ten year old child a blaster. Leia kept Tala's holster with her after returning to Alderaan and used it as a place to keep her droid Lola.\nDurith was an idealistic woman who became disillusioned with the Galactic Empire after witnessing its violence towards civilians and children. She involved herself in the activities of the Path in order to atone for her role in a massacre on Garel, and showed a great deal of sympathy for those who were mistreated by the Empire, including Force-sensitives and droids. Her dogged pursuit of the Path's goals led her to display a certain degree of ruthlessness, as exemplified by her willingness to murder troops under her own command to save Force-sensitive refugees from execution.\nDurith showed some familiarity with blasters, accurately firing pistols such as the SE-14r as well as rifles such as the E-11 from both short and long range. She was also skilled in hand-to-hand combat, being able to silently dispatch an opponent—albeit an unwitting one—larger than herself within seconds. She was an able liar, weaving elaborate justifications for her duplicitous behavior whenever questioned.\nTala Durith was first pictured in the teaser trailer for the Obi-Wan Kenobi television series, which was released on March 9, 2022. She was first mentioned, albeit indirectly, in the second episode of the series, which aired on May 26, 2022. She first appeared in the third episode of the series, which aired on June 1, 2022. She was portrayed by actress Indira Varma. Her Imperial rank and full name were revealed on a viewscreen in aurebesh in the fourth episode of the series.\nAccording to Varma, she first took interest in joining the show when her manager brought up the opening of a role for it. She had not watched any of the Star Wars franchise and felt that she didn't need an encyclopaedic knowledge of Star Wars to understand her character's motivations. Nevertheless, Varma chose to research by watching the Disney+ The Mandalorian, as Obi-Wan Kenobi's director Deborah Chow had been part of it and her friend Pedro Pascal, a co-star of hers in the fantasy franchise Game of Thrones, was the lead character.\nHaving enjoyed the wit, humanity, and serialized feel of The Mandalorian, Varma conversed with Chow and they talked about joining the show. Varma trusted Chow's sensibilities and liked how the director wanted the show to be character driven and Chow asked for her input. Varma saw being in the show was an exciting time to change how women are perceived and found her character unique. That made her feel more welcome in Star Wars and she believed she didn't need to copy any other portrayal.\nBy the time Varma learned about Durith, her character's story had reportedly gone through a number of incarnations, with her apparently being coined as a love interest for Obi-Wan Kenobi at one point.\nDurith's holster was made to fit both her and its inheritor Leia Organa. The designers removed the drop portion from the gun belt to fit Organa well. In order to be a fit for both Durith's blaster and eventually Organa's droid Lola, the blaster was designed with a scope in the style of Han Solo's blaster that could required a holster space which fitted the droid as well. The detonator which Durith used to sacrifice herself was inspired by the one used by Leia Organa in the 1983 film Star Wars: Episode VI Return of the Jedi and was made from a replica that was modified by the designers.\nAccording to Varma, Kenobi's actor Ewan McGregor playfully teased her on multiple occasions for not seeing the Star Wars films. At the end of filming for the sequence where Durith perishes in the episode \"Part V,\" which released on June 15, 2022, the actor called it an emotional day.\nMcGregor considered the character of Tala Durith to be important for encouraging Kenobi to leave the past in the past. Varma similarly saw the character as someone who wanted to help Kenobi face his past and fears. She considered Durith to be the equivalent to the French Resistance, which opposed the Nazi occupation of France during the Second World War, and someone who had been hurt by and deeply disillusioned with the Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/User:Braha%27tok_enthusiast",
  "/wiki/User:Spookywilloww",
  "/wiki/Talk:Tala_Durith",
  "/wiki/Tala_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/9_BBY",
  "/wiki/Jabiim",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Mapuzo_battery",
  "/wiki/Hidden_Path",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_officer",
  "/wiki/Planet",
  "/wiki/Mapuzo",
  "/wiki/Captain",
  "/wiki/Imperial_Military",
  "/wiki/Jedi",
  "/wiki/Order_66",
  "/wiki/Force-sensitive",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Homeworld",
  "/wiki/Alderaan",
  "/wiki/Stormtrooper",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Unidentified_human_pilot_(Mapuzo)",
  "/wiki/Anakin_Skywalker",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Mustafar",
  "/wiki/Nur",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Inquisitorius",
  "/wiki/Lord",
  "/wiki/Attack_on_Jabiim",
  "/wiki/Thermal_detonator",
  "/wiki/Galaxy",
  "/wiki/Politics",
  "/wiki/Military_rank",
  "/wiki/Standard_day",
  "/wiki/Execution_of_Force-sensitive_individuals_on_Garel",
  "/wiki/Garel",
  "/wiki/Youngling",
  "/wiki/Hunting",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Death",
  "/wiki/Officer",
  "/wiki/The_galaxy",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Mining",
  "/wiki/Kawlan_Roken",
  "/wiki/Kawlan_Roken%27s_wife",
  "/wiki/Inquisitor",
  "/wiki/Quinlan_Vos",
  "/wiki/Haja_Estree",
  "/wiki/Con_artist",
  "/wiki/Daiyu",
  "/wiki/Mission_to_Daiyu",
  "/wiki/Hunt_for_Obi-Wan_Kenobi",
  "/wiki/Bounty_hunter",
  "/wiki/Transport_eight",
  "/wiki/Viper_probe_droid",
  "/wiki/Mapuzo_mining_village",
  "/wiki/Mapuzo_safehouse",
  "/wiki/Droid",
  "/wiki/Soldier",
  "/wiki/Blaster",
  "/wiki/Blaster_pistol",
  "/wiki/SE-14r_light_repeating_blaster",
  "/wiki/Blaster_rifle",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Unidentified_Imperial_terminal_officer",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/March_9",
  "/wiki/2022",
  "/wiki/Part_II",
  "/wiki/May_26",
  "/wiki/Part_III",
  "/wiki/June_1",
  "/wiki/Indira_Varma",
  "/wiki/Viewscreen",
  "/wiki/Aurebesh",
  "/wiki/Part_IV",
  "/wiki/Star_Wars",
  "/wiki/The_Mandalorian",
  "/wiki/Deborah_Chow",
  "/wiki/Pedro_Pascal",
  "/wiki/Brad_Elliot",
  "/wiki/Han%27s_heavy_blaster_pistol",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Ewan_McGregor",
  "/wiki/Part_V",
  "/wiki/June_15",
  "/wiki/Part_VI",
  "/wiki/StarWars.com",
  "/wiki/LEGO",
  "/wiki/Star_Wars_Inside_Intel:_The_Inquisitorius",
  "/wiki/Obi-Wan_Kenobi:_A_Jedi%27s_Return",
  "/wiki/Databank_(website)",
  "/wiki/Part_I",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Rank_insignia_plaque",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Andor_(television_series)",
  "/wiki/June_4",
  "/wiki/File:Imperial_Forces_Rank_Chart_-_Rogue_One.png",
  "/wiki/June_6",
  "/wiki/June_2",
  "/wiki/June_20",
  "/wiki/August_8",
  "/wiki/2018",
  "/wiki/July_21"
 ]
}