{
 "name": "Talia_Moonseeker",
 "display_name": "Talia Moonseeker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aargauun"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Va'too"
     ]
    }
   ]
  }
 ],
 "content": "Talia Moonseeker was a female Aargauun Jedi Knight who lived during the waning years of the Galactic Republic. Moonseeker was trained by Jedi Master Va'too and successfully passed the Jedi Trials, becoming a Knight. Four months after her promotion, Moonseeker, her former Master, and a large group of Jedi were sent on a mission to rescue Jedi Knight Obi-Wan Kenobi from execution on the planet Geonosis. The rescue mission turned into the opening battle of the Clone Wars, and although Moonseeker survived it, her former Master was killed. Shaken by the loss, she mourned her deceased mentor on the battlefield.\nTalia Moonseeker was a female Aargauun who lived during the last years of the Galactic Republic. By virtue of her Force-sensitivity, Moonseeker was accepted by the Jedi Order. She was chosen as a Padawan learner by Jedi Master Va'too and passed the Jedi Trials around 22 BBY, becoming a full Jedi Knight.\nFour months after Moonseeker was promoted to the rank of Jedi Knight, fellow Knight Obi-Wan Kenobi was captured by the Confederacy of Independent Systems during a mission on the Outer Rim planet Geonosis and sentenced to death. Both Moonseeker and her former Master were part of a strike team assembled by Jedi Master Mace Windu to rescue the trio. However, the rescue mission turned into a full-scale battle with the Separatist Droid Army, and while Moonseeker survived the engagement—which marked the beginning of the Clone Wars—Va'too was killed in action. After the Republic victory in the battle, Moonseeker returned to the execution arena, where the fight began, and mourned her old Master, before ensuring that the body was carried away from the battlefield.\nTalia Moonseeker was able to reach the rank of Jedi Knight under the tutelage of Master Va'too. She survived the Battle of Geonosis, although many other Jedi, like her former Master, were killed. After the battle, Moonseeker openly mourned at the body of her Master and afterward tried to ensure that Va'too's body was carried away by Republic clone troopers.\nMoonseeker first appeared in Wild Space, a novel of The Clone Wars series. Wild Space was written by Karen Miller and published in 2008. In the book, her species name, Aargauun, was misspelled as Argauun. Miller confirmed the mistake and that she was referencing the obscure species, not creating a new one.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Aargauun",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Va%27too",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Geonosis_strike_team",
  "/wiki/Jedi/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Death/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Petranaki_arena",
  "/wiki/Clone_trooper/Legends",
  "/wiki/The_Clone_Wars:_Wild_Space",
  "/wiki/Star_Wars:_The_Clone_Wars_(novels)",
  "/wiki/Karen_Miller",
  "/wiki/2008",
  "/wiki/The_Clone_Wars:_Wild_Space_(audiobook)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/File:KMillerEmail2.png"
 ]
}