{
 "name": "Tallissan_Lintra",
 "display_name": "Tallissan Lintra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pippip 3"
     ]
    },
    {
     "name": "Born",
     "values": [
      "12 ABY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Raddus",
      "Oetchi system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Tallissan Lintra's A-wing squadron",
      "Blue Squadron",
      "Tallissan Lintra's A-wing squadron",
      "Blue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Tallissan Lintra, nicknamed \"Tallie,\" was a human female pilot who served as a lieutenant and squadron commander in the Resistance's naval branch during the New Republic Era. Before joining the Resistance, Lintra lived on a farm with her parents on the planet Pippip 3 where she learned how to fly using her father's old RZ-1 A-wing interceptor. She also had a sister named Kallie Lintra that also joined the Resistance. Some time after joining the Resistance, Lintra participated in a series of missions against a group of pirates in the Cassander sector. By the time of the war against the First Order, Lintra was known as one of the Resistance's most capable pilots. She piloted a RZ-2 A-wing interceptor and served as Blue Leader during the evacuation of D'Qar until her demise aboard the Raddus at the hands of a pair of missiles fired by Kylo Ren's TIE silencer.\nTallissan Lintra was born in 12 ABY long after the dark days of the Galactic Empire. She had a sister named Kallie Lintra, and during her early life Tallissan Lintra and her parents lived on a farm on the planet Pippip 3, where she learned how to fly using her father's crop duster RZ-1 A-wing. During her days on Pippip 3, she developed a strong sense of protecting the peace that the New Republic had brought to the galaxy.\nIn 28 ABY, Princess Leia Organa created the Resistance, a small paramilitary force created to oppose the First Order, the successor state of the Galactic Empire. By 34 ABY, Lintra joined the Resistance, after she became frustrated with the way the New Republic was handling the rise of the First Order. She was hoping to help the next generation of children be free, and to make history alongside it. Lintra became a lieutenant in the Resistance navy and one of their most capable pilots, impressing Poe Dameron with her piloting skills.\nAt some point after joining the Resistance, Lintra was in charge of a training session which Stomeroni Starck and three other Resistance pilots were taking part. Training near an ionized gas cloud, Starck reported to Lintra that cloud was causing sensor interference and recommend aborting the flight. Agreeing with the recommendation, Lintra decided that training without sensors was not what she had in mind and notified the Free Virgillia-class Bunkerbuster Ninka that they would return to the ship. Using her callsign of Blue Leader she informed the Ninka that there was no point on continuing the training session without sensors.\nWhile she was returning to the ship a distress signal alerted the Resistance forces near the area. After getting the report that the signal was coming from inside the cloud, Lintra returned and flew into the cloud to look after the stranded ship. While inside the cloud her RZ-2 A-wing interceptor lost power for all communications, sensors and navicomputer systems, but she was still able to locate the stranded ship.\nTo locate any survivors, Lintra boarded the ship and search for anyone inside. While searching she noted that the starship systems were working fine and that the ship lights were on manual lockdown, noting that the internal comms were working Lintra identified herself and asked if there was anyone aboard the ship. While she was repeating her message, a Duros named Staaysha Dekkr approached Lintra at blaster point thinking she was a pirate and tried to put her on the brig. Lintra confused about the situation explained that she was trying to help after receiving the ship's beacon. Dekkr explained that while trying to impress the boss by getting an early docking slot at Klytus V Station, the Duros attempted to plot a shortcut through the nebula, but the sensors went down and the ship got lost inside it.\nLintra looked into the bridge to see if there was anything they could do. Trying to come up with an idea, Lintra asked if the nebula was mapped to which Dekkr answered that it was since it was navigation hazard. While observing the Nebula map Lintra noted that her A-wing starfighter ion exhaust had left a trail, Lintra then restarted the navicomputer so they ship could lock the exhaust signature and follow it. After rebooting the navicomputer, Starck and the rest of the T-70 X-wing starfighters reached the location of the Dekkr's starship and tried to contact the ship, but Lintra informed Starck that she was onboard and that she was helping Dekkr. After helping Dekkr to return to safety, Lintra accompanied Dekkr aboard the Ninka where they met Amilyn Holdo. Inside the ship Dekkr expressed to be thankful for the Resistance help and shared the map for the gas cloud, which would be uploaded to the Resistance databanks.\nIn 34 ABY, the Resistance learned that pirates armed by the First Order had started to raid the star systems in the Cassander sector. In response to the threat of the sector being taken by the First Order, the Resistance sent Lintra and her A-wing squadron as well as bombers from Cobalt and Crimson Squadron to the sector. The Resistance's first target in the sector was to destroy a pirate controlled spaceport on Mamkoda, Lintra and her squadron were assigned to protect the bombers while they made their attack run on the spaceport. During the battle, Lintra and her squadron encountered heavy resistance from the pirates, but the Resistance bombers were able to destroy their target.\nThree days after the mission on Mamkoda, Lintra and the Resistance forces undertook a relief mission to Caraxl. While the bombers started to deliver the supplies, Lintra reported to the bombers that First Order TIE fighters were on an intercept course to their position. As their orders were to avoid confrontation with First Order vessels, the mission was aborted and they headed back to the Ninka. After returning they learned that the pirates' base was located on Sheh Soahi, with the information Resistance forces were able to destroy the base and get proof of the First Order alliance with the pirates.\nFollowing the destruction of Starkiller Base, ships from the Resistance fleet arrived at D'Qar with new complements of starfighters and joined the remaining forces stationed on the planet to reinforce the Resistance base. After the Resistance learned that the First Order was regrouping, Lintra was present on a briefing where General Organa ordered to evacuate the planet, shocked by the decision, Lintra discussed with Suralinda Javos about it. During the briefing Dameron designed a semi-improvised plan to protect the evacuation ships, Lintra and the A-wings were assigned as the primary defense for the fleet. Dameron also devised a plan to destroy a Mandator IV-class Siege Dreadnought after receiving the schematics from Inferno Squad. As part of the plan squadron commander Lintra, piloting an A-wing starfighter and assuming the leadership of Blue Squadron, was assigned with the vital task of commanding the Resistance starfighter forces and escort the bombers to the dreadnought.\nAfter the First Order fleet arrived at D'Qar, Lintra and the fighters started their approach to the dreadnought after Commander Dameron had destroyed all the turbolasers on the Fulminatrix's surface. While they started to get closer to the dreadnought Lintra ordered the bombers to stay in formation and joked with her wingmate Stomeroni Starck to not get drawn into dogfights. During their approach Ben Teene spotted several TIE fighters closing in formation, Lintra compared their formation to dire hounds loose among whellays back home on Pippip 3. Once the TIE Fighters got close enough the Resistance fighters engaged in combat trying to clear a path for the bombers, after reaching the dreadnought Lintra ordered the bombardiers to start their dropping sequence on the ship, however the majority of the bombers were destroyed after one spiraling TIE cockpit detonated the proton bombs in one of the bombers. The only bomber left managed to drop its explosives destroying the dreadnought. As the dreadnought exploded Lintra and the surviving fighters returned to the Raddus and jumped into hyperspace.\nAfter fleeing from D'Qar, the Resistance fleet dropped out of hyperspace in the remote Oetchi system. Unknown to the Resistance, the First Order had tracked them through hyperspace and began an attack on their fleet. Lintra, whilst sleeping, had a dream where she had to protect the Resistance bombers, but she couldn't see them but instead could only locate them by the screams of their pilots as they died. After being woken up by a klaxon in the Raddus ready room, Lintra and Starck confusingly looked at the holotank and realized that the First Order fleet had followed them. After putting on her boots and her flight vest Lintra made her way to the hangar. In the hangar Lintra and the rest of the fighters started up their ships in order to engage the First Order. Before they could take off, Kylo Ren fired a pair of missiles into the hangar from his TIE silencer, killing Lintra and destroying the starfighters.\nSometime after Lintra's encounter with Staaysha Dekkr the story became known to Emil Graf, who shared the story with his BB-series astromech droid BB-00 and with the monster droid CR-8R \"Crater\" aboard the Star Herald. Graf told the story trying to help Crater overcome the fear of not being able to see anything after Graf replaced his photoreceptors crystals. After sharing the entire story Crater started to feel batter and Graf took him to maintenance to so he could take an oil bath.\nAfter the Resistance established their base on the jungle moon of Ajan Kloss, a squadron of RZ-2 A-wings was renamed to Tallie Torchers, being Tallie the nickname of Tallissan Lintra. Lintra's legacy was also honored by fellow A-wing pilot Merl Cobben, who felt particularly indebted to Lintra since she saved his life in a previous skirmish.\nIn 35 ABY, the Resistance launched an attack on the Final Order, a fleet assembled by the Sith Eternal cult, on the Unknown Regions' planet of Exegol. As part of the Exegol air team, Tallissan Lintra's sister Kallie Lintra was killed after eight Sith TIE fighters surrounded her A-wing. After her death, Poe Dameron took a deep breath and lamented that they had lost both Tallissan and Kallie Lintra during the war.\nTallissan Lintra was a human female who had light skin, blue eyes, blonde hair, and she stood at a height of 1.73 meters, or five feet and eight inches. Lintra's piloting skills were able to impress the Resistance ace pilot Poe Dameron and also made her one of the most capable pilots in the Resistance. She performed various roles in the Resistance, from leading relief missions to escorting starships.\nHer piloting skills came from flying an old RZ-1 A-wing as a cropduster on her homeworld of Pippip 3. With her expertise on the RZ-1, Lintra believed that flying the newer RZ-2 A-wing was like lacing her boots. Her leadership potential was noticed by the Resistance leadership who lead them to take the decision of give her the command of Blue Squadron during the evacuation of D'Qar. Lintra was also know to have the ability to swiftly adjust to unexpected developments or changes in battles and use them to her advantage. During the evacuation of D'Qar, Lintra was considered a vital and essential part of the evacuation due to her ability to quickly assemble the fighter squadrons.\nLintra cared for her fellow pilots and she was afraid of not being able to help other pilots during combat. After the battle at D'Qar she started to had nightmares in which she couldn't see the other pilots, but she could only hear their screams as they were being killed. Lintra also had a good relationship with her wingmate Stomeroni Starck, she often joked with him, and tried to keep him in check.\nTallissan Lintra developed a strong sense of valuing and protecting the peace that the New Republic had brought to the galaxy. This sense helped her join the Resistance, after she became frustrated with the way the New Republic was handling the rise of the First Order.\nLintra wore a standard green Resistance pilot uniform that included a FreiTek life support unit attached to her vest and a Guidenhauser ejection harness. She also wore a synthsilk scarf her father gifted her, as a symbol of luck. Lintra's red and white flight helmet had a yellow Rebel Alliance starbird and the letters \"DA\" in Aurebesh, which stood for \"Deadly Approach\", a punch-line to a well-known pilots' joke. Lintra piloted a blue marked RZ-2 A-wing starfighter and carried a blaster pistol with her.\nTallissan Lintra was portrayed by English actress Hermione Corfield in the 2017 Star Wars sequel trilogy film Star Wars: Episode VIII The Last Jedi, which was written and directed by Rian Johnson. The character was credited as \"A-Wing Pilot Tallie\" in the film's end credits, but was later identified as \"Tallissan Lintra\" in the movie's Visual Dictionary and Incredible Cross-Sections reference books released in conjunction with the film. Corfield's involvement in the film was first announced by Rian Johnson on his Twitter account on October 3, 2017.\nBefore Tallissan Lintra's appearance on the film, she was first mentioned in the 2017 activity book Star Wars: A-wing Deluxe Book and 3D Wood Model, written by Michael Kogge, and later made her first appearance in the 2017 video game Star Wars Battlefront II, in its The Last Jedi season. The season introduced Tallie's RZ-2 A-Wing fighter as one of the playable starfighter hero units. Tallie's A-wing was added to the game two days before the film, on December 13, 2017.\nTallissan Lintra's dialogue is expanded on the movie's novelization, during the opening sequence in which Lintra and the Resistance forces approach the First Order dreadnought, the Resistance forces are positioned farther than in the film and giving space to a brief interaction between Lintra and Stomeroni Starck.\nTallissan Lintra is a playable character in the 2020 mobile game Star Wars: Starfighter Missions, developed by Lucasfilm and JOYMAX.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tallie",
  "/wiki/Pippip_3",
  "/wiki/12_ABY",
  "/wiki/34_ABY",
  "/wiki/Raddus_(MC85_Star_Cruiser)",
  "/wiki/Oetchi_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Tallie_Torchers",
  "/wiki/Blue_Squadron_(Resistance)",
  "/wiki/File:MakeThisCount.ogg",
  "/wiki/Pilot",
  "/wiki/Lieutenant",
  "/wiki/Squadron_commander",
  "/wiki/Resistance_navy",
  "/wiki/New_Republic_Era",
  "/wiki/Tallissan_Lintra%27s_farm",
  "/wiki/Parent",
  "/wiki/Planet",
  "/wiki/Tallissan_Lintra%27s_father",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Kallie_Lintra",
  "/wiki/Time",
  "/wiki/Missions_against_pirates_in_the_Cassander_sector",
  "/wiki/Sheh_Soahi%27s_pirates",
  "/wiki/Pirate",
  "/wiki/Cassander_sector",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance_pilot",
  "/wiki/RZ-2_A-wing_interceptor",
  "/wiki/Blue_Leader",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/Death",
  "/wiki/Missile",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Ben_Solo",
  "/wiki/Kylo_Ren%27s_TIE_silencer",
  "/wiki/Reproduction",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/New_Republic",
  "/wiki/The_galaxy",
  "/wiki/28_ABY",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Youngling",
  "/wiki/Poe_Dameron",
  "/wiki/Teacher",
  "/wiki/Stomeroni_Starck",
  "/wiki/Unidentified_gas_cloud",
  "/wiki/Sensor",
  "/wiki/Free_Virgillia-class_Bunkerbuster",
  "/wiki/Ninka",
  "/wiki/Starship",
  "/wiki/Callsign",
  "/wiki/Distress_signal",
  "/wiki/Tallissan_Lintra%27s_RZ-2_A-wing_interceptor",
  "/wiki/Navigation_computer",
  "/wiki/Staaysha_Dekkr%27s_starship",
  "/wiki/Duros",
  "/wiki/Staaysha_Dekkr",
  "/wiki/Blaster",
  "/wiki/Brig",
  "/wiki/Klytus_V_Station",
  "/wiki/Nebula",
  "/wiki/Bridge_(starship)",
  "/wiki/Star_map",
  "/wiki/A-wing_starfighter",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Amilyn_Holdo",
  "/wiki/Databank",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_system",
  "/wiki/Sector",
  "/wiki/Squadron",
  "/wiki/MG-100_StarFortress_SF-17",
  "/wiki/Cobalt_Squadron",
  "/wiki/Crimson_Squadron",
  "/wiki/Battle_of_Mamkoda",
  "/wiki/Mamkoda_spaceport",
  "/wiki/Mamkoda",
  "/wiki/Bomber",
  "/wiki/Spaceport",
  "/wiki/Standard_day",
  "/wiki/Mission_to_Caraxl",
  "/wiki/Caraxl",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Sheh_Soahi_pirate_base",
  "/wiki/Sheh_Soahi",
  "/wiki/Battle_of_Sheh_Soahi",
  "/wiki/File:GunnersLookAlive.ogg",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Starkiller_Base",
  "/wiki/D%27Qar",
  "/wiki/Starfighter",
  "/wiki/Resistance_base",
  "/wiki/Suralinda_Javos",
  "/wiki/Mandator_IV-class_Siege_Dreadnought",
  "/wiki/Inferno_Squad_(Resistance)",
  "/wiki/Resistance_Starfighter_Corps",
  "/wiki/Dreadnought",
  "/wiki/First_Order_Navy",
  "/wiki/Commander",
  "/wiki/Turbolaser",
  "/wiki/Fulminatrix",
  "/wiki/Wingmate",
  "/wiki/Starfighter_combat",
  "/wiki/Ben_Teene",
  "/wiki/TIE/sf_space_superiority_fighter",
  "/wiki/Dire_hound",
  "/wiki/Whellay",
  "/wiki/Bombardier",
  "/wiki/Cockpit",
  "/wiki/Proton_bomb",
  "/wiki/Crimson_Smiter",
  "/wiki/Cobalt_Hammer",
  "/wiki/Hyperspace",
  "/wiki/Fleet",
  "/wiki/Hyperspace_tracker",
  "/wiki/Sleep",
  "/wiki/Dream",
  "/wiki/Klaxon",
  "/wiki/Holotank",
  "/wiki/Boot",
  "/wiki/Flight_vest",
  "/wiki/Hangar",
  "/wiki/Emil_Graf",
  "/wiki/BB-series_astromech_droid",
  "/wiki/BB-00",
  "/wiki/Monster_droid",
  "/wiki/CR-8R",
  "/wiki/Star_Herald",
  "/wiki/Photoreceptor",
  "/wiki/Oil_bath",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Jungle",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Merl_Cobben",
  "/wiki/35_ABY",
  "/wiki/Battle_of_Exegol",
  "/wiki/Final_Order",
  "/wiki/Sith_Eternal",
  "/wiki/Religion",
  "/wiki/Unknown_Regions",
  "/wiki/Exegol",
  "/wiki/Exegol_air_team",
  "/wiki/TIE/dg_starfighter",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Foot",
  "/wiki/Clothing",
  "/wiki/FreiTek_Incorporated",
  "/wiki/Life_support",
  "/wiki/Guidenhauser",
  "/wiki/Flight_harness",
  "/wiki/Synthsilk",
  "/wiki/Scarf",
  "/wiki/Flight_helmet",
  "/wiki/Rebel_Alliance_starbird",
  "/wiki/Aurebesh",
  "/wiki/Blaster_pistol",
  "/wiki/Hermione_Corfield",
  "/wiki/2017",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Rian_Johnson",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Last_Jedi:_Incredible_Cross-Sections",
  "/wiki/October_3",
  "/wiki/Star_Wars:_A-wing_Deluxe_Book_and_3D_Wood_Model",
  "/wiki/Michael_Kogge",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/December_13",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/2020",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/JOYMAX_Co.,_Ltd.",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Last_Jedi_(storybook)",
  "/wiki/The_Last_Jedi_Adaptation_1",
  "/wiki/Poe_Dameron_28",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_Alone_in_the_Dark",
  "/wiki/Star_Wars_Adventures_(2017)_26",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/William_Shakespeare%27s_Jedi_the_Last:_Star_Wars_Part_the_Eighth",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Tallissan_Lintra",
  "/wiki/Category:Images_of_Tallissan_Lintra",
  "/wiki/Star_Wars",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Last_Jedi_(toy_line)",
  "/wiki/The_Art_of_Star_Wars:_The_Last_Jedi",
  "/wiki/The_Last_Jedi:_Bomber_Command",
  "/wiki/Star_Wars:_The_Last_Jedi:_Ultimate_Sticker_Collection",
  "/wiki/Star_Wars:_The_Last_Jedi:_Heroes_of_the_Galaxy",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Resistance_Conversion_Kit",
  "/wiki/RZ-2_A-Wing_Expansion_Pack",
  "/wiki/Topps_Star_Wars_Living_Set",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_35",
  "/wiki/Starfighter_Aces",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Ships_and_Vehicles",
  "/wiki/Star_Wars_Ships_and_Vehicles_12",
  "/wiki/Ships_and_Vehicles",
  "/wiki/The_Resistance",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Atterra_campaign",
  "/wiki/File:TallieActressRevealed.jpg",
  "/wiki/Electronic_Arts"
 ]
}