{
 "name": "Talvee_Chawin",
 "display_name": "Talvee Chawin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Iktotchi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Talvee Chawin, better known as the Thorn, was a male Iktotchi crime lord of Level 1313 on the planet Coruscant around the time of the Battle of Endor in 4 ABY.\nChawin was a male Iktotchi crime lord operating on the planet Coruscant. He owned a gang that had at least five members\nWhen the youngling Jak, a Rebel, rescued Lazula, Chawin's woman, from the custody of the Coruscant police, he was given a card that granted an audience with Chawin on Level 1313 of the Coruscant Underworld. Jak went to see Chawin around the time of the Battle of Endor in 4 ABY that killed the Emperor and negotiated for an EMP. He then gave it to the Anklebiter Brigade, a legion of youngsters that Jak belonged to, so that they could use it as a distraction against Imperial forces. These Imperial forces were fighting for control of CoCo Town against the Rebel Alliance. In exchange for the EMP, Jak pledged himself to Chawin's service.\nChawin is shown to be stubborn, demanding a price for the weapon he gave to Jak. Jak theorized that Chawin may have been nicknamed \"the Thorn\" since one of his horns was broken while the other looped around his chin and then jutted outward. Jak also theorized that there was the possibility that he was nicknamed \"the Thorn\" because he was \"a thorn in the Empire's side.\"\nTalvee Chawin first appeared as a secondary character in Chuck Wendig's 2015 novel Aftermath, which is set immediately after the events of the Return of the Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Thorn_(disambiguation)",
  "/wiki/Iktotchi",
  "/wiki/Gender",
  "/wiki/Crime_lord",
  "/wiki/Level_1313",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Jak_(Coruscanti)",
  "/wiki/Lazula",
  "/wiki/Youngling",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Coruscant_Underworld",
  "/wiki/Palpatine/Legends",
  "/wiki/Electromagnetic_pulse",
  "/wiki/Anklebiter_Brigade",
  "/wiki/Galactic_Empire",
  "/wiki/CoCo_Town",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(novel)",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}