{
 "name": "Talva_Ko%27lib",
 "display_name": "Talva Ko'lib",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bothawui"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Talva Ko'lib was a Bothan Force Adept who was raised on the planet Bothawui during the reign of the Galactic Empire. Life on Bothawui taught Ko'lib the value of social maneuvering and the Bothan became well placed to gain a position of power on the planet. Following the outbreak of the Galactic Civil War between the forces of the Empire and the Rebel Alliance, Ko'lib resisted recruitment efforts that were made by the Alliance on Bothawui, considering the Rebels to be a group of criminals that were fighting a lost cause. However, after the Empire constructed a base on Bothawui and imposed Imperial rule onto the world, Ko'lib finally joined the Alliance and was assigned to serve aboard the transport Griffon's Wings. A short time after the Battle of Yavin, the Griffon's Wings was dispatched by the Alliance to scout the planet Yorgraxx. However, shortly after arriving in the Yorgraxx system, the Griffon's Wings was attacked by three Imperial Guardian-class light cruiser. The transport was forced to crash land on Yorgraxx and the impact knocked Ko'lib and the rest of the vessel's crew unconscious. After coming around, Ko'lib and the surviving crew encounted Arran Flekk and Vor Harkass, two Imperial scouts that were stranded on Yorgraxx, and the pair agreed to work with the crew of the Griffon's Wings to find a way off of Yorgraxx. Shortly afterward, the group investigated a nearby Sith fortress, where they encounted the Sith spirit Quorlac Fornayh and the Emperor's Hand Jallar Golin.\nTalva Ko'lib was created by Robert Wiese and appears in the role-playing adventure Shadows in the Force, as a pre-generated character that a player of the adventure can choose to role-play as. The players have the choice of determining whether Ko'lib has a male or female gender, and the character's canon gender is not revealed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Force_Adept",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Griffon%27s_Wings",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Yorgraxx",
  "/wiki/Yorgraxx_system",
  "/wiki/Guardian-class_light_cruiser",
  "/wiki/Arran_Flekk",
  "/wiki/Vor_Harkass",
  "/wiki/Fornayh%27s_fortress",
  "/wiki/Force_ghost",
  "/wiki/Quorlac_Fornayh",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Jallar_Golin",
  "/wiki/Robert_Wiese",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Shadows_in_the_Force",
  "/wiki/Gender/Legends",
  "/wiki/Canon"
 ]
}