{
 "name": "Tam_Posla",
 "display_name": "Tam Posla",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Milvayne"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Accresker Jail",
      "above Tiferep Major",
      "3 ABY",
      "Milvayne"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Majority of body"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Milvayne Authority",
      "Son-tuul Pride"
     ]
    }
   ]
  }
 ],
 "content": "Tam Posla was a Milvaynian human male from the planet Milvayne. He became a respected lawman in the law enforcement known as the Milvayne Authority and eventually began investigating a rash of crimes by the criminal surgeon Cornelius Evazan and his partner Ponda Baba. Although he was taken off of the case, he went rogue to continue pursuing the pair, becoming a bounty hunter and vigilante when his superior officer had him discharged.\nAlthough he was unable to apprehend Evazan and Baba on the moon Jedha, Posla found and fell in love with one of their cyborg prototypes Caysin Bog, and the pair continued the hunt together. In order to gather funds for their hunt, they took a job in which they joined a crew of mercenaries led by the rogue archaeologist Chelli Aphra. The crew undertook a series of missions, going on to infiltrate the Imperial base Hivebase-1.\nAt Hivebase-1, Aphra catalysed the death of Bog at the hands of attackers in order to make Posla fight them. Once their mission was complete, she conspired with the Imperial Magna Tolvan, who stole the vigilante's attire and left him gagged while she stowed away with the rogue archaeologist. Posla suspected Aphra of being responsible for Bog's death, but put the matter aside and continued his hunt for Evazan, tracking the rogue surgeon's history up until a dead end.\nAphra then contacted Posla, asking him to help her escape the Imperial wreckage-prison Accresker Jail in exchange for a captive Evazan. The vigilante agreed to a trade and brought an escape shuttle to her at Accresker, taking away Evazan frozen in an ice chunk. However, when being freed from the ice, Evazan used a the shape-shifting creature pluripleq to pretend to be someone else, tricking Posla into thinking he had been lied to. The vigilante returned to Accresker Jail and confronted Aphra, only to be attacked and killed by the assassin droid 0-0-0.\nAfter his death, Posla's corpse was found and merged into by some Force-sensitive Gundravian hookspores, reviving the vigilante and giving him Force powers. The undead Posla tracked down and pursued Aphra and 0-0-0 on Milvayne, losing them on multiple times. When the vigilante later joined and Imperial garrison that was attacking the pair, he was set on fire by 0-0-0, and while burning up, he fired a shot that triggered a series of events involving mass rioting on Milvayne.\nHailing from Milvayne, a planet in the Inner Rim Territories with a justice-orientated society, the human male Tam Posla became a respected lawman in the Milvayne Authority, the local law enforcement agency. He become the most celebrated among the police force's ranks as he led a long and dedicated career pursuing his targets with much determination. During his life, he gained cybernetic upgrades to much of his body from his personal cyberneticist, Rajam Nuss, in order to enhance his performance.\nAround 10 BBY, Posla travelled to a number of planets far from his homeworld, eventually finding himself at the Lodge saloon on the cold mountainous Mid Rim Territories planet of Vandor that year. He spoke with a patron near the bar when the Crimson Dawn lieutenant Qi'ra arrived with the rookie mercenaries Han Solo and Chewbacca. The trio made their way over to a Sabacc game where the famed smuggler Lando Calrissian played several other experienced gamblers.\nPosla himself joined the spectators of the Sabacc game, positioning himself rear to Calrissian before moving to stand not far behind the Azumel player Argus Panox after Solo joined the game beside the latter player, speaking with another spectator that was further back. Solo began getting a streak of winning hands, besting Calrissian and the other players. Posla watched as the pair raised the steaks and bet their starships, only for Calrissian to play a better hand, secretly cheating by slipping a card out of his sleeve. The game disbanded after that.\nBetween 10 BBY and 0 BBY, Posla was assigned to a case regarding a series of abductions on Milvayne and other Inner Rim worlds that were connected to forced servitude and surgical alteration, all thought to have been carried out by a pair of visitors to the world using the aliases \"Roofoo\" and \"Sawkee;\" in reality the criminals Doctor Cornelius Evazan and Ponda Baba. The lawman discovered the surgical mutilations committed by the pair and was deeply affected by it, making it his personal goal to solve the case. He unsuccessfully attempted to arrest the two culprits and dubbed Evazan the \"Mutilator of Milvayne.\"\nPosla was taken off the case by his superior officer, but that did not stop his newfound obsession, and he continued with the case against orders. He learned of a similar string of crimes taking place in the streets of Jedha City on the Mid Rim moon of Jedha, where Evazan was cybernetically enhancing victims of a local insurgency and selling them into unwilling servitude as cyberslaves were known as the decraniated. Since Jedha was not in the lawman's jurisdiction, Posla's superior officer claimed his hunt had no sanction, and being given no other choice, had him dishonorably discharged from the Milvayne Authority in his absence.\nDespite losing his job and home, Posla was still too attached to the case to give up on it. He thus continued his vendetta as a vigilante, acquiring an Imperial Peace-Keeping Certificate as a license to become a bounty hunter. He then made his way to Jedha and searched through Jedha City, and briefly stood at the side of a street by Tythoni Square to make way for a patrol from the Galactic Empire's forces on Jedha, comprising of stormtroopers and a TX-225a Occupier Tank. That was when members of the local insurgency, the Partisans, attacked the patrol, leading to a battle between both sides.\nIn his search for Evazan, who was making his way off-world with Baba at that time, Posla was unable to find any decraniated with the ability to speak to him on his target until he crossed paths with the prototype Caysin Bog, who had also been making way for the Imperial patrol when it was attacked. Meanwhile, the Empire's new project, the Death Star, loomed over Jedha City. Having missed his opportunity to catch Evazan by seconds, Posla was forced to evacuate the city with Bog to evade the Death Star's wrath, which destroyed Jedha City just hours later.\nAfter escaping Jedha, Posla teamed with Bog to continue hunting Evazan and Baba, and the pair fell in love. Wishing to gather funds to light up the underworld for Evazan, they sought out mercenary work through Bog's connections and found themselves hired by the assassin droid 0-0-0, the leader of the Son-tuul Pride syndicate, into joined a crew of mercenaries around 3 ABY. 0-0-0 kept himself anonymous from the majority of the mercenaries, including Posla and Bog, and placed them under the leadership of the rogue archaeologist Doctor Chelli Aphra. Other members of the crew included the cyborg Rexa Go, the swordsman known as the Violet Ghost, the Skakoan guide Hallio Bas, the modified Droideka Dek-Nil, the Xexto assassin Sister Six, and the Defel Glahst Ombra.\nThe mercenaries gathered aboard a LAAT/le patrol gunship docked at a spaceport on the Outer Rim Territories planet Son-tuul, where Go eventually brought Aphra to meet her new crew. Using an aug scanner, Aphra inspected the backgrounds of Posla and the rest of her crew, commenting on each of them. The crew leader then prepared to leave Son-tuul, but not before leaving behind one of the mercenaries under 0-0-0's request, choosing to let the Violet Ghost fight inspecting Imperial forces as the rest of the crew departed the spaceport.\nThe crew landed on the planet Skako Minor to investigate the workshop of the famed Skakoan Techno Union foreman Wat Tambor. Bas led the group through a fungal forest towards the workshop, telling his colleagues about Tambor and praising the Techno Union. Listening to Bas's praising, Posla and Bog exchanged snide remarks about Tambor and the Union, Posla calling him a unrepentant villain. As the group continued following Bas, they soon found themselves surrounded by Imperial troops, Bas revealing himself as a traitor. The lead Imperial officer wished to execute the mercenaries Bas had fooled, but Aphra played a trick on them, handing over her modified pet Tooka Flufto to Bas. That was when she stated a codephrase, detonating her Tooka. Bas and the Imperials were swiftly killed by the explosion\nFollowing the explosion, Aphra opened Go's crate, which some of the other mercenaries assumed carried booze. However it carried sixty more shrink frozen Tookas, one of which Aphra took out to replace the one she had detonated. A stormtrooper who had survived the explosion then ran past Posla and Bog, making for the forest. Go ordered for the trooper to be stopped, but the mercenary lovers refused, seeing no point in killing an \"cog in a machine\" who had broken no law. Ombra, though, ambushed the Imperial soldier at the treeline, killing her prey.\nThe group entered Wat Tambor's workshop and found a room full of deactivated machines and artefacts. As they began searching the place, Aphra gave praise to the machinery around the room, Posla questioned whether there was extra pay for having a maniac in charge of their team. The rogue archaeologist stopped Bog from touching a techno-totem she feared was a booby trap, mistakenly calling him Posla. The crew's search was soon disrupted by an Imperial Delta-class T-3c shuttle which broke through the workshop's roof and landed in the middle landed with a squad of stormtroopers led by Lieutenant-Inspector Magna Tolvan.\nThe mercenaries crew took cover behind walls as the stormtroopers opened fire on them. The stormtroopers open fired on Aphra's crew and the mercenaries took cover. In addition, the Imperial shuttle had landed on the techno-totem, which awoke a large cyborg creature in the workshop, the Chthonic worm god. The beast attacked both sides, killing several stormtroopers in the process and forcing Posla and Bog to remain hiding behind cover. Aphra wanted Bog to use his bayonet to stab at it, but Posla stopped his partner as their contract for the mission did not require such action. The rogue archaeologist and Go made attacks on the cyborg creature, and Six suggested helping Aphra as she was pinned down. Posla refused, calling her a criminal and insisting that the word god had broken no law.\nSix then pointed out to Posla that the worm god had left Bog lying lifeless behind them. Angered, the vigilante revealed his cybernetic weapons and unleashed a barrage of rockets onto the beast. Bog awoke in the meantime, having temporarily winded from the worm gods attacks. Relieved, the bounty hunter sat behind cover again, apologizing for his aggression. Six called him and the rest of the mercenaries mad while Posla and Bog returned to cover and embraced. Shortly after, the worm god was killed by a rocket blast from a stormtrooper, Aphra reappeared to her crew and advised them to continue looting.\nThe mercenaries proceeded to loot the workshop more, being briefly interrupted by a blaster shot. Aphra pushed her comrades to return to their looting, hiding the fact that she had just killed Rexa Go to rescue Tolvan, whom she had exchanged a kiss with during the fighting. After she finished extracting data from a terminal, the rogue archaeologists had the crew begin to leave. Posla questioned where Go was, but Aphra overrode his query.\nThe mercenaries made their way out of Wat Tambor's workshop and back to their patrol ship. The crew found Ombra, who had decided to flees the workshop during the fighting there, returning to them at the ship, although it was secretly Tolvan wearing Ombra's hide after killing the Defel. Once the ship took off, Aphra analyzed her extracted data and learned that the information she sought was found in the Imperial Tarkin Initiative archive facility Hivebase-1. The rogue archaeologist returned to her crew, sarcastically asking them if they wanted to do something sane.\nAs part of Aphra's plan to infiltrate Hivebase-1, her crew, Posla included, located the Rebel Alliance Lucrehulk-class Battleship Lucrehulk Prime, which served as a training school for rebel pilots. After getting aboard the Lucrehulk, the fake Ombra slipped away from the mercenaries and using an aura ability which allowed Defel's to disappear. The Alliance officer Bini, believing that the crew was enlisting for the Alliance, greeted the crew at the Lucrehulk Prime's bridge, asking how they had found the flight school. While Aphra gave a sarcastic explanation, Posla insisted that he spoke for the team, explaining that the crew had heard rumors of the flight school and wanted to see it for themselves, with Six and Aphra adding details on how they located it.\nBini recognized Posla, acknowledging the vigilante's past as a Milvayne lawman and begun giving details of recruitment into the Alliance, much to Posla's confusion as he did not intend to enlist. Aphra pushed him to say yes to Bini as the officer shook the bounty hunter's hand. Bini then took the crew on a tour to the Lucrehulk Prime's control core, telling Posla and his colleagues about the core's function. Aphra's newest clone of Flufto then ran into the core, Aphra making chase.\nHera Syndulla, the rotation general aboard the flight school, shot the Tooka, and approached her new visitors. Bini introduced Posla and the rest of the crew to the general, calling them volunteers. The vigilante then finally denied to the rebels that they were enlisting, and revealed that they had a proposal for \"mutual benefit.\" Realizing that her visitors were mercenaries, Syndulla had Posla and the others arrested and placed in the Lucrehulk Prime's brig.\nThe mercenaries were locked in cells at the brig, Posla sharing one with Bog and Six while Aphra and Dek-Nil shared another next to them. After some time had passed, the fake Ombra reached Aphra's cell through the vents and revealed herself as Tolvan in disguise. Posla heard the commotion from his cell and dismissed it as Aphra muttering and scheming, although Bog endeavoured to try and check what was going on. As the confrontation in Aphra's cell continued, Tolvan was incapacitated and incidentally fired at the ray shield projectors, freeing the mercenaries. However, they chose to not escape and stayed at the cells, Aphra and Dek-Nil getting the unconscious Tolvan back into the vent.\nSyndulla met with Posla and the rest of the crew by their patrol ship in the hangar, giving them an opportunity to present their proposal. The bounty hunter and his colleagues claimed that they had a plan to get into Hivebase-1, the general becoming intrigued to know more. As Posla begun to explain, though, Aphra sprung her real plan: Bog ejected four blasters set to stun, and Six caught them and proceeded to shoot each rebel in the room. The vigilante had not known of the new plan, which involved escaping with the incapacitated Syndulla, and was outraged of it, as well as not being informed. Bog tried to reassure his lover, but the bounty hunter declared that he quit. Aphra then wished Posla luck with rebel reinforcements, which stoked the vigilante to board the crew's ship instead of facing armed rebels.\nThe mercarnaries' ship escaped from the Lucrehulk Prime, and Aphra asked her colleagues to borrow a holo-communicator. Posla gave her snide remarks, Bog interjecting to stop him making a threat. The bounty hunter claimed he had been made into a liar thanks to Aphra, but the rogue archaeologist assured him that what he had said to the rebels was technically the truth. Using a communicator lent by Bog, she contacted Hivebase-1 and proposed to trade Syndulla, although the officer left the deal unconfirmed.\nThe group traveled in their gunship for Hivebase-1. On the way, Aphra fixed some servos in Bog's cybernetics, which had been scrambled from the worm god. Posla continued to deliver insults to Aphra for deceiving him, much to his partner's protests for him to let the matter rest. The vigilante asked what Aphra was planting into his partner, which she claimed was a diagnostic test. In reality, the rogue archaeologist was installing contingency orders into the cyborg's cybernetics to override his brain. Aphra also complemented Doctor Evazan's work on Bog, Posla began ranting about how evil the rogue surgeon was. When he noticed and asked about comm chatter coming from Aphra's direction, the rogue archaeologist made excuses and asked about who Evazan was, leading Posla to explain the story of why he hated Evazan, recounting how he lost his place in the Milvayne Authority and went to Jedha, where he met Bog.\nWhen the group then arrived at Hivebase-1, and an Imperial officer confirmed their trade with Syndulla over the comms, giving them specific directions to enter their base without being destroyed by the surrounding scaraphyte swarm. Aphra then revealed to Syndulla that a tracker on the general's rank plaque had been reactivated. Subsequently, the Lucrehulk Prime nearby and found itself overwhelmed by the scaraphytes. With Hivebase-1 distracted by the rebels, Aphra's team covertly landed in a hanger in the complex, and the mercenaries began there search onboard. When Posla questioned what they were to do with Syndulla, Aphra said to bring or leave her as she had already served her purpose.\nPosla and the other mercenaries entered a room full of frozen rejected prototypes. As they searched around, Aphra got news that the bridge of the Lucrehulk Prime's control core had been commandeered by Magna Tolvan. Aphra got onto the comm channel, to convince Tolvan to spare the rebel ship, but lieutenant-inspector in turn revealed to Hivebase-1 that they had infiltrators. Posla and the others quickly noticed the rejected prototypes around them defrosting. Aphra asked the the vigilante if he could bring out his cybernetic weapons, but he refused, citing that the rejects had broken no law, remaining firm to his decision as the rogue archaeologist warned him that they would die.\nThe rejected projects opened fire, gunning down Dek-Nil as the rest of the mercenaries and Syndulla took cover behind crates. As Posla continued to deny Aphra's requests, sat idle behind a crate, the rogue archaeologist ordered everyone back to their ship. That's when Aphra activated the modifications she had put into Bog's cybernetics, forcing him into unwillingly advancing towards the prototypes. A confused Posla questioned what his partner was doing, only to witness the cyborg be mowed down by the rejects. Bog's death sent the bounty hunter into a fit of rage, unleashing his sybernetic weapons at the rejected projects. With the prototypes at bay, Aphra, Syndulla and Sister Six left Posla to face the swarm of rejects alone.\nPosla survived the fight and returned to the others at the datacore of Hivebase-1, traumatised from the events that had occurred in the prototype room. The vigilante slumped at a terminal while Aphra consulted another for the information she was looking for. However, the group was then found and attacked by the Imperial Commander Yewl and his troops, Posla sitting behind cover during the skirmish. That's when Aphra put the final part of her plan into motion, using a bug she had planted into the Lucrehulk Prime to control the vessel, using it to steal Hivebase-1's datacore with Aphra's team inside using its tractor beam. Meanwhile, the rest of the shrink frozen Tooka's escaped Aphra's crate and began roaming Hivebase-1, simultaneously detonating to destroy the facility.\nPosla, Aphra, Sister Six and Syndulla made made it safely on board the flight school. While the rebel general pardoned the group for stealing the Hivebase-1 core, Aphra had Posla go to the vents to retrieve Tolvan. Tolvan, though, attacked the bounty hunter and gagged him up, using his attire to stow away with Aphra. Impersonating the vigilante, Tolvan gave Syndulla locational data on an Imperial infiltrator as she and Aphra left the Lucrehulk Prime on a UT-60D U-wing starfighter/support craft. The rebel soldiers made their way into the vents to find the gagged Posla, surprised that he was not an Imperial.\nAfter the betrayal, Posla parted from the rebels. He came to suspect that Aphra might be responsible for Bog's death and swore to one day take revenge on her. In the meantime, the vigilante resumed his long halted search for Cornelius Evazan. He returned to Son-tuul and bought a starship from 0-0-0, not aware of the droid's identity or involvement in the vigilante's missions with Aphra. The droid had in fact bugged the ship for the purposes of spying on the bounty hunter. Posla gathered a history of Evazan's known activity after Jedha, including an altercation Evazan and Baba had gotten into a fight with a Jedi on the Outer Rim planet Tatooine, which had led to Baba losing an arm, and Evazan's infiltration of a biofarm on the astronomical object Thannt. The bounty hunter also managed to obtain Baba's arm and kept it in a jar.\nEvazan's trail, however, came to a halt, and after a month Posla had ended up killing five informants for information purposes. On the four-hundred and twentieth day of the hunt, he kicked a sixth informant to death for lying about Evazan's whereabouts. The vigilante knew that Evazan's ego never kept him off the grid for for so long and had to assume that the man was either dead of imprisoned. So the vigilante began scanning Imperial custodial facilities in the hopes of finding him.\nOn the four-hundred and twenty-first day of the hunt, while his ship floated in deep space, Posla updated his mission log, explaining his recent findings and general knowledge on Evazan, he stated that due to his killing of informants he would adopt a less hands on strategy temporarily for the purposes of his \"mental equilibrium.\" Later that day, the vigilante was listening to a transmission from Hera Syndulla to the rebel ship Volt Cobra, which had been shot down at the Imperial wreckage-prison Accresker Jail while hunting Aphra, who had been imprisoned there. Posla noticed a reference to Aphra from Syndulla and logged it, hoping to chase up on Aphra after taking care of Evazan. At that time, 0-0-0 was listening in from a captured touring ship he had hijacked and, as he was very keen on finding Aphra, he began repeating the bounty hunter's statement on the Aphra reference.\nMeanwhile, Aphra was seeking a way off of Accresker Jail, accompanied by some others including Tolvan and Cornelius Evazan himself. Evazan, though, was using a Pluripleq, a shape-shifting creature he had stolen from Thannt, to pretend to be a shape-shifting alien named \"Lopset Yas.\" Posla was soon contacted by Aphra, who demanded a rescue from Accresker Jail and Posla's word that he would not kill her. The vigilante called her delusional and assured her that she would be brough to justice once he had finished hunting Evazan. However, Aphra then showed him Evazan, who had pretended to his cohorts that he was shape-shifting into a fake Evazan, at knife point, convincing the vigilante to reluctantly accept her deal. The rogue archaeologist told Posla her location and left the comm channel. 0-0-0, who was still spying through the systems Posla's ship, also made haste for the prison in order to pursue Aphra.\nPosla traveled to Accresker Jail with an escape shuttle to trade with Aphra for Evazan. The prison at hand was decommissioned and on a crash course towards the Mid Rim planet Tiferep Major as an example for its rebellious population. The vigilante found Accresker's prison-tug crashed into the prison and he flew into the hanger of the wrecked cruiser. There, Aphra and Tolvan awaited him, having frozen Evazan in a cube of ice using a coolant grille. As Posla arrived, he was also detected by some of the infectious fungus known as gundravian hookspores, which had acquired on the heroism personality and Force-sensitivity of a long dead Jedi and was searching for a new justice-orientated host.\nAfter disembarking, Posla inspected the frozen Evazan and confirmed him to be alive. As he grappled the ice chunk with his clamps, Aphra asked if they were even, to which he asked her if she had killed Caysin Bog. The rogue archaeologist asked him if it would change the terms of the deal, and the bounty hunter assured her that if she had killed Bog, he would pursue her punishment once their deal was done. As he said that, the gundravian hookspores approached him in an attempt to merge with the vigilante, only for Tolvan to activate the coolant grille and freeze them. Posla was confused at what the new arrival was, Aphra admitting that it had been a weird few days for her and advising him to get going. The bounty hunter thus left on his ship with the frozen Evazan.\nAs he departed Accresker Jail, Posla voiced his triumph for Bog, aspiring to return to Milvayne. He then looked back at the frozen Evazan, wondering whether Aphra could have tricked him. His doubts on the legitimacy of his prize led to him diverting his ship's power to the heating array so that the ice chunk melted. Once free from the ice, Evazan pretended to be \"Lopset Yas,\" revealing to Posla that he had been lied to by Aphra. The vigilante was furious, not realizing that the Evazan was in fact legitimate, and decided to return to Accresker Jail to deal with Aphra.\nMeanwhile, Aphra and Tolvan were still stranded on the Accresker Jail as 0-0-0 had arrived and shot down the escape shuttle. The Sith Lord Darth Vader had also arrived and stopped the wreckage-prison's collision course with his ship's tractor beam so he could find Aphra and Tolvan. After he and Posla spotted the wrecked escape shuttle, \"Yas\" used the head of Dek-Nil, which had been strapped onto his back prior to his freezing, to help the vigilante track down Aphra. They soon found her watching a live holovid of Vader interrogating Tolvan. After \"Yas\" greeted a confused, Posla stepped out and pointed his blaster at her. Aphra tried to confront him with an ancient lightsaber, but it deactivated due to its age. Posla remarked on the irony of the situation when 0-0-0 attacked him from behind. The vigilante was caught off guard and slaughtered by the assassin droid.\nAfter killing Posla, 0-0-0 captured Aphra and dragged her towards his ship, only to find it wrecked by Vader. \"Yas\" then intervened and incapacitated both the assassin droid and Aphra, taking them aboard Posla's ship and escaping Accresker Jail before Vader's ship released it from its tractor beam and sent it crashing into Tiferep Major. There, he removed a proximity bomb implanted in his throat and planted it into 0-0-0, linking it to one planted in Aphra so that the pair could not go twenty meters apart. When Aphra awoke, \"Yas\" revealed himself to be Cornelius Evazan wearing a Pluripleq and informed her of the situation, leaving the rogue archaeologist and the soon-to-be reactivated 0-0-0 on the late Posla's ship.\nAlthough it had been aboard Accresker Jail when it had crashed, Posla's body was left relatively intact, and remained floating in space within the wreckage. Remnants of the hookspores, riddled with Force energy, located Posla, surrounding his corpse and possessing it. The Force-sensitive fungus revived the vigilante, as well as giving him its Force abilities. Posla then rebuilt 0-0-0's fallen comrade, the astromech assassin droid BT-1 and controlled him with a restraining bolt. Wanting to bring justice to Aphra, undead bounty hunter then used BT-1 to locate his murderer 0-0-0's transponder signal in the hopes of finding her with him.\n0-0-0's transponder signal led Posla back to Milvayne, where the assassin droid and Aphra had gone to get their proximity bombs removed. As Posla searched for his enemy, having attained an ordinance weapon and a jetpack, he found Aphra and 0-0-0 riding on a qaberworm through Milvayne's undercity with the scavenger Vulaada Klam. The vigilante attacked them, shooting at the qaberworm with the ordnance weapon, knocking off its riders. Aphra questioned how he was alive, Posla proclaiming that the Force and justice could never perish. Posla used the Force to pull Aphra's blaster from her hands. 0-0-0 then confronted him, the undead bounty hunter bringing up how he tracked down the droid. BT-1 entered the confrontation at that time, whom the vigilante ordered to kill Aphra and 0-0-0.\nAlthough 0-0-0 tried to negotiate with his old companion BT-1, the latter droid fire on the former and Aphra. As the pair fled BT-1, Posla used the Force to pull them towards him. That was when the Trandoshan hunter Nokk attacked, impaling the vigilante from behind with his Vr'gedian tranquilizer harpoon. Posla was left lifeless kneeling on the ground, the hookspores within him subdued. Nokk and her husband and fellow hunter Winloss then confronted Aphra, their target, but were attacked by BT-1. The wedded hunters shot their attacker with an ion-net while Aphra and 0-0-0 escaped.\nAfter both parties were gone, the gundravian hookspores within Posla returned to consciousness and brough their host back to life. The vigilante found that BT-1 had been taken away by Winloss and Nokk. As well as this, Evazan had begun broadcasting a live feed from 0-0-0's eyes to the residents of Milvayne, encouraging them to help the Milvayne Authority catch Aphra and 0-0-0 for the reward of credits. Through his helmet, Posla them listened in on calls being sent to the law enforcement with claims about fugitive pair.\nPosla found a call sent by Vulaada Klam, who had survived the vigilante's attack was willing to cash in help the Milvayne Authority find the rogue archaeologist and assassin droid. The undead bounty hunter joined the Milvayne Authority forces heading to catch Aphra and 0-0-0, assuming a position among them. The police forces surrounded the fugitives as they traveled with Klam through the undercity on a bloatbarge. Posla demanded the pair to surrender, and Klam revealed her treachery, by incapacitating them for the Milvayne Authority.\nPosla joined the Milvayne Authority in taking Aphra and 0-0-0, both tied together, to be tried at a ledge above the undercity, at Milvayne City's upper levels. The senior officer declared the pair guilty of crimes to numerous to count and left the sentence to Posla as the arresting officer. The vigilante ordered that they be shot until \"profoundly dead\" and thrown into the underworld. As the undead bounty hunter ordered the Milvayne cops to take aim, Aphra argued about his legitimacy to tell the lawmen what to do. She told them that the vigilante was a deserter, one officer confirming from Posla's warrant number that he had been dishonorably discharged.\nPosla called his discharge a foolish detail, but the rogue archaeologist added that 0-0-0's eyes were still broadcasting to the world, questioning whether the cops wanted to be publicly outdone by a deserter. The Milvayne Authority officers thus turned their guns on the vigilante. Posla became enraged and unleashed his cybernetic arsenal. As the Milvayne cops fired on him, he activated his jetpack and began gunning down his new opponents. Aphra and 0-0-0 used the opportunity to get away.\nAphra and 0-0-0 were able to find BT-1 freed of his restraining bolt continued their quest to get their proximity bombs removed, Klam and her qaborworm returning to help them reach the cybersurgery of Professor Prexo in Milvayne City's South District Seven. Milvayne's local Imperial garrison was mobilized to intercept the fugitives, joined by members of the Milvayne Authority. The garrison commander's uncareful vetting of the forces deployed led to Posla joining the ranks of the attackers as they were engaged by BT-1. When the vigilante entered the fray, he told the garrison's stormtroopers to stand aside, knocking them away with his Force energy and cybernetic guns as he pledged to bring order.\nHowever, 0-0-0 flanked Posla once again, using his flamethrowing hand to set the undead bounty hunter alight. Taken by surprise, the vigilante fired with his blaster. The blaster shot sped towards Klam, only for Aphra to jump in front and take it. The sacrifice was watched by billions of Milvayne citizens, and many were suddenly motivated by the heroic action and went out to riot. Within minutes, crowds were riotig in the streets, Posla burning up as the mobs passed him.\nTam Posla was a Milvaynian human male with light skin. He was devoted to law and justice, loving his job in the Milvayne Authority and proudly wearing the uniform of the law enforcement agency even after he had been discharged. The rule of law was the guiding force of the his moral code, and even after parting from law enforcement, he was obedient to the exact wording of contracts. Posla put much dedication into tracking his targets, something that Bini considered a characteristic of the praised lawman. The vigilante, though, also held a \"pompous\" view of himself, liking to take charge of his associates in certain situations.\nPosla refused to kill those who he believed had not broken the law, allowing a running stormtrooper past him and refusing to fight the Chthonic worm god when he was ordered to do otherwise for his team's mission. He kept absolute self-control in that regard, choosing to keep a clean conscience even if it led to his death. He only broke his code when harm came to his partner, Bog, which would lead to him fighting Bog's attacker in a fit of rage. After fighting the worm god in that situation, he apologized for his behaviour calmly.\nPosla's personality was found favorible by the gundravian hookspores, which was seeking someone with a heroic personality like its former host, a long-dead Jedi. After the fungus merged with his corpse, the revived Posla's new hybrid personality considered the Force and justice to be synonymous, repeatedly citing them. When pursuing Aphra and 0-0-0 on Milvayne, the vigilante teamed with the Milvayne Authority again, believing that they both served justice alike. The undead bounty hunter, though, was quick to start killing them when they turned on him.\nDeeply affected by Cornelius Evazan's crimes, Posla made a personal challenge to bring the culprit to justice, which ultimately drove him insane. He came to passionately hate the criminal surgeon more than anyone else in the galaxy, calling him a monster and a sadist. His vendetta resulted in his disobeying orders and travelling beyond his jurisdiction to pursued the criminal surgeon. He continued the hunt despite losing his job and home and made changes to his career to keep going, pursuing mercenary work just to fund his obsession.\nPosla was insulted when Aphra complemented Evazan's cybernetic work on his partner, treating it as an additional reason to criticize her. When informants lied to him about Evazan, he chose to kill them, later reflecting that it was bad for his mental equilibrium. In maintaining his focus on the mission at hand, the vigilante harmed himself with a knife. Posla considered Evazan his top priority over bringing justice to others like Aphra, only agreeing to a deal with the rogue archaeologist when she offered Evazan himself as a trade.\nPosla fell in love with one of Evazan's victims, the cyborg humanoid male Caysin Bog. The pair shared the bearing of hunting Evazan, hoping that they could be at peace afterwards. Bog being attacked would also lead Posla to go against his code for his partner, leading Aphra to exploit his weakness and make the cyborg run to his death so that Posla would attack the Hivebase-1 prototypes. With Bog's death, Posla was left traumatized to fight after his fit of rage.\nAlthough Bog was gone, Posla acted like his partner was still there, referring to the cyborg in his mission log as if his late lover was in his ship's cockpit alongside him. When he acquired a frozen Evazan, the vigilante spoke for Bog, wishing that the cyborg could be there to see the completion of their mission. After coming to believe Aphra had been responsible, he swore to the rogue archaeologist that he would pursue her punishment with complete dedication if his suspicions were true.\nAfter beginning to serve Aphra, Posla found the rogue archaeologist to be a maniac and refused to go out of his way to help her as she was a criminal in his eyes. After she lied to him about their team's plan aboard the Lucrehulk Prime, Posla was enraged at her, claiming she had made him betray his honor. He even briefly attempted to quit from their job until rebel soldiers began firing at him. Posla continued to scorn Aphra for lying to him afterwards. On Hivebase-1, he told her that he would never take any of her orders when she pleaded for his assistance. The vigilante repeatedly called her \"villain\" or \"malefactor.\"\nAfter suspecting Aphra of killing Bog, Posla wished to inflict a slow death on the rogue archaeologist, making her his second from top priority. After being convinced she had given him a fake Evazan, the vigilante became determined to pursue Aphra, calling her heartless scum. After his revival, he continued to seek justice on the rogue archaeologist, confronting her multiple times on Milvayne until his fateful defeat at the hands of 0-0-0.\nPosla was a experienced in tracking, being able trace Evazan's activities to a number of locations, and also tracking down Aphra multiple times. His arsenal of cybernetic weapons gave him the power to take on groups of enemies at once, and face large enemies like the Chthonic worm god. However, Posla, both alive and undead, tended to allow the grip of his moral code cloud his awareness of his surroundings, allowing him to be attacked from behind on at least three occasions. After his destruction, Pitina Voor commented that the grip of his moral code made him lack good optics. Evazan also remarked after Posla's first death that if he had not been so angry that Aphra tried to trade a fake Evazan with him, he might have realized he had the real one all along.\nAfter his corpse was merged with the Force-sensitive gundravian hookspores, Posla became gained Force-sensitivity, and was able to use telekinesis on multiple individuals. When the Force energies ran rampant within the vigilante, it could repair his humanoid form and also push back individuals within his vicinity.\nTam Posla wore Milvayne Authority uniform, which concealed many of his traits, including his height, gender and species, from the average observer. He covered his face with a black and white colored helmet marked with symbols of the letters \"MA\" in a script that denoted his status as an officer of the Milvayne Authority. The helmet was equipped with an two audio receivers on the lower sides which used an integrated audio system that was sensitive enough to pick up frequencies beyond the human hearing range and boost the sound around him to listen to conversations and detect approaching enemies. The helmet also had a rangefinder on an agriculated stalk which had a targeting package which allowed him to track individuals, as well as a breathing kit that could allow him to survive in different atmospheres like that of Skako Minor without needing extra equipment.\nPosla wore a brown padded energy-dissipating blast tunic on his upper body with armor plates fitted on the shoulders and elbows. He also donned gray pants and brown gloves. Posla had webbing over his right shoulder with a utility belt. Both of these accessories carried survival gear and ammunition but he had a portable scanner in an electromagnetic radiation proof pouch on his belt. Posla kept his Imperial Peace-Keeping Certificate in a patch pocket on his pants, which he had with his at all times along with his bounty hunter credentials.\nWhile on Jedha he was armed with a black BlasTech Industries DL-17 blaster rifle modified with an extended magazine and equipped with a long strap. He also carried a BlasTech DH-17 blaster pistol which was also modified with an extended magazine, to counter a common problem with the weapon, and was set to full auto, meaning the pistol could burn through a standard clip in under twenty seconds. Following the infiltration of Hivebase-1, Posla eventually purchased a ship from the protocol droid, to assist him in his hunt for Evazan. When hunting Aphra and 0-0-0 on Milvayne, he utilized a large ordnance weapon and a jetpack.\nTam Posla had a vast array of cybernetics throughout his body, which he had added to him by his personal cyberneticist Rajam Nuss. His right eye had been replaced with a yellow robotic eye and the rear of his head was almost entirely robotic. The many features could be hidden under Posla's armor with his helmet being able to split to reveal a large gun out the top of his head and a laser on the side. Posla also had a gun in his other knee and could semi-detach his hands to show two more guns with blades coming out of his knuckles. Furthermore, Posla had several more guns embedded in his torso and a twin gun attached to his right thigh. Mobilizing his cybernetic weaponry ended up extensively damaging Posla's clothing during his time at Hivebase-1.\nTam Posla was created for Gareth Edwards' 2016 film Rogue One: A Star Wars Story. The character was portrayed by Matt Allsopp, a concept artist for the film. During production, the costume designer Glyn Dillon created the outfit of Posla for Allsopp, letting him pick the design before tweaking it to replicate the artist's interests of being a \"mysterious bounty hunter\" with a hidden face. Allsopp's initials were imprinted on Posla's helmet in \"Domabesh,\" a new script created for the film.\nThe artist attended a week of filming for Rogue One, during which he found difficulty seeing with the helmet on and tripped a few times. However, the scenes including Posla did not make the director's cut according to Allsopp, and footage of Posla was only shown in the initial teaser trailer. The outfit was also used for one of the Partisans, who was seen in multiple scenes unmasked. In one such scene, the extra is both seen masked and then unmasked in two consecutive shots which implied they were two different individuals.\nAlthough the character did not appear in the final film, Posla was given a name and backstory in the Star Wars: Rogue One: The Ultimate Visual Guide, a complementary reference book for Rogue One written by Pablo Hidalgo and released on the same day as the movie. The name Tam Posla was formed from the backwards variations of Allsopp's first and last name. Hidalgo also explained the artist's initials on the helmet canonically by creating the Milvayne Authority. The writer later added that his creation of Posla's backstory in the reference book stemmed from explaining the existence of the Decraniated, which also appeared in Rogue One.\nIssues 16, 17, 18, 19, 26 27, 28, 29, and 31 of Star Wars: Doctor Aphra—all written by Simon Spurrier, illustrated by Emilio Laiso and published respectively by Marvel Comics on January 31, February 21, March 28, April 25, November 14, and December 12 of 2018 and on January 30, February 27, and April 24 of 2019,—give an alternate depiction of Posla's helmet and clothing to how in events that are consecutive with those of issues 15 and 25—both written by Spurrier, illustrated by Laiso and Kev Walker respectively and published again by Marvel Comics on the respective dates of December 20 2017 and October 24 2018. Different details include his helmet being plain white with a large triangular visor shape and his tunic's padding being a pattern of triangles. This article's prose ignores the alternately depicted details presented by the listed issues.\nThe Helmets section of issue sixty-five of De Agostini's Star Wars Helmet Collection series, released in 2018, states that Posla's homeworld was the planet Kamino and his species was Milvaynian. The 2019 DK publishing reference book Ultimate Star Wars, New Edition, though, states that Posla's homeworld was Milvayne, Doctor Aphra 26 backing that fact, and also specifies that the lawman's species was human. Additionally, the issue \"Din Djarin and Other Bounty Hunters and Criminals\" from De Agostini's Star Wars Encyclopedia, published on August 3 of 2021. series called Posla a human and gave Milvaynian as his demonym. This article therefore ignores the information from Star Wars Helmet Collection.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tam",
  "/wiki/Special:Upload",
  "/wiki/Milvayne",
  "/wiki/3_ABY",
  "/wiki/Accresker_Jail",
  "/wiki/Tiferep_Major",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Milvayne_Authority",
  "/wiki/Son-tuul_Pride",
  "/wiki/Milvaynian",
  "/wiki/Planet",
  "/wiki/Police_officer",
  "/wiki/Law_enforcement_agency",
  "/wiki/Surgeon",
  "/wiki/Cornelius_Evazan",
  "/wiki/Ponda_Baba",
  "/wiki/Bounty_hunter",
  "/wiki/Tam_Posla%27s_superior_officer",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Cyborg",
  "/wiki/Caysin_Bog",
  "/wiki/Mercenary",
  "/wiki/Archaeologist",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Infiltration_of_Hivebase-1",
  "/wiki/Hivebase-1",
  "/wiki/Death",
  "/wiki/Magna_Tolvan",
  "/wiki/Wreckage-prison",
  "/wiki/Unidentified_shuttle_(Tam_Posla)",
  "/wiki/Water",
  "/wiki/Changeling",
  "/wiki/Pluripleq",
  "/wiki/Assassin_droid",
  "/wiki/0-0-0",
  "/wiki/Force-sensitive",
  "/wiki/Gundravian_hookspore",
  "/wiki/The_Force",
  "/wiki/Chase_on_Milvayne",
  "/wiki/Garrison",
  "/wiki/Homeworld",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Cybernetics",
  "/wiki/Cyberneticist",
  "/wiki/Rajam_Nuss",
  "/wiki/10_BBY",
  "/wiki/The_Lodge",
  "/wiki/Mountain",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Vandor",
  "/wiki/Standard_year",
  "/wiki/Crimson_Dawn",
  "/wiki/Lieutenant",
  "/wiki/Qi%27ra",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Sabacc",
  "/wiki/Smuggler",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Gambler",
  "/wiki/Azumel",
  "/wiki/Argus_Panox",
  "/wiki/Starship",
  "/wiki/0_BBY",
  "/wiki/Slavery",
  "/wiki/Doctor",
  "/wiki/Jedha_City",
  "/wiki/Jedha_insurgency",
  "/wiki/Decraniated",
  "/wiki/Imperial_Peace-Keeping_Certificate",
  "/wiki/Tythoni_Square",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Stormtrooper",
  "/wiki/TX-225_GAVw_%22Occupier%22_combat_assault_tank",
  "/wiki/Partisans",
  "/wiki/Battle_on_Jedha",
  "/wiki/Project_Stardust",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Standard_second",
  "/wiki/City",
  "/wiki/Destruction_of_Jedha_City",
  "/wiki/Standard_hour",
  "/wiki/Rexa_Go",
  "/wiki/Rabael_Dir_Glorio",
  "/wiki/Skakoan",
  "/wiki/Hallio_Bas",
  "/wiki/Droideka",
  "/wiki/Dek-Nil",
  "/wiki/Xexto",
  "/wiki/Assassin",
  "/wiki/Sister_Six",
  "/wiki/Defel",
  "/wiki/Glahst_Ombra",
  "/wiki/LAAT/le_patrol_gunship",
  "/wiki/Son-tuul_Spaceport",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Son-tuul",
  "/wiki/Aug_scanner",
  "/wiki/Spaceport",
  "/wiki/Skako_Minor",
  "/wiki/Mission_to_Skako_Minor_(Son-tuul_Pride)",
  "/wiki/Wat_Tambor%27s_workshop",
  "/wiki/Techno_Union",
  "/wiki/Foreman",
  "/wiki/Wat_Tambor",
  "/wiki/Fungus",
  "/wiki/Forest",
  "/wiki/Imperial_officer",
  "/wiki/Tooka",
  "/wiki/Flufto",
  "/wiki/Trooper",
  "/wiki/Soldier",
  "/wiki/Techno-totem",
  "/wiki/Delta-class_T-3c_shuttle",
  "/wiki/Lieutenant-Inspector",
  "/wiki/Shuttle",
  "/wiki/Chthonic_worm_god",
  "/wiki/Tarkin_Initiative",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Lucrehulk_Prime",
  "/wiki/Rebel_pilot",
  "/wiki/Alliance_officer",
  "/wiki/Bini",
  "/wiki/Bridge_(starship)",
  "/wiki/Hera_Syndulla",
  "/wiki/General",
  "/wiki/Blaster",
  "/wiki/Stun",
  "/wiki/Holotransmitter",
  "/wiki/Scaraphyte",
  "/wiki/Commander",
  "/wiki/Yewl",
  "/wiki/Tractor_beam",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Posla%27s_ship",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Tatooine",
  "/wiki/Biofarm",
  "/wiki/Thannt",
  "/wiki/Information_broker",
  "/wiki/Unidentified_informant_(Tam_Posla)",
  "/wiki/Volt_Cobra",
  "/wiki/Prison",
  "/wiki/Touring_ship",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Prison-tug",
  "/wiki/Cruiser",
  "/wiki/Coolant_grille",
  "/wiki/Unidentified_Jedi_(Accresker_Jail)",
  "/wiki/Heating_array",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Executor",
  "/wiki/Holovid",
  "/wiki/Lightsaber",
  "/wiki/Proximity_bomb",
  "/wiki/Meter",
  "/wiki/Astromech_droid",
  "/wiki/BT-1",
  "/wiki/Restraining_bolt",
  "/wiki/Jetpack",
  "/wiki/Qaberworm",
  "/wiki/Underworld_(Milvayne)",
  "/wiki/Scavenger",
  "/wiki/Vulaada_Klam",
  "/wiki/Telekinesis",
  "/wiki/Trandoshan",
  "/wiki/Hunter",
  "/wiki/Nokk",
  "/wiki/Vr%27gedian_tranquilizer_harpoon",
  "/wiki/Marriage",
  "/wiki/Winloss",
  "/wiki/Ion-net",
  "/wiki/Credit",
  "/wiki/Helmet",
  "/wiki/Bloatbarge",
  "/wiki/Milvayne_City",
  "/wiki/Unidentified_senior_Milvayne_Authority_officer",
  "/wiki/Cybersurgery",
  "/wiki/Professor",
  "/wiki/Prexo",
  "/wiki/South_District_Seven",
  "/wiki/Standard_minute",
  "/wiki/The_galaxy",
  "/wiki/Knife",
  "/wiki/Humanoid",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Unidentified_Aurebesh_script_(Jedha)",
  "/wiki/Atmosphere",
  "/wiki/Glove",
  "/wiki/Portable_scanner",
  "/wiki/Electromagnetic_radiation",
  "/wiki/BlasTech_Industries",
  "/wiki/DL-17_blaster_rifle",
  "/wiki/DH-17_blaster_pistol",
  "/wiki/Protocol_droid",
  "/wiki/Gareth_Edwards",
  "/wiki/2016",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Matt_Allsopp",
  "/wiki/Glyn_Dillon",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Tuckerization",
  "/wiki/Doctor_Aphra_(2016)_16",
  "/wiki/Doctor_Aphra_(2016)_17",
  "/wiki/Doctor_Aphra_(2016)_18",
  "/wiki/Doctor_Aphra_(2016)_19",
  "/wiki/Doctor_Aphra_(2016)_26",
  "/wiki/Doctor_Aphra_(2016)_27",
  "/wiki/Doctor_Aphra_(2016)_28",
  "/wiki/Doctor_Aphra_(2016)_29",
  "/wiki/Doctor_Aphra_(2016)_31",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Simon_Spurrier",
  "/wiki/Emilio_Laiso",
  "/wiki/Marvel_Comics",
  "/wiki/January_31",
  "/wiki/February_21",
  "/wiki/March_28",
  "/wiki/April_25",
  "/wiki/November_14",
  "/wiki/December_12",
  "/wiki/2018",
  "/wiki/January_30",
  "/wiki/February_27",
  "/wiki/April_24",
  "/wiki/2019",
  "/wiki/Doctor_Aphra_(2016)_15",
  "/wiki/Doctor_Aphra_(2016)_25",
  "/wiki/Kev_Walker",
  "/wiki/December_20",
  "/wiki/2017",
  "/wiki/October_24",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Kamino",
  "/wiki/Species",
  "/wiki/Dorling_Kindersley",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/August_3",
  "/wiki/2021",
  "/wiki/Category:Images_of_Tam_Posla",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Rogue_One_Adaptation_2",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_23",
  "/wiki/Doctor_Aphra_(2016)_24",
  "/wiki/Doctor_Aphra_(2016)_30",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_67",
  "/wiki/Databank_A-Z",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Databank_(website)",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth",
  "/wiki/Battle_of_Yavin",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Dryden_Vos",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Darth_Vader_(2015)_7",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_Art_of_Rogue_One:_A_Star_Wars_Story",
  "/wiki/May_30",
  "/wiki/January_4",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia"
 ]
}