{
 "name": "Tamo_Lan",
 "display_name": "Tamo Lan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Carosi XII"
     ]
    },
    {
     "name": "Born",
     "values": [
      "28 BBY–24 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Carosite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Shroud Team",
      "Shroud Team"
     ]
    }
   ]
  }
 ],
 "content": "Tamo Lan was a male Carosite field medic who served with the Alliance to Restore the Republic during the Galactic Civil War. After leaving his homeworld, Carosi XII, following an incident that involved him killing a slaver who threatened one of his patients, Lan joined the Alliance and served on the planet Baes Logia and the moon Yavin 4 before being selected to join Shroud Team, an all-alien unit of Foster Agents led by Jin lieutenant Dutra Zeneta. Foster Agents were responsible for returning stranded field agents to the Alliance, and Shroud Team operated out of Corint City on the planet Pirik. Lan served as the team's medic, while also training the Aqualish female Gondara—the sister of his deceased best friend, Karlon—to be his assistant.\nTamo Lan, a Carosite male, was born on the planet Carosi XII between 28 BBY and 24 BBY. Like all Carosites, he had a natural affinity for the healing arts, and trained as a field medic. Lan also harbored the desire to leave his homeworld and join the Alliance to Restore the Republic in its struggle against the Galactic Empire. One day, Lan encountered a Twi'lek slaver who threatened one of the Carosite's patients. The medic protected his ward, but to do so, he had to kill the slaver. While Lan was not banished from Carosi XII for his actions, he knew that it was in his own best interests if he left. The Carosite followed his desire and joined the Alliance sometime before 0 BBY, serving as a medic.\nLan served throughout the Alliance, including the campaign on the planet Baes Logia and as part of the personnel staffing Headquarters Base on the moon Yavin 4 a little while prior to the destruction of the first Death Star. During his time with the Alliance, Lan met an Aqualish male, Karlon, and the two became best friends. Sometime after the Battle of Yavin, the Jin lieutenant Dutra Zeneta selected Lan to be part of Shroud Team, a unit of all-alien Foster Agents based out of Corint City on the planet Pirik in the Divis Arm. Shroud Team's composition of non-Human operatives allowed them to blend into the population of Corint City effectively, as only 5 percent of the city's 10 million residents were Human. Operating as a Foster Agent was a dangerous role within the Alliance; they were responsible for returning stranded operatives—known as \"orphans\"—to the Alliance. Foster Agent names and locations were well-known to field operatives, which placed the Agents at risk if their potential charges were ever captured and interrogated.\nLan, code-named \"Shroud Four,\" was the team's medic and was often called upon to treat the injuries of both the members of Shroud Team and the various operatives who came into the unit's care. Sometime after 0 ABY, his friend Karlon was killed by Imperial forces on the planet Bresnia. Lan took charge of his friend's seventeen-year-old sister, Gondara—who had been living on an Alliance safe world while her brother fought for the Rebellion—and began training her as his assistant.\nTamo Lan possessed dark brown fur and had small, dark eyes. Like all Carosites, Lan held an optimistic outlook on life. However, his experiences with the Alliance during the Galactic Civil War dulled his optimism, and while he still had a positive disposition, it was tempered by observing the tyranny of the Empire and the horrors of war firsthand. A dedicated professional, Lan possessed the medical aptitude present in all Carosites. He was also extremely protective of his patients, the helpless and the young, and his ward, Gondara.\nA skilled and highly competent medic, Lan was trained in first-aid techniques and advanced medicine. He was knowledgeable about various alien species and their cultures and languages, and was a personable individual, able to bargain or persuade others to achieve his goals. The Carosite's technical skills allowed him to operate communications and sensor equipment, interface with security systems, and repair and program computers. Lan could also program droids, with a specialization in working with 2-1B surgical droids. He was capable of plotting courses through hyperspace and was trained to drive and repair repulsorlift vehicles. Despite being a medic, Lan was trained to use a blaster, was competent at melee and unarmed combat, and was trained in urban survival techniques.\nTamo Lan generally armed himself with a heavy blaster pistol, along with a knife. In addition to his weapons, he carried a comlink, a datapad, a diagnostic computer, and three medpacs.\nTamo Lan was first featured in \"Cracken's Rebel Operatives,\" a series of articles published in issues of West End Games' Star Wars Adventure Journal. Lan was featured in issue 10's article, released in 1996. It was written by C. Robert Carey and featured a black-and-white illustration of the Carosite by Kathy Burdette.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Carosi_XII",
  "/wiki/28_BBY/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Carosite",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Shroud_Team",
  "/wiki/Medic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Death/Legends",
  "/wiki/Unidentified_Twi%27lek_slaver",
  "/wiki/Unidentified_patient_(Carosi_XII)",
  "/wiki/Planet/Legends",
  "/wiki/Baes_Logia",
  "/wiki/Moon/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Foster_Agent",
  "/wiki/Jin",
  "/wiki/Lieutenant/Legends",
  "/wiki/Dutra_Zeneta",
  "/wiki/Corint_City",
  "/wiki/Pirik",
  "/wiki/Aqualish/Legends",
  "/wiki/Gondara",
  "/wiki/Karlon",
  "/wiki/Reproduction/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Baes_Logia_campaign",
  "/wiki/Great_Temple/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Time/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Divis_Arm",
  "/wiki/Human/Legends",
  "/wiki/Operative",
  "/wiki/City/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Battle_of_Bresnia",
  "/wiki/Bresnia",
  "/wiki/Standard_year/Legends",
  "/wiki/Safe_world/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Species/Legends",
  "/wiki/Language/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/2-1B_surgical_droid",
  "/wiki/Astrogation/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Medical_diagnostic_computer",
  "/wiki/Medpac/Legends",
  "/wiki/Cracken%27s_Rebel_Operatives_(article)",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/1996",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Kathy_Burdette",
  "/wiki/4_ABY/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/Dheendo",
  "/wiki/Thilis-Brin"
 ]
}