{
 "name": "Tana_Chellaine",
 "display_name": "Tana Chellaine",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Nashtah Squadron",
      "Nashtah Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Tana Chellaine was a female human who flew as a TIE fighter pilot for the Galactic Empire around the time of the Battle of Yavin. She flew in the Imperial Army's Nashtah Squadron, which participated in a battle on the planet Portocari where they lost three squad members. Sometime after the battle, Chellaine and the other surviving members of Nashtah Squadron drank together at the Zero Angle, a bar in the Bright Jewel Oversector Flight Base. There, Chellaine unsuccessfully tried to prevent some of her squadmates from getting into a bar fight with Imperial Navy pilots before the bar was informed by Commander Weller that the Death Star had been destroyed.\nThe human female Tana Chellaine served the Galactic Empire as a pilot during the Galactic Civil War against the Alliance to Restore the Republic. During the war, Chellaine flew a TIE/ln space superiority starfighter in Nashtah Squadron, a squadron of pilots in the Imperial Army who flew missions within planetary atmospheres. Around the time of the Battle of Yavin, she and her squadron were sent to the planet Portocari where they were sent to bomb Rebel artillery in the planet's hills before being reassigned to bomb an urban safehouse, which the squad were told would prevent the need for door-door fighting and civilian casualties. During the ensuing battle, Chellaine's squad-mate Muller was shot down by an anti-aircraft missile, while another named Barsay was killed by Z-95 Headhunters.\nUpon bombing the safehouse, the squadron discovered it was full of munitions, which exploded and killed two more of Chellaine's comrades, Chan and Riggs. After the battle, the surviving members of the squadron traveled to the Bright Jewel Oversector Flight Base on the moon Axxila III. There, Muller was taken to be treated in bacta while Chellaine and the other surviving members of her squadron  where debriefed. The group five then met for drinks in the Zero Angle, a bar in the flight base.\nAfter becoming intoxicated, Trompo began singing a ground-hog anthem in an attempt to antagonize a group of Imperial Navy pilots also in the bar. Chellaine warned her squad-mate to stop, as the singing had drawn the attention of Florn, the bar's bartender, but Trombo continued and was joined by Olvar. Hastur then interrupted the pair and forced them to sit down. Essada tried to discuss the events on Portocari with the group, but Hastur shot down the topic of discussion and Trombo began singing again, this time successfully rallying other Army pilots in the bar to join in. The Zero Angle's navy patrons quickly retaliated with their own anthem, and a fight quickly broke out between the two groups. Chellaine stayed out of the brawl, but when a navy pilot stumbled into her and caused some of her drink to fly in the air, she was able to catch the water back in her cup and then kick the navy pilot back into the fight.\nChellaine then spotted Lightning, Florn's astromech droid coming out from behind the bar and warned her colleagues before covering her ears, as to not be affected by the sonic emitter the droid used to disrupt the bar fight. Florn then had the droid shock Trompo before giving a speech to his patrons telling them not to fight each other. The bartender's talk drew Chellaine's attention to the gallery of holograms above the bar depicting pilots who had died in combat. She pointed out Suthers and Plix to her squad-mates, who then began talking with Heiwei Akrone, a navy pilot who had mutual friends on the wall with Hastur. Florn then told the Nashtahs and Akrone's squad, Banshee Squadron to sit together since a table had been broken in the fight. The groups grudgingly obliged and Akrone and Hastur ordered all of the pilots a round of drinks.\nThe two squadrons began discussing their most recent missions and the casualties they had taken, with Essada claiming something major had happened which had put the Empire on the offensive, leading to missions with low quality intel and causing casualties like those suffered on Portocari. Akrone and his squad-mate Bruiser confirmed they had heard similar reports, before Imperial Commander Weller entered the bar and greeted Florn. He then informed the room that the Death Star had been destroyed by the Rebellion, meaning the fleet was on full alert and the army or navy affiliation of all pilots in the bar was rescinded immediately, ordering them to the quarters for assignment to new squadrons. Before Chellaine left, she spoke with Florn about the many casualties the aftermath of the Death Star's destruction would cause.\nTana Chellaine had dark skin, brown eyes and black hair. She never drank anything stronger than distilled water, and as a result was able to keep her uniform immaculate while at the Zero Angle. She was able to judge how long the bar's other occupants had been drinking based on the states of their tunics. When she believed Huck Trombo was about to pass out after drinking to much alcohol, Chellaine could not decide if she should stop him falling or not, but decided she would not have when he claimed the Navy pilots would of enjoyed his singing. Chellaine believed Essada was right annoyingly often. She assumed that the Death Star was a codename for a coordinated fire-control technology to be used among fleet units, and was shocked to learn that it had been destroyed.\nChellaine wore an olive-green tunic when off-duty at the Zero Angle.\nTana Chellaine was created by Jason Fry for the short story \"Last Call at the Zero Angle\" which was published in Star Wars Insider 156 in 2015. An illustration of Nashtah Squadron by John Van Fleet's was included in the story, but which pilot was which was not clarified in the Insider. Fry later confirmed the identity of each character in the illustration on Twitter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Nashtah_Squadron",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Battle_of_Yavin",
  "/wiki/Imperial_Army",
  "/wiki/Battle_of_Portocari",
  "/wiki/Planet",
  "/wiki/Portocari",
  "/wiki/Zero_Angle",
  "/wiki/Bright_Jewel_Oversector_Flight_Base",
  "/wiki/Imperial_Navy",
  "/wiki/Pilot",
  "/wiki/Commander",
  "/wiki/Weller_(commander)",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Muller",
  "/wiki/Barsay",
  "/wiki/Death",
  "/wiki/Z-95_Headhunter",
  "/wiki/Chan_(individual)",
  "/wiki/Riggs",
  "/wiki/Moon",
  "/wiki/Axxila_III",
  "/wiki/Bacta",
  "/wiki/Sully_Olvar",
  "/wiki/Huck_Trompo",
  "/wiki/Artur_Essada",
  "/wiki/Sax_Hastur",
  "/wiki/Ground-hog_anthem",
  "/wiki/Florn_(individual)",
  "/wiki/Bartender",
  "/wiki/Vac-Head_anthem",
  "/wiki/Lightning",
  "/wiki/Astromech_droid",
  "/wiki/Ear",
  "/wiki/Sonic_emitter",
  "/wiki/Droid",
  "/wiki/Hologram",
  "/wiki/Suthers",
  "/wiki/Plix",
  "/wiki/Heiwei_Akrone",
  "/wiki/Banshee_Squadron",
  "/wiki/Bruiser_(individual)",
  "/wiki/Weller",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Water",
  "/wiki/Jason_Fry",
  "/wiki/Last_Call_at_the_Zero_Angle",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/2015",
  "/wiki/John_Van_Fleet",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/File:Jason_Fry_Last_Call_at_the_Zero_Angle_tweet.png"
 ]
}