{
 "name": "Tanbris",
 "display_name": "Tanbris",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star I",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Starfighter Corps",
      "Imperial Navy",
      "Imperial Starfighter Corps",
      "Imperial Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Tanbris was a male Human who served Palpatine's Galactic Empire at the time of the Galactic Civil War. A capable TIE Fighter pilot, he reached the rank of lieutenant, but was grounded after an injury. By 0 BBY, Tanbris was a tactical officer aboard the first Death Star as part of Darth Vader's personal crew. He was killed that same year when the Death Star was destroyed by Luke Skywalker, a pilot of the Rebel Alliance.\nA Human male, Tanbris joined the Imperial Military, the armed forces of Emperor Palpatine's New Order, in which he became a TIE/LN starfighter pilot and attained the rank of lieutenant. At some point during his Imperial service, Tanbris came to work with Thul Fain, who later left the Empire and became a smuggler for the Hutt crime lord Jabba Desilijic Tiure. Tanbris' promising career as a fighter pilot was ruined when he was injured. Following the accident, he was grounded and got reoriented, becoming a tactical officer.\nBy the year 0 BBY, Lieutenant Tanbris served aboard the first Death Star, a deep-space mobile battlestation built by the Empire to destroy entire worlds with a single superlaser shot. He was made a crew officer of the Emperor's right-hand man Darth Vader, answering directly to his orders. When the Rebel Alliance launched an attack on the station, Tanbris rushed to Darth Vader in the corridor of the Death Star's command center, informing him that the enemy ships were too small to be shot down by the meridian trench's turbolaser towers. After being so ordered by Vader, the lieutenant had Black Squadron, a unit of elite fliers, get to their fighters so they could shoot the Rebels one by one. A few moments later, the Rebel pilot Luke Skywalker fired proton torpedoes in the the trench's exhaust vent, triggering a chain reaction that propagated to the Death Star's core. The battlestation exploded, and Tanbris was among those killed from the explosion.\nThroughout his military career, Tanbris had emerged as a capable pilot and skilled officer. He had brown hair and blue eyes.\nWhile serving aboard the Death Star, Tanbris wore the black variant of the Imperial officer's uniform.\nTanbris first appeared in Star Wars: Episode IV A New Hope, the first movie of the Star Wars original trilogy. Although he was not credited, stuntman Andy Bradford played the character according to the fan website Dahoov's Autograph Collecting. The lieutenant went unnamed in the film itself and was referred to as one Vader's \"astro-officers\" in the script. Tanbris was first identified in the Premiere Limited set of the Star Wars Customizable Card Game.\nTanbris was present in most adaptations of Star Wars Episode IV, including the 1977 novelization—in which he was referred to as a \"a harried Commander\"— and Marvel comic book, as well as the 1997 adaptation by Dark Horse Comics. In the 1977 comic book, the lieutenant was depicted with blond hair and wearing an olive green tunic with a tan officer cap.\nA string in Star Wars: Empire at War: Forces of Corruption has TEXT_UNIT_TIE_TANBRIS as the string's name, with TIE Advanced X-2 as the data in the string; however no unit uses this string, and there is no TEXT_TOOLTIP string to go with it as its description as there is for all other units. This suggests that Tanbris was to pilot a TIE Advanced x2 starfighter in the game, but was canceled early on, and its name string was left in.\nIn 2008, Tanbris received his own entry in The Complete Star Wars Encyclopedia. He was also mentioned in Thul Fain's entry, although oddly misspelled as \"Trabinis.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Yavin_system/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Starfighter_Corps_(Galactic_Empire)",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Pilot/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Tactical_officer/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Thul_Fain",
  "/wiki/Smuggler/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Battlestation",
  "/wiki/Planet/Legends",
  "/wiki/Superlaser/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Meridian_trench/Legends",
  "/wiki/Black_Squadron_(Galactic_Empire)/Legends",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Thermal_exhaust_port/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Original_trilogy",
  "/wiki/Andy_Bradford",
  "/wiki/Premiere_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Commander/Legends",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(1977)_6",
  "/wiki/1997",
  "/wiki/Star_Wars:_A_New_Hope_-_The_Special_Edition_4",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption",
  "/wiki/TIE/x2_starfighter",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Death_Star_(novel)",
  "/wiki/Star_Wars_Manga:_A_New_Hope_4",
  "/wiki/Star_Wars:_A_New_Hope_(Cine-Manga)",
  "/wiki/The_Star_Wars_Storybook",
  "/wiki/Star_Wars:_Rogue_Squadron_II:_Rogue_Leader",
  "/wiki/Canon",
  "/wiki/Star_Wars:_Empire_at_War",
  "/wiki/The_Rise_and_Fall_of_Darth_Vader",
  "/wiki/The_Art_of_Star_Wars_Episode_IV:_A_New_Hope",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_1",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/A_New_Hope_(TCG)",
  "/wiki/Star_Wars_in_100_Scenes",
  "/wiki/Imperial_Sourcebook",
  "/wiki/April_27",
  "/wiki/2019"
 ]
}