{
 "name": "Tanivos_Exantor_Divo",
 "display_name": "Tanivos Exantor Divo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Divo family",
      "Galactic Republic",
      "Federal District Police Academy",
      "Coruscant Security Force",
      "Federal District Police Academy",
      "Coruscant Security Force",
      "Galactic Empire",
      "Coruscant Security Force",
      "Coruscant Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Tanivos Exantor Divo, more commonly known as Tan Divo, was a human male police inspector who served as a lieutenant in the Coruscant Security Force during the final decades of the Galactic Republic and in the early years of the Galactic Empire. With a rigid sense of justice, Divo sought to eradicate the crime that ran rampant on Coruscant, the capital of the Republic. Divo fought an uphill battle against the political and criminal elite of Coruscant to achieve his goals and, over the course of his long and storied career, he looked to unearth large criminal operations through smaller cases. Though sometimes pompous and overconfident in his abilities, he firmly believed in his work and strived to keep Coruscant safe.\nDivo's difficult childhood surrounded by crime on Coruscant left him with a rigid sense of justice, and he rose to become a detective in the CSF. Divo served for many years and fought an uphill battle against the Republic's elite to establish justice on his homeworld. The many roadblocks in his career culminated in the pan-galactic Clone Wars, when he was forced to leave many of his long-built cases against the galaxy's crime syndicates unfinished as they became impeded by the conflict. On numerous occasions, his work was overrun when he clashed with Republic officials and the Jedi Order, with whom he had a long-documented distrust. Though the war greatly fatigued him and left him disillusioned with the Republic, Divo's extensive monitoring and steadfast commitment to justice kept larger criminal groups from spreading on Coruscant.\nAfter the end of the Clone Wars, Divo served the successor to the Republic, the Galactic Empire, for a few years before retiring. His daughter, Andressa Divo, continued the family legacy of law enforcement by joining the Imperial Security Bureau. Divo's relationship with his daughter became strained as the Empire's totalitarian state became more apparent, with Divo in opposition to the New Order's lack of restraint and abuse of power. On the last day Tanivos and Andressa spoke, the Empire unveiled their new Death Star superweapon, which they used to destroy the rebellious planet Alderaan. Divo was on Alderaan when it was destroyed, and he was killed with the billions of others on the planet. Andressa later turned from the ideology of the Empire, and her son, Exantor, would carry on the family tradition as the police commissioner on Hosnian Prime after the fall of the Empire.\nTanivos Exantor Divo was born on Level 3215 of Coruscant, a planet in the Core Worlds and the capital of the Galactic Republic. Level 3215 was far from the sunlit surface of Coruscant but was higher than many of the more dangerous levels of the ecumenopolis. Divo came from a lineage that had been involved in law enforcement for fourteen generations. As a child, he and his family lived in Gavas-Eclat, a neighborhood filled with reduced-capacity industrial areas and lower-class apartment complexes. The working-class nature of Gavas-Eclat drew criminals to the area who were looking to shake down the hardworking denizens for what little they had.\nThe young Tan Divo's father was among many of the workers who were forced to pay their hard-earned credits to thugs, and watching his family suffer under the crime rampant on Level 3215 instilled the boy with a rigid sense of justice and fairness. Divo dedicated his life to ending the injustice pervading Coruscant and applied himself in his academic studies, eventually earning a scholarship to the Federal District Police Academy at age sixteen. His work paid off when he graduated as valedictorian. At his graduation ceremony, Divo gave a valedictory address to his fellow 4,500 newly-minted deputies, telling them that their job as law enforcement was not to see the worst in people but to keep the best safe.\nAfter graduating from the police academy, Divo started his career as a patrolman in the Coruscant Security Force and eventually rose to the position of Inspector with the rank of lieutenant. Divo championed sprawling reforms to how the police force conducted their investigations, suggesting that they create a network of information and coordination that would extend from the upper levels down to the beat cops who operated in the deepest levels of Coruscant. Divo's proposals were thwarted at every turn, however, by judges, lobbyists, and other politicians who all profited from the systems of crime and disinvestment in Coruscant's lower levels.\nDuring his early years, Divo's greatest opponent was Malastare Senator Aks Moe, who had a great deal of influence over the courts and politicians who curbed his reform attempts. Moe faulted Divo's police procedures for allowing narcotics from the deep levels of Coruscant into the halls of the Galactic Senate, and his accusations warranted a deposition hearing, where the outraged senator questioned Divo about his work. In contrast to the colorful Moe, Divo spoke flatly and to the point, stating that it was the complacency of the Republic which had bred the crime that ran throughout the capital. Divo changed his approach to police work thereafter, knowing that he wouldn't be able to achieve justice upstream with powerful and well-connected men like Moe in his way. By picking at small cases, Divo hoped to build larger ones against the crime lords that ran free on Coruscant and the politicians who did business with them.\nDivo had well-documented differences with the Jedi Order, a vaunted religious group that claimed to be the guardians of peace and justice. The Jedi, whose missions were appointed by the Senate, focused on issues of piracy, interplanetary disputes, and sovereignty but rarely focused any of their work on the crime on Coruscant. Divo felt that the law enforcement of Coruscant was alone in their struggle to bring justice to the planet, but found an ally in Jedi Master Quinlan Vos, the Jedi Order's interface with the local police. Vos demonstrated respect for the police and commiserated with them on the Republic's shortcomings, becoming a valuable source of intel and insight from the higher levels of Coruscant's society. Though he did not get along with the Jedi, Divo lauded Vos in his reports.\nDuring his career, Divo was involved in a series of cases relating to the Oba Diah-based Pyke Syndicate, a criminal organization specializing in the transport and distribution of the narcotic spice. A breakdown in cross-divisional cooperation helped the Pyke's business spread across Coruscant, where the scourge of spice addiction grew rampant in the undercity. Divo worked to uncover spice dens and Pyke business channels on the planet but found himself giving in to suspicion and stereotypes as he searched legitimate businesses run by Pykes not associated with the Oba Diah syndicate.\nDivo cased several Pyke domiciles and searched many Pyke-run restaurants and kitchens alleged to be secret spice dens, but in reality, had nothing to do with the Pyke Syndicate. Though Divo took no pleasure in doing so, his searching did yield some results. In 7942 C.R.C., following the capture and interrogation of a spice-addicted holo-star, the CSF learned of a spice den running out of a curio shop on Level 3321, in return for the star's name to be kept out of headlines. The Security Force sent surveillance probes to the shop, which confirmed the curio was a spice den run by spice dealer Tach Drud and unveiled a wealthy senatorial lobbyist and a cargo hauler's dealings with the Pykes.\nThe hand of the Pyke Syndicate was not only in the lower levels but the highest members of the Republic as well. Senator Yudrish Sedran of Chalacta was under investigation for claims he took bribes from the Pykes in exchange for turning a blind eye as they spread their operations beyond Pyke space, as well as for granting them limited ambassadorial status, which gave Pyke delegates legitimacy and access to the Senate. Divo and a team of forensic droids sealed Sedran's offices and apartments and led a thorough examination of their contents for evidence of criminal activity. Among the seized items were several Pyke paintings, among them a portrait of Pyke Syndicate capo Lom Pyke, which Sedran claimed was a cultural exchange gift from Oba Diah. Sedran's elite legal team was able to clear the senator of charges, but the portrait did manage to bring some Pyke operations down. Divo's forensics team analyzed the paintings and found grains of Kessel spice in the canvas' velvet pile, and, using the unique organic cores of the spice grains, CSF sniffer droids and hound teams tracked down contraband at the Level 1313 docks.\nAn attempt by Zugga Entertainment to open a podrace course in the Grand Aratech Gravidome on Coruscant prompted Divo to conduct mass amounts of research into the sport, whose shady reputation raised his suspicions. Podracing was a dangerous Outer Rim sport that was growing in popularity in the Core Worlds. Zugga learned that law enforcement was taking an interest in their project, which fell through.\nDivo's research of podracing pointed to the lethality and corruption that gripped the sport, with massive corporation sponsors pouring funds into the races and the ruthlessness and criminal actions of the racers themselves. In his research, Divo came across the podracer Sebulba, whom some children in the Outer Rim treated like a hero. Reflecting on Sebulba's criminal misdeeds in podracing and the worship given to him, the lieutenant was glad that the sport wouldn't find a home on Coruscant.\nSometime after the Zugga plan fell apart, Divo received an anonymous tip meant to support his investigation into podracing-related crimes. The evidence, a hologram, allegedly answered the mystery of the fate of Neva Kee, a rising podracer who had disappeared during the Boonta Eve Classic of 7945 C.R.C., which took place on Tatooine in the city Mos Espa. Footage of the race did not include the stretch where Kee vanished, and later rumors proposed by Podracing Quarterly alleged that Kee had fled to escape creditors. Divo was unable to confirm the authenticity of the image, which showed Tatooine-based crime lord Jabba the Hutt paying bounty hunter Aurra Sing while two cronies dragged Kee from a podrace crash. The Mos Espa case officer, who was investigating the case, reached out to Divo for help. Divo's theory, which he updated years after the incident, was that the original manufacturers of Kee's podracer, Farwan \u0026 Glott, arranged the hit on Kee to obtain his modification secrets.\nDivo and the CSF's surveillance operations were not limited to the Pykes. Divo's agents began attempts to infiltrate Ziro's Palace, the nightclub of the Ziro Desilijic Tiure, a Hutt with ties to the powerful Hutt Cartel in the Outer Rim. Ziro was an outlier of the Hutt's commerce ventures, having established his criminal empire on Coruscant, far from Hutt Space. Divo found it difficult to implicate Ziro in any illegal activity, as there was a lack of evidence and he didn't want to subject Ziro to stereotype, as the Pykes often were. What Divo could manage to find was that Ziro's clientele often came from the criminal element and that the Hutts had several fronts and operations on Coruscant that lined the reelection coffers of politicians on Coruscant. Though he was unable to formally charge Ziro with any crime, Divo's undercover agents in his nightclub captured footage of powerful political clientele, which gave the Inspector more leads to follow.\nOne of the mysterious cases Divo dealt with was the Xrexus Cartel, a group of semi-legitimate droid manufacturing firms from the Mid Rim Territories who banded together to fix prices and distribute unlicensed combat automata from the Outer Rim. Divo first came across the existence of the Xrexus Cartel when he intercepted a shipment of sham restraining bolts meant for The Glitch, a splinter of the infamous Droid Gotra, a droid emancipation group, who were planning a droid uprising on Coruscant. Divo attempted to follow up on the Xrexus Cartel, but all his leads ran dry as both the cartel and its founder, Boss-Mistress Xev Xrexus, seemingly vanished from the galaxy altogether. What Divo could find was an invitation to an auction hosted by Xrexus and her cartel, which offered up the prize of a \"treasured rarity of extreme import and interest.\" With no more leads into the strange situation, the Xrexus case went cold.\nIn 26 BBY, an Utapaun named Zodu Onglo was arrested on Level 1671 for aggravated assault after a botched attempt to sell a cache of stolen weapons. Inspector Divo traveled to the site of the incident, where he questioned witnesses as Coruscant's underworld officers took Onglo into custody. Divo followed up on Onglo's arrest with further investigation, which revealed a connection between the criminal and the Wandering Star syndicate based out of Level 1313. A few years later, Lieutenant Divo spoke at the Federal District Police Academy class of C.R.C. 7953.4.\nAround this time, Divo and the CSF launched investigations into Xomit Transport Systems, a Falleen-based shipping company with a major regional hub on Mustafar. XTS was connected to several incidents of contraband smuggling and was suspected to be masterminded by the Black Sun syndicate. Though the CSF had various paths of clues that would have blown the case against XTS and the Black Sun wide open, the shipping company had the protection of wealthy trading guilds with senators in their pockets. Attempts to gain access to XTS cargo were halted by these trade guilds, who placed permits and waivers for the CSF that turned their leads cold.\nIn 22 BBY, at the height of tensions between the Republic and its splinter state, the Confederacy of Independent Systems, Divo and the CSF began a string of operations surveilling criminals and suspected crime hubs on Coruscant. One of the establishments monitored by Divo was Dex's Diner, a eatery located in the Collective Commerce District, or \"Coco Town\" for short. The diner was not far from the Federal District and was also nearby to Ziro's Palace.\nDivo's surveillance revealed a pattern between Ziro's nightclub and Dex's, in which partners who first met at the posh Ziro's would eventually find themselves enjoying a no-frills meal at Dex's Diner, which had a twenty-four-hour schedule. The owner of Dex's Diner, Dexter Jettster, was not keen on Divo's meddling but was respected by the Inspector for his good nature. Divo's investigations showed no connection between Dex and the criminal deals made by his patrons, though he and his surveillance operation scaled back at the behest of Dex himself, who didn't want his business tarred by a reputation for invading privacy. Divo, out of respect for Dex, decided to keep the CSF at a distance from the diner, but kept an eye on the place nonetheless.\nAs the eve of the Senate's controversial vote on the Military Creation Act, Senator Padmé Amidala of the Chommell sector was the target of two assassination attempts. The first, a bombing of the senator's ship, killed seven in her retinue and led to the postponement of the vote. Later that night, a second assassination attempt was made using two venomous arthropods. Lieutenant Divo negotiated with the investigating Jedi Knights to secure the creatures for further study, which he was granted. The investigation revealed that the would-be assassin, who was later identified as Zam Wesell, had used an ASN courier droid to insert the arthropods into Amidala's bedroom while she slept.\nDivo sent the bisected corpses of the creatures to the Coruscant Zoo for identification. The myriapodologists at the zoo identified the creatures as Indoumodo kouhuns and preserved the specimens in a canister for evidence. The zoo, working with the CSF, removed the venom sacks from the kouhuns to develop in hopes of developing an anti-venom. Divo's official report of the incident credited Amidala's head of security, Captain Gregar Typho, for his fast response to the attempt on her life, but he made little mention of the Jedi who had been present.\nOne of the individuals Divo took a particular interest in was Dannl Faytonni, a low-level con man with a growing number of incident reports. Faytonni was known to prowl the entertainment establishments of the Uscru District, mostly in the levels from the 4000s to mid-3000s. Faytonni's greatest crime was impersonating an officer of the Republic Judiciary, which triggered an arrest warrant. The tensions between the Republic and Confederacy reached a tipping point when the Republic enacted a militarized response to the Confederacy's actions, leading to the outbreak of war with the First Battle of Geonosis. A sudden shift in Republic resources, however, led Divo and the CSF to make compromises in their work and what cases they gave attention to.\nThe Supreme Chancellor of the Republic, Sheev Palpatine, proposed a measure to heavily restrict coaxium markets, which parceled out hyperspace fuels to transport agencies that met law enforcement regulations. This measure was opposed to by the merchant guilds that protected the XTS, leaving Divo and the CSF unable to act on the shipping company and leave their fate in the hands of the Senate. In a more disappointing turn, Divo was forced to divert assignments to focus on the increased security of Coruscant, which meant he was unable to continue pursuing Faytonni. Faytonni, an adaptive and cunning individual, played a game of cat and mouse by giving him hints while remaining elusive, and Inspector Divo allowed him to do so in order to gain insight into usable leads and larger quarry. Though he was reserved in his decision to allow Faytonni to conduct his small crimes, Divo was reassured that he'd be able to catch his quarry at some point.\nAmong the individuals Divo had monitored at Dex's Diner were the Salenga Ione Marcy and the Terrelian Jango Jumper Cassilyda Cryar. Marcy was the live-in girlfriend of notorious hitman Nack Movers, who had evaded the law due to his connections, which kept the string of dead informants, accountants, and cops from catching up to him. Because of this protection, Movers and Marcy lived in a comfortable skyrise apartment on the upper east side of the Jrade District. Despite this, Divo kept an open case into Movers' activities, hoping to bring him to justice. Movers' paranoia led him to hire Cryar as a bodyguard. Marcy and Cryar grew close, and the two teamed up to kill Movers after he began making lecherous propositions to the bodyguard. Movers was found dead by the Jedi Tera Sinube and Ahsoka Tano, who traced Tano's stolen lightsaber to Movers. Tano engaged Cryar in a chase as she attempted to escape, while Sinube cornered Marcy and deduced her guilt, only for her to escape. With help from the elderly Sinube, Tano was able to bring Cryar and Marcy to CSF officers at a tram station before they could escape.\nThe CSF, in conjunction with Jedi crime scene analysis droid Russo-ISC, ran an investigation into Movers' death, which found that he had died after consuming a Sennari-laced drink. Movers' professional weapon was poison, as he had apparently been trained as a Malkite poisoner. In his notes, Divo commented that although the CSF hadn't brought Movers to justice, justice had caught up to him from someone he took for granted, that person being Marcy. Examinations of knocked-over furniture and claw marks on a painting of Movers, Marcy, and Cryar showed that his death had been near-instant after a series of convulsions from the poison. Divo found it ironic that Movers had lived poisoning individuals and he ended up suffering the same fate.\nAfter Boba Fett was arrested and brought to Coruscant, Divo opened a portfolio on the young boy. Fett was the unaltered clone of famed bounty hunter Jango Fett, who had been the original genetic donor for the Republic's clone army. Jango had been killed during the First Battle of Geonosis by Jedi Master Mace Windu in self-defense, which the impressionable Boba had witnessed. He, along with known criminals and bounty hunters Aurra Sing and Bossk, attempted to exact revenge on Windu by bombing his quarters on the Star Destroyer Endurance, and, after their first attempt failed, downing the entire ship itself by disabling it over Vanqor.\nBoth assassination attempts failed, and the hunters later placed a trap for Windu in the wreckage of the Endurance, Jango Fett's helmet, which was wired with a shaped baradium charge. Both Windu and Jedi General Anakin Skywalker were trapped under rubble for hours after the bomb went off during their investigation of the crashed ship before being rescued. General Plo Koon and Ahsoka Tano later tracked Fett and the hunters to Florrum, where they arrested Boba and Bossk but failed to capture Sing, who apparently perished in a ship crash. Divo and the CSF were granted custody of part of Jango Fett's damaged helmet, which they analyzed and placed into evidence after hearing testimony from Windu that authenticated it.\nBoba had been charged with the attempted murder of Windu and the bombing of the Star Destroyer Endurance over Vanqor. Both Fett and Bossk were arrested and taken to Coruscant, where they underwent processing for their roles in the scheme. Divo closely monitored the events, as he was curious about how such a young boy ended up involved in criminal activities. Barristers argued that Fett was a subadult who had been coerced by Sing, the true mastermind of the plot. Others argued that, as a clone, Fett was the property of the Republic and ceded his right to due process as such.\nWindu himself recommended that Fett be given leniency and rehabilitation as opposed to corporal punishment, but the Republic Judiciary denied such treatment, citing their zero tolerance policy towards attacks against military assets during wartime. Divo agreed with Windu in his portfolio of Fett. Additionally, Divo was deeply troubled by the implications that the Grand Army of the Republic was akin to an army of children as young as Fett, who resembled what many clones would look like if they were not genetically altered with age acceleration by their Kaminoan creators. Boba and Bossk were found guilty and imprisoned at the Republic Judiciary Central Detention Center on Coruscant.\nSometime later, Divo was contacted by Captain Patrok Ru-Saxon of the Mandalorian Guard, the law enforcement agency of the ruling New Mandalorian government on the planet Mandalore. Ru-Saxon had recently helped the Mandalorian ruler, Duchess Satine Kryze, expose a black market ring that had taken hold on the planet and caused an outbreak of poisoning at several schools. Mandalorian doctor Zak Zaz identified the source of the outbreak as a Moogan Tea variant known as Ardees Beverage imported by the Ardees Beverage Company, which had been brewed with slabin to extend its shelf life. The slabin had become lethal due to high concentration levels in the mixture. An investigation led by Kryze and visiting Republic Senator Padmé Amidala uncovered the Moogan smuggling operations at the Sundari dockyards. After a firefight at the Moogan's base which left Ru-Saxon injured and Tee Va, the head of the smuggling operation, arrested, Kryze ordered that the warehouse be burned as a symbol of what corruption would face on Mandalore, despite Ru-Saxon's protests that it could be valuable evidence.\nThough Ru-Saxon was unable to learn more from the smuggler's base, he was able to review the Moogan transport ship's navi-computer records, which indicated a stop off on Coruscant. Ru-Saxon deduced that they had been planning to expand their black market to Coruscant and notified Lieutenant Divo about his findings. Divo was surprised by this atypical heads-up from Mandalore, a planet known for its independence and neutrality under Kryze. With Ru-Saxon's tip, Divo located and intercepted a shipment at the Eastport Docks destined for the Coruscant underlevels before it could do any harm, and had several pallets of the tainted Moogan tea confiscated. As a show of thanks, Divo sent Ru-Saxon a bottle of artisanal Tarine tea and, in return, was gifted a bottle of Mandalorian kri'gee ale.\nA crisis on the moon Pantora arose during the Clone Wars when the Trade Federation blockaded the system. Though the Trade Federation claimed it had done so to seek payment for overdue debts, it had blockaded the world to sway the moon into joining the Confederacy. When the Supreme Chairman of Pantora, Baron Notluwiski Papanoida, arrived on Coruscant to correspond with Pantoran Senator Riyo Chuchi, his two daughters, Chi Eekway and Che Amanwe, disappeared. Divo was assigned to the case, and he conducted a sweep of the Papanoida's apartments as part of the investigation, alongside a team of police droids. While searching the apartment, however, he found no evidence of foul play. Divo and his team ran into Baron Papanoida and his son, Ion, as they were leaving the premises. Divo informed Papanoida that he found nothing in the apartment suggesting murder, and the impatient baron told Divo that his daughter's lives were in his hands. Divo told the baron that he had nothing to worry about and that the CSF was in complete control of the situation, then left the apartment complex to continue the investigation.\nUnfortunately, Divo had missed something during his sweep of the Papanoida's apartment. While investigating the rooms, he and his team left the Icon of the Moon Goddess out of place, thinking it was where it was meant to be. When Papanoida entered the apartment, he noticed the misplaced statuette, and while placing it back on its shrine, he noticed blood underneath it. Papanoida and his son, dismissing Divo's investigation, analyzed the blood themselves and learned that Chi Eekway and Che Amanwe had been taken by a bounty hunter named Greedo. With the help of Senator Chuchi and Jedi Ahsoka Tano, Papanoida led an extralegal effort to track down and retrieve his daughters, nullifying the Trade Federation blockade in the process.\nDuring the early stages of the Clone Wars, the Republic forged a treaty with the Hutt Clan to gain access to the Hutts' Outer Rim hyperspace lanes and trade routes. The deal, struck between Republic forces and Jabba the Hutt, came following the arrest of Ziro for his scheme to remove Jabba from power and for his allegiance to the Confederacy. Divo and law enforcement believed early on that this treaty would allow Republic jurisdiction to reach beyond the borders of Hutt Space, but soon found their hands tied in legal and political matters. Hutt lawyers amended the treaty to a degree that allowed them to peer into Republic business but denied the Republic to do the same to them. Because of the narrow margin Divo had to work with, much of his gathered material against the Hutt cartels, much of which would have been inadmissible if he were able to take legal action, became ultimately useless with no way to use them against the clans.\nDespite this disappointment, Divo and Republic agencies did what they could to continue gathering material. To gain access to the halls of the Grand Hutt Council on Nal Hutta, a translator droid was gifted to the leaders of the cartel via a third party. The droid captured an image of Ziro the Hutt being held before the Hutt Council, after he was freed from Republic custody following a Hutt-ordered hostage crisis in the Senate. Several senators were taken hostage by bounty hunters, and in return for their safety, Ziro was released. Though the image, like the rest of Divo's files against the Hutts, was rendered useless in the legal sense, it allowed him and the CSF a heads-up into some of the Hutt Clan's nefarious plans. Ziro was found mysteriously murdered on Teth shortly after his release from prison. He had been killed on the orders of the Hutt Council to prevent him from leaking damaging information regarding their crimes, though this fact would go unknown to the Republic.\nWhen word of youths being captured and trafficked out of Coruscant to the Outer Rim reached Divo, he used his network of contacts to pinpoint where their final destination was. His contacts pointed to Zygerria, the homeworld of the Zygerrians and the ancient, pre-Republic Zygerrian Slave Empire. The Zygerrians had been emboldened by the fractured state of the Republic to return their underground slave trade to the surface and preyed on people displaced by the war to fuel their burgeoning empire. Unfortunately, Divo was unable to pursue action given Zygerria's independence, which limited what actions the Republic could take against the slavers.\nIt wasn't until the Zygerrians slipped their hands to being accomplices to the Separatists after raiding and kidnapping a colony of Togruta on Kiros that the Republic launched a liberation effort as part of a military operation. During a strike against the Zygerrian's kidnapping efforts in the Core, a shipping container holding twenty-seven subadults from Coruscant, Corellia, and Denon was captured. One of the weapons of the Zygerrians, an electro-whip, was given to Divo as evidence. Analysis of the weapon's design and engineering gave Divo and law enforcement agencies further insight into how the Zygerrians tortured those they enslaved.\nWhile the Republic Senate debated its military output, Lieutenant Divo was assigned to look into the sudden death of Senator Onaconda Farr of Rodia, who had suffered what appeared to be a heart attack while celebrating his efforts to overturn legislation that expanded military funding with his allies. Divo ordered a rigorous autopsy of Farr's body by forensic science commander V2A DAZ, who discovered a chemical trace of poison in the Rodian's bloodstream. The autopsy revealed that the poison used against Farr was Kaminoan in origin and only affected Rodians. The report led the CSF to open an investigation under Divo, who began by gathering together Farr's allies in the office of Supreme Chancellor Palpatine. Divo collected the Supreme Chancellor, Vice Chair Mas Amedda, senators Bail Organa, Mon Mothma, and Padmé Amidala, and Rodia's junior representative Lolo Purs for questioning.\nWhen they arrived at the meeting, Divo asked Amidala and Purs if they knew of anyone who disliked Farr enough to kill him, but they, as well as Organa, argued that Farr was loved by many and that none would want him dead. Divo dismissed their assertions, and Amidala asked why the inspector believed it was murder. Divo explained that poison, which he deemed the preferred method of killing by politicians, had been found in Farr's body during the autopsy. He theorized that Farr's killing had been political, possibly in response to a secret of Farr's coming out. Amidala countered that Farr had no secrets and suggested that the murderer may have been motivated by Onaconda's anti-war bill on the Senate floor instead. Annoyed by Amidala's interjection, Divo asked her to leave the investigation to him, then left the Chancellor's office to continue his work.\nDespite Detective Divo's request for the late Farr's allies not to interfere, Amidala and Organa took it upon themselves to follow up on their theories of Farr's death. After interrogating Senators Halle Burtoni and Mee Deechi, some of his political enemies, the two learned that Farr had been followed by one of Deechi's operatives, who had observed him in a secret meeting at the docks under the derrick major the night before he died. With this new lead, Amidala insisted that she and Organa investigate the dockyard themselves. While they did so, however, they were attacked by an unknown assailant. After their attacker escaped, they contacted the CSF, and Divo arrived with a contingent of police droids.\nDivo angrily chastised Amidala for not only failing to inform him of what she had learned from Deechi but possibly alerting the killer to the fact that his investigation was closing in on them. Though Divo again warned them not to interfere, Amidala and Organa began theorizing that Deechi had been responsible for Farr's death and left to confront him. Divo yelled at the two not to leave an active crime scene but relented and followed them with a trio of police droids. When Divo and the senators arrived at Deechi's office however, they found the Umbaran dead in his chair, stabbed to death with a knife still lodged in his chest.\nIn order to secure the lives of the individuals involved in the case, Divo placed Amidala, Organa, Mothma, and Purs under lockdown in Amidala's office until Farr's murderer was found. Purs protested that they were being made easy targets by Divo's lockdown and left the room. One of Divo's police droids went to stop her, but the inspector had the droid stop and let her go. Divo questioned Amidala on whether anyone else knew that she and Organa had gone to the docks, and she revealed to him that Senator Burtoni had been present when she and Organa heard of Farr's visit to the docks from Deechi. With this new lead, Divo had a team of droids sweep Burtoni's office, but when he arrived he learned that Burtoni had seemingly fled.\nDivo returned to Amidala's office, where Purs returned in a frenzy. Purs claimed that Burtoni had attacked her, and Divo sent his droids to capture the Kaminoan. With the alleged culprit in custody, Divo had her brought to the Chancellor's office, where he confronted her alongside numerous senators and the Chancellor himself on the morning after. Burtoni dismissed Purs' accusation and the idea that she had killed Farr or Deechi, but Divo presented the evidence mounted against her, including the Kaminoan poison used on Farr. Believing that he had found the motive, means, and opportunity, Divo had his guards take Burtoni away, but Amidala questioned the scan Divo had ordered on the poison. Amidala pointed out that if the poison had been in her, Farr, Mothma, Organa, and Purs' drinks when Farr died, then Purs would have been killed too.\nPurs revealed a blaster and aimed it at Amidala's head, then took the senator hostage. Amidala asked why Purs had killed Farr, and she told her that she had poisoned him in retaliation for briefly allying Rodia with the Confederacy of Independent Systems early in the war. Purs inadvertently revealed when arguing with Amidala that she had been the unknown person who had confronted Farr at the docks and had killed Deechi. While she was distracted, Divo activated two police droids stationed outside with his datapad. The droids stopped Purs from exiting the room, and Amidala, angry still over the death of Farr, hit the blaster out of her hand and then knocked her out with a punch. With the murders of Farr and Deechi solved, Divo had his droids take Purs into custody, and the Senate resumed its business.\nDuring the middling years of the Clone Wars, a series of high-profile criminals were arrested and brought to Coruscant's Central Detention Center, several of whom had been closely watched by Divo for years. Moralo Eval, a sociopathic and violent serial killer widely known for his deranged genius and crafty brilliance in avoiding the law, was among those apprehended. Eval was captured by a police detachment on Denon, though oversight on the Judiciary's part allowed him contact with other prisoners during his confinement in the Central Detention Center.\nShortly after Eval's imprisonment, the famed and notorious bounty hunter Cad Bane, who had sky-rocketed to the title of \"best bounty hunter in the galaxy\" during the Clone Wars, was also arrested. Bane had been monitored by Divo for years despite his supposed legal stance with a bounty hunting license. During the Clone Wars, however, Bane made several large-scale strikes against the Republic and the Jedi, including the senate hostage crisis to free Ziro the Hutt. It was after these incidents that the Republic Judiciary collared him and took him prisoner. When Divo viewed his intake holo, he only commented that it seemed like Bane was confident he would get out of prison.\nThe third high-profile criminal taken into custody was Rako Hardeen, whom Divo had been pursuing for years. Hardeen, also known as the Marksman of Concord Dawn, was a bounty hunter reputed to take extralegal cases. Divo was able to update his profile on the hunter often because of Hardeen's frequent visits to Coruscant, but he was never able to crack open a case against him. One morning, however, Divo was surprised by an unexpected alert that the Jedi had arrested him and were holding him prisoner at the Jedi Temple. Divo immediately requested access to Hardeen but was denied any contact with him.\nEven upon Hardeen's transfer to the Central Detention Center, Divo's requests to interview him or examine the Jedi's arrest reports were denied. Eventually, Divo was given a heavily-redacted copy of the arrest report, which only shared the knowledge that Hardeen had accepted a bounty on a Jedi Council member and assassinated Jedi Master Obi-Wan Kenobi on behalf of a redacted employer. Divo knew right away that even this redacted transcript was enough to bring down whoever was propping Hardeen up, but the Jedi again denied Divo any of their intelligence on the matter.\nWithin a week of Hardeen's arrest, Divo learned that Kenobi was still alive, having posed as Hardeen to infiltrate the prison community to learn about a supposed assassination plot against Chancellor Palpatine. Kenobi, as \"Hardeen,\" commiserated with Bane and Eval and staged a prison break that allowed dozens of hardened criminals loose into the Coruscant streets. Divo was incredulous at this revelation, especially after he discovered that the Supreme Chancellor's office had no record of the plot against him. Divo reached out to Chancellor Palpatine to find out any further information. The Chancellor told him that the whole operation was an elaborate Jedi bid to stop an assassination attempt engineered by Moralo Eval behind bars. The Chancellor was sympathetic to Divo's fury and told him that he had been concerned that the Jedi did not include him in any of their plans. Divo was struck by the Chancellor's admittance of unease with the Jedi's growing independence during the war.\nDespite what he gained from his discussion with Palpatine, Divo was unsure he would ever get a full picture of the Jedi's risky plot. Further attempts at investigation gave Divo the knowledge that the mercenary plot hinged heavily on criminal inventor Sinrich's holographic disguise matrix but yielded little else. All the mercenaries who ended up party to the assassination attempt, including Bane and Eval, were arrested after their plan was sabotaged by Kenobi. Despite having Bane and Eval behind bars once more, whatever happened to the real Rako Hardeen remained a secret, one the Jedi would take to the grave.\nDivo's fascination with Boba Fett from earlier in the war continued as years passed, even after the young boy escaped prison. A fugitive from Republic law, Fett avoided activity in Republic space and mostly stayed in unincorporated territories in the Outer Rim. Divo continued to update his profile on Fett despite limited knowledge and followed rumors of the boy's whereabouts for more information. On occasion, Divo heard rumors that Fett had returned to Coruscant, piquing his interest greatly. Divo finally learned what had happened to Fett in the last year of the war when Sedra Hoxin, a constable from the prefect of Mos Eisley, a spaceport on Tatooine, contacted him. The constable sent Divo a holographic image touting the services of the \"Krayt's Claw,\" a posse of bounty hunters stationed on Tatooine, among them Fett.\nIn his files, Divo wrote about Fett's burgeoning career as a bounty hunter, commenting that he was leveraging his father's name for infamy. Despite Fett's criminal growth, Divo was concerned for the boy and was wary of the bounty hunters he was becoming involved with in Krayt's Claw, who were later identified as Bossk, Aurra Sing, C-21 Highsinger, Dengar, Embo, and Latts Razzi. Maintaining his history of creating dedicated entries for individual bounty hunters, Divo gave each their own dossiers among his case files. Divo received an update from Constable Hoxin later that year as a Life Day greeting, a holo of the Krayt's Claw. From the image sent by Hoxin, Divo discerned that Fett was not only a member of Krayt's Claw but the leader of the gang. In the last entry of his file on Fett, Divo commented that Fett was likely trying to fill the void in his life created when his father was killed, and though he lamented that the boy was turning to bounty hunting, he believed it was not the worst path for him.\nA new issue for Divo and the CSF's long-stagnating case to determine the leadership of Xomit Transport Systems appeared during the Clone Wars with the death of XTS chairman Xomit Grunseit. Because of his death, the board of the XTS was reformed and whoever assumed the leadership was unknown.\nSome time before the final year of the war, a rash of violence and suspicious reallocation of funds and capital led to the discovery of a short-lived but expansive criminal syndicate known as the Shadow Collective. Investigations revealed that the syndicate was a joint venture made up of the Hutt Cartel, the Pyke Syndicate, the Black Sun, and the Mandalorian terrorist group Death Watch. Divo and the CSF created a conjectural list of the leaders of the Collective: Jabba Desilijic Tiure of the Hutt Cartels, Pre Vizsla, the former governor of the Mandalorian moon Concordia and the leader of Death Watch, Lom Pyke, former capo and current boss of the Pyke Syndicate, and Ziton Moj, leader of Black Sun and successor to Xomit Grunseit.\nTwo additional leaders, thought to be the primary masterminds of the organization, were known to be active to Divo but were unidentified. The Shadow Collective was believed to have funded the toppling of Satine Kryze's regime on Mandalore in 19 BBY, which had been a goal of Vizsla's for years. During the fall of Mandalore, Kryze was deposed and killed, and the planet fell into chaos.\nA string of piracy along the Metellos Trade Route, a hyperspace lane that led to Coruscant, led Divo to put out an interdivisional call for any information regarding Weequay raiders, based on what scant evidence there was about the attacks. The torrent of reports that flooded Divo's receptacle gave him a single consistent name: Hondo Ohnaka. Ohnaka was the pirate leader of the Ohnaka Gang, a Florrum-based group widely known for having kidnapped Confederate Head of State Dooku early in the war. Divo's investigation into the gang revealed no political convictions, as the group had crossed paths with both the Republic and Confederacy and proven a nuisance to both. While perusing the information he was given, Divo found a \"letter\" sent to a raided ship from Ohnaka and a surveillance image of the infamous pirate captain. Though his call resulted in a seemingly endless supply of requests, warrants, and rewards for the capture of Ohnaka from outlying agencies, Divo never responded to any of them. For the remainder of the war, Ohnaka remained kept to the frontier of the Outer Rim.\nLate in the Clone Wars, a shocking terrorist strike at the heart of the Jedi Temple on Coruscant crystallized just how unpopular the Clone Wars had become. The terrorist bombing was seemingly connected to a series of protests around the temple that demanded an end to the war. A nano-droid-triggered carbon bomb had detonated within the temple launch facilities, killing twelve crew workers, eight clones, six Jedi, and injuring dozens more. Jedi crime scene analyzer Russo-ISC led a detailed investigation into the attack, aided by the Jedi Anakin Skywalker and Ahsoka Tano.\nThrough a series of holographically displayed surveillance images of the attack, the trio was able to confirm that the bomb originated inside the body of a compromised crew member, Jackar Bowmani, who had been a munitions expert with clearance for access to the temple. What was supposed to be a strictly internal Jedi investigation eventually fell into Republic military jurisdiction, given the deaths of civilians and clone troopers. Divo and the police were largely kept out of proceedings in both cases, though some intelligence was shared with the inspector.\nIn a strange turn of events, Ahsoka Tano became the main suspect of masterminding the attack after apparently killing Letta Turmond, the protestor who had fed nano-droids to her husband, Bowmani. Underworld CSF cops aided in the search for the fugitive Jedi, who was captured by the Coruscant Guard and brought before a high court. Her innocence was eventually proven when Jedi Knight Barriss Offee confessed to the crime and was arrested in Tano's place. Divo wasn't allowed information until after a verdict had been delivered for Offee. Following the trial, Divo was given a heavily redacted report of the incident but was allowed access to a nullified sample of NM-K nanodroids and a compressed baryon canister used to smuggle them, which were put into evidence and analyzed.\nThe Clone Wars came to a tumultuous end in the year 19 BBY, when Supreme Chancellor Palpatine declared that the Republic would be reorganized into the first Galactic Empire and became he became Emperor Palpatine. His rise to power was given way by the Confederacy's loss of its leadership, with the deaths of Head of State Dooku, General Grievous, and the Separatist Council in quick succession, as well as the genocide of the Jedi after they allegedly began a rebellion movement to overthrow him. Though the Imperial government revised the Republic's penal code and created the Imperial Security Bureau as its primary law enforcement and intelligence agency, Lieutenant Divo remained in his position within the Coruscant Security Force nonetheless.\nDivo had a level of distrust for the notion of a \"Jedi rebellion\" despite his troubled relationship with the Order. Among the list of presumed victims of the Jedi Purge was Quinlan Vos, who Divo had worked with many years before. Despite Vos supposedly being implicated in the Jedi insurrection, Divo kept quiet on any matter relating to him or other Jedi. Vos was later included in a list of potential survivors of the Purge and priority targets of the Jedi-hunting Inquisitorius.\nIn the first year of the Galactic Empire, Imperial forces detained KRONOS-841, a member of the Droid Gotra, who was subsequently interrogated by Divo. In exchange for leniency, KRONOS offered Divo a data dump of old memories, some over a decade old. While pouring over this data, Divo unexpectedly uncovered a new lead in the long-cold case of the Xrexus Cartel. Piecing together KRONOS's memories, Divo and his agents reconstructed an image of the founder of the Xrexus Cartel, Xev Xrexus, at her mysterious auction in 32 BBY.\nWith the reconstructed image and KRONOS's other memories, Divo managed to get a glimpse into the fate of Xev Xrexus and her cartel. The item that had been up for auction was a Jedi Padawan, Eldra Kaitis, whom KRONOS and his cohorts were bidding for by proxy. The auction had been won by the industrialist Jee Kra, who bid 2.5 million credits for the Padawan. KRONOS's evidence ended there, but further research by Divo revealed that Kra was found dead in a shuttle crash beyond Republic borders. Unfortunately, Divo also discovered an old order from the Office of the Supreme Chancellor, which closed investigations into Kra's death and classified information relating to the situation. Both the records of the Jedi Order and other law agencies employed by the Republic revealed nothing, and the case of the Xrexus Cartel ran cold once again. In his files, Divo suspected that Kaitis had been killed at the auction or some point afterward and that the disappearance of Xev Xrexus was somehow related to \"Jedi business,\" which explained why no other agencies had any reports of the auction.\nDuring the early years of the Empire, Lieutenant Divo retired from the CSF with honors. Upon his retirement, many of his files were inherited by the Imperial Office of Criminal Investigations, including vast troves of records on tattoo symbology. At Divo's recommendation, the Imperial Security Bureau implemented a system of tattoo identification by deploying protocol droids specializing in that field to crowded spaceports and transit areas, where they could easily differentiate personal and cultural markings from criminal ones.\nDivo's daughter, Andressa Divo, was eager to continue the family tradition of service and enrolled herself in the Federal District Police Academy, the same institution her father had attended. When she graduated, Andressa decided to join the ISB as an agent. Andressa had witnessed the toll the Clone Wars took on the galaxy, especially her father, and absorbed the Galactic Empire's rhetoric and ideology. The now-retired Inspector Divo, however, was less enthusiastic about the New Order's totalitarian state. He and Andressa kept correspondence after she joined the ISB, where she was often sent off-world to deal with scattered incidents and investigations throughout the galaxy.\nAt the end of the Clone Wars, the Empire pardoned and expunged the criminal records of various bounty hunters, among them Boba Fett, so they could be used as an extension of Imperial law enforcement. Andressa, while taking custody of fugitive Isquik Tors from Fett, spoke briefly with the bounty hunter and later wrote to her father about their interaction, knowing that he had an interest in him. In later correspondence, Andressa wrote to Divo about his work creating a case to keep podracing off Coruscant, as she was investigating race circuits on the industrial world of Corellia based on reports from the CSF. She also used one of Divo's reports from the attempted kidnapping of Chancellor Palpatine during the Clone Wars to conduct further investigations into the evolution of Sinrich's holographic disguise matrix.\nUnder the ISB, Andressa attempted to learn more about the leadership and business of Xomit Transport Systems, with little result. Tan and Andressa's differing opinions on the Empire's way of governing led them to argue over Andressa's case on the assassin droid IG-88B. Divo was horrified to learn not only that the Empire was allowing the murderous droid to work for it, but that Andressa herself treated the droid the same as any other bounty hunter. In Divo's mind, IG-88 was a sign that the Empire was taking law enforcement to its extremes.\nAs rebellious movements began appearing across the galaxy, Andressa's focus of work centered on stifling dissent and opposition to the Empire. One of Andressa's focuses was on Senators Bail Organa and Mon Mothma, both of whom had become increasingly critical of the Empire and secretive in their affairs. In an act of treason, Mothma publicly absconded from the Senate and declared the creation of the Alliance to Restore the Republic, while Organa became a part-time delegate and his daughter, Leia Organa, became Senator of Alderaan. Both Organas were monitored heavily by Andressa and the ISB.\nEvidence of Alderaan's relationship to the rebellion led Imperial Grand Moff Wilhuff Tarkin to take swift and decisive action against the planet. In 0 BBY, Tarkin used the newly-unveiled superweapon, the Death Star, to destroy Alderaan. Tan Divo was on Alderaan at the time, and he was killed in the disaster alongside Organa and nearly two billion other life forms. That day was the final day he and his daughter spoke, and after his death, all files Andressa had compiled regarding Bail Organa vanished.\nIn the years after the Tan Divo's death and the destruction of Alderaan, the Galactic Civil War erupted between the Empire and the Rebel Alliance and enveloped the galaxy. Andressa continued her service to the ISB, investigating Imperial defectors and smuggling operations. In 4 ABY, however, Emperor Palpatine was killed during the Battle of Endor and the Empire fractured in his wake. The Rebel Alliance reformed into the New Republic, and, in 5 ABY, defeated the Empire during the Battle of Jakku, after which the Galactic Concordance formally concluded the Empire's reign.\nAndressa, still loyal to the Empire, took her young son, Exantor Divo, and went on the run, as she expected the New Republic to execute her as an enemy of the state. It took much convincing for her to emerge from hiding, after which the Republic impressed on her that she would not warrant arrest or punishment given her record, which was meticulously researched by the new chiefs of law enforcement. She was offered an invitation to aid the New Republic with her expertise, but she flatly refused and retired, deeming the new government illegitimate.\nExantor Divo, meanwhile, followed in his family's footsteps and enrolled in the Hosnian Prime Academy of Law Enforcement, much to his mother's dismay. Though she did not stop him from enrolling, their later correspondence became strained and a wedge grew between them over her support for the Empire, much like her relationship with her late father. Exantor graduated as part of the Class of 7996 C.R.C. and did not see his mother in attendance. Years later, however, he found a holo from the ceremony that was not part of the standard set released by the Academy. He contacted Andressa about it, and she revealed that she had been there. In her conversation with him, she added that their familial tradition of law enforcement did not allow them the luxury of choosing the laws they enforce. In a striking turn from her beliefs during the early New Republic, she admitted that she had misgivings about the Empire but had no outlet to express them, which damaged her relationship with her father. As she did not want Exantor to face the same isolation she had, she promised that he could always talk to her if he had any misgivings about New Republic law.\nThough he had initially wanted to become a Sector Ranger, Exantor went on to become the Police Commissioner on Hosnian Prime and was thrice awarded the New Republic Medal of Distinguished Public Service. He lived on Hosnian Prime with his partner and two children, the great-grandchildren of Tan Divo. Four years after attaining the title of Commissioner, Exantor was gifted Tanivos Divo's personal case files, which had been long thought lost during the Clone Wars. Exantor also had access to Andressa's ISB files, and, along with his own, he assembled the three generations' worth of information and history into a compilation referred to as Scum and Villainy: Case Files on the Galaxy's Most Notorious. Alongside his own annotations and writings about his grandfather and mother's cases, Exantor included excerpts from their files and his reflections on the meaning and purpose of law enforcement. In the afterword of the compilation, Exantor reflected on the illuminating realizations he had on law enforcement while touring his grandfather and mother's files, which he felt were a useful key to understanding how both crime and the law evolve.\nTanivos Divo's poor and difficult upbringing instilled him with a firm sense of justice and fairness, and he used this to push himself to solve the rampant issues of crime that ran afoul on Coruscant. Divo had a rigid belief in rules and how they were enforced. In his opinion, the only thing that could exist when the rule of law was absent was chaos. Divo took great pride in his abilities and by-the-book procedures. He could be pompous and self-important, most often to authority figures he distrusted, such as Republic politicians. Though he carried himself with a degree of arrogance, Divo deeply cared for his homeworld and his work. Divo's rigid sense of duty was not without room to grow, however, and he would reach out to other worlds to learn more about how they and their law operated. Doing so gave him the knowledge of how to avoid allowing the same errors and pitfalls to happen on Coruscant.\nInspector Divo believed that the purpose of a police officer was to keep the public safe from harm rather than to target criminals out of vindictiveness. Divo struggled, however, to balance stereotyping and carrying out the law; in his early career, he and the CSF would search Pyke homes and businesses in search of connections to the Pyke Syndicate, often based only on the occupant's species. Divo regretted doing so and, for the rest of his career, he made sure to avoid stereotyping and advised Imperial law enforcement to do so as well. Divo did not fault criminals for their past if they tried to reform and instead welcomed their attempts to make amends. He likewise was uncomfortable with corporal punishment, especially for subadults. During the trial of Boba Fett during the Clone Wars, Divo supported taking leniency in his sentence and focusing on rehabilitation over retribution. He felt that Boba was not responsible for his behavior and attributed it to his troubled early life and clone engineering.\nThough Divo most often worked to bring justice to the lower criminal element, his goals remained focused on the corrupt upper classes of Coruscant society. Throughout his career, Divo had a deep mistrust of the Coruscant elite, including politicians as well as trade and industry barons. Divo viewed the Republic's politicians as greedy and backstabbing and faulted them for breeding the rampant crime in the Coruscant underworld. To him, they had either willfully allowed crime to spread or were ignorant to the issues that plagued the lower levels of the planet entirely. His early battles against Senators Aks Moe and Yudrish Sedran taught him that, no matter how hard he tried, it would be near impossible to take down corrupt politicians who had the resources to insulate themselves from justice. Instead, Divo found a strategy of building large cases out of smaller ones, allowing him to stem crime in the lower levels and unveil their connections to the upper classes.\nLieutenant Divo had a long and well-documented distrust of the Jedi Order. His misgivings toward the Order came initially from what he perceived to be a lack of care about Coruscant's issues from them, but as time went on, he found more problems with the group. He believed that they unlawfully held unchecked jurisdiction and needed oversight for their actions, some of which went unquestioned despite clearly being illicit in his eyes. Though he would go so far as to remove Jedi contributions to cases in official reports, Divo did, however, respect the maverick Jedi Master Quinlan Vos, who often worked alongside the CSF. The peak of Divo's issues with the Jedi came during their internal planning to prevent the kidnapping of Supreme Chancellor Palpatine. The Order's ability to disappear wanted criminals like Rako Hardeen without any probe from Republic officials outraged Divo's sense of moral duty, and he voiced his concerns to the Chancellor himself.\nAs the Clone Wars drew to a close, Divo became increasingly disillusioned with the Republic and began to struggle with his belief in the rule of law as the government stifled his cases and investigations. He continued to serve in the Coruscant Security Force during the early years of the Galactic Empire after the war ended but retired shortly after. In his retirement, Divo began to express his opinions about how the Empire was handling law enforcement and found that he was growing increasingly critical of the New Order's fascist policies. The Empire's use of assassin droids such as IG-88 disturbed him, and he believed that the government's willingness to treat it as a police droid ran contrary to its true purpose as a killing machine. Divo criticized IG-88 and the Empire for lacking any value for life or order, which he saw as a key component of justice.\nThough criticized by some for his attitude and relatively low success rate in solving cases, Tan Divo was a talented investigator whose greatest strengths weren't in solving cases but in building them. Throughout his career with the Coruscant Security Force, Divo meticulously tied various crimes together to illuminate grander and far more complicated schemes. What kept him from acting on his findings, however, were outside influences such as the Galactic Senate or Jedi Order, forcing him to abandon or scale-down long-built cases. In addition to his investigative abilities, Divo had a knack for filing reports and maintained his own personal set of case files.\nTan Divo was created for the animated television series Star Wars: The Clone Wars, where he first appeared in the season two episode \"Senate Murders,\" which was directed by Brian Kalin O'Connell and first aired on March 19, 2010, in the US. Unlike most characters in the series, Divo was specifically designed to have asymmetrical facial features. Divo's full name, Tanivos Exantor Divo, was first provided in the 2018 canon reference book Star Wars: Scum and Villainy: Case Files on the Galaxy's Most Notorious, which greatly expanded the story of the character.\nIn both \"Senate Murders\" and a later episode of The Clone Wars featuring Divo, \"Sphere of Influence,\" Divo was portrayed by voice actor and comedian Tom Kenny, who had previously voiced numerous characters in the show. Because of the murder-mystery storyline of \"Senate Murders,\" Kenny approached the script as though it were a police-centric serial rather than an episode of The Clone Wars. Kenny was inspired by characters such as Joe Friday from Dragnet and Frank Columbo from Columbo for his voice for Divo. Kenny directly added hints of Columbo in his performance, such as making Divo intentionally abrasive as part of what he felt was the character's modus operandi.\nKenny further reflected the beat-cop nature of Divo with a \"colloquial\" manner of speech, which contrasted greatly with the pontificating of the Jedi Knights and politicians often featured in The Clone Wars. Kenny's thinking when portraying Divo was that, although the character could be arrogant and haughty, he was a good detective and proud of his skills, describing him as \"part Joe Friday, part egotistical Sherlock Holmes-wannabe.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Tan_Divo",
  "/wiki/Coruscant",
  "/wiki/0_BBY",
  "/wiki/Alderaan",
  "/wiki/Human",
  "/wiki/Coruscanti",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Divo_family",
  "/wiki/Galactic_Republic",
  "/wiki/Federal_District_Police_Academy",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Galactic_Empire",
  "/wiki/Law_enforcement_agency",
  "/wiki/Inspector",
  "/wiki/Lieutenant",
  "/wiki/Imperial_Era",
  "/wiki/Homeworld",
  "/wiki/The_galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Jedi_Order",
  "/wiki/Andressa_Divo",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/New_Order",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/The_Disaster",
  "/wiki/Death",
  "/wiki/Exantor_Divo",
  "/wiki/Commissioner",
  "/wiki/Hosnian_Prime",
  "/wiki/Reproduction",
  "/wiki/Level_3215",
  "/wiki/Planet",
  "/wiki/Core_Worlds",
  "/wiki/Capital",
  "/wiki/Gavas-Eclat",
  "/wiki/Tanivos_Exantor_Divo%27s_father",
  "/wiki/Malastare",
  "/wiki/Senator",
  "/wiki/Aks_Moe",
  "/wiki/Galactic_Senate",
  "/wiki/Religion",
  "/wiki/Jedi",
  "/wiki/Pirate",
  "/wiki/Jedi_Master",
  "/wiki/Quinlan_Vos",
  "/wiki/Oba_Diah",
  "/wiki/Pyke_Syndicate",
  "/wiki/Spice",
  "/wiki/Pyke",
  "/wiki/35_BBY",
  "/wiki/Unidentified_holo-star",
  "/wiki/Level_3321",
  "/wiki/Spice_dealer",
  "/wiki/Tach_Drud",
  "/wiki/Yudrish_Sedran",
  "/wiki/Chalacta",
  "/wiki/Capo",
  "/wiki/Lom_Pyke",
  "/wiki/Level_1313",
  "/wiki/Zugga_Entertainment",
  "/wiki/Podracing",
  "/wiki/Grand_Aratech_Gravidome",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Sebulba",
  "/wiki/Neva_Kee",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/32_BBY",
  "/wiki/Tatooine",
  "/wiki/Mos_Espa",
  "/wiki/Podracing_Quarterly",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Bounty_hunter",
  "/wiki/Aurra_Sing",
  "/wiki/Farwan_%26_Glott",
  "/wiki/Ziro%27s_Palace",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Hutt_Cartel",
  "/wiki/Ziro_the_Hutt%27s_criminal_organization",
  "/wiki/Hutt_Space",
  "/wiki/Xrexus_Cartel",
  "/wiki/Mid_Rim_Territories",
  "/wiki/The_Glitch",
  "/wiki/Droid_Gotra",
  "/wiki/Boss",
  "/wiki/Xev_Xrexus",
  "/wiki/Auction_of_Eldra_Kaitis",
  "/wiki/26_BBY",
  "/wiki/Utapaun",
  "/wiki/Zodu_Onglo",
  "/wiki/Level_1671",
  "/wiki/Wandering_Star",
  "/wiki/24_BBY",
  "/wiki/Xomit_Transport_Systems",
  "/wiki/Falleen",
  "/wiki/Mustafar",
  "/wiki/Black_Sun",
  "/wiki/22_BBY",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Dex%27s_Diner",
  "/wiki/Dexter_Jettster",
  "/wiki/Military_Creation_Act",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Chommell_sector",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Zam_Wesell",
  "/wiki/ASN_courier_droid",
  "/wiki/Coruscant_Zoo",
  "/wiki/Myriapodologist",
  "/wiki/Kouhun",
  "/wiki/Captain",
  "/wiki/Gregar_Typho",
  "/wiki/Dannl_Faytonni",
  "/wiki/Judicial_Department",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Coaxium",
  "/wiki/Salenga",
  "/wiki/Ione_Marcy",
  "/wiki/Terrelian_Jango_Jumper",
  "/wiki/Cassilyda_Cryar",
  "/wiki/Nack_Movers",
  "/wiki/Jrade_District",
  "/wiki/Tera_Sinube",
  "/wiki/Ahsoka_Tano",
  "/wiki/Russo-ISC",
  "/wiki/Sennari",
  "/wiki/Malkite_poisoners",
  "/wiki/Boba_Fett",
  "/wiki/Cloning",
  "/wiki/Jango_Fett",
  "/wiki/Mace_Windu",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Endurance",
  "/wiki/Sabotage_of_the_Endurance",
  "/wiki/Vanqor",
  "/wiki/Baradium",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Mission_to_Vanqor",
  "/wiki/Plo_Koon",
  "/wiki/Second_mission_to_Florrum",
  "/wiki/Florrum",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Kaminoan",
  "/wiki/Republic_Judiciary_Central_Detention_Center",
  "/wiki/Patrok_Ru-Saxon",
  "/wiki/Mandalorian_Guard",
  "/wiki/New_Mandalorians",
  "/wiki/Mandalore",
  "/wiki/Mandalorian",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Mandalorian_black_market_conspiracy",
  "/wiki/Zak_Zaz",
  "/wiki/Moogan_Tea",
  "/wiki/Ardees_Beverage",
  "/wiki/Ardees_Beverage_Company",
  "/wiki/Slabin",
  "/wiki/Moogan",
  "/wiki/Mooga_smuggling_ring",
  "/wiki/Sundari",
  "/wiki/Skirmish_at_the_Sundari_docks",
  "/wiki/Tee_Va",
  "/wiki/Shekelesh-class_freight_gunship",
  "/wiki/Navigation_computer",
  "/wiki/Eastport_Docks",
  "/wiki/Tarine_tea",
  "/wiki/Kri%27gee",
  "/wiki/Ale",
  "/wiki/Pantora",
  "/wiki/Trade_Federation",
  "/wiki/Blockade_of_Pantora",
  "/wiki/Supreme_Chairman",
  "/wiki/Baron",
  "/wiki/Notluwiski_Papanoida",
  "/wiki/Riyo_Chuchi",
  "/wiki/Chi_Eekway_Papanoida",
  "/wiki/Che_Amanwe_Papanoida",
  "/wiki/Kidnapping_of_the_Papanoida_daughters",
  "/wiki/GU-series_Guardian_police_droid",
  "/wiki/Ion_Papanoida",
  "/wiki/Icon_of_the_Moon_Goddess",
  "/wiki/Greedo",
  "/wiki/Rescue_in_Chalmun%27s_Cantina",
  "/wiki/Rescue_on_the_Pantora_Droid_Control_Ship",
  "/wiki/Hutt_Clan%E2%80%93Republic_treaty",
  "/wiki/Raid_on_Ziro%27s_Palace",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Nal_Hutta",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Teth",
  "/wiki/Zygerria",
  "/wiki/Zygerrian",
  "/wiki/Zygerrian_Slave_Empire",
  "/wiki/Battle_of_Kadavo",
  "/wiki/Corellia",
  "/wiki/Denon",
  "/wiki/Electro-whip",
  "/wiki/Onaconda_Farr",
  "/wiki/Rodia",
  "/wiki/Reduced_military_spending_bill",
  "/wiki/Republic_military_enhancement_bill",
  "/wiki/V2A_DAZ",
  "/wiki/Rodian",
  "/wiki/Vice_Chair",
  "/wiki/Mas_Amedda",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Mon_Mothma",
  "/wiki/Junior_representative",
  "/wiki/Lolo_Purs",
  "/wiki/Halle_Burtoni",
  "/wiki/Mee_Deechi",
  "/wiki/Docks_under_the_derrick_major",
  "/wiki/Deechi%27s_office",
  "/wiki/Umbaran",
  "/wiki/Padm%C3%A9%27s_office",
  "/wiki/Moralo_Eval",
  "/wiki/Cad_Bane",
  "/wiki/Rako_Hardeen",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi_High_Council",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Riot_at_the_Republic_Judiciary_Central_Detention_Center",
  "/wiki/Office_of_the_Supreme_Chancellor",
  "/wiki/Sinrich",
  "/wiki/Holographic_disguise_matrix",
  "/wiki/Sedra_Hoxin",
  "/wiki/Constable",
  "/wiki/Mos_Eisley",
  "/wiki/Krayt%27s_Claw",
  "/wiki/C-21_Highsinger",
  "/wiki/Dengar",
  "/wiki/Embo",
  "/wiki/Latts_Razzi",
  "/wiki/Life_Day",
  "/wiki/Shadow_Collective",
  "/wiki/Death_Watch",
  "/wiki/Pre_Vizsla",
  "/wiki/Concordia",
  "/wiki/Ziton_Moj",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Battle_of_Mandalore",
  "/wiki/Metellos_Trade_Route",
  "/wiki/Weequay",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Ohnaka_Gang",
  "/wiki/Head_of_State",
  "/wiki/Dooku",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/NM-K_reconstitutor",
  "/wiki/Carbon",
  "/wiki/Jackar_Bowmani",
  "/wiki/Letta_Turmond",
  "/wiki/Coruscant_Guard",
  "/wiki/Barriss_Offee",
  "/wiki/19_BBY",
  "/wiki/Galactic_Emperor",
  "/wiki/Grievous",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Inquisitorius",
  "/wiki/KRONOS-841",
  "/wiki/Padawan",
  "/wiki/Eldra_Kaitis",
  "/wiki/Jee_Kra",
  "/wiki/Imperial_Office_of_Criminal_Investigations",
  "/wiki/Protocol_droid",
  "/wiki/Agent",
  "/wiki/Isquik_Tors",
  "/wiki/IG-88B",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Galactic_Civil_War",
  "/wiki/4_ABY",
  "/wiki/Battle_of_Endor",
  "/wiki/New_Republic",
  "/wiki/5_ABY",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galactic_Concordance",
  "/wiki/Hosnian_Prime_Academy_of_Law_Enforcement",
  "/wiki/19_ABY",
  "/wiki/Sector_Ranger",
  "/wiki/New_Republic_Medal_of_Distinguished_Public_Service",
  "/wiki/Exantor_Divo%27s_partner",
  "/wiki/Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Fascism",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Senate_Murders",
  "/wiki/Brian_Kalin_O%27Connell",
  "/wiki/March_19",
  "/wiki/2010",
  "/wiki/2018",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Sphere_of_Influence",
  "/wiki/Tom_Kenny",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Lightsaber_Lost",
  "/wiki/Death_Trap",
  "/wiki/R2_Come_Home",
  "/wiki/Lethal_Trackdown",
  "/wiki/Bounty",
  "/wiki/Corruption_(episode)",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_The_Official_Black_Spire_Outpost_Cookbook",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Hostage_Crisis",
  "/wiki/Hunt_for_Ziro",
  "/wiki/Kidnapped",
  "/wiki/Deception",
  "/wiki/Crisis_on_Naboo",
  "/wiki/The_Mandalore_Plot",
  "/wiki/The_Lawless",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Databank_A-Z",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Darth_Maul_(Marvel)",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Secret_Cargo",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy"
 ]
}