{
 "name": "Tantarra",
 "display_name": "Tantarra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Tantarra was a Wookiee prince and the son of Chief Attiburra. He was held captive by Trandoshans before his rescue by the Freemakers. Tantarra then helped the Freemakers recover the third Kyber Saber crystal.\nTantarra was a Wookiee pup who lived during the Galactic Civil War. He was a prince and the son of Chief Attiburra. At some point, the Trandoshan proxies of the Galactic Empire kidnapped Tantarra and held him hostage at an island fortress This forced his father Attiburra to abandon his resistance against the Trandoshans. Following the Battle of Hoth, the scavenging family known as the Freemakers traveled to the Wookiee home world of Kashyyyk to obtain a piece of wroshyr wood for the wealthy captain Ignacio Wortan. Attiburra gave them the wood but sent the Freemakers to rescue his son.\nDisguising themselves as repair crew, Zander, Kordi and Rowan Freemaker infiltrated the Trandoshans island fortress and freed Tantarra from his cell. When Zander mistakenly called him a princess, Tantarra leapt on top of him. Tantarra and his rescuers then climbed on top a building and made preparations to rendezvous with their modified B1-series battle droid looking after their starship StarScavenger. However, Rowan then sensed the presence of a Kyber Saber crystal inside the fortress.\nWhile Attiburra and his Wookiee forces attacked the Trandoshans fortress, Tantarra and the Freemakers ventured inside a sanctum where they found the Kyber Saber crystal inside the eye of a large Trandoshans statue. While Tantarra and the other Freemakers fought off the Trandoshans, Rowan struggled to remove the crystal. Tantarra hurled a Trandoshans warrior at the statue's eye, dislodging the crystal and allowing Rowan to retrieve it. The Freemakers then reunited Tantarra with his father, who praised the rescuers for giving his people hope.\nLater, Tantarra and his father Attiburra were fighting Trandoshans when Zander and Kordi traveled to Kashyyyk in an effort to find Rowan and Roger, who had hidden on an unknown planet with the last Kyber Saber crystal. Tantarra and his father saw no sign of Rowan and were unable to help.\nPrior to the Battle of Endor, Tantarra, his father Attiburra and several Wookiees joined rebel troopers led by Lieutenant Valeria in fighting Imperial forces. Lacking air support and outgunned, the Wookiees and rebels retreated to a beach where their Auzituck anti-slaver gunship was waiting. The group were cornered by an AT-ST walker.\nShortly later, the Freemakers arrived aboard their powerful new starship Arrowhead, which destroyed the AT-ST walker. The Arrowhead then destroyed several advancing AT-AT walkers; scoring the rebels a victory against the Empire.\nTantarra was a young and strong male Wookiee pup who spoke Shyriiwook. He was loved by his father Chief Attiburra, who was willing to do anything to rescue his son. After the Freemakers rescued him from prison, Tantarra believed that he owed them a favor and helped Rowan steal a Kyber Saber crystal.\nTantarra first appeared in the non-Canon LEGO Star Wars: The Freemaker Adventures episode \"Peril on Kashyyyk\", which premiered on Disney XD on June 27, 2016.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars",
  "/wiki/Kashyyyk",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Prince",
  "/wiki/Chief",
  "/wiki/Attiburra",
  "/wiki/Trandoshan",
  "/wiki/Freemakers/LEGO",
  "/wiki/Kyber_Saber",
  "/wiki/Kyber_crystal",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Hoth",
  "/wiki/Wroshyr_wood",
  "/wiki/Captain",
  "/wiki/Ignacio_Wortan",
  "/wiki/Zander_Freemaker",
  "/wiki/Kordi_Freemaker/LEGO",
  "/wiki/Rowan_Freemaker/LEGO",
  "/wiki/B1-series_battle_droid",
  "/wiki/Starship",
  "/wiki/StarScavenger",
  "/wiki/Battle_of_Endor",
  "/wiki/Lieutenant",
  "/wiki/Colvett_Valeria",
  "/wiki/Auzituck_anti-slaver_gunship",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Arrowhead_(Freemakers)",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Skirmish_on_Kashyyyk_(Freemakers)",
  "/wiki/Shyriiwook",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Peril_on_Kashyyyk",
  "/wiki/Disney_XD",
  "/wiki/June_27",
  "/wiki/2016",
  "/wiki/Duel_of_Destiny",
  "/wiki/A_Perilous_Rescue"
 ]
}