{
 "name": "Tantor_(bounty_hunter)",
 "display_name": "Tantor  (bounty hunter)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Esooma"
     ]
    },
    {
     "name": "Born",
     "values": [
      "32 BBY",
      "Esooma"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Esoomian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corf Sarb"
     ]
    }
   ]
  }
 ],
 "content": "Tantor was an Esoomian born on Esooma in 32 BBY. He worked as a pirate brawler and stopped several mutiny attempts that threatened his captain. After the captain and Tantor argued about a raise in Tantor's salary, the Esoomian attacked and jettisoned the captain into space. Tantor was shackled following the incident, for the crew's safety, but later freed himself and killed several of the pirates before escaping.\nThrough the following years, Tantor became a professional enforcer, bounty hunter, bodyguard, thug, and killer-for-hire. Lacking the slyness needed for the most profitable jobs in his area, and knowing that he was not that smart, Tantor carefully chose less lucrative, easier tasks. During the first years of the New Republic, he operated in Mos Eisley, confronting Gamorreans and agents of the New Republic—which earned him a bounty on his head. His employer, the Enu crime lord Corf Sarb, had initially agreed to pay Tantor's medical bills, but he later changed his mind. Knowing this, Tantor then turned against Sarb.\nAn Esoomian male born on the planet Esooma in 32 BBY, Tantor first left his homeworld to join the crew of a pirate starship. Tantor's tasks included intimidating victims of the ships they boarded. The Esoomian also subjugated the pirate crew during several attempted mutinies, to the benefit of the vessel's captain.\nAfter a long time without a pay rise, Tantor requested one of the captain. As Tantor and the captain had differing opinions on the pay adjustment, a discussion followed, which ended with an unsatisfied Tantor putting the captain in an escape pod and jettisoning the individual into space. The captain was succeeded by the ship's first officer, who mistrusted Tantor after this event. As such, the first officer decided to shackle the Esoomian for the crew's safety. Tantor freed himself at the following stopover, killed a number of pirates, and escaped the ship.\nEventually obtaining an Imperial Peace-Keeping Certificate, Tantor became a legitimate bounty hunter, albeit an aimless one. Realizing that his mind was not as keen as some of his colleagues', Tantor mostly worked for other individuals while sometimes accepting illegal jobs in exchange for money or favors. He nonetheless avoided the higher bounties, as they meant a harder job, and the Esoomian contented himself with a modest success. Still, he was familiar with the reputation of Jabba the Hutt, a crime lord operating on Tatooine, and Tantor hoped to travel there and join Jabba's organization one day.\nHowever, by the time Tantor reached Tatooine, Jabba had already been killed, and Tantor no longer had the Peace Keeping Certificate identifying him as an authorized bounty hunter. He looked for alternative employers, including the Enu smuggler and crime lord Corf Sarb, for whom he began working. Sarb was known to hire the best available thugs and to have them affirm their loyalty to him by killing one of his enemies or committing a crime. While working for Sarb and for other crime bosses, Tantor earned himself a reputation in Mos Eisley as an \"antennae-breaker.\"\nAt some point before 7 ABY, Sarb promised to pay for Tantor's medical expenses should Tantor fight against a clan of Gamorreans. However, once the skirmish was over, Sarb broke his oath. Tantor's partnership with Sarb soured, and the Esoomian demolished Sarb's headquarters while the Enu was inside. Tantor also fought and assaulted agents of the New Republic. Due to this, New Republic Intelligence offered a bounty of 30,000 credits for Tantor's head.\nTantor worked as a professional enforcer, bodyguard, and assassin-for-hire, sometimes collecting debts for anyone paying him. The Esoomian commonly resorted to physical violence in a straightforward style, effective in the back alleys he frequented. While he was not particularly intelligent, he had a certain guile and ambushed prey from dark alleys. A report on Tantor written by agents of New Republic Intelligence mentioned that Tantor was surprisingly loyal for a common thug. Nonetheless, Tantor disliked being betrayed by his boss, Corf Sarb, and turned against him.\nAt three meters tall, Tantor was huge and strong. He knew how to use his natural heftiness to his advantage, both in personal combat and as a tool of intimidation. He was very persuasive and had a penchant for gambling. and he could also use his naked, hooved fists to violently kill a person. Like many Esoomians, he had trouble speaking Galactic Basic Standard and spoke in a garbled tone, but understood it well enough to follow orders.\nTantor carried a vibro-ax and wore a black pauldron on each shoulder, a belt, and black pants.\nTantor first appeared in Wanted by Cracken, a 1993 sourcebook for the West End Games' Star Wars: The Roleplaying Game. The book included an image of Tantor, credited to Lucasfilm Ltd., which was a cropped, re-inked conceptual design for the rancor, drawn by Joe Johnston for the 1983 film Star Wars: Episode VI Return of the Jedi but went unused. Tantor later appeared in the 1994 roleplaying game supplement, Galaxy Guide 10: Bounty Hunters, which included the first piece of original art on Tantor, drawn by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tantor_(disambiguation)",
  "/wiki/Esooma",
  "/wiki/32_BBY/Legends",
  "/wiki/Esoomian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Corf_Sarb",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/Pirate/Legends",
  "/wiki/Unidentified_pirate_captain_(Tantor)",
  "/wiki/Captain/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Enu",
  "/wiki/Crime_lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Time/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Unidentified_pirate_first_officer",
  "/wiki/Executive_officer/Legends",
  "/wiki/Imperial_Peace-Keeping_Certificate/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Battle_of_the_Great_Pit_of_Carkoon",
  "/wiki/Smuggler/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Gambling/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Rancor/Legends",
  "/wiki/Joe_Johnston",
  "/wiki/1983",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/1994",
  "/wiki/Roleplaying_game",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/Mike_Vilardi",
  "/wiki/Category:Images_of_Tantor_(bounty_hunter)",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/4_ABY/Legends",
  "/wiki/Return_of_the_Jedi_Sketchbook"
 ]
}