{
 "name": "Tanus_Spijek",
 "display_name": "Tanus Spijek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Elom"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Elom"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray",
      "brown and white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray and pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tanus Spijek was an Elom male spy for the Alliance to Restore the Republic hired to carry messages between the planet Alderaan and the moon Yavin 4 during the Galactic Civil War. In the year 4 ABY, Spijek was on the planet Tatooine where he spent time in the palace of the crime lord Jabba Desilijic Tiure and witnessed Luke Skywalker arrive to speak with the crime lord, and witnessed the Jedi killing Jabba's pet rancor Pateesa. The Elom was amongst those who then accompanied the Hutt to the Great Pit of Carkoon on the sail barge Khetanna to witness the execution of Skywalker and several of his friends. The Jedi managed to free himself and with the help of his allies killed the Hutt and destroyed the barge.\nThe Elom male Tanus Spijek was a spy-for-hire from the planet Elom who was hired by the Alliance to Restore the Republic to act as a spy and messenger for them during the Galactic Civil War against the Galactic Empire. He ferried messages between Alderaan, a Core Worlds planet that was home to founding member of the Alliance Bail Organa—and the Alliance base on the moon Yavin 4, In the year 0 BBY, the Empire destroyed Alderaan and soon after in 0 ABY the Alliance was forced to evacuated Yavin 4 following the Battle of Yavin.\nSpijek then began working as an extortionist for the Hutt crime lord Jabba Desilijic Tiure, but interacted with few others while at the Hutt's palace on the desert planet Tatooine. In 3 ABY, the bounty hunter Boba Fett intended to deliver the smuggler Han Solo to the palace after Solo was frozen in carbonite so that he could collect the bounty that Jabba had set on the smuggler's head. However, Solo was stolen by the Crimson Dawn crime syndicate before Fett made it to Tatooine, causing Jabba to put a bounty on Fett instead. Fett then arrived at the palace to confront the Hutt but was greeted instead by the Hutt's majordomo, Bib Fortuna.\nFortuna informed Fett that Jabba was not on Tatooine as he had left to attend an auction for Solo being held by the Crimson Dawn. The majordomo then suggested Fett leave as Spijek and other employees of the Hutt appeared behind him, many with their weapons aimed at Fett. Instead of leaving, Fett reminded the crowd of his dangerous reputation and questioned if it was really fair that they might died fighting him only for the sake of Fortuna. Silently, the crowd lowered their weapons, and Fett passed Spijek as the bounty hunter entered the palace with Fortuna in order to see the invitation.\nIn 4 ABY, Spijek sat in one of the booths of Jabba's throne room during a nightime performance of the song \"Jedi Rocks\" by the Max Rebo Band. He was seated in front of the Whiphid J'Quille in order to watch and witnessed Jabba demand that the band repeat the song. The second performance however, ended with the Twi'lek dancer Oola being dropped through a trapdoor into a pit below the throne room and devoured by Jabba's pet rancor, Pateesa. As other courtiers rushed forward to watch, Spijek stayed in his booth, but raised a glass as she was eaten while others present cheered.\nImmediately after the performance, Princess Leia Organa disguised as the bounty hunter Boushh made a commotion while entering the throne room with the Wookiee Chewbacca, causing Spijek to recoil in fear as she stood in front of him to face Jabba. Organa—whose plan was in fact to try and rescue Solo from Jabba—haggled with the Hutt over the bounty price for bringing him the Wookiee, activating a thermal detonator in order to scare the Hutt into increasing his offer. Spijek and many others present in the room to cowered in fear at the explosive, but much to their relief of Organa deactivated the grenade once Jabba compromised with her on the amount. Organa was caught later that night attempting to free Solo from carbonite and imprisoned by Jabba.\nThe court celebrated Organa's capture late into the night, and in the morning Spijek was resting on the floor up against a wall alongside many other court in the throne room. He was awoken when the Jedi Master Luke Skywalker arrived demanding audience with Jabba. The Jedi sought to persuade Jabba to release Solo, Organa and Chewbacca. Spijek stood to watch the two speak, and witnessed Skywalker threaten the Hutt with a DL-18 blaster pistol taken from the guard Nizuc Bek before being dropped into the rancor pit below the throne room.\nAfter Jabba's pet rancor Pateesa ate the Gamorrean Jubnuk, who had fallen in with Skywalker, was killed by the Jedi, much to the horror of the Hutt and his court. Spijek and the crowd then watched as Skywalker and his friend Han Solo were dragged before Jabba and sentenced to death through being eaten by the sarlacc at the Great Pit of Carkoon. The Elom then boarded the Hutt's sail barge Khetanna in order to travel to the pit and witness the executions. While traveling across the Dune Sea on the barge, Spijek spoke with the Ugnaught Yoxgit. Once above the pit, Skywalker managed to free himself and board the barge from the Bantha-II cargo skiff he had been transported on. Skywalker's ally Princess Leia Organa then killed Jabba by strangling him to death and together Skywalker and his allies destroyed the sail barge and escaped Tatooine.\nSpijek was mentioned in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY. The journal noted how the spy had made a name for himself in the galaxy, which was unusual for his species as they rarely left their caves.\nUnlike most other Eloms, Tanus Spijek had no sympathy for the rebellion, despite working for them, and was a vile opportunist. The extortionist had black eyes, calloused gray and pink skin, and a thick oily pelt that was mottled gray, brown and white.\nTanus Spijek was portrayed by mime artist Graeme Hattrick in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The character was known as \"The Mole\" during production and its mask was based on a maquette that depicted Spijek with lighter gray fur. The character was not named in the film, but was first identified in the current canon in the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon.\nThe name originated from a card in the Jabba's Palace Limited set of the Star Wars Legends Customizable Card Game released by Decipher, Inc. in 1998. According to a Star Wars CCG fan site, the name was an anagram of Justin Pakes, an employee of Decipher at the time.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tanus_Spijek",
  "/wiki/Tanus_Spijek/Legends",
  "/wiki/Elom_(planet)",
  "/wiki/Elom",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Spy",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Galactic_Civil_War",
  "/wiki/Standard_year",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Luke_Skywalker",
  "/wiki/Jedi",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Galactic_Empire",
  "/wiki/Core_Worlds",
  "/wiki/Homeworld",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Great_Temple",
  "/wiki/0_BBY",
  "/wiki/The_Disaster",
  "/wiki/0_ABY",
  "/wiki/Battle_of_Yavin",
  "/wiki/Hutt",
  "/wiki/Desert",
  "/wiki/3_ABY",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Bounty",
  "/wiki/Crimson_Dawn",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Throne",
  "/wiki/Standard_day",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Max_Rebo_Band",
  "/wiki/Whiphid",
  "/wiki/J%27Quille",
  "/wiki/Twi%27lek",
  "/wiki/Oola",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boushh",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Thermal_detonator",
  "/wiki/Grenade",
  "/wiki/Jedi_Master",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Nizuc_Bek",
  "/wiki/Gamorrean",
  "/wiki/Jubnuk",
  "/wiki/Sarlacc",
  "/wiki/Dune_Sea",
  "/wiki/Ugnaught",
  "/wiki/Yoxgit",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/34_ABY",
  "/wiki/The_galaxy",
  "/wiki/Species",
  "/wiki/Eye",
  "/wiki/Oil",
  "/wiki/Graeme_Hattrick",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Decipher,_Inc.",
  "/wiki/1998",
  "/wiki/Justin_Pakes",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Gerald_Home",
  "/wiki/Rebelscum.com",
  "/wiki/December_19",
  "/wiki/June_18",
  "/wiki/2022",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/It%27s_All_In_The_Cards",
  "/wiki/Star_Wars_Galaxy_Collector_3",
  "/wiki/August_15",
  "/wiki/2005",
  "/wiki/April_6",
  "/wiki/2016"
 ]
}