{
 "name": "Tap-Nar-Pal",
 "display_name": "Tap-Nar-Pal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "44 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Merson"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Ronhar Kim"
     ]
    }
   ]
  }
 ],
 "content": "Tap-Nar-Pal, nicknamed \"Tap\", was a male Cerean Padawan serving the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars. As the war ground onward, Pal approached his Master, Ronhar Kim, with the unusual plan to have all the Senators of the Republic tested for midi-chlorians. Kim brought the idea to his old friend, Supreme Chancellor Palpatine—Palpatine agreed to think about the idea, but asked the Jedi to keep it to themselves for the time being. Immediately after their meeting with Palpatine, Kim and Pal were dispatched to the planet of Merson, to establish a staging area for a larger mission to eliminate the Merson Pirates. While Master Kim led the ground forces, Pal remained in space, leading the starfighters that defended the small fleet that had accompanied them. Both the fleet and the ground forces were ambushed upon their arrival, and were cut off from each other. The ground forces took heavy casualties, and were unable to escape when Captain Gilad Pellaeon refused to send a rescue ship. Pal took it upon himself to break away from the fight to try and rescue his Master, despite knowing that his ship had already been heavily damaged. He was quickly shot down and killed, and his master followed soon thereafter, both falling to Palpatine's manipulations.\nA Force-sensitive male Cerean, Tap-Nar-Pal was trained in the ways of the Force by the Jedi Order at the Coruscant Jedi Temple. In 32 BBY, Pal was selected for training as a Padawan by Jedi Knight Ronhar Kim of Naboo. During his apprenticeship, Pal constructed a green-bladed lightsaber and learned how to use it under Kim's tutelage.\nTen years later, when the Clone Wars erupted across the galaxy, Tap-Nar-Pal and his master devised a plan to expose the identity of the elusive second Sith. After heard the story of Obi-Wan Kenobi's imprisonment on Geonosis, and the report Kenobi had made about his interrogation by Count Dooku, Pal believed that the war could be cut short if the second Sith was exposed. As the Jedi suspected that the second Sith Lord was hidden within the members of the Republic government, Pal suggested that they test all the members of the Galactic Senate to determine their respective midi-chlorian counts. Whomever had the highest count would clearly be the Sith they sought.\nKim and his Padawan presented the plan to Palpatine, who immediately rejected the idea as too controversial. He pointed out that some Senators such as Bail Organa of Alderaan would object to the test on principle, but this was not sufficient to dissuade them. Pal suggested that Palpatine himself be the first to take the test, thereby showing the rest of the Senate that it was a good idea. Palpatine asked the two Jedi to hold off on suggesting the plan to the Jedi High Council until they could discuss it at a later time. Kim said that he and Pal were leaving on a simple mission to Merson to battle pirates for a few days, and they would hold off on informing the Council until then.\nAlmost immediately after landing on the planet, Kim, clone commander Dox, and his clone troopers planetside were overwhelmed with battle droids. Pal, flying his Delta-7 Aethersprite, and Republic Captain Gilad Pellaeon faced an insurmountable force in orbit. Intelligence reports had put the Confederate forces at five times less than what they were; knowing their destination, Palpatine had ordered Count Dooku to ensure that no one survived the battle because Palpatine indeed was the second Sith and did not want their plan to interfere in his affairs.\nPellaeon refused to land transports to evacuate the forces on the ground and decided to order a full retreat. Kim reluctantly agreed with Pellaeon, and ordered Pal to accompany the Captain out of the battle. Pal, however, ignored his Master's orders and instead plunged his fighter into Merson's atmosphere in a vain attempt to help Kim. The Cerean believed that he may be able to hold off the attacking droids long enough for Kim and his ten remaining troopers to escape, but he was quickly shot down and killed, crashing his fighter into the advancing columns of droids.\nKim quickly mourned the loss of his Padawan, then ordered Dox to engage the droid forces. He told Dox to die well, and the Jedi joined the clones in attacking the battle droids. Kim was gunned down, wounded in several places, and collapsed to the ground. As he died, he realized he had been set up by the second Sith, until a B2 super battle droid shot him in the head, killing him.\nKim and Pal were publicly mourned by Palpatine before the full Galactic Senate. He used their death as an excuse to goad on the war effort and further increase security measures, boosting his own executive power. Just as Palpatine planned, Pal's and Kim's idea to expose Darth Sidious died with them.\nComic writer John Ostrander based Tap-Nar-Pal's name after the screename of a poster on the Dark Horse forums. Ostrander speculated that Tap-Nar-Pal was born in 37 BBY.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/44_BBY/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Merson",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ronhar_Kim",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Midi-chlorian/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Death/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/32_BBY/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Bail_Prestor_Organa/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Dox",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Count_of_Serenno/Legends",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/37_BBY/Legends",
  "/wiki/Republic_64",
  "/wiki/Star_Wars:_Battle_for_the_Republic",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_139",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Jedi_Council_Forums"
 ]
}