{
 "name": "Tarados_Gon",
 "display_name": "Tarados Gon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi assault team",
      "Jedi assault team"
     ]
    }
   ]
  }
 ],
 "content": "Tarados Gon was a Force-sensitive Klatooinian who served as a Jedi Knight in the Jedi Order. In 22 BBY, Gon was part of the assault team led by Jedi Master Mace Windu that traveled to the planet Geonosis to save Jedi Knight Obi-Wan Kenobi from execution by the Confederacy of Independent Systems.\nThe Jedi engaged the Separatist forces in the Petranaki Arena but sustained heavy casualties, with Gon and the other survivors eventually finding themselves surrounded. After refusing to surrender to the Separatist Count Dooku, the Jedi were rescued by the arrival of an army of clone troopers led by Grand Master Yoda, which turned the battle around and defeated the Separatists.\nTarados Gon was a Klatooinian member of the Jedi Order who served as a guardian of the Galactic Republic. By the year 22 BBY, Gon had risen to the rank of Jedi Knight and was part of an assault team made up of 212 Jedi led by Jedi Master Mace Windu that traveled to the planet Geonosis in order to rescue Jedi Knight Obi-Wan Kenobi.\nKenobi had been captured by the Confederacy of Independent Systems, a group of political entities and companies seeking to separate from the Republic. He was due to be executed in the Geonosian Petranaki Arena alongside his Padawan, Anakin Skywalker, and Senator Padmé Amidala, both of whom had been captured trying to rescue Kenobi.\nGon and the other Jedi infiltrated the arena while the three prisoners fought to avoid death. The group of Jedi revealed themselves when Windu confronted Separatist leader Count Dooku. The Jedi then engaged an army of battle droids deployed to the arena, with Gon fighting on the arena floor.\nThe Jedi sustained heavy casualties, and soon Gon and most of the other survivors found themselves surrounded in a circle at the center of the arena. Dooku called for his droids to cease firing and commended the efforts of the Jedi, before offering them a chance to surrender.\nWindu refused the offer, and Dooku gave the order for Gon and the others to be killed. However, before the battle droids could begin firing, Low Altitude Assault Transport/infantry gunships descended on the arena carrying an army of clone troopers led by Jedi Grand Master Yoda.\nAs the droids began firing, the gunships landed in a perimeter around the surviving Jedi in order to rescue them. The Jedi then boarded the ships, which left the arena and carried their occupants to join the wider battle outside. The arrival of the clones ultimately turned the battle in the Jedi and Republic's favor, allowing them to defeat the Separatist forces and force them to flee Geonosis. Gon was mentioned in an artist's journal, which was restored, expanded, and displayed at the Graf Archive at some point after 34 ABY.\nTarados Gon was a Force-sensitive Klatooinian with brown skin.\nGon wore a light-brown tunic with dark-brown pants and used a blue-bladed lightsaber.\nTarados Gon first appeared in the 2002 prequel trilogy film, Star Wars: Episode II Attack of the Clones, played by an uncredited actor. The character was first identified by name in the new Star Wars canon in the 2018 reference book Star Wars: Alien Archive.\nThe Jedi battle in the Geonosis Arena scenes were filmed on Stage 3 at Fox Studios, Sydney, between August 10 and August 15, 2000. In an unused and unfinished alternate cut of the Battle of Geonosis in which a group of Jedi board a Droid Control Ship during the arena battle, Tarados Gon can be seen shaking hands with Saesee Tiin in the circle of surviving Jedi after they seemingly manage to shut down the droids attacking them. The droids then reactivate, leaving the Jedi surrounded once more.\nAlthough Gon's lightsaber is primarily shown as blue in color throughout Attack of the Clones, it is erroneously green in color during the shot in which Mace Windu refuses to surrender to Count Dooku. The character's name originated in the Star Wars Legends continuity, where it was first used in the 2003 reference book Inside the Worlds of Star Wars: Attack of the Clones, written by Curtis Saxton and Simon Beecroft.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tarados_Gon",
  "/wiki/Tarados_Gon/Legends",
  "/wiki/Klatooinian",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_assault_team",
  "/wiki/File:Dooku_and_Windu-Surrender.ogg",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Knight",
  "/wiki/22_BBY",
  "/wiki/Jedi_Master",
  "/wiki/Mace_Windu",
  "/wiki/Planet",
  "/wiki/Geonosis",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Death",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Petranaki_Arena",
  "/wiki/Count_of_Serenno",
  "/wiki/Dooku",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/File:Windu-What_Jedi.ogg",
  "/wiki/Galactic_Republic",
  "/wiki/Standard_year",
  "/wiki/Politics",
  "/wiki/Separatist_Crisis",
  "/wiki/Geonosian",
  "/wiki/Gender",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Prisoner",
  "/wiki/Head_of_State",
  "/wiki/Battle_droid",
  "/wiki/Droid",
  "/wiki/File:Yoda-Perimeter.ogg",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Gunship",
  "/wiki/Starship",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Graf_Archive",
  "/wiki/34_ABY",
  "/wiki/Jedi_robes",
  "/wiki/Lightsaber",
  "/wiki/2002",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars",
  "/wiki/2018",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Fox_Studios,_Sydney",
  "/wiki/August_10",
  "/wiki/August_15",
  "/wiki/2000",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Saesee_Tiin",
  "/wiki/Star_Wars_Legends",
  "/wiki/2003",
  "/wiki/Inside_the_Worlds_of_Star_Wars:_Attack_of_the_Clones",
  "/wiki/Curtis_Saxton",
  "/wiki/Simon_Beecroft",
  "/wiki/Star_Wars_Storybook_Collection:_Star_Wars:_The_Prequel_Trilogy_Stories_and_Star_Wars:_The_Original_Trilogy_Stories",
  "/wiki/The_Brink_of_War",
  "/wiki/The_Prequel_Trilogy_Stories",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Star_Wars:_100_Defining_Moments",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Made_Easy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Insider",
  "/wiki/Nick_Gillard_From_Circus_to_Sith",
  "/wiki/Star_Wars_Insider_187",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Yoda_and_Other_Users_of_the_Force",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Tarados_Gon",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/In-universe",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Oetchi",
  "/wiki/Amilyn_Holdo",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/The_Star_Wars_Archives:_Episodes_I%E2%80%93III,_1999%E2%80%932005"
 ]
}