{
 "name": "Tara_Rashin",
 "display_name": "Tara Rashin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Batuu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Left arm"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Guavian Death Gang"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Guavian Death Gang"
     ]
    }
   ]
  }
 ],
 "content": "Tara Rashin was a Quarren female pirate who led a cell of the Guavian Death Gang. She had a sinister reputation for spreading fear and intimidation by means of terrorizing ships and hijacking cargo.\nTara Rashin started as a foot soldier in the Guavian Death Gang, quickly being promoted within the organization, thanks to her tactical skills and viciousness. Upon pledging an oath to the gang and receiving a cybernetic left arm, she became the leader of her own cell based on the Outer Rim Territories. During her leadership, her cell developed a close relationship with the First Order.\nIn 34 ABY, Tara led a cell of the Guavian Death gang to attack a cargo transport flew by J-4X, who was working for Mubo on Batuu. A droid repair technician was also present on the transport and ejected the cargo to the Batuu Wilds and escaped, leaving Tara and the rest of the gang on the transport. Before leaving the transport, Tara killed J-4X.\nAfter the cargo landed on Batuu, Tara and the Guavians settled on a base on one of the many spires on Batuu. As Tara stayed in her tower while the rest of her Guavians looked for the cargo but eventually they were picked of by the same repair technician from the transport. The repair technician and C-3PO came to the tower main landing pad in search of R2-D2, who was one of the cargo the Guavians needed. Tara Rashin saw the repair technician save R2 and came out with her custom AT-RT and battled the repair technician. In the end, R2 knocked over heavy containers and it knocked over Tara and her AT-RT, sending Tara down the long spire to her death.\nTara Rashin was portrayed by Debra Wilson in the virtual reality experience Star Wars: Tales from the Galaxy's Edge.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tara",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/34_ABY",
  "/wiki/Batuu",
  "/wiki/Quarren",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Limb",
  "/wiki/Guavian_Death_Gang",
  "/wiki/Pirate",
  "/wiki/Cybernetics",
  "/wiki/Outer_Rim_Territories",
  "/wiki/First_Order",
  "/wiki/Attack_on_a_Droid_Depot_supply_vessel",
  "/wiki/J-4X",
  "/wiki/Mubo",
  "/wiki/Unidentified_droid_repair_technician",
  "/wiki/Batuu_Wilds",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/All_Terrain_Reconnaissance_Transport",
  "/wiki/Debra_Wilson",
  "/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Battle_of_Batuu",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_ABY",
  "/wiki/The_Star_Wars_Book",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}