{
 "name": "Taramyn_Barcona",
 "display_name": "Taramyn Barcona",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 BBY",
      "Aldhani"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps",
      "Aldhani rebel infiltration team"
     ]
    }
   ]
  }
 ],
 "content": "Taramyn Barcona was a human male who was a stormtrooper in the Galactic Empire's Stormtrooper Corps before becoming a rebel soldier as part of a team that served a mission on the planet Aldhani.\nTaramyn Barcona was a human male who at one point became a stormtrooper for the Galactic Empire. Eventually, he would leave Imperial service and become a rebel.\nBarcona later became a part of Vel Sartha's team who traveled to the planet Aldhani to undertake a mission to rob the Aldhani Garrison. Three days before the mission was set to take place, Sartha returned to camp with a new member for the group, who was introduced as Clem, but in actuality was Cassian Andor. Barcona and fellow rebel Arvel Skeen were both disturbed by the sudden appearance of a new man so close to the operation, but when Barcona attempted to raise his concern to Sartha, he was quickly shut down. Later, Barcona and Skeen questioned how Sartha knew the man, and although Sartha admitted that she did not, she said that all that mattered was that he was here and they needed another person to complete the mission.\nWhen Imperial Lieutenant Gorn, the team's inside man at the garrison, arrived at camp, he was also displeased, but Sartha straightened him out before Barcona and the others assembled to go over the plan. The next day, the rest of the team, Andor, Skeen, Karis Nemik, and Cinta Kaz, assembled outside to drill. Barcona led Skeen, Nemik, and Andor to practice walking like Imperial soldiers, as they would be wearing disguises to sneak inside. When Andor suggested that the right-handed Barcona switch sides of their formation with the left-handed Skeen, Barcona told Andor to focus instead of trying to suggest things to him. However, Sartha asked Andor why he had said that, and when he explained that each person's weapon should be on the outside, Sartha glared at Barcona, who accepted the suggestion.\nBarcona led the team through their initial steps, arriving under Gorn's supervision and being sent inside with the Imperial commandant, Jayhold Beehaz, as well as his wife and son. Once inside, they sprang their trap, turning their weapons on the family and taking them hostage. Although Barcona had one of the hostages at gunpoint, Colonel Petigar drew his weapon as well and aimed it at Nemik, threatening them to let the child go. Just then, Sartha and Kaz arrived, with the latter gunning down Petigar and allowing the group to proceed.\nThe group methodically worked their way to the vault, leaving Kaz with the commandant's family while the others took him to the vault, as they needed his handprint to open it. Barcona rounded up the six guards that were stationed down in the vault before helping the others force them to load the credits onto the freighter. Gorn arrived a short while after, but only moments after him, a team of Imperials who had discovered the infiltration did as well, led by Corporal Kimzi. Kimzi shot and killed Gorn as a firefight erupted. When Barcona attempted to help Sartha, who was pinned down and unable to join the team on the freighter, he instructed Skeen to cover him, but Skeen failed to defend him and Barcona was taken down. Sartha, Skeen, Nemik, and Andor would escape on the freighter, although Nemik would die soon after the escape to an injury suffered in takeoff. Meanwhile, Kaz donned a disguise and left a different way.\nBarcona was a tall human male who had black hair that included a mustache. He was a good leader, being placed in charge of the group when Sartha departed them to execute her part of their plan. He was wary of the newcomer Cassian Andor and demanded to know about him when Sartha brought him to the camp. Barcona was a right-handed individual.\nAs a former stormtrooper, Barcona was well versed in military conduct, including marching, signals, and intonation when delivering commands. He demanded discipline from his fellow rebels and was a stern leader.\nTaramyn Barcona was played by Gershwyn Eustache Jnr in the television series Andor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/5_BBY",
  "/wiki/Aldhani",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Stormtrooper",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Planet",
  "/wiki/Vel_Sartha",
  "/wiki/Aldhani_Garrison",
  "/wiki/Standard_day",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Arvel_Skeen",
  "/wiki/Lieutenant",
  "/wiki/Gorn",
  "/wiki/Karis_Nemik",
  "/wiki/Cinta_Kaz",
  "/wiki/Soldier",
  "/wiki/Commandant",
  "/wiki/Jayhold_Beehaz",
  "/wiki/Roboda_Beehaz",
  "/wiki/Leonart_Beehaz",
  "/wiki/Colonel",
  "/wiki/Petigar",
  "/wiki/Credit",
  "/wiki/Corporal",
  "/wiki/Kimzi",
  "/wiki/Category:Images_of_Taramyn_Barcona",
  "/wiki/Aldhani_(episode)",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Announcement",
  "/wiki/Star_Wars",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Death",
  "/wiki/Kassa_(episode)"
 ]
}