{
 "name": "Tardon_Golor",
 "display_name": "Tardon Golor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Born",
     "values": [
      "33 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    }
   ]
  }
 ],
 "content": "Tardon Golor was a Twi'lek starship thief, who operated during the early years of the New Republic. Golor even managed to steal B-Wing and X-Wing starfighters from the New Republic.\nTardon Golor was born on the planet Ryloth in 33 BBY. A starship thief, Golor once worked with a young Niles Ferrier, and the pair learned their trade together. Golor did not particularly care what ships he stole; depending on the demand for a particular ship, he stole both military and civilian vessels. He would subsequently sell the ships on to smugglers or those who supplied pirates or criminal organizations. Golor was wanted by the New Republic for the theft of several New Republic starships, including several T-65 X-wing starfighters and a pair of A/SF-01 B-wing starfighters. Intelligence reports indicated that Golor attempted to contact the Galactic Empire in order to sell his ships and components. The New Republic offered a reward of 18,000 credits for Golor's capture on the charges of theft of New Republic property and theft of civilian property.\nTardon Golor was a male Twi'lek who was two meters tall with elaborately tattooed lekku. He was shrewd bargainer, con artist, and gambler.\nGolor was skilled in the use of a blaster and blaster artillery, and was knowledgeable about alien species, cultures, and languages. Golor had an understanding of bureaucratic procedure, and knowledge of law enforcement practices. Golor knew how to contact the criminal underworld, determine the value of items, and use stealth techniques effectively.\nGolor was a skilled pilot, capable of flying transports and starfighters. He could operate the weapons and deflector shield systems on the vessels, and navigate the ships through hyperspace. Golor could also drive repulsorlift vehicles. His technical skills included computer programming and repair, droid programming and repair, transport and starfighter repair, starship weapon repair, and bypassing security systems.\nGolor was armed with a hold-out blaster, and carried a datapad, pocket computer with scomp link. The computer was pre-programmed with three hyperspace jump coordinates and was also used to override starship security programs.\nTardon Golor was profiled in Wanted by Cracken, published in 1993 by West End Games. Mike Jackson supplied the image for Golor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Starship/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/A/SF-01_B-wing_starfighter/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Niles_Ferrier",
  "/wiki/Smuggler/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Tattoo/Legends",
  "/wiki/Lekku/Legends",
  "/wiki/Con_artist/Legends",
  "/wiki/Gambler/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_artillery",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Pocket_computer",
  "/wiki/Scomp_link/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Mike_Jackson"
 ]
}