{
 "name": "Tarfang",
 "display_name": "Tarfang",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black with a diagonal white stripe"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Intelligence Service",
      "Galactic Alliance Intelligence Service"
     ]
    }
   ]
  }
 ],
 "content": "Tarfang was a male Ewok smuggler. He served as copilot on the freighters XR808g and later DR919a alongside the Sullustan Jae Juun.\nTarfang was a male Ewok from the forest moon of Endor. He was unique among his species, in that he had left the sanctity of his homeworld to carve his own niche in the galaxy. Tarfang's exploits often landed him in unfavorable positions, and his endeavors were usually of a criminal nature. By 35 ABY, Tarfang's illegal activities had earned himself death sentences in over ten star systems. He had also met and partnered himself by this time with Jae Juun, a Sullustan pilot and fellow smuggler.\nTarfang and Juun met the Solos and the Skywalkers, when they were asking about the whereabouts of the Jedi Joiners. He tagged along with Jae Juun during the Dark Nest Crisis. He along with Juun brokered a deal with some Squibs for some spinglass replicas of Luke's T-65 X-Wing and the Falcon to send to the Fifth Fleet shortly after the Skirmish at Qoribu. He, along with Juun found Han Solo and Luke Skywalker. The pair aided them in getting onto the Dark Nest's nest ship. He showed his penchant for violence when Han Solo during combat briefly lost the lightsaber of Mara Jade that he had with him, Tarfang took it and viciously wielded it to dice up Killiks to great effect. During the Swarm War Tarfang was recruited to serve in the Galactic Alliance Intelligence Service with Jae Juun, even when they had previously worked indirectly for the Killiks.\nAfter the end of the Dark Nest Crisis, Tarfang and Juun continued to rise the intelligence ranks and continued going on missions for the Galactic Alliance.\nTarfang and Juun would later reunite with the Solos on Kashyyyk before the Battle of Kashyyyk. Tarfang and Juun were watching the Wookiees and spotted the Solos, and attempted to arrest them. While at the Rock Council Tarfang fought Leia for control of the conversation as per customs. Since Leia was not able to use the Force the battle was difficult and brutal with Tarfang trying to choke Leia and bash her head against the rock. Eventually Leia tossed Tarfang off of the rock just as Luke arrived. Tarfang gave the jawbone, which granted whoever held it the right to speak at the Council, to Luke.\nTarfang was fairly intelligent for an Ewok, and he was technically adept. Though unable to speak it, Tarfang could fully understand Galactic Basic Standard. Tarfang was also able to communicate with Killiks. Tarfang was considered particularly vicious for an Ewok; he exhibited a short, volatile temper, and flailed his arms about in an exaggerated fashion when angry. Jedi Master Saba Sebatyne openly regarded the Ewok as an unpleasant being.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Endor/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Intelligence_Service",
  "/wiki/Saba_Sebatyne",
  "/wiki/Smuggler/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/XR808g",
  "/wiki/DR919a",
  "/wiki/Sullustan/Legends",
  "/wiki/Jae_Juun",
  "/wiki/Moon/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/35_ABY/Legends",
  "/wiki/Death/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Joiner",
  "/wiki/Dark_Nest_Crisis",
  "/wiki/Squib/Legends",
  "/wiki/Spinglass",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Galactic_Alliance_Fifth_Fleet",
  "/wiki/Skirmish_at_Qoribu",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Gorog",
  "/wiki/Nest_ship",
  "/wiki/Han_Solo/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Killik/Legends",
  "/wiki/Swarm_War",
  "/wiki/Battle_of_Kashyyyk_(Second_Galactic_Civil_War)",
  "/wiki/Rock_Council",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_95",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}