{
 "name": "Targen",
 "display_name": "Targen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tanned"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Around left eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Targen's gang"
     ]
    }
   ]
  }
 ],
 "content": "Targen was a Human male who worked as the head of a freelance gang on Nal Hutta during the Cold War between the Republic and the resurgent Sith Empire. In the year 3643 BBY, he and his men were hired to install listening devices in the room of the mercenary Red Blade at the Hutt crime lord Suudaa Nem'ro's palace. While they installed the devices, the Blade; who was actually the Imperial Intelligence agent Cipher Nine, returned and killed the freelancers.\nBy the year 3643 BBY, during the Cold War between the Sith Empire and the Galactic Republic, the Human male Targen had come to lead a gang of freelancers who worked on the planet of Nal Hutta. In that year he and his men were paid to plant a number of listening devices in the room of the mercenary Red Blade, who was staying in the palace of the Hutt crime lord Suudaa Nem'ro. The gang leader brought three of his followers with him to the mercenary's room, two Twi'lek thugs and the Rodian Luunti. The group began installing the devices, but were interrupted by the arrival of the Blade, who was, unbeknownst to them, in fact an undercover agent of Imperial Intelligence known as Cipher Nine.\nTargen turned to face the Agent as they entered the room and explained what they were doing, after which the Imperial immediately attacked and killed all four gang members, including Targen.\nTargen had brown hair, green eyes and tanned skin. Upon being found by who he believed to be the Red Blade, he assumed that the mercenary would attack him and his men. He was unwilling to betray the group who employed him and his men as he did not want to earn their ire, even for triple what he was already being paid.\nTargen carried a blaster pistol and wore brown clothing while installing the listening devices. He also had cybernetics installed around his left eye socket.\nTargen was created for the 2011 BioWare MMORPG Star Wars: The Old Republic. He appeared in the quest \"Economies of Scale\" which is part of the Imperial Agent class's story on the planet Hutta. Players have the option to immediately attack Targen and his comrades once encountering them for dark side points, trying to make a deal with them for light side points or asking who hired them for no alignment points. This article assumes that players chose the dark side option as the Agent is an Imperial character. If the player attempts to talk to the gang or make a deal with them, Targen refuses to betray his employer and the group attack and are killed anyway.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Targen%27s_gang",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Standard_year/Legends",
  "/wiki/Listening_device/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Red_Blade",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Nem%27ro%27s_Palace",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Imperial_Agent",
  "/wiki/Cipher_Nine",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Luunti",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Hair/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}