{
 "name": "Targada",
 "display_name": "Targada",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Targada was a Klatooinian male who for a time lived as a slave, but eventually gained his freedom and joined the New Republic Defense Fleet. He saw action during the rebellion on Akiva.\nTargada was a former Klatooinian slave who joined the New Republic. During the Rebellion on Akiva, he served as an New Republic Defense Fleet ensign under Commander Kyrsta Agate onboard the frigate Sunspire. Mid battle, the vessel's scanners picked up a lone yacht headed for one of the Imperial Star Destroyers, and Agate asked Targada to track its movements. When the Klatooinian asked if they should fire on the ship, the commander decided to focus fire on the Star Destroyer instead, as the yacht might contain an intelligence asset. The yacht, which was carrying Imperial Admiral Rae Sloane, managed to reach one of the Star Destroyers and escape, but the New Republic ultimately won the battle.\nTargada was a gruff individual with a high brow and a frowning mouth. As a former slave, he was loudly loyal to the New Republic.\nTargada first appeared in the novel Aftermath, which was written by Chuck Wendig and released in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Klatooinian",
  "/wiki/Gender",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Slavery",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Akiva",
  "/wiki/Ensign",
  "/wiki/Commander",
  "/wiki/Kyrsta_Agate",
  "/wiki/Frigate",
  "/wiki/Sunspire_(New_Republic)",
  "/wiki/Yacht",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Destroyer",
  "/wiki/Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Mouth",
  "/wiki/Aftermath_(novel)",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(audiobook)"
 ]
}