{
 "name": "Tari_Darkspanner",
 "display_name": "Tari Darkspanner",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3637 BBY",
      "Yavin 4"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Order of Revan"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Morrun Dokaas"
     ]
    }
   ]
  }
 ],
 "content": "Tari Darkspanner  was a Human female Sith who was the master of the Sith cult known as the Order of Revan during the Cold War. She founded the Order after learning of Revan during her time on Korriban as a Sith acolyte. She learned of Revan's visit to Dromund Kaas three centuries prior to the Cold War, and believed that he had overthrown the Sith Emperor and sat in his throne.\nShe lived within the Revanite compound on the Sith Empire's capital planet of Dromund Kaas. Initiates who completed their Pilgrimage were granted an audience with \"her\" in the form of a hologram of a man dressed as Revan. But she later appeared in person to a new cult member and asked them to help keep the cult safe from Darth Charnus and his apprentice Emic Sandor.\nDarkspanner eventually learned of Revan's true fate when the man himself appeared to her in a vision, requesting her to leave Dromund Kaas to find him. Revan, impressed with Darkspanner and all she had accomplished with the Order of Revan, offered her the opportunity to expand the order's roster and purpose. Granted the title of Lord Darkspanner, she served as one of Revan's most trusted commanders until her death on Yavin 4 by joint champions of the Empire and Republic.\nTari Darkspanner is a character from the 2011 Star Wars: The Old Republic MMORPG video game. She appears during the Dromund Kaas Revanite missions exclusive to Imperial players.\nUpon the completion of the Revanites' trials, Darkspanner offers the player a way to get the Empire off the trail of the Revanites; she had procured a Sith amulet from Darth Charnus and she wants the player to give it to Sandor to frame his master as the Revanites' leader. The player can either go along with Darkspanner's plan, setting Sandor against Charnus ; or identify Darkspanner to Sandor, allowing the Dark Council to capture her . Given that Charnus later appears during the Battle of Corellia, and Darkspanner later re-emerges on Yavin 4, both efforts would not achieve their intended aim.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3637_BBY",
  "/wiki/Yavin_4/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Order_of_Revan",
  "/wiki/Morrun_Dokaas",
  "/wiki/Sith/Legends",
  "/wiki/Master_of_the_Order_of_Revan",
  "/wiki/Sith_cult/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Revan/Legends",
  "/wiki/Korriban",
  "/wiki/Sith_Acolyte",
  "/wiki/Attack_on_the_Sith_Emperor",
  "/wiki/Dromund_Kaas",
  "/wiki/Tenebrae",
  "/wiki/Revanite_compound",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Pilgrimage",
  "/wiki/Darth_Charnus",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Emic_Sandor",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Video_game",
  "/wiki/Battle_of_Corellia",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/3638_BBY",
  "/wiki/2013",
  "/wiki/Standard_year/Legends",
  "/wiki/2014",
  "/wiki/3636_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}