{
 "name": "Tarkin%27s_creature",
 "display_name": "Tarkin's creature",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hybrid of several",
      "including Iktotchi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark red",
      "Green",
      "Orange"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic left eye"
     ]
    }
   ]
  }
 ],
 "content": "The Imperial Grand Moff Wilhuff Tarkin created a creature sometime before the Battle of Yavin as a part of the weapon-manufacturing Tarkin Initiative. A hybrid of several different species, the being was one among several subjects designed to be weapons of war, but the project was eventually shut down by Tarkin and all experiments were ordered to be terminated. This creature, however, survived, and plotted to destroy the Grand Moff for the crimes he had committed.\nTracking Tarkin down to the Imperial II-class Star Destroyer Optima, the creature attacked the vessel and its crew, determined to stop the Imperial Governor from continuing to hurt others. Tarkin managed to escape, rigging the ship to explode and locking its escape pods in place to prevent witnesses from fleeing. After seeing his creator's cruelty, the creature took pity on the vessel's crew and helped propel their pod from the doomed ship, dying alone in the ensuing explosion.\nThe creature first appeared in Star Wars Adventures: Return to Vader's Castle 2, a comic book written by Cavan Scott.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Hybrid",
  "/wiki/Iktotchi",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Yellow",
  "/wiki/Cybernetics",
  "/wiki/Galactic_Empire",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Battle_of_Yavin",
  "/wiki/Tarkin_Initiative",
  "/wiki/Species",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Optima",
  "/wiki/Starship",
  "/wiki/Governor",
  "/wiki/Escape_pod",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_2",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Cavan_Scott"
 ]
}