{
 "name": "Tarkov",
 "display_name": "Tarkov",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.15 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish-brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tarkov was a male Wookiee woodsmith who lived near the city of Kachirho on the planet Kashyyyk. In 19 BBY, during the Clone Wars, Tarkov stumbled upon a large Separatist invasion army while he was hunting with his son, Jaccoba. Tarkov and his son then reported the Separatist presence to the nearby towns of Warralokk, Grunnrurr, and Rowrakruk. Later, when the Republic sent a large detachment of their army to protect Kashyyyk, Tarkov and Jaccoba fought alongside the Republic's forces to defend Kachirho from the Confederacy.\nTarkov was a Wookiee male woodsmith living near the city of Kachirho, in the Wawaatt Archipelago on the planet of Kashyyyk. In 19 BBY, during the height of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, Tarkov took his son Jaccoba on a grantaloupe—a four-legged herbivore—hunt that would promote Jaccoba to adulthood. During the hunt, a wayward spear thrown by his son hit a large piece of shrubbery, making a metallic echo. When Tarkov inspected the shrubbery, curious as to why a plant would be making a metallic sound, the Wookiee discovered that the plant was actually a Separatist landing craft. Tarkov and Jaccoba moved to a nearby tree for safety, and as they looked down at the landscape, they saw a large Separatist invasion army.\nRetreating to the city of Kahiyuk, the pair alerted the nearby towns of Warralokk, Grunnrurr, and Rowrakruk to the presence of the Separatists. Soon after, the Republic sent a task force of their army, under the command of Jedi Grand Master Yoda, to reinforce the Wookiees' defense of Kashyyyk. When the Separatists launched an attack on Kachirho, Tarkov and Jaccoba joined the local military, and were among the Wookiees who fought alongside the Republic army to repel the Separatist invaders.\nTarkov was somewhat inquisitive; after Jaccoba hit the disguised MTT with his spear, Tarkov scrutinized the \"plant\", wanting to know why it was making metallic sounds. Tarkov was also a brave warrior, willing to defend Kachirho from the Separatist invasion force.\nTarkov made his first appearance in the twenty-second chapter of the Star Wars: Clone Wars animated television series. The chapter originally aired on Cartoon Network on March 22, 2005, and was the second episode in the series' third season, and was released on the Star Wars: Clone Wars Volume Two DVD. Tarkov was later given his own entry in the StarWars.com Databank and The Complete Star Wars Encyclopedia, which identified his name and expanded on his biography. Tarkov's Databank entry also mistakenly refers to Kashyyyk as a moon.\nIt was revealed in the Ask the Master Q\u0026A section of Star Wars Insider 90 that Tarkov was named after Genndy Tartakovsky, the director of Star Wars: Clone Wars, while Jaccoba was named after Tartakovsky's son, Jacob.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/City/Legends",
  "/wiki/Kachirho/Legends",
  "/wiki/Planet/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Jaccoba",
  "/wiki/Warralokk/Legends",
  "/wiki/Grunnrurr/Legends",
  "/wiki/Rowrakruk/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Battle_of_Kashyyyk/Legends",
  "/wiki/Wawaatt_Archipelago/Legends",
  "/wiki/Grantaloupe",
  "/wiki/Spear/Legends",
  "/wiki/Plant/Legends",
  "/wiki/C-9979_landing_craft/Legends",
  "/wiki/Kahiyuk/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Clone_Wars_Chapter_22",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Cartoon_Network",
  "/wiki/March_22",
  "/wiki/2005",
  "/wiki/Clone_Wars:_Season_Three",
  "/wiki/Star_Wars:_Clone_Wars_Volume_Two",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Moon/Legends",
  "/wiki/Ask_Lobot",
  "/wiki/Star_Wars_Insider_90",
  "/wiki/Genndy_Tartakovsky",
  "/wiki/Jacob_Tartakovsky",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_24"
 ]
}