{
 "name": "Tarl_Sokoli",
 "display_name": "Tarl Sokoli",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "Forerunner II"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Imperial Officer Corps",
      "Stormtrooper Corps",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Tarl Sokoli, nicknamed the Spine Dragon of Anaxes, was a human male who served as a stormtrooper captain in the Galactic Empire, being pivotal in the liberation of the planet Chorin. During a parade on Chorin, Sokoli inspired a young boy Beilert Valance to pursue joining the Imperial Military. Sokoli came across Valance again, at Carida Academy, deeming the boy unfit to serve the Imperial Navy due to his injuries.\nSokoli later became a admiral and commanded the light cruiser Forerunner II. His growingly public dissatisfaction of the Empire became known to Darth Vader, who tasked the now rebuilt cyborg Valance with killing the admiral, giving the false excuse that the war hero has joined the criminal syndicate Crimson Dawn. Sokoli was lured near the Eriadu system, where Valance's Dark Squadron went to engaged his forces.\nSokoli's forces fought Dark Squadron, eventually destroying two of the squadron's TIE/d \"Defender\" Multi-Role Starfighters while the admiral's forces suffered their own losses. Valance then crashed his defender into the Forerunner II's bridge and confronted Sokoli in person. The pair conversed, and the admiral learned about Valance's motives. When two stormtroopers attempted to intervene, Sokoli shot at Valance, only to be fatally shot himself by the cyborg's palm blaster.\nHaving grown up on a planet he considered plagued with cruelty, Tarl Sokoli went on to serve as a stormtrooper in the Galactic Empire's Imperial Army, eventually holding the rank of captain and bearing the nickname \"Spine Dragon of Anaxes.\" He took part in the liberation of the mining planet of Chorin, during which he led the charge on Chorin City, where pirates had enslaved the miners. Sokoli was rumored to have killed around seventeen of the pirates. Following the Empire's victory on Chorin, Sokoli took part in a victory parade through the streets of Chorin City with his fellow stormtroopers.\nSokoli sat aboard an All Terrain Tactical Enforcer during the march until he noticed a young resident, named Beilert Valance, emerge from the crowd. The captain halted his march and disembarked from his walker to approach Valance. Stopping a stormtrooper from taking the boy away, he offered Valance his last ration bar, then asking if the resident knew who he was. When Valance called him a hero, Sokoli dismissed himself as a humble servant of the Empire doing his part to bring order to the galaxy, further suggesting the boy could be doing the same one day.\nSokoli continued to fight battles for the Empire, eventually becoming an Imperial officer. Over time, he grew disillusioned with the Empire which he had so valiantly promoted the vision of. Between 13 BBY and 10 BBY, the captain went to the Imperial Naval Academy on the planet Carida to give a lecture. On his way to the lecture, accompanied by a lieutenant, he collided with a cadet who was wishing to attend the speech. The cadet was Valance, who had joined the academy under the inspiration of Sokoli, but had also received several permanent injuries during training in an active warzone.\nThe captain immediately noticed Valance's new cybernetic leg and eye patch and stopped his lieutenant from arranging a punishment for the cadet. Valance then told Sokoli about Chorin and how the captain had inspired him to join the Imperial Navy. Sokoli, though, did not remember his time on Chorin and apologized to the cadet for leading the boy astray, believing Valance would never be able to fly again with the his injuries. With the lieutenant urging him to get to his lecture, the captain went on his way.\nAs his service with the Empire continued, Sokoli eventually reached the rank of admiral and acquired his own light cruiser, the Forerunner II. His dissatisfaction with the Empire, though, grew public enough to catch the attention of the Sith Lord Darth Vader. Between 3 ABY and 4 ABY, Vader falsely labeled the admiral as a mole for the resurgent criminal syndicate Crimson Dawn and tasked some of his assets, the TIE/d \"Defender\" Multi-Role Starfighters of Dark Squadron, with taking out the supposed traitor. Valance had been put in charge of the squadron. By that time the boy from Chorin had sustained many more injuries in his time with the Empire, becoming a cyborg to survive.\nAlthough he had been discharged from the Imperial Military and became a bounty hunter, Valance was later captured by Vader and forced under blackmail to serve the Sith Lord in his mission to eliminate the Crimson Dawn's growing threat. Vader used the mission to eliminate Soloki as a test of the cyborg's loyalty, knowing of the history Valance had with the admiral.\nVader sent orders to the Forerunner II to travel to outside the Eriadu system. With the cruiser following the orders, Dark Squadron arrived sometime after and approached Sokoli's vessel, one of the bridge officers informing the admiral of the arrival. Sokoli was confused about the presence of TIE Defenders, believing they had all been decommissioned years before, but his officer insisted that their clearance codes checked out. The admiral then discovered through the officer that Vader had sent the prior orders to the Forerunner II and deduced that it was a trap. Although the bridge officer was skeptical of his deduction, Sokoli ordered for his cruiser's TIE/ln space superiority starfighters to be scrambled.\nDark Squadron engaged the Forerunner II and its escort, taking out a number of TIE fighters. After one of Dark Squadron was able to take out the cruiser's hyperdrive, Sokoli ordered his panicked bridge crew to calm themselves and start firing the Forerunner II's cannons. The Imperial gunners were initially unable to hit any TIE Defenders, one stressing that they were too fast, so the admiral advised them to draw the enemy TIEs into the firing line of the cruiser's front cannons. Sokoli's idea worked, and a TIE Defender was destroyed. After another defender was destroyed, Valance chose to fly his own into the bridge of the Forerunner II to get to Sokoli. Watching the defender approach him, the admiral commended the tactical decision before it crashed into the bridge.\nSokoli was injured by the crash, his bridge crew being taken out in the process. The admiral then spoke with Valance as the cyborg exited his crashed TIE. Learning that Valance was there to kill him, Sokoli questioned the reason for it, to which Valance explained the claim that the admiral was a Crimson Dawn mole and that the Sith Lord was blackmailing him. Sokoli then began analyzing the Valance's cybernetic features and motives, identifying his opponent as a seasoned killer. Valance once again brought up how Sokoli had inspired him to join the Empire, making the admiral realize that the cyborg was a \"convert\" who had since been disillusioned with the Empire. Two stormtroopers then arrived, which Valance attacked. Sokoli fired at the cyborg, proclaiming that life was full of disappointments, but Valance fatally shot the admiral with his palm blaster.\nTarl Sokoli was a human male with light skin and black hair, which later turned grey. During his time fighting battles, he held the humble view that he was but a servant of the Galactic Empire doing his part, advising the young Beilert Valance that he could be the same. When second time he met Valance, though, he pitied the cadet after witnessing the injuries he had sustained, believing there was no place for the boy in the Imperial Navy.\nEarlier into his service in the Empire, Sokoli wore the standard white stormtrooper armor. Later into his career, he donned the standard grey uniform of an Imperial officer, which included an Imperial kepi, a code cylinder above each of his breasts and a rank plaque which denoted his rank of captain and later admiral.\nTarl Sokoli first appeared through flashbacks and hologram in the comic Bounty Hunters 18, which was written by Ethan Sacks, illustrated by Ramon Bachs and Bryan Valenza, and released on December 1, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bounty_Hunters_19",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Forerunner_II",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Stormtrooper",
  "/wiki/Captain",
  "/wiki/Liberation_of_Chorin",
  "/wiki/Planet",
  "/wiki/Chorin",
  "/wiki/Beilert_Valance",
  "/wiki/Imperial_Military",
  "/wiki/Carida_Academy",
  "/wiki/Imperial_Navy",
  "/wiki/Admiral",
  "/wiki/Commanding_officer",
  "/wiki/Light_cruiser",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cyborg",
  "/wiki/Crimson_Dawn",
  "/wiki/Eriadu_system",
  "/wiki/Dark_Squadron",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Bridge_(starship)",
  "/wiki/Palm_blaster",
  "/wiki/Imperial_Army",
  "/wiki/Military_rank",
  "/wiki/Anaxes",
  "/wiki/Mining",
  "/wiki/Chorin_City",
  "/wiki/Pirate",
  "/wiki/Death",
  "/wiki/City",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Walker",
  "/wiki/Ration_bar",
  "/wiki/The_galaxy",
  "/wiki/Standard_day",
  "/wiki/Imperial_officer",
  "/wiki/13_BBY",
  "/wiki/10_BBY",
  "/wiki/Carida",
  "/wiki/Unidentified_Imperial_lieutenant_(Carida)",
  "/wiki/Cadet",
  "/wiki/Cybernetics",
  "/wiki/Limb",
  "/wiki/Eye",
  "/wiki/Lieutenant",
  "/wiki/Sith_Lord",
  "/wiki/Squadron",
  "/wiki/Bounty_hunter",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Cruiser",
  "/wiki/Starship",
  "/wiki/Officer",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/TIE_line",
  "/wiki/Dark_Five_(pilot)",
  "/wiki/Hyperdrive",
  "/wiki/Cannon",
  "/wiki/Imperial_weapons_technician",
  "/wiki/Dark_Three_(pilot)",
  "/wiki/Dark_Four_(pilot)",
  "/wiki/Hair",
  "/wiki/Stormtrooper_armor",
  "/wiki/Clothing",
  "/wiki/Imperial_kepi",
  "/wiki/Code_cylinder",
  "/wiki/Breast",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Bounty_Hunters_18",
  "/wiki/Ethan_Sacks",
  "/wiki/Ram%C3%B3n_F._Bachs",
  "/wiki/Bryan_Valenza",
  "/wiki/December_1",
  "/wiki/2021",
  "/wiki/Category:Images_of_Tarl_Sokoli",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Han_Solo",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Navy",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Han_Solo_-_Imperial_Cadet_5",
  "/wiki/Target_Vader_5",
  "/wiki/Marvel_Comics"
 ]
}