{
 "name": "Tarla_Limpan",
 "display_name": "Tarla Limpan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Duro"
     ]
    },
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Blue Diver"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Galactic Federation of Free AlliancesGalactic Alliance Defense FleetGalactic Alliance Second Fleet",
      "Galactic Alliance Defense FleetGalactic Alliance Second Fleet",
      "Galactic Alliance Second Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Tarla Limpan was a female Duros who served in the New Republic, and later the Galactic Alliance Defense Forces. During the Second Galactic Civil War, she led the Galactic Alliance Second Fleet as an admiral, though she was killed when her flagship, the Blue Diver, was destroyed by Centerpoint Station.\nDuring the Yuuzhan Vong War, she was a Captain in the New Republic. As of 40 ABY, Limpan was an admiral in the Galactic Alliance Defense Fleet, though she had become somewhat relaxed after years of peacetime. She served as captain of the Dodonna, as well as commander of the Second Fleet task force within the Corellian system following the removal of Matric Klauskin, who was deemed to be insane. She led the Galactic Alliance forces during the Battle of Tralus with the supposed aid of Leia Organa Solo.\nMonths later, during the blockade of the Corellian System, Limpan was forced to retreat when forces from Commenor and Bothan Space forces launched a surprise assault to break the Blockade of Corellia. At this point Limpan transferred her flag from Dodonna to the Blue Diver. Limpan ordered her forces to attempt to disable Centerpoint Station before leaping out of the system, to regroup at Point Bleak.\nLimpan led the Second Fleet once again during a meeting between the Corellian forces and co-Chief of State Jacen Solo in an isolated star system, three months later. The Duros Admiral was ordered to support Solo in case the meeting was a trap; when the Confederation forces engaged Solo with antiquated vessels, Limpan entered the battle, leading the Second Fleet aboard the Blue Diver. However, the trap was not one which would be fought conventionally; from the Corellian system, the Corellian leadership fired Centerpoint Station, unleashing a torrent of gravitic energy which wiped out the Second Fleet. Admiral Limpan perished along with the vast majority of her command.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Duro/Legends",
  "/wiki/40_ABY",
  "/wiki/Blue_Diver",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Defense_Fleet",
  "/wiki/Galactic_Alliance_Second_Fleet",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Galactic_Alliance_Defense_Force",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Admiral/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Centerpoint_Station",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Captain/Legends",
  "/wiki/Dodonna_(Galactic-class)",
  "/wiki/Corellian_system",
  "/wiki/Matric_Klauskin",
  "/wiki/Battle_of_Tralus_(Second_Galactic_Civil_War)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Commenor/Legends",
  "/wiki/Bothan_sector",
  "/wiki/Blockade_of_Corellia",
  "/wiki/Point_Bleak",
  "/wiki/Darth_Caedus",
  "/wiki/Legacy_of_the_Force:_Betrayal",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Garm_Bel_Iblis/Legends"
 ]
}