{
 "name": "Tarnis_(Sith_Lord)",
 "display_name": "Tarnis  (Sith Lord)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Sith Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Praven"
     ]
    }
   ]
  }
 ],
 "content": "Tarnis was a Human male Sith Lord of the reconstituted Sith Empire who lived during the Great Galactic War and the subsequent Cold War with the Republic. The son of the legendary Darth Angral, Tarnis was trained by his father's apprentice Lord Praven to the rank of Sith Lord before embarking on an undercover assignment not long after the Treaty of Coruscant ended the Great Galactic War. Posing as the Republic scientist Eli Tarnis, he infiltrated the Republic's superweapon projects and quickly became the head of the design team for the Planet Prison weapon on the Republic's capital Coruscant. While his initial purpose was to gather information from inside the Republic, Tarnis believed his cover was in danger in 3643 BBY when the Jedi Master Bela Kiwiiks arrived on Coruscant to investigate a \"dark presence\" the Jedi Council had sensed on the capital. He made his move and attempted to steal the Planet Prison with the help of the criminal organizations known as the Migrant Merchants' Guild and Black Sun.\nStaging his own kidnapping from the Senate Building after hiring a thief to steal the design files for the Planet Prison, Tarnis fled to the territory of the paramilitary Justicars' Brigade, but was pursued by a young Jedi Knight. Tarnis' true identity was uncovered by the Jedi Knight, working with the Republic Strategic Information Service, the Coruscant Security Force, and the Padawan Kira Carsen, and the Sith was followed to the ruins of the Jedi Temple, where the Knight and Carsen faced the Sith Lord in a duel in order to stop him from using the Planet Prison against Coruscant itself. Tarnis' death was witnessed via hologram by his father, who declared everlasting vengeance upon his son's killer and embarked on a crusade to gain revenge upon the Jedi.\nA Human male, Tarnis was born the son of the Sith Lord Darth Angral sometime during or before the Great Galactic War with the Galactic Republic. Found to have inherited his father's Force-sensitivity, he was trained by the pureblooded Sith Praven—one of his father's own Sith apprentices. Tarnis ascended to the rank of Sith Lord sometime before the Sacking of Coruscant in 3653 BBY, when his father led an invasion fleet to capture the Republic capital and Tarnis' teacher joined Darth Malgus and Lord Adraas in destroying the Jedi Temple.\nWhen Darth Baras negotiated the Treaty of Coruscant and ended the Great Galactic War, Angral was furious to be denied the chance to crush the Republic once and for all. Tarnis inherited his father's hatred of the Republic as well, and was sent undercover on Coruscant by Angral as a scientist not long after the treaty. The man put his scientific genius to use as part of the Mon Calamari General Var Suthra's superweapon projects, where Tarnis and other scientists worked to weaponize technologies developed by the brilliant Doctor Nasan Godera during the war. As Doctor \"Eli Tarnis,\" it was not long before the Sith became the chief scientist for the entire division during the tense Cold War, and while he did contribute significantly to the other designs such as the Shock Drum and the Death Mark laser, he worked primarily on the Planet Prison—a weapon designed to ionize a planet's entire atmosphere, preventing any starships from leaving or entering the atmosphere and effectively blockading a planet without any additional naval firepower. However, Tarnis also developed a way to combine the different weapons into something he called the Desolator, though he kept his research a secret.\nBy 3643 BBY, the Planet Prison was reaching the prototype stage, and the scientists were preparing to start trials when the Jedi Master Bela Kiwiiks arrived on Coruscant to investigate a darkness that the Jedi Council sensed on the capital. Fearing that his cover would soon be exposed, Tarnis set in motion a plan to seize control of the Planet Prison and escape from Republic territory.\nContacting the criminal syndicate known as Black Sun, Tarnis revealed his true identity as a Sith Lord and made an offer to Salarr, Black Sun's leader. In exchange for advanced weapons and armor from the Sith Empire, acquired through Tarnis's allies in the Imperial-friendly Justicars' Brigade paramilitary group, Black Sun would aid Tarnis in the elaborate deception he was about to perpetrate. At Tarnis's request, Black Sun enlisted the Rodian thief Vistis Garn—who often worked for Black Sun's rival, the Migrant Merchants' Guild—to steal the design files for the Republic superweapons. A team of Guild members under Garn's leadership raided a military warehouse and stole a shipment of heavy weapons in addition to the design files Tarnis had requested.\nJust over thirty hours later, Tarnis was summoned to the Senate Building for a meeting with General Suthra and the Jedi Masters Orgus Din and Bela Kiwiiks, as well as Kiwiiks' apprentice Kira Carsen. Kiwiiks was concerned that Tarnis seemed to not care about the missing files, and the Doctor was irritated that the Jedi were against the development of the Planet Prison—it was a humane defensive weapon. Not long into the conversation, Din's former student arrived, and General Suthra departed the conference room with the two Jedi Masters for a meeting with Supreme Chancellor Dorian Janarus when the Mon Calamari's subordinate Agent Galen arrived with news: A member of the Republic Strategic Information Service, Galen and his team had identified Garn as one of the thieves and tracked him to the Old Galactic Market, a region under the control of the Merchants' Guild.\nWhile Carsen worked with Galen to distract the criminals with the Coruscant Security Force's security network, Din's apprentice—a recently elevated Jedi Knight—traveled to the Old Galactic Market with the astromech droid T7-O1 in order to recover the weapons and plans. While the duo raided the warehouse where Garn was holed up, Tarnis contacted Black Sun and set the second stage of his plan in motion. Taking advantage of the preoccupation of Suthra and Galen's forces, Tarnis gave a Black Sun team inside information on the Senate Building's defenses so that they could sneak inside and \"kidnap\" him. The plan worked perfectly, and Tarnis disappeared from the building before security realized the criminals were there.\nThe Black Sun criminals retreated to the Coruscant Spaceport in order to serve as a distraction, while Tarnis himself took an air taxi—but instead of going to the gang's territory as planned, he traveled to the territory of the Justicars so that he could prepare for the third stage of his plans. While the Black Sun lieutenant Zeer and his men fought the Coruscant Security Force in Docking Bay 84 to protect their \"prize,\" Tarnis transmitted a secure message to the five other members of the Planet Prison design team. He informed his subordinates that the Jedi had discovered the project and were planning to shut it down, convincing them that the only way to save the project was to bring him the prototype deep in the Justicars' Sector. Believing their superior, the five stole the prototype from their lab and journeyed deep into the region to meet with Tarnis at the Justicars' Tower.\nDuring that time, the Knight had joined forces with Carsen to break through the kidnappers' lines and learned from Zeer that Tarnis had been taken to Black Sun Territory. General Suthra was alarmed to discover that the files stolen by Garn had contained information on all of the Republic's weapons projects, and so Masters Din and Kiwiiks departed Coruscant along with Agent Galen to secure each offworld facility. Galen had first put the Knight in contact with the CSF's Special Tactical Unit, and the Jedi had traveled deep into Black Sun Territory with T7-O1 to meet up with the police officers. The Knight and Sergeant Nidaljo's men staged their attack on Salarr's headquarters and quickly broke through the criminals' defenses, causing the Black Sun leader to contact Tarnis in a fury. Tarnis brushed off Salarr's accusations of treachery and ordered the criminal to kill the Knight, who had just entered the room and discovered the \"Doctor\" talking to Salarr via holocomm. When the Jedi accused him of treason, Tarnis revealed his true identity as a Sith Lord before terminating the conversation so that he could meet with his design team.\nThe five scientists gratefully handed control of the prototype over to Tarnis, but were horrified when their superior turned on them and drew his lightsaber, unleashing lightning from his fingertips as he cut them down. The Sith Lord made quick work of the defenseless scientists, though one man—Jonkan—was only wounded mortally and witnessed the Sith depart with the prototype. Tarnis descended into the industrial sector known as the Works, where he was escorted to the ruins of the Jedi Temple by Imperial soldiers and began to set up the Planet Prison in the chambers of the Jedi Council.\nJonkan managed to hold on long enough for the Jedi Knight to arrive with Carsen, and in his last moments explained that the device needed time to charge—and that it generated immense amounts of heat. Using the scientist's information, the two Jedi were able to locate the weapon in the Jedi Temple and raced to the ruins, cutting through the Imperials who attempted to stop them.\nAs he waited for the device to charge, Tarnis contacted his father via a secure holotransmission threaded through Ord Mantell and several other planets, and informed both Angral and his father's three apprentices—Sadic, Praven, and Nefarid—of his success. Angral was greatly pleased by his son's accomplishments, and was in the process of praising Tarnis when the Knight and Carsen stormed into the room. Sadic mocked Tarnis for leaving loose ends, but Angral urged his son not to allow the Jedi to stop their victory. Refusing the Knight's offer of surrender, Tarnis summoned his red-bladed lightsaber to his hand and unleashed a storm of violet lightning at the two Jedi before charging. Though Tarnis was skilled with his blade and in the use of the dark side of the Force, he was ultimately no match for the younger Jedi's martial skill and strength in the Force, and their duel ended when the Knight struck down the Sith Lord before the unbelieving eyes of Tarnis's father.\nTarnis's death drove his father to the brink of insanity, and Angral declared war upon the Republic in his effort to exact revenge upon the Jedi Knight who killed his son. Seizing control of the Republic's superweapon projects, Angral used his son's research on combining superweapon technologies—Tarnis's final gift to his father—to combine the stolen weapons into the planet-killing Desolator. After successfully testing the weapon on the agriworld Uphrades, Angral attempted to destroy the Jedi Order's homeworld of Tython, but the Knight was able to defeat the elder Sith Lord aboared his flagship Oppressor, ending the threat of the Desolator forever.\nWhen Praven faced the Knight on the desert world of Tatooine, he understood that the Jedi's power was what ultimately led to his student's death, and the Sith was satisfied to know that his training had not been at fault. Tarnis's work on the Planet Prison would later be adapted into the weapons known as the Firestorm Turbolasers by Imperial scientists during the Battle of Corellia several years later.\nA Human male with green eyes like his father's, Tarnis had brown hair and pale skin in his mild-mannered \"Eli Tarnis\" persona. However, when Tarnis dropped the facade, the power of the dark side visibly darkened and grayed his skin, and he wore a dark hooded cloak. Tarnis was an arrogant and cruel man, and some of it bled through his disguise in that he was considered stuffy and self-important as a scientist. As a Sith Lord and the son of Darth Angral, he believed himself invincible and trusted fully in the power of the dark side to destroy his enemies and ensure his victory. Once he no longer had need of allies like Salarr, Black Sun, and even his research team, he cast them aside and continued his own plans with complete confidence that he would succeed. His arrogance stemmed from both his brilliance and his strength in the dark side, and Tarnis was willing to use both to achieve his objectives.\nAs the son of the powerful Sith Lord Darth Angral, Tarnis inherited his father's strength in the Force and was trained by Praven as a Sith. In battle, Tarnis wielded a single red-bladed lightsaber with considerable skill, but relied more upon his use of Force blasts and lightning. The Sith's true skills lay in subterfuge, as Tarnis was skilled enough to maintain his cover for almost a decade, and in science—the man was a genius. Tarnis's work brought significant advancements to the superweapon projects, and he also developed a way to combine the Shock Drum, Death Mark laser, and Planet Prison weapons into a single ship-mounted weapon—a feat that even the renowned Doctor Nasan Godera, the creator of those weapon technologies, acknowledged as pure brilliance.\nTarnis first appeared in Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare and LucasArts on December 20, 2011. The ultimate antagonist of the Coruscant section of the Prologue for Jedi Knight class, he is first encountered as \"Doctor Eli Tarnis\" in the mission \"The Jedi Envoy\". Tarnis is the target of the missions \"Kidnapped!\", \"Rescue\", \"Tracking Down the Traitor\", and \"Race to the Ruins\", though his identity as a Sith Lord is not revealed until the end of \"Rescue\". When the player faces Tarnis in the Jedi Temple, they can choose to ask him to surrender for light side points, or attack for dark side points, but regardless of the player's choice they will fight and kill Tarnis. Tarnis is also mentioned in the 2012 reference guide Star Wars: The Old Republic Encyclopedia, in the entries on Darth Angral and the Jedi Knight class storyline. In the 2015 Digital Expansion Knights of the Fallen Empire, Tarnis appears as an enemy for Jedi Knight players during the hallucination scenes in Chapter 2.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Tarnis_(criminal)",
  "/wiki/3643_BBY",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Praven",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Darth_Angral",
  "/wiki/Sith_training",
  "/wiki/Parent/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Scientist/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Planet_Prison",
  "/wiki/Capital/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bela_Kiwiiks",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Migrant_Merchants%27_Guild",
  "/wiki/Black_Sun/Legends",
  "/wiki/Kidnapping_of_Doctor_Tarnis",
  "/wiki/Senate_Building",
  "/wiki/Vistis_Garn",
  "/wiki/Raid_on_a_Republic_Military_warehouse",
  "/wiki/Justicar_territory",
  "/wiki/Justicars%27_Brigade",
  "/wiki/Hero_of_Tython",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Kira_Carsen",
  "/wiki/Jedi_Temple",
  "/wiki/Duel_in_the_Jedi_Temple_ruins",
  "/wiki/Death/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Desolator_crisis",
  "/wiki/Jedi/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Fleet/Legends",
  "/wiki/Darth_Malgus",
  "/wiki/Adraas",
  "/wiki/Darth_Baras",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/General/Legends",
  "/wiki/Var_Suthra",
  "/wiki/Doctor/Legends",
  "/wiki/Nasan_Godera",
  "/wiki/Shock_Drum",
  "/wiki/Death_Mark_laser",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Navy/Legends",
  "/wiki/Desolator_(superweapon)",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Salarr",
  "/wiki/Armor/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Scoundrel",
  "/wiki/Unidentified_Republic_Military_warehouse",
  "/wiki/Standard_hour/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Conference_Room_2-Aurek",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Dorian_Janarus",
  "/wiki/Agent/Legends",
  "/wiki/Galen_(SIS)",
  "/wiki/Old_Galactic_Market",
  "/wiki/Astromech_droid/Legends",
  "/wiki/T7-O1",
  "/wiki/Raid_on_the_Migrant_Merchants%27_Guild_warehouse",
  "/wiki/Migrant_Merchants%27_Guild_warehouse",
  "/wiki/Coruscant_Spaceport",
  "/wiki/Air_taxi/Legends",
  "/wiki/Black_Sun_territory",
  "/wiki/Lieutenant/Legends",
  "/wiki/Zeer_(criminal)",
  "/wiki/Docking_Bay_84",
  "/wiki/Laboratory/Legends",
  "/wiki/Justicars%27_Tower",
  "/wiki/Time/Legends",
  "/wiki/Skirmish_in_Docking_Bay_84",
  "/wiki/Special_tactical_unit",
  "/wiki/Police_officer/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Nidaljo",
  "/wiki/Raid_on_the_Black_Sun_headquarters",
  "/wiki/Black_Sun_Headquarters",
  "/wiki/Holocomm/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Jonkan",
  "/wiki/Sector_943",
  "/wiki/Soldier/Legends",
  "/wiki/High_Council_Chamber",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Sadic",
  "/wiki/Nefarid",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Devastation_of_Uphrades",
  "/wiki/Agriworld/Legends",
  "/wiki/Uphrades",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Battle_of_the_Oppressor",
  "/wiki/Flagship/Legends",
  "/wiki/Oppressor_(Harrower-class)",
  "/wiki/Desert/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Firestorm_Turbolaser",
  "/wiki/Battle_of_Corellia",
  "/wiki/Standard_year/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Darth/Legends",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/2015",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Category:Images_of_Tarnis",
  "/wiki/Template:TOR_dates",
  "/wiki/The_Old_Republic:_Deceived",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant"
 ]
}