{
 "name": "Tarn_(Khoonda)",
 "display_name": "Tarn  (Khoonda)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Khoonda"
     ]
    }
   ]
  }
 ],
 "content": "Tarn was a male Human mechanic living in Khoonda on Dantooine in 3951 BBY.\nTarn was one of the first people met by Meetra Surik upon her arrival planetside, and claimed to be the outpost's only qualified mechanic, though that proved not to be the case. He, like most on Dantooine at the time disliked the Jedi Order though five years earlier he had been the assistant of Dergar Chester, the head technician for the Jedi Enclave at the time of Darth Malak's attack.\nHe was supposed to free the tech chief when a door to a storage room in the Enclave got stuck while he attempted to fix it from the inside, but for unknown reasons Tarn was unsuccessful and at some point left the Enclave. As a result, Chester starved to death in the wake of the Sith bombardment. Many others in Khoonda considered him to be something of an idiot, and not that great a mechanic. He attempted to repair an old protocol droid salvaged from the Enclave for use as a greeter, however he did a poor job of it and it took Surik's own skill at repair to get it working properly again.\nWhen the Exile fixes the protocol droid and has it play a recording having to do with her, Tarn hears it and asks the Exile if he/she is a Jedi. The player can mind trick Tarn into thinking he had misheard the droid, but if the attempt is unsuccessful, Tarn will run off to tell everyone of the Exile's true nature. He never appears in the game again if this happens.\nThe Exile also has the opportunity to kill Tarn; however, this is not considered canonical, as the Exile was canonically Light sided.\nIt has been discovered that a glitch could give the player infinite Light side and Dark side points if the player follows the appropriate pattern correctly.\nThe player can offer Tarn a chance to join the Khoonda Militia but he declines if asked, stating that he is \"way too busy to die.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tarn",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Khoonda",
  "/wiki/Technician/Legends",
  "/wiki/3951_BBY",
  "/wiki/Meetra_Surik",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/3956_BBY",
  "/wiki/Dergar_Chester",
  "/wiki/Jedi_Enclave",
  "/wiki/Darth_Malak",
  "/wiki/Attack_on_Dantooine_(Jedi_Civil_War)",
  "/wiki/Death/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Canon",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Khoonda_Militia",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Template:Cite_web"
 ]
}