{
 "name": "Tarn_Mison",
 "display_name": "Tarn Mison",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Las Lagon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tarn Mison was a Human male from Las Lagon who served as an Imperial pilot and smuggler before defecting to the Rebel Alliance after witnessing the mass execution of colonists on the planet Farbinda III by the Empire. By 3 ABY, Mison was stationed at the Rebellion's headquarters of Echo Base on the ice planet Hoth.\nAfter serving as Tycho Celchu's gunner under the call sign Rogue Five at the Battle of Hoth, Mison was among a group of six Rebel pilots who flew X-wing starfighter escort for the GR-75 medium transport Bright Hope through the Imperial Navy blockade in Hoth's orbit. Despite Mison's and his group's efforts, the Bright Hope failed to escape destruction during its blockade run.\nThe Human male Tarn Mison hailed from the planet Las Lagon, located in the Inner Rim. Growing up, Mison learned to fly, and he became noted as a talented bush pilot. At some point, Mison joined the Galactic Empire, serving as a pilot.\nEventually, Mison turned to smuggling, playing his trade on the Shipwrights' Trace hyperlane. During the Galactic Civil War, he accepted a job to ferry supplies to the planet Farbinda III, where a group of conscientious objectors had established a colony. Upon arrival, he discovered that an Imperial strike team had landed on Farbinda III, where they had rounded up the local populace who offered no resistance. Mison watched as the Imperials summarily executed the colonists.\nHorrified, Mison spent several months deliberating on the events before deciding to join the Alliance to Restore the Republic shortly following the destruction of the first Death Star at the Battle of Yavin in 0 BBY. For a time, Mison served the Rebellion at Massassi Station on the moon of Yavin 4, prior to the Alliance's evacuation of the base six months following the Battle of Yavin.\nAs a lieutenant, Mison earned an assignment to the Alliance High Command headquarters of Echo Base on the ice planet Hoth by 3 ABY, where he was passing through the facility's main transport hangar while Captain Shawn Valdez issued orders regarding the base's evacuation procedure to his subordinates in the face of imminent Imperial invasion just prior to the Battle of Hoth.\nMison was drafted into the hastily assembled Rogue Group, a collection of pilots and gunners drawn from Rogue Flight, Blue Squadron, and Green Squadron. Rogue Group was assigned to fly T-47 airspeeders to counter the Imperial AT-AT walker assault and give the Alliance forces time to evacuate the planet. Mison was partnered with Tycho Celchu under the call sign Rogue Five, serving as the gunner.\nBoth Celchu and Mison survived the subsequent battle. During the last stages of the evacuation, Mison, along with pilots Wedge Antilles, Derek \"Hobbie\" Klivian, and Wes Janson, was one of six Rebel pilots who flew T-65 X-wing starfighters as escort for the GR-75 medium transport Bright Hope, the final Rebel evacuation transport to depart the besieged Echo Base alongside the GR-75 medium transports Thon's Orchard and Dutyfree.\nHowever, Mison's escort failed to see the Bright Hope through the Imperial Navy blockade waiting in Hoth's orbit. A combined attack by Imperial Star Destroyers and the Mist Hunter, the craft of bounty hunters Zuckuss and 4-LOM, all but destroyed the Bright Hope before it could reach the safety of hyperspace. Seeing that there was nothing they could do for the Bright Hope and that no rescue attempt could be made for any possible survivors, Mison and the five escorting X-wing pilots escaped into hyperspace themselves.\nUltimately, despite the damage done to the Bright Hope, many of the transport's passengers managed to evacuate to safety. Likewise, Thon's Orchard and Dutyfree also managed to safely evacuate.\nTarn Mison's interests generally revolved around credits rather than politics. However, upon witnessing the Imperial atrocity on Farbinda III, Mison's conscience led him to join the Alliance to Restore the Republic to oppose the Empire. He had fair skin, brown hair, and a brown beard.\nMison was a skilled pilot and expert marksman.\nMison wore the standard Rebel flight suit along with a flight helmet during his service as a Rebel pilot.\nTarn Mison first appeared as a Rebel pilot extra in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. Although uncredited, Industrial Light \u0026 Magic matte artist Michael Pangrazio portrayed Mison in the film. In fact, all of the Rebel characters present in the Mison scene were ILM artists, including Ralph McQuarrie, Joe Johnston, and Harrison Ellenshaw. Their scene was filmed as part of pickups at Industrial Light \u0026 Magic in California on February 9, 1980, and was completed in ten takes.\nThe Mison character was first provided a name and a brief backstory on the \"Lieutenant Tarn Mison\" card as part of the 1998 Special Edition Limited expansion set of Decipher, Inc.'s Star Wars Customizable Card Game. The card's information retconned Mison as being one of the X-wing pilots who escorted the Bright Hope off Hoth in the 1996 short story \"Of Possible Futures: The Tale of Zuckuss and 4-LOM,\" published in Tales of the Bounty Hunters. According to a fan-run site for the game, Tarn Mison was named as an anagram of Decipher employee Bill Martinson.\nIn 2012, Jason Fry's reference book The Essential Guide to Warfare established Mison as the gunner of Rogue Five during the Battle of Hoth. As the book formally confirms Mison was part of Rogue Group, the character also indirectly appears in the January 27, 1999 first issue of the The Empire Strikes Back manga adaptation, which depicts all twelve of Rogue Group's airspeeders.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tarn_(disambiguation)",
  "/wiki/Las_Lagon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Death/Legends",
  "/wiki/Colonist/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Farbinda_III",
  "/wiki/3_ABY/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Water/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Gunner/Legends",
  "/wiki/Call_sign",
  "/wiki/Rogue_Five/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Bright_Hope/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Shipwrights%27_Trace/Legends",
  "/wiki/Hyperlane",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Time/Legends",
  "/wiki/Great_Temple/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Evacuation_of_Yavin",
  "/wiki/0_ABY/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Shawn_Valdez",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Blue_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/Green_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Derek_Klivian/Legends",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Thon%27s_Orchard/Legends",
  "/wiki/Dutyfree/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Mist_Hunter/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Zuckuss/Legends",
  "/wiki/4-LOM/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Politics/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Rebel_flight_suit",
  "/wiki/Flight_helmet/Legends",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Michael_Pangrazio",
  "/wiki/Ralph_McQuarrie",
  "/wiki/Joe_Johnston",
  "/wiki/Harrison_Ellenshaw",
  "/wiki/February_9",
  "/wiki/1998",
  "/wiki/Special_Edition_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Retcon",
  "/wiki/1996",
  "/wiki/Of_Possible_Futures:_The_Tale_of_Zuckuss_and_4-LOM",
  "/wiki/Tales_of_the_Bounty_Hunters",
  "/wiki/Tuckerization",
  "/wiki/Bill_Martinson",
  "/wiki/2012",
  "/wiki/Jason_Fry",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/January_27",
  "/wiki/1999",
  "/wiki/Star_Wars_Manga:_The_Empire_Strikes_Back_1",
  "/wiki/Star_Wars_Manga:_The_Empire_Strikes_Back",
  "/wiki/Airspeeder/Legends",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_33",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Empire_Strikes_Fact!",
  "/wiki/Star_Wars_Insider_94",
  "/wiki/The_Art_of_Harrison_Ellenshaw",
  "/wiki/Star_Wars_Insider_140",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Rebel_Transport_Expansion_Pack",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Las_Lagon_system",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Complete_Locations_(2005)",
  "/wiki/West_End_Games",
  "/wiki/Running_the_Gauntlet",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Inside_the_Worlds_of_Star_Wars_Trilogy",
  "/wiki/X-Wing:_Isard%27s_Revenge",
  "/wiki/October_27",
  "/wiki/2003",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/August_15",
  "/wiki/2005",
  "/wiki/April_6",
  "/wiki/2016",
  "/wiki/Marvel_Comics"
 ]
}