{
 "name": "Taron_Malicos",
 "display_name": "Taron Malicos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic",
      "Nightbrothers",
      "Viscus' clan",
      "Viscus' clan"
     ]
    }
   ]
  }
 ],
 "content": "Taron Malicos was a human male Jedi Master who served the Jedi Order and the Galactic Republic as a Jedi General during the Clone Wars. During Order 66 in 19 BBY, he was attacked by his clone troopers but managed to escape to the planet Dathomir by using his starship. He encountered the Nightbrothers led by Brother Viscus and was soon captured by them. Whilst in captivity, he fell to the dark side of the Force and began to manipulate the Nightbrothers against each other. He escaped his Nightbrother captors but was eventually recaptured by them. Malicos' killing of a Nightbrother warrior led to the other warriors bringing the former Jedi before Viscus. By killing Viscus in a fight, Malicos became the leader of his Nightbrother clan.\nHe then started influencing the Dathomirian Nightsister Merrin to learn her magick art and told her that the Jedi had conducted the Battle of Dathomir, when in truth, the battle was orchestrated by the Confederacy of Independent Systems and its leader, the Sith Lord Count Dooku, who ordered the Kaleesh cyborg General Grievous to annihilate the entirety of the Nightsisters. Malicos eventually ran into the Padawan Cal Kestis in 14 BBY. Pretending to be a wanderer, he warned Kestis to stay away from the Tomb of Kujet but the Jedi declined and continued on his journey. After Kestis exited the ruins, Malicos probed him about what he was doing there but Kestis wanted to know who he really was. The wanderer revealed his true identity as a former Jedi to him.\nMalicos tried to turn Kestis to the dark side by convincing him to harness the power of Dathomir but Merrin appeared. Merrin then attacked Malicos and Kestis by unleashing Nightsister Zombies from the remains of her deceased sisters. However, Kestis and Malicos both managed to escape the attack. When Kestis eventually returned to Dathomir, Merrin concluded that Malicos had lied about the Jedi killing her fellow sisters. Within the Tomb of Kujet, the Padawan and Nightsister decided to take him out. Malicos tried to turn Kestis to the dark side again but the Jedi refused, ensuring a duel between the two. Kestis won the duel with the help of Merrin, who buried the fallen Jedi with her magick.\nDuring the pan-galactic Clone Wars, the Jedi Master known as Taron Malicos became one of the Jedi Order's most trusted generals in the Galactic Republic's army. Malicos was renowned for his abilities as a tactician and motivator of his troops. In 19 BBY, when Order 66 was enacted, Malicos was betrayed and attacked by his clone troopers. He struck them down and escaped the troopers in his starship, surviving the Great Jedi Purge orchestrated by Darth Sidious.\nAt one point, Brother Viscus and the Nightbrothers witnessed Malicos' ship crash into the Swamp of Sacrifice on the Outer Rim planet Dathomir. Viscus informed the Nightsister Merrin of the incident, and she advised him to be cautious and that she sensed great danger. The Nightbrothers captured the stranded Malicos, who was brought to their village. Viscus and the Nightbrothers did not know what to do with him while they waited for Merrin to give them instructions. Viscus grew tired of waiting for Merrin to tell the Nightbrothers what to do with Malicos, who succumbed to Dathomir's dark energies and turned to the dark side of the Force.\nViscus was aware that Malicos was manipulating his captors in a bid to divide them and confided in a fellow Nightbrother that it was time to deal with the prisoner. When Malicos escaped imprisonment, Viscus sent the Nightbrother warriors to hunt the fallen Jedi through the Collapsed Settlement near the village. Malicos was recaptured and brought back to the dungeon, but he killed one of the Nightbrothers, leading several others to decide that action needed to be taken, and they brought him before Viscus in the settlement ruins. The two engaged in a struggle, however, and Malicos got the upper hand and killed Viscus, who, with his dying words, told the former Jedi that the Nightbrothers would never kneel before him.\nAfter killing Viscus, Malicos usurped control over the Nightbrothers through his influence and power alone. The Nightbrothers laid down their weapons and submitted to him, and he became the new leader of the clan. He ruled them with fear, which resulted in the Nightbrothers worshiping him due to his power in the Force and becoming his enforcers. Malicos also came into contact with Merrin, and seeking to become even more powerful, manipulated the young Nightsister into allying with him. Malicos told Merrin that the Jedi had been the ones who massacred the Nightsisters during the Clone Wars, and in return for teaching him her magick, he would help her get revenge. Because of her misplaced loyalty to the increasingly mad Malicos, Merrin allowed him to lead the Nightbrothers astray without Viscus' leadership.\nIn 14 BBY, during his time on Dathomir, Malicos—posing as a wanderer—met former Padawan Cal Kestis outside of the Tomb of Kujet. Malicos saw that Kestis had met Merrin and was surprised he had survived the encounter with her. He realized that the lightsaber that Kestis carried saved his life. Malicos, pretending, stated that he liked to travel, studying extinct cultures and dead philosophies. Malicos told Kestis that the Clone Wars had come to Merrin's world and she had to watch her family die. Kestis asked about the ruins to the former Jedi. Malicos explained that they were very ancient. He claimed that the Nightsisters were tempted by the power within the temple. Malicos warned Kestis to stay away from the ruins or be corrupted by the power within the structure.\nKestis then asked Malicos about his length of stay on the planet, who replied that he had been there enough. Malicos explained that Dathomir had provided him a sanctum when he was in need, shelter when he was weak, and enlightenment when he was lost in the dark. He followed it up with a dry chuckle, Kestis being skeptical about his statements. The former Padawan asked Malicos about his knowledge of the Nightsisters, who explained it as observation by seeing many things since coming to the world. Kestis asked for clarification, Malicos stating that his observation did not need to have meaning with great minds having lost themselves in pursuit of order. Malicos with a chuckle said to Kestis that he should be careful about the world's many mysteries. Kestis then left to continue his journey.\nKestis eventually learned of the outsider's rise to power through the Force power psychometry. However, he did not know that the outsider was in fact the wanderer, Taron Malicos. Kestis discovered Brother Viscus' corpse and learned that he had been the leader of the Nightbrothers and was killed by the outsider. Kestis ultimately ignored Malicos' advice, entering the tomb.\nAfter exiting the tomb, Malicos questioned Kestis about going into the ruins suspecting that things did not go as planned and reminded Kestis of his warning. Kestis did not want to talk to him but Malicos wanted to talk, thinking that he was lost and defenseless on the planet. Kestis had enough of it and wanted to know who he really was. Malicos revealed his true identity to him, a former Jedi like Kestis. Malicos stated that they had a lot in common, but Kestis doubted it. The former Jedi explained that they were both Jedi Purge survivors. Malicos explained that he had no choice but to kill the clone troopers and escape, that the darkness on the planet almost tried to control him. Malicos stated that he had prevented that by conquering the power within.\nKestis realized that he was the leader of the Nightbrothers, and the former Jedi confirmed it laughingly to be true, that he had become their leader because of his strength in the Force. Kestis did not agree with his stance. Malicos asserted that these were dire times, devouring them if they did not stand together. However, Kestis did not want his help. The former Jedi replied that Kestis' broken lightsaber told a different story and suspected that Kestis had seen something terrible in the ruins. The former Jedi continued stating that there were many such places on Dathomir, trying to convince Kestis to join his cause with controlling the planet's power but was unsuccessful.\nMerrin showed up and stated that she was familiar with Malicos' words about joining his cause. Malicos asserted that she had overstepped her bounds. Merrin accused Malicos of attempting to include a Jedi into his cause, when he had told her that the Jedi had killed her sisters. Malicos replied that she was told to deal with it and that she lacked power. Merrin then stated that Malicos was mad, that the planet had unmade him, and that her misplayed loyalty had allowed Malicos to lead the Nightbrothers astray and the Nightsisters did not betray each other. Malicos stated that her sisters were gone. Merrin confirmed this with the surrounding graves. Kestis and his droid BD-1 wanted to leave, but Merrin summoned the Nightsister Zombies. Malicos chuckled, stating that Merrin was foolish with her uncontrollable powers. Merrin wanted Malicos and Kestis to feel her wrath. The pair were then attacked by the released zombies controlled by Merrin. Malicos told Kestis to run, and both of them fled.\nWhen Kestis returned to Dathomir, Merrin approached him while the Padawan was inside Kujet's Tomb. Merrin was surprised that the Padawan returned, describing it as fearless but, not wise. Kestis told her that Malicos had lied about the Jedi conducting the massacre on Dathomir. In actuality, the mass slaughter was orchestrated by the Confederacy of Independent Systems and its leader, the Sith Lord Count Dooku, ordered the Kaleesh cyborg General Grievous to annihilate the entirety of the Nightsisters. In return, the Nightsister expressed that Malicos had promised her revenge if she taught him magick. With the extent of Malicos' intent revealed, Merrin and Kestis decided to stop the darksider together. Kestis approached the fallen Jedi inside the Tomb of Kujet. Malicos once again attempted to convert him by telling him that he wanted to create something new and better. However, Kestis did not concur.\nFailing to do so, Malicos ignited his two lightsabers and attacked Kestis. During the duel, Malicos lifted Kestis and slammed him onto the ground. While the Padawan was on the ground, Malicos broke a chunk of rock off a wall with the Force and was about to kill Kestis with it. However, Merrin used magick and crushed the rock into small pieces. Merrin hurled energy balls at the fallen Jedi, though Malicos deflected them with his lightsabers. Malicos then threw one of his lightsabers at the pillar Merrin was standing on and pulled it down with the Force, though the Nightsister jumped down to where Malicos was. Merrin told Kestis to get back up and then disappeared. The Padawan continued the duel against the fallen Jedi Master, with Merrin appearing several times and throwing magick energy at Malicos to assist Kestis. Eventually, Merrin grabbed Malicos with her magick and buried him alive underneath the tomb ground, leaving both the young Jedi and Nightsister victorious in the duel.\nAfter the duel, Merrin revealed to Kestis that Malicos wanted her to attack the crew members of the luxury yacht Stinger Mantis, Cere Junda and Greez Dritus. However, she saw that they were not threats. When Kestis later revisited the Tomb of Kujet, he contacted Merrin on the ship, asking her if Malicos had always been unhinged. Merrin confirmed that the fallen Jedi's behavior had seemingly changed upon Kestis' arrival, viewing the Padawan as either an opportunity or a threat. Kestis then noted that he was glad that they had stopped Malicos despite not knowing what his precise endgame was.\nTaron Malicos was a tall, muscular human male who had gray hair, blue eyes, and fair skin. Malicos was a formidable Jedi General as well as a trained motivator and cunning tactician. Noted for his competency and courage at leading clone troopers into battle, the Jedi Order counted Malicos as one of their most trusted battlefield commanders.\nHowever, after being betrayed by his own troops and spending several years on Dathomir, Malicos succumbed to darkness and madness. He became power-hungry and manipulative, having influenced the Nightbrothers to follow him. His wild hair and ragged beard becoming a symbol of his lunacy. Malicos also exerted power over Merrin who he asked to learn the art of magick and lied to her about the Jedi conducting the massacre of her fellow Nightsisters, when in truth, it was conducted by General Grievous on the orders of Count Dooku. He was also keen at being evasive in order to keep his true identity secret and remain shrouded in mystery. He did this to Cal Kestis by portraying himself as a \"wanderer\" who studied ancient history and philosophies, while Kestis wanted to know who he was.\nWhilst on Dathomir, Malicos gained scars and carried horns from dead Nightbrothers he had slain due to opposition from them. They were a reminder of those who dared to oppose him. Scarred both physically and mentally, he lost faith in the Jedi and believed they had doomed themselves to extinction by allowing their traditions and past glories to blind them to reality. In the Jedi Order's place, he wanted to create something new and better. The former Jedi believed that Merrin could not control her own power, claiming that she had become possessed by it, such as her releasing a number of Nightsister Zombies to attack Kestis and Malicos.\nAs a former Jedi Master, Malicos was an accomplished lightsaber combatant, favoring the use of two single-bladed lightsabers in battle, proving himself to be a strong practitioner of Jar'Kai. Malicos' abilities were enough to help him kill Viscus, the Nightbrothers' leader, and prove himself a powerful fighter to the clan. Likewise, when he fought Kestis, Malicos easily handled Kestis' assaults and was only defeated by Merrin helping Kestis. During the Clone Wars, Malicos was a master tactician and general using those abilities to motivate his troops in battle.\nMalicos was incredibly powerful with the Force, and highly competent in the use of telekinesis. He could lift multiple boulders simultaneously and fling them at opponents, which he did to Kestis during their duel, and occasionally throw his lightsabers with incredible accuracy. He was able to telekinetically restrain and fling Kestis around with ease. Malicos could also use the Force to augment his own physique and assist him in combat.\nTaron Malicos possessed two red-bladed lightsabers that were stored on his belt. He wore black and red robes that left his scarred chest exposed, a ragged black cloak and boots. Malicos showcased horn trophies from slain Nightbrothers on his robes and utilized a starship to escape Order 66.\nTaron Malicos was introduced in the 2019 video game Star Wars Jedi: Fallen Order, developed by Respawn Entertainment and published by Electronic Arts. He was voiced by Liam McIntyre and had a range of concept art in The Art of Star Wars Jedi: Fallen Order.\nThis article assumes that all optional dialogue involving or mentioning Malicos has been seen and that all collectables mentioning Malicos have been acquired. In Jedi: Fallen Order, the optional dialogue and collectables do not affect the storyline of the game meaning that Malicos has no alternate stories.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Nightbrothers",
  "/wiki/Viscus%27_clan",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_General",
  "/wiki/Clone_Wars",
  "/wiki/Order_66",
  "/wiki/19_BBY",
  "/wiki/Clone_trooper",
  "/wiki/Planet",
  "/wiki/Dathomir",
  "/wiki/Starship",
  "/wiki/Brother",
  "/wiki/Viscus",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Jedi",
  "/wiki/Dathomirian",
  "/wiki/Nightsisters",
  "/wiki/Merrin",
  "/wiki/Magick",
  "/wiki/Battle_of_Dathomir",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Head_of_State",
  "/wiki/Sith_Lord",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Kaleesh",
  "/wiki/Cyborg",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Mission_to_Dathomir_(Cal_Kestis)",
  "/wiki/Padawan",
  "/wiki/Cal_Kestis",
  "/wiki/14_BBY",
  "/wiki/Tomb_of_Kujet",
  "/wiki/Nightsister_Zombie",
  "/wiki/The_galaxy",
  "/wiki/Troop",
  "/wiki/Trooper",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Darth_Sidious",
  "/wiki/File:MalicosShipWreckage.png",
  "/wiki/Time",
  "/wiki/Swamp_of_Sacrifice",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Unidentified_Nightbrother_village",
  "/wiki/Collapsed_Settlement",
  "/wiki/Nightbrother_Dungeon",
  "/wiki/Death",
  "/wiki/File:ViscusDead.png",
  "/wiki/The_Force",
  "/wiki/File:WandererMeetsKestis.png",
  "/wiki/Jaro_Tapal%27s_lightsaber",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Force_power",
  "/wiki/Psychometry",
  "/wiki/File:Malicos-ComeAtMeBro.png",
  "/wiki/File:NightsisterZombieAttack-MalicosKestis.png",
  "/wiki/Droid",
  "/wiki/BD-1",
  "/wiki/File:Malicos-Kestis-duel.png",
  "/wiki/File:MalicosDirtNap.png",
  "/wiki/Taron_Malicos%27s_lightsabers",
  "/wiki/Lightsaber_duel",
  "/wiki/Telekinesis",
  "/wiki/Lightsaber",
  "/wiki/Luxury_yacht",
  "/wiki/Stinger_Mantis",
  "/wiki/Cere_Junda",
  "/wiki/Greez_Dritus",
  "/wiki/File:DathomirRuins.png",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Commander",
  "/wiki/File:TaronMalicosSaberJFOArt.png",
  "/wiki/Lightsaber_combat",
  "/wiki/Jar%27Kai",
  "/wiki/Belt",
  "/wiki/Robe",
  "/wiki/Cloak",
  "/wiki/Boot",
  "/wiki/File:Taron_Malicos_concept_art.jpg",
  "/wiki/2019",
  "/wiki/Video_game",
  "/wiki/Respawn_Entertainment",
  "/wiki/Electronic_Arts",
  "/wiki/Liam_McIntyre",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Category:Images_of_Taron_Malicos",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com"
 ]
}