{
 "name": "Tartuta",
 "display_name": "Tartuta",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dug"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Tartuta was a male Dug bounty hunter who was hired by the newly-formed Galactic Empire two weeks after the end of the Clone Wars to find Sagoro Autem, an Imperial naval captain that was slated for purging from the military. The Dug wielded a pair of knives in his feet as his primary weapon, and was shown to be extremely acrobatic, swinging around railings and poles to dodge enemy blaster fire and quickly close the distance to them. He even deflected a blaster bolt by spinning the blades quickly in circles.\nHe found and attacked Sagoro Autem, but was shot dead by Evan Hessler before he could claim the prize.\nIn 19 BBY, two weeks after the end of the Clone Wars between the Separatists and the Republic, Tartura—a male Dug bounty hunter— was hired by the newly formed Galactic Empire to hunt down Sagoro Autem. Autem, a captain in the Imperial Navy, had been slated for purging from the Imperial Military, but had managed to escape before Stormtroopers could apprehend him. Tartuta, a Shistavanen named Severian, and a masked Human named Evan Hessler, were told by the Sith Lord Darth Vader to apprehend Autem, alive or dead.\nRather than waste time tracking Autem himself, Tartuta followed the Shistavanen bounty hunter, reasoning that they were excellent trackers. His gambit paid off as Severian found the target within a few hours, leading the Dug right to Autem. Before Severian could take the bounty, Tartuta attacked him and lopped off his right hand, sending him tumbling off the walkway he was perched on. The Dug turned his knives on Sagoro, using his acrobatic skills to dodge defensive blaster fire. As he closed on Autem, however, he was shot in the back and killed by Evan Hessler. Sagoro, unaware of how the Dug had died, took one of his knives for extra protection and continued on.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Sagoro_Autem",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Emperor%27s_purge",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Shistavanen/Legends",
  "/wiki/Severian",
  "/wiki/Human/Legends",
  "/wiki/Evan_Hessler",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Republic_78"
 ]
}