{
 "name": "Tarvyn_Lareka",
 "display_name": "Tarvyn Lareka",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Academy",
      "501st Legion",
      "Imperial Starfighter Corps",
      "Imperial Academy",
      "501st Legion",
      "Imperial Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Tarvyn Lareka, designated TK-4601, was a human male who, after graduating from the Imperial Academy, served aboard the Imperial I-class Star Destroyer Devastator as a junior member of the Sith Lord Darth Vader's personal stormtrooper legion, Vader's Fist. In 0 BBY, the legion boarded the Rebel Alliance CR90 corvette Tantive IV, where he witnessed the death of the corvette's captain, Raymus Antilles at the hands of the Vader. While sweeping corridors as a part of a patrol group, Lareka stunned princess Leia Organa after she shot his commander. He then requested for two replacement stormtroopers and cut off from his patrol group as they escorted Organa to Vader.\nFollowing the Battle of Yavin Lareka served as a lieutenant TIE fighter pilot in the Imperial Starfighter Corps aboard the Star Destroyer Determination. He developed a crush for another pilot named Iden Versio and became suspicious when she began acting differently. When the lieutenant discussed this issue with her at a bar, she claimed that the Empire only knew violence and expressed her support for the extremist rebel cell the Partisans. Lareka subsequently reported her to Commander Udrai, but a stormtrooper squad arrived first to arrest Versio, with one asking the lieutenant to go with him.\nAt the age of nineteen, Tarvyn Lareka heard the calls to join the Rebel Alliance, a resistance movement which opposed the Galactic Empire. He ultimately resisted these calls and joined the Empire's Imperial Academy. Straight after graduating, he was then assigned as a stormtrooper aboard the Imperial I-class Star Destroyer Devastator, the flagship of the Sith Lord Darth Vader. Lareka, designated \"TK-4601,\" served as a junior member of Vader's personal legion, known as Vader's Fist. There, he befriended the Stormtrooper Commander TK-9091, his commanding officer, who told jokes to Lareka during his break hours.\nIn 0 BBY, Vader and his forces aboard the Devastator entered the Battle of Scarif, where Alliance forces had stolen the plans for the Empire's new superweapon, the Death Star. The plans were taken aboard the CR90 corvette Tantive IV, which fled the site of the battle. After the Devastator intercepted the corvette in above the planet Tatooine, Vader's Fist, Lareka among them, boarded the Tantive IV in search of the plans.\nDuring the fighting aboard the Tantive IV, Vader's forces captured the vessel's captain, Raymus Antilles, with Vader personally interrogating the man. Lareka witness the short exchange, stood at attention just a meter away as Vader questioned the captain before choking the man to death in his anger. Hearing the snapping of Antilles' back bone, Lareka took a hard swallow. The Sith Lord then gave commands to TK-9091, telling the commander and his men to search the corvette for the plans, taking any passengers alive. Lareka and the other stormtroopers immediately departed to their new duties thereafter.\nLareka, 9091 and the stormtroopers TK-3338 and TK-4247 searched for passengers of the Tantive IV who were hiding among the out-of-the-way locations on the vessel. 9091, who took point, told his comrades to kill the starships crew, but set their blasters to stun in the case of a passenger. During their sweep, the conversation between Vader and Antilles resounded in Lareka's mind, as well as rumors of the Alderaanian Princeess Leia Organa being aboard the starship, which he considered asking 3338 about. 4247 asked the other troopers if they would find any passengers, to which 9091 mentioned how pleased Vader would be with them if they did. Lareka considered the opposite in his mind, but ceased to dwell on it.\nAfter a brief exchange between 3338 and 9091, the patrol group continued searching corridor to corridor. That was until during a later sweep when 9091 spotted a passenger looking around a corner holding a blaster. The commander pointed the straggler out, turning to Lareka and reminding him to set his blaster to stun. In the following moment, which lasted slowly for Lareka, he studied the traits of the passenger, becoming impressed by the confidence in her expression and deducing her to be Organa. In this passing moment, the princess raised her blaster and shot 9091 while the commander hesitated to react. Organa attempted to flee immediately after, but Lareka stunned her before she could get away.\nLareka rushed to the princess, worried that she may have died. After confirming otherwise, he told his comrades that Organa would be alright, advising his comrades to inform Vader of their new prisoner. As he then thought of the princess's fate to come, he was informed by 4247 that 9091 had died from Organa's blaster shot. Lareka was surprised at the failure of 9091's armor and his new role as commander of the patrol group by default. He approached the unconscious Organa, who soon began to stir. When the princess attempted to raise her blaster again, Lareka kicked it away, bringing her attention to him. He pulled Organa up by her wrists, with 3338 pressing a blaster against her to oppose her struggling. Bounding her arms together with stun cuffs, Lareka informed the princess that Vader wanted to see her, giving her the options of travelling on foot or being carried.\nOrgana chose Lareka's latter option, and Lareka reported her capture and 9091's death through his comm, asking for two more troopers after. As 3338 and 4247 questioned his last appeal, he then requested a transfer to active duty, which the individual over the comm granted and informed him that troopers may be sent to the surface of Tatooine. Lareka subsequently decided in his mind that he wanted to fight rebels in the air where he would not witness their faces, like he did with Organa. After the two requested troopers, TK-7624 and TK-8332, arrived, the princess was escorted away by the pair and Lareka's two remaining comrades to be brought to Vader. As Organa looked back at him one last time, Lareka removed his helmet, to which she nodded at him, acknowledging his gesture.\nShortly after, Lareka became a TIE pilot aboard the Star Destroyer Determination, holding the rank of Lieutenant. At that time, the Alliance, having taken the Death Star plans to their hierarchy, took advantage of a weakness in the superweapon and was able to destroy it, but not before the battle station obliterated the planet Alderaan, Organa's homeworld. After, Commander Udrai took Lareka's squadron aside and informed them that if they could ask for help if they had any troubling thoughts over the recent events.\nIn 0 ABY, Captain Iden Versio, a survivor from the battle which saw the destruction of the Death Star, transferred to the Determination. Lareka was captivated by her, feeling that she had an aura about her and developing a crush on the captain. He also heard conspiracies about Versio's survival of the Death Star's destruction, others speculating that she was Force-sensitive or a double agent or her father, Admiral Garrick Versio, having her TIE fighter modified. Lareka, having watched the captain fly her TIE, concluded that the reason was down to her skills as a pilot, comparing her flying to an air performance. Versio frequently beat Lareka's kill count.\nDuring the Determination's patrol through the Mid Rim, a skirmish ensued with rebel forces, which were ultimately defeated. In this fight, Lareka noticed Versio miss two easy shots on rebel fighters. During their debriefing after, the lieutenant overheard their team leader verbally punish the captain for her mistakes, watching out of the corner of his eye. Lareka concluded that something was wrong with the Versio and went to catch up with her after the debrief. The captain ignored him at first, but when he fell into step beside her, Versio insisted that she was fine. Lareka pointed out how out the uniqueness in her actions that day.\nVersio broke her resistivity and expressed how everything had changed after the Death Star's destruction, further comparing the primarily military purpose of the battle station to the defenselessness of Alderaan when the superweapon wiped the planet and its civilian population out. Feeling himself grow pale upon her statement, Lareka grabbed the captain's arm, advising her to tell him her thoughts at a bar when they were off duty. Versio agreed to this and thanked him. Watching the captain leave, Lareka concluded that she was having trouble adjusting to the loss of the Death Star and felt determined to help her.\nAfter changing into a fresh uniform, Lareka seated himself at a table in a small alcove in wait for Versio, ordering himself a drink of beer. The captain, having also changed her uniform, arrived and ordered whiskey from a serving droid. Once the droid had returned and was sent on it's way, Versio began, saying that she should have not expressed her feelings on Alderaan to him. Lareka assured her that it was okay and that she was not the only one shaken by the Death Star's destruction. Versio then expressed her distaste in the Empire's obliteration of Alderaan, citing the deaths of innocent civilians who did not sympathize with the Alliance as why the destruction at the hands of a superweapon was unnecessary. Lareka was stunned by this, sure that she needed to get help.\nVersio continued, claiming that the Empire's actions involving Alderaan and its survivors was wrong. Lareka, trying to downplay his horror at her words, attempted to interrupt. Versio, though, voiced her opinion that the Empire should be swept away, revealing her sympathy for the Partisans, an extremist rebel group. After stating that the Empire only knew violence, the captain turn to the rest of the bar, which had heard her final few lines. Lareka, having recorded their conversation the whole time, sent the recording to Commander Udrai, who messaged the lieutenant that he was on his way. Assuring Versio that it was going to be alright for her, Lareka informed the captain about what Udrai had told his squadron after the Death Star's destruction.\nVersio became suspicious of Lareka's actions, and thus he revealed that he had sent a recording of the conversation to the commander. The captain then rose from her chair and Lareka noticed that a stormtrooper squad was approaching. The lieutenant, determined to take Versio to Udrai, tried to sway the stormtroopers in his favor, but they instead had Lareka step aside and arrested the captain. Looking at her clenched fist, he was briefly convinced that she would fight back, but instead watched her allow not resist, being bounded with stun cuffs. As Versio was taken away, another stormtrooper told Lareka to go with him, grabbing lieutenant by the elbow.\nTarvyn Lareka was a human male with blue eyes and blond hair which formed a disruptive tuft that he found hard to comb. His fair skin easily reddened and paled despite his efforts to control his expressions. For example: Lareka turned pale in response to Iden Versio beginning to criticize destruction of Alderaan and also when he was asked to go with a stormtrooper after Versio was arrested. Lareka was subsequently grateful that to be wearing a helmet when he himself was a stormtrooper as it hid his facial expressions.\nWhen encountering Leia Organa, Lareka considered her to be delicate, rushing to her after she fell to the floor in fear that she may have died. He also found it her size and confidence to be unexpected. Whilst looking at the princess's face, Lareka realized that she could only see what he served while his face was covered by his helmet, choosing to briefly take it off when Organa was eventually taken away to show her that he had a face. He also concluded that he did not want to kill a rebel while looking into their faces, being reassigned as a pilot aboard the Determination shortly after.\nLareka developed a crush on Versio after she was transferred to the Determination, finding her attractive and unforgettable and admiring her skill as a pilot. When the captain began showing signs that something was off with her, he found it hard to come to terms with and inquired with Versio shortly after. Lareka was determined to help her, taking advantage of Commander Udrai's offer to help those with troubling thoughts after the Death Star's destruction and recording Versio's statements. When Versio revealed her resentment of the Empire's obliteration of Alderaan, the lieutenant show visible horror, attempting to reduce the expression. Lareka felt bad after revealing to Versio that he had deceived her and questioned his actions as she was taken away by stormtroopers.\nDuring his service with Vader's Fist, Lareka wore stormtrooper armor and used an E-11 medium blaster rifle. He also utilized stun cuffs when arresting Organa and requested for reinforcements through his comm. While aboard the Determination Lareka used a device to record Versio and send the statements to Udrai.\nThe stormtrooper later known as Tarvyn Lareka first appeared in the 1977 film Star Wars: Episode IV A New Hope, the first installment of the Star Wars original trilogy, directed by George Lucas. The trooper was portrayed by an uncredited extra. The films script, as presented in LucasArts' 1998 interactive CD-ROM Star Wars: Behind the Magic, identified the stormtrooper as \"Trooper.\"\nA Tarvyn Lareka later appeared in Christie Golden's 2017 novel Battlefront II: Inferno Squad but was not linked to the stormtrooper from A New Hope. Golden confirmed shortly after on Twitter that she had included the stormtrooper as the focus of her then upcoming installment of the short story collection From a Certain Point of View and that the character had already appeared in Inferno Squad. The short story, named \"The Bucket\" and released the same year as Inferno Squad, subsequently identified Lareka as the stormtrooper in A New Hope, further giving his identification number, TK-4601. Golden also confirmed on twitter that the identification number was a reference to the musical Les Miserables—the lead character of Jean Valjean, while imprisoned, had a prisoner number of 24601.\nIn Star Wars Legends continuity, Lareka was identified as DV-692 in the A New Hope expansion set of Wizards of the Coast's Star Wars Trading Card Game in 2002.\nLareka's scene in A New Hope was among the last few filmed during the principle photography phase in the United Kingdom, shot at some point between June 29 and July 16 in 1976. His lines were performed over a walkie-talkie by disc jockey Terry McGovern and recorded by sound designer Ben Burtt. The sound effect of Lareka's stun shot in the film was derived from a mix of the sound of an air cannon combined with a note played by an ARP synthesizer with a \"rising pitch and a delay\" to produce a bombination.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tarvyn_Lareka",
  "/wiki/DV-692",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Academy",
  "/wiki/501st_Legion",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Operating_number",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Stormtrooper",
  "/wiki/Legion",
  "/wiki/0_BBY",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Death",
  "/wiki/Corvette",
  "/wiki/Captain",
  "/wiki/Raymus_Antilles",
  "/wiki/Stun",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/TK-9091",
  "/wiki/Battle_of_Yavin",
  "/wiki/Lieutenant",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Star_Destroyer",
  "/wiki/Determination",
  "/wiki/Pilot",
  "/wiki/Iden_Versio",
  "/wiki/Partisans",
  "/wiki/Commander",
  "/wiki/Udrai",
  "/wiki/Squad",
  "/wiki/Flagship",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Stormtrooper_Commander",
  "/wiki/Commanding_officer",
  "/wiki/Standard_hour",
  "/wiki/Battle_of_Scarif",
  "/wiki/Rogue_One",
  "/wiki/Death_Star_plans",
  "/wiki/Superweapon",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Meter",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/TK-3338",
  "/wiki/TK-4247",
  "/wiki/Blaster",
  "/wiki/Alderaanian",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Stormtrooper_armor",
  "/wiki/Limb",
  "/wiki/Stun_cuffs",
  "/wiki/Comlink",
  "/wiki/TK-7624",
  "/wiki/TK-8332",
  "/wiki/Helmet",
  "/wiki/TIE_pilot",
  "/wiki/Military_rank",
  "/wiki/Battle_station",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Homeworld",
  "/wiki/Squadron",
  "/wiki/0_ABY",
  "/wiki/Force-sensitive",
  "/wiki/Agent",
  "/wiki/Parent",
  "/wiki/Admiral",
  "/wiki/Garrick_Versio",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/TIE_line",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Alliance_Military",
  "/wiki/Eye",
  "/wiki/Standard_day",
  "/wiki/Ale",
  "/wiki/Whiskey",
  "/wiki/Service_droid",
  "/wiki/Droid",
  "/wiki/Hair",
  "/wiki/Armor",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars",
  "/wiki/Original_trilogy",
  "/wiki/George_Lucas",
  "/wiki/LucasArts",
  "/wiki/1998",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Christie_Golden",
  "/wiki/2017",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/The_Bucket",
  "/wiki/Star_Wars_Legends",
  "/wiki/A_New_Hope_(TCG)",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/2002",
  "/wiki/June_29",
  "/wiki/July_16",
  "/wiki/1976",
  "/wiki/Terence_McGovern",
  "/wiki/Ben_Burtt",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Raymus",
  "/wiki/StarWars.com",
  "/wiki/File:Christie_Golden_FACPOV.png",
  "/wiki/File:Christie_Golden_Les_Mis.png",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/The_Sounds_of_Star_Wars"
 ]
}