{
 "name": "Tau_(individual)",
 "display_name": "Tau  (individual)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Well before 25",
      "793 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Infinite Empire",
      "Je'daii Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tul'kar"
     ]
    }
   ]
  }
 ],
 "content": "Xesh was a Force-sensitive Human male who was captured and enslaved as a child by the Infinite Empire of the Rakata species. Branded with the Aurebesh letter Xesh on his face, back, and arms, Xesh was trained in the dark side of the Force as a Force Hound, the personal warrior of the Rakatan Predor Tul'kar. However, he gave himself a new name, Tau, which meant \"soul\" in his native language, and kept it a secret to all except Shae Koda. Powerful and skilled, Xesh excelled as a warrior, though his friendship with a fellow slave named Trill became a bitter rivalry when the two became Force Hounds. In Tul'kar's service, Xesh discovered many planets with strong Force signatures, and was considered to be one of the best Force Hounds in the entire Empire by the year 25,793 BBY, when he was tasked with finding a Force-strong planet in the Deep Core.\nXesh was successful in finding a path to the world, which was the planet Tython, but Tul'kar's starship Devourer exploded over Tython and Xesh found himself the only survivor—only to be confronted by Shae Koda, Tasha Ryo, and Sek'nos Rath: three young Je'daii Journeyers, members of an order of Force-sensitive warriors, scholars, and healers. Believing the Je'daii to be warriors like himself, Xesh fought them before fleeing into the canyon known as the Rift. However, Xesh's arrival on Tython caused a powerful Force storm that began to sweep across the planet, leading the Je'daii to pursue the dark stranger into the Rift. After witnessing Shae Koda's use of the light side of the Force in defense of her friends, a power that was alien and intoxicating to Xesh, the Force Hound joined the Je'daii in battling a saarl, an enormous creature in the Rift.\nDefeated by the Je'daii, Xesh was exiled to the moon of Bogan to meditate on the Force, but his fellow exile, the mad Je'daii Daegen Lok, recruited Xesh in his mission to construct new Forcesabers—the powerful weapons of the Force Hounds. The two escaped Bogan and traveled the Settled Worlds of the Tython system, acquiring the materials needed for the Forcesabers, but Xesh grew more and more uneasy about his \"ally\" as their journey continued and as they were pursued by Je'daii, among them Shae Koda and Sek'nos Rath. Xesh captured Koda after rescuing her from death on the planet Nox, but Lok's attempt to secure the allegiance of the Twi'lek warlord Volnos Ryo ended in disaster as Ryo turned on Lok and their Je'daii pursuers caught up to them. Convinced by Koda to make his destiny his own, Xesh turned on Lok and helped the Je'daii capture the mad warrior.\nA Human male slave of the Infinite Empire of the Rakata species, Xesh was found to be Force-sensitive and placed in a brood of other Force-sensitive children. Branded with a tattoo of the Aurebesh letter Xesh on his face, upper arms, and back, the boy found a friend in a fellow slave named Trill, and she defended him against the brood leader Yirt when the larger child attempted to attack him. While the rest of the slaves turned on and began to attack Yirt, Trill and Xesh left Yirt at the other slaves' mercy. The two became friends and made blood oaths to protect and not to kill each other.\nIn the years that followed, Xesh and the rest of the brood were encased in the machines of the Rakata, which drew on their strength in the Force to fuel the Rakata's ships. It was then that he first touched the dark side of the Force, his powers unknowingly fueled by the pain, anger, and hate that he felt. These machines and the pain that they caused also effectively stripped Xesh of his empathy, leaving him unable to experience emotions such as love or compassion. One of the Rakata, a Predor named Tul'kar sensed Xesh's power and singled him out from the brood, training him as a Force Hound. Not long afterwards, Tul'kar forced him to fight Trill, who was also training as a Force Hound, and the two battled aboard Tul'kar's ship Devourer. Xesh was victorious in their battle, and he was ordered by Tul'kar to strike down Trill with his new Forcesaber. However, in an effort to save Trill's life, Xesh proposed that Tul'kar present Trill as a gift to his superior, Skal'nas, as a gift—but also an insult, as Trill would be less powerful than Xesh. Applauding his slave's cunning, Tul'kar agreed, and Xesh departed the chamber without responding to Trill's calling his name. Trill perceived Xesh's actions as a betrayal, and Xesh earned her undying hatred after their battle.\nDuring his training on the planet Byss, Xesh was pitted against Isk, a Force Hound belonging to Tul'kar's superior Skal'nas, and Xesh was initially on the defensive against Isk, who was rumored to be Skal'nas's best Force Hound. However, when Isk attempted to use a set of darts against Xesh, the Human picked the darts out of the air as they passed before leaping on the offensive. Xesh was victorious in the battle, but refused to kill the defeated Isk when he begged for mercy and a good death in battle.\nAs Tul'kar's Hound, Xesh lived a life of loneliness, becoming the best Force Hound in the entire Infinite Empire. Garbed in black and grey armor, Xesh sought out planets with powerful Force signatures, after which the Rakata would conquer the planets and cull the Force-sensitives from the native population. Among Xesh's discoveries was the planet Sriluur, which was inhabited by the Weequay species. Xesh led the Flesh Raiders, mutated lower-caste Rakata who were bred as soldiers for the Empire, in many battles, including one where they conquered the Givin species. In 25,793 BBY, Xesh located the planet of Tatooine, and he led Tul'kar's forces there to conquer it and the native Kumumgah. Xesh then identified the Force-sensitive Kumumgah from the population, though his selection of a Kumumgah named Lonai caused Lonai's father to try and attack Tul'kar.\nTul'kar and Xesh were then summoned by Skal'nas to its personal stronghold on the planet Byss, where they learned that Skal'nas actually had need of Xesh's abilities. Trill had detected a Force-rich world in the Deep Core, but she was unable to reach it because of the hyperspace disturbances and astronomical anomalies that riddled the region. When asked if Trill's statement was correct, Xesh replied that only she was unable to find it, and an enraged Trill attacked her former friend. Xesh replied by throwing her with the Force before leaping and attempting to kick her, and his second kick sent her falling to the floor. However, as Xesh prepared to execute the pinned Trill with his Forcesaber, Skal'nas intruded and threw the two Force Hounds apart with the Force. Skal'nas repeated his question to Xesh, and the Hound replied that he was able to find the world. Xesh was placed in the Mind Rack to find Tython and found it along with the Je'daii. Without Xesh's knowledge, Skal'nas installed memory blocks on the Force Hound's mind, making him his unknowing spy.\nAs the Devourer arrived at Tython, Tul'kar ordered Xesh to scout the Planet using force shadow. However, Xesh unknowingly appeared in visions to five people—Sek'nos Rath, Shae Koda, Tasha Ryo, Daegen Lok, and Lanoree Brock. Koda, Rath, and Ryo were Je'daii Journeyers, students of the Force in the Je'daii Order on Tython, and Lok was an insane Je'daii who had been exiled to the moon Bogan. Soon, Xesh sabotaged the Devourer and slay his master along anyone on his way for his escape to Tul'kar's escape pod. The three Journeyers were drawn to a volcanic region of Tython by the Force, where they witnessed the stricken Devourer crash, but they discovered Xesh's escape pod intact nearby.\nAs he exited the pod, Xesh cast aside his helmet and drew his Forcesaber, and he scoffed at the Journeyers' claims that they meant no harm when he saw their drawn weapons. The Force Hound then leaped at Rath, slicing through the Sith's Madog steel sword, and he did the same to Koda's weapons when the girl landed a kick to his back. Xesh scored a grazing blow on Koda's arm, but Ryo stopped him with the Force and again asked him to surrender. Refusing, Xesh threw Ryo against a nearby rock and resumed his battle with Koda and Rath, and the Sith was astonished when Xesh absorbed the ball of Force lightning that Rath cast at his opponent. Growing tired with the duel, Xesh unleashed the absorbed energy against Koda and Rath, and the lightning injured Koda's pet rancor Butch. Xesh took advantage of her distraction to send her flying with the Force, but Rath managed to stop Xesh's attack with his Forcesaber and take the weapon from the Force Hound. However, Rath was unable to activate the weapon, and in his fury Xesh summoned Force lightning and a storm of wreckage from their surroundings in order to attack Rath.\nRath tossed the weapon to a returning Koda, and a furious Xesh pinned his opponent to the ground before threatening to burn the Sith with lightning unless Koda returned the Forcesaber. But to Xesh's surprise, Koda was able to channel her anger into activating the weapon, and Xesh soon realized that he had misjudged his opponet's powers. Smashing his fist into the ground, Xesh used the Force to tear the surrounding rocks apart before fleeing into the nearby canyon known as the Rift. However, Xesh was weakened by his wounds and concussion, and he collapsed, unconscious, while traveling through the section of the Rift known as the Abyss of Ruh. Xesh's presence on Tython also generated an immense Force storm, as his intense darkness had driven the planet out of balance, and the storm became centered on Xesh's unconscious body in the Rift.\nXesh's unconscious mind recalled the events on the Devourer, but the screams of the dying in his head awoke the Force Hound, who found that he was being encased in a cocoon of webbing by a swarm of spiders. As the creatures attempted to climb inside his mouth, Xesh summoned Force lightning and tore through the webbing, blasting away the spiders, but as he tore the rest of the webbing from his armor, Xesh was confronted with a nightmarish vision of those who had died on the Devourer, and he fled deeper into the Rift. Battling through the nightmares and the twisted creatures that pursued him, Xesh found that his lightning had no effect on the beasts that attacked him, causing his mind to flash back to the fight with Isk years earlier and how Force Hounds were trained to fight on and with any weapon when the stakes were conquer or die. In the absence of his lighting, Xesh resorted to telekinesis, but when one of the creatures bit his arm, Xesh fell to the ground in pain—only to grab spines off of a nearby plant and use them as projectile, felling all but one of the attacking creatures.\nHowever, the beast was plucked off of Xesh by a saarl, an enormous worm-like creature that proceeded to attack Xesh after it ate the smaller creature. Fortunately for Xesh, the saarl was dissuaded by a large rock that struck it, which had been thrown by the newly-arrived Sek'nos Rath as Koda and Ryo pulled Xesh to safety. The two held back the saarl with the Force as it attacked them, but Xesh slipped away while the three Je'daii were distracted in battle, believing that the three had only saved him because they sought to kill the Force Hound himself. Xesh stopped his ascension of the nearby cliffs to savor the Je'daii's fear, but Koda's anger drew his attention as she struggled to activate the Forcesaber. Xesh called for her to give him the weapon, and despite her reservations, she tossed him the blade—only for Xesh to walk away from their fight with his weapon. Xesh did not leave, however, but remained hidden at the top of the cliffs while he observed the Je'daii fight with the saarl. Xesh was confused as to why Koda and Rath did not simply sacrifice Ryo, the weakest of the three, so that they could escape, and he grew even more confused when Koda did not flee after Ryo and Rath were both knocked unconscious.\nThe Force Hound watched in amazement as Koda, her fear vanishing, stood strong against the saarl and drew powerfully on the light side of the Force in her desire to protect her fallen friends. Intrigued and intoxicated by the sensation of her power, Xesh leapt into battle and stabbed the saarl, joining Koda in the fight. Three more Je'daii—Master Quan-Jang, Ranger Hawk Ryo, and Master Rori Fenn—arrived moments later, and Fenn and Hawk Ryo joined Koda and Xesh in battling the saarl as Xesh leapt onto the saarl and stabbed it through the eye with his Forcesaber. However, Xesh was caught in a storm of energy that exploded outward from the dying saarl and spiraled up to join the Force storm overhead, and the storm began to fuel his power in the Force as the Je'daii demanded that he stand down.\nXesh refused to surrender as the storm continued to grow in power, but Master Quan-Jang, working in conjunction with the other Je'daii Temple Masters across Tython, channeled the Force through the storm and struck down Xesh with lightning, shifting the planet's balance back towards the light and causing the storm to fade. An enraged Shae Koda, believing her master Quan-Jang to now be dead, grabbed Xesh's fallen Forcesaber and prepared to execute Xesh in her anger, but when Xesh informed Koda that she should have the honor portion of his body because of her bravery, Xesh's words confused Koda and brought her to her senses, causing her to deactivate the weapon and walk away. Xesh was taken to Mahara Kesh, the Je'daii Temple of Healing, where his wounds were tended to by a healer named Calleh, though Xesh did not understand what a \"healer\" was or why the Je'daii did not kill him.\nOver the next ten days, Xesh refused all of the healers' offers to help restore his now-shattered memory, which they believed resulted from the concussion he suffered in the crash of the Devourer. Tasha Ryo visited Xesh, who still could not understand why the Je'daii did not treat him as a prisoner or kill him, and Ryo helped Xesh remember fragments of his memory—but Ryo was horrified to find that Xesh had been without empathy since his childhood, as the darkness and violence of his life had long since suppressed his emotions. When questioned as to why he helped Koda defeat the saarl, Xesh found it difficult to express, but stated that he simply could not have allowed Koda's \"light\" to be extinguished. However, the Masters' Council of Je'daii decided that Xesh, with his intense inner darkness, was to be exiled to Tython's moon of Bogan, where he was to meditate on the Force and bring himself back into balance.\nRangers Ryo and Fenn escorted Xesh to Bogan in a Peacemaker-class cruiser, and on the moon Xesh was given a compound to stay in. He received regular deliveries of food, and was supervised by sentry droids. Two months after his initial arrival on the moon, Xesh was returning to his compound after learning from a sentry droid that a shipment of food was due in one week when the Force Hound suddenly found himself under attack. Xesh found his own robes turned upon him as they tried to smother him, and reality seemed to twist so that there was no air. Lashing out, Xesh connected with the stranger who had attacked him and found that the strange effects of the man's attack had ended. The stranger grinned and explained that it was a mind twist—he was inside Xesh's head—and he was pleased when Xesh attacked him, as he wanted to see the Force Hound's power. Xesh pinned the man against the wall and summoned lightning to his hand to kill the man, but Xesh lowered his hand when the stranger asked why the warrior had appeared to him two months ago. Realizing that the man had seen him in a vision like the Journeyers, Xesh released him and listened as he introduced himself as Daegen Lok.\nWhen Xesh questioned the absence of Lok's cuffs, Lok removed Xesh's cuffs with the Force and hid them under the blankets of Xesh's bed, and he took the younger warrior out across the surface of the moon to a hidden cavern where a crashed starfighter lay. Lok explained that he had been exiled to Bogan after he had witnessed a vision of a dark army wielding blades of fire, and Xesh recognized one of the carvings that Lok had made in the wall as a Forcesaber. An excited Lok demanded to know whether Xesh could make more Forcesabers, and after Xesh admitted that he was able to, Lok showed him the crashed Pho-V fighter that was drained of power. To Lok's surprise, Xesh used Force lightning to restore power to the starship, and Xesh used his power to fuel the starship and refill the ship's power cells—but when Lok pulled Xesh away to prevent him from overloading the power cells, Xesh warned Lok to never again attempt to command him while he was using the Force. Drained from his efforts, Xesh collapsed in the ship's bunk while Lok piloted the ship and lifted off from Bogan, setting course for the crystal planet of Krev Coeur so that Xesh could find the crystals needed for the Forcesabers.\nXesh's sleep was filled with dreams of the Devourer's crash, but he awoke to find that the ship was on fire and breaking apart as they entered the atmosphere of Krev Coeur. Lok and Xesh grabbed parachutes and leapt to safety as their ship crashed into the planet, and Lok then sought out an alien named Slug who showed the two a crop of particularly valuable crystals. While Lok engaged in negotiations with Slug, Xesh surveyed the crystals and selected two that were appropriate for use in the Forcesabers. However, when Lok attempted to kill Slug and eliminate a loose end, a Je'daii Ranger named Bel Zana arrived and threw Slug to safety before attempting to arrest the two fugitives. Xesh leapt into battle with the Ranger, but Lok reached into her mind and preyed on her fear of fire, performing a mind twist that convinced her mind that she was on fire.\nXesh viewed Lok's attack with contempt as a cowardly trick, but they were suddenly beset by Temple Master Jake Fenn and Sek'nos Rath. Xesh squared off against Rath, but asked the Journeyer to walk away—he had no desire to kill Rath, but their fighting would end with Rath's death. Rath refused to retreat and attacked Xesh, instigating a brief fight that ended when Lok threw a still mind-twisted Bel Zana off the nearby cliff and Rath leapt to save her. As Rath fell to his apparent death while saving Zana, Xesh and Lok fled and made their way to the factory world of Nox. Lok secured them use of Gratz Foundry by mind-tricking the owner Gratz, and Xesh set to work on the Forcesaberswhile Lok cleaned himself up and acquired sets of armor for himself and Xesh. Using alchemy and the machinery in the factory, Xesh completed two Forcesabers and tuned the crystals, and after completing the weapons he cut his hair and donned his new armor at Lok's request.\nForcesabers in hand, Lok then set out to gather an army, and took Xesh to Skrag's Cantina where the Je'daii introduced him to four of the generals of the Despot Queen Hadiya, the woman who had instigated the Despot War in the Tython system twelve years ago. Bakko, Shri-Lan, Gav Vannar, and Ka'un Damm opened fire on Lok when they recognized him, as he was responsible for Hadiya's death, but Lok and Xesh made quick work of the four's weapons with their Forcesabers. Lok proceeded to try and convince the four to follow him and gather an army to take Tython, but Xesh sensed that Shae Koda was tracking him through the Force and interrupted Lok to inform him of their pursuers. The two departed the cantina minutes before Hawk Ryo arrived, and Lok and Xesh split up to evade their pursuers.\nTo Xesh's surprise, he found himself on the losing end of a hunt as Shae Koda doggedly pursued him, seemingly able to anticipate his every move. Unable to shake her, Xesh realized that he did not want to fight her—a feeling that was alien to the Force Hound—as they raced through the streets of the city of Boneyard. Collapsing a pile of barrels in his wake to slow Koda, Xesh leapt down a nearby garbage chute, slowing his descent with the Force, only to find that Koda had beat him to the bottom where she delivered a flying kick to his jaw. As he rolled to his knees, Xesh warned her that a fight would end in her death, and asked her to walk away—but an enraged Koda drew her swords and berated Xesh for breaking the trust she and Rath had shared with Xesh before she leveled one of her swords at his throat. Xesh easily knocked it aside with the Force and again asked the Je'daii to walk away, but Koda would not be denied, and she reminded Xesh of how she and the other Journeyers had been his friends.\nDrawing his Forcesaber, Xesh asked Koda for a final time to walk away, and the two began to duel. However, after Koda succeeded in slicing Xesh's side, they were both thrown off of their feet by enormous tremors as the tentacles of a dianoga, a massive sewer creature, erupted through the ground below them and grabbed Koda. Despite the fact that his instincts told him to let her die, Xesh dove after Koda into the hole left by the dianoga and plunged into the murky waters of the cave far below where the creature had made its home. Upon seeing Koda seemingly lifeless in the dianoga's grasp, Xesh reached out with the Force and took hold of the beast's hearts, squeezing them until the creature died and released Koda. The Force Hound pulled Koda to the surface, where he realized that she was not breathing but detected a faint pulse. Determined to save her for reasons he could not understand, Xesh breathed air back into her lungs, and when she awoke, he took her prisoner and carried her to the nearby spaceport where he and Lok were to rendezvous.\nThe two stole a ship and flew to the planet Shikaakwa, where Lok intended to continue his efforts to gather an army, and the mad Je'daii clouded Koda's mind to make her a cooperative prisoner. Lok brought Xesh and Koda along to Ryo Fortress, home of Clan Ryo—one of Shikaakwa's nine crime families—and Xesh was surprised to see the guard grant them access when Lok used a mind trick to convince the man that he carried the seal of Ryo. Xesh pulled Koda along as the trio headed to the personal chambers of Baron Volnos Ryo, who was angered to see Lok, though Lok reminded Ryo that he had helped Lok go undercover in the Despot Army during the Despot War and kill Queen Hadiya.\nRyo's security droid targeted both Xesh and Lok with tracking lasers, but when the baron questioned Xesh about how he felt about the man he \"served,\" the angered Force Hound reached out with the Force and pulled Ryo into the line of fire. Xesh batted the droid's fire back at it and destroyed it, saving Ryo from death, but his point was clear: he served no one. Their conversation was interrupted by the arrival of Sek'nos Rath, Trill, Rori Fenn, and Hawk Ryo, who called for the two to drop their weapons and surrender. Lok pulled down the chamber's ceiling with the Force and ordered Xesh to follow with Koda as he leapt to the roof, and Xesh pulled the girl with him as he retreated to a shadowy area of the roof to wait for Sek'nos Rath, who he could sense approaching.\nXesh informed Rath that he was glad to see the Je'daii had survived, but Rath brushed off the comment as sarcasm and demanded Xesh surrender. The Journeyer tried to slam the Force Hound against the nearby wall with the Force, but Xesh delivered a flying kick to Sek'nos's jaw as the two argued over what Rath saw as Xesh's servitude to Lok, and Xesh blasted Rath into unconscious with Force lightning before he pulled Koda along with him to find Lok. As he departed, Xesh saw Trill tending to a fallen Rath, but he did not recognize his former brood mate thanks to mental blocks installed by Skal'nas. Xesh arrived just in time to drive Hawk Ryo away from a fallen Lok, who used Ryo's distraction while dueling Xesh to summon his Forcesaber and slice off Ryo's lower leg.\nHearing Ryo's cry of pain, Koda awoke from Lok's mental control and grabbed Ryo's Forcesaber, attacking Lok in defense of Ryo. Lok ordered Xesh to kill Koda so that he could kill Ryo, and Xesh ordered the Journeyer to surrender—but Koda berated the warrior for his continued servitude to Lok and pleaded with him to make his own choices in life. Koda's words were cut off when Lok sent the girl flying with the Force, but his proclamation that he was Xesh's master convinced Xesh of the truth of Koda's words and he turned on Lok, slicing the mad Je'daii across his chest. Lok grabbed Xesh by the throat and delved into his mind, but doing so was a mistake—Xesh's mind overwhelmed Lok, knocking him nearly unconscious and sending him to his knees. Xesh prepared to execute Lok with his Forcesaber, but Koda convinced him not to, and Xesh helped the Je'daii take Lok prisoner instead.\nIn the days that followed, Xesh agreed to accept the Je'daii's help in restoring his memory so they could learn what they could of the Rakata, whom the Je'daii had determined were likely planning to invade the Tython system. After reviewing Xesh's actions, the Council decided that Xesh was ready to be trained as a Je'daii, and Xesh began training in the ways of the Balance under the Je'daii while the Order began construction of Forcesabers for use in the coming war. Some among the Order believed that Xesh was intended to lead the Je'daii in the coming battle, and Hawk Ryo—who had shared Lok's vision of the dark army—admitted to Temple Master Ketu that in his vision, it had been Xesh who had led the Je'daii against the dark army and not Lok as Lok had foreseen. However, Trill, who was still posing as an ally of the Je'daii, sent a message to Skal'nas reporting that the Predor's memory blocks on Xesh were successful: the Force Hound had no idea that he was in fact Skal'nas's spy.\nLiving among the Je'daii, Xesh began to understand that the Force was more than the dark side; however, when the Rakata invaded the Tython system, Xesh found himself relying more and more on the dark side. Xesh ambushed a group of Flesh Raiders in the swamps of Shikaakwa, and he quickly dispatched most of them. Xesh was killing the last Flesh Raider as a Force Hound arrived riding a winged creature, but Shae Koda came to Xesh's rescue atop her rancor-dragon Butch. He quickly dispatched the Force Hound but had to fall back with Lok when attacked by Rakatan war machines, Rakatan Annhilators. Xesh requests an air strike despite being in the battlefield and reminding Lok that the Rakatan eat their enemies. Soon, the Je'daii air squadron strafe the battlefield and destroying the enemies cavalry. Soon, the Rakatan force retreat due to sustaining casualties with the remaining Je'daii clean up the remaining Flesh Raiders.\nLok celebrate the victory over the Rakatans with the many of the Je'daii exhausted from the battle. As Trill take Rath to a bath, Xesh struggles to remember Trill and confide with Shae. Shae thanks Xesh for showing the Forcesabers capable to stand against the Rakata while Xesh thanks Shae and the Je'daii for showing the other side of the Force other than the dark, they almost kiss until Shae decide to rest for the day with Xesh looking at her.\nAt night, Xesh had a nightmare on his repressed memories of the Rakata Empire and reminding his duty for them. He soon woke up by Shae whose force bond with Xesh woke her up as well. Xesh fear his nightmare of turn back to the Rakatan side and betray the Je'daii but Shae deny this and admit she is in love with him. Xesh was confused about the concept of love due to his Rakata past and admits that being near her calms him. He soon shares a secret, Xesh is not his true name and merely designation for the Rakata to mark their slaves, he remembers his true name, Tau. Tau was the only word from his native langauge and it means soul, Shae thanks Tau for sharing his name and keep it a secret, soon they sleep together for the rest of the night.\nXesh attend the war council with Rajivari and Lok where they discuss Ryo attempt peace with the Rakata under the assumption they target Tython only. Xesh explain that it is a foolish action as Rakata is merciless in their conquest and that those without the Force will most likely be food. Soon, Tasha seen another force vision of the future regarding the fortress falling. While the Je'daii can't fight a war of attrition, Xesh offered a solution, to kill the Predor Skal'nas as killing the leader would cause chaos in the invasion hierarchy with the Sub-Predor fighting for power, Xesh offer to use Force to find Skal'nas location in Ska Groa. He located the Predor in the Valley of Kraau and prepare a Je'daii strike force. However, the Rakata ambushed and captured many of the Je'daii, Xesh soon fought the attacking Flesh Raiders with him using the Force Lightning, reminding himself that he fight for his home and friends along with his connection with Shae. He caught Trill using the Force to detect him and her attempt to attack him, he stop her and interrogate her with her stating that she thought he was a Flesh Raider. He enters the cave where the Flesh Raiders came from with Trill wanting to come with Xesh, soon they found the Force battery with the captured Je'daiis. Trill revealed her true nature and knocked out Xesh.\nSoon, Xesh memories have return to him by Skal'nas who demand Xesh return to serve the Rakatan. Xesh soon argue that there is the light side of the force and balance with his Predor cruely reminded Xesh of his duty for the Rakatan Empire. Out of fear that the Je'daii would never accept him with his newfound atrocities and returned to the dark side and serve under Skal'nas. Xesh soon attend Lok's interrogation about the chasm below Anil Kesh along with the vision, he use his mind trick to force Lok to remember his vision to the chasm and confirm the legends of the Infinity Gate. Soon the Predor uses the Force Hounds as conduits to blind the Force Seers, giving them an advantage in their invasion.\nXesh soon become Skal'nas' personal Force Hound, replacing Trill. He followed his master along with Lok to chasm with Xesh reminding the begging Lok that everything will be under the Rakatan rule. They arrive in the chasm, proceed to the Infinity Gate in Tython, leaving behind the chained Lok. As they arrived at the Infinity Gate, Tau can hear Shae through the force bond. Shae and Lok arrived at the gate with Shae dueling Xesh while Lok duel Skal'nas. Xesh tell Shae to flee the battle while Shae remind Xesh that his mind is in conflict, he express his guilt for destroying the world and he is nothing more than a Force Hound. Shae argue back that Tau feelings for her is true and he embraced the light side of the Force that he was absence of, convincing back to be Tau instead of Xesh. Shae soon gave a choice to be Xesh the Force Hound or Tau a free man, however the Predor managed to open the Gate which interrupted the duel. Xesh beg Shae to surrender or she will die, she instead chose to forgive Xesh for his crimes for he will forgive himself, as they soon get closer. Skal'nas attack Shae from behind and dismiss the Je'daii beliefs, Tau soon turn against his master and duel with him. During the duel, the Thor Yor destroyed the Gate, destroying the Predor's ambition with Tau killing him in the process. He soon cast aside his former identity as Xesh and became Tau. Soon he managed to escape the collapsing gate along with Shae and Lok.\nAfter the war with the Rakata Empire, Tau and Shae are allowed to explore Tython starting from the Silent Desert. He express his surprise that the masters return him back to the Je'daii Order.\nA fair-skinned Human with black hair and blue eyes, Xesh had been a slave of the Rakata since he was a child, and he did not remember his original name; he and the other members of his brood were identified only by the letter with which they had been branded. In Xesh's case, he was tattoed with the Aurebesh letter Xesh in purple on his forehead, back, upper arms, and legs, as the mark signified that he was a Force Hound of the Rakata and allowed his masters to identify his limbs and body if he died in combat. His body was covered by dozens of cuts and scars that were the results of countless fights in the Arena of Byss. Xesh's hair and facial hair grew long during his two months on Bogan, though he shaved his face and cut his hair short once again on Nox and also donned a custom-made suit of armor that resembled his Force Hound armor.\nAs a child, Xesh found a protector and surrogate sister in the older slave Trill, who defended him from their pack leader Yirt. The two became fast friends, with Trill comforting Xesh when he was in pain, and as they grew older they made blood oaths to protect and never to kill each other. However, Predor Tul'kar pitted the two against each other for his own amusement, and Xesh emerged victorious and was ordered to kill Trill. To save Trill's life, he proposed that she be given to Predor Skal'nas as a Force Hound, but Trill saw his decision as a betrayal—he was the one being in the galaxy that she would gladly die for, and Xesh did not look back as he left the chamber despite her calling his name. From that moment forward, Xesh's life was one of constant loneliness, and he only knew the barbaric and ruthless culture of the Rakata species. As his masters were cannibals, Xesh expected the same of the powerful warriors he met on Tython, and was surprised to learn otherwise.\nThe dark side was the only Force that Xesh knew, and his life was filled with the anger and hate that fueled the machines of his Rakata masters. Xesh felt that the rules of the arena applied to all life—one must fight to survive with any and all weapons at hand, and showing mercy was a weakness that should be met with death. However, when he witnessed Shae Koda's determination to save her friends and her demonstration of the light side of the Force, Xesh became fascinated with the light she represented, and though he did not understand why, he felt that her light should be protected and not be snuffed out. After his defeat, he was confused by the Je'daii healers' requests that they be allowed to heal his shattered memory, as he believed that as the victors they were able to do whatever thy wanted with Xesh regardless of his opinions.\nXesh disliked Daegen Lok's use of mental manipulation during the two's journey across the Tython system, as he viewed such tricks as unworthy of true warriors, and he made it clear to Lok that the mad Je'daii should never try to command him or his use of the Force. When he fought Sek'nos Rath and Shae Koda on Krev Coeur and Nox, he asked both to walk away, as the only way he knew how to fight was to the death, and he had no desire to harm those who had saved him and considered him their friend. Xesh recognized the fact that he should have let the dianoga who attacked Shae Koda take the girl, but the Force Hound was unable to let her die—he saved her from drowning and breathed life back into the unconscious girl for reasons he could not understand.\nOn Shikaakwa, Xesh was uncomfortable with Lok's manipulation of Koda's mind, and by that time Xesh had become determined never to be a slave again: Volnos Ryo's reference to him as Lok's servant enraged the warrior, and Rath and Koda were able to convince Xesh during their later fight that he could be more than just Lok's subordinate. Refusing to be the slave of Lok or anyone else ever again, Xesh turned on the mad Je'daii, and the darkness and pain within Xesh's mind was so strong that Daegen Lok was nearly knocked unconscious. After Shikaakwa, Xesh accepted the Je'daii's offer of training so that he could be brought into balance and help them fight the coming armies of the Rakata.\nXesh was a particularly powerful Force-sensitive, and he was trained in the dark side since he was a child by his Rakata masters. Tul'kar considered Xesh to be the best of the Force Hounds, and Xesh was a formidable fighter in both unarmed combat and swordplay. In the arena on Byss, Xesh developed a powerful survival instinct and learned to use anything and everything at hand as a weapon. Xesh was particularly proficient in the use of telekinesis, using the Force to manipulate the environment around him during battle and as a part of everyday life.\nWhen Trill attacked him on Byss, Xesh was able to disarm and then defeat her using only telekinesis, and he favored the use of Force lightning in combat—Xesh could both cast lightning and reflect lightning back at his opponents, and he even used Force lightning to restore power to the drained fuel cells of the Shikaakwan fighter on Bogan. The Force Hound looked down on those Force powers that dealt with mental manipulation, as he viewed them as tricks that were unworthy of true warriors, but he was able to push back Daegen Lok's influence from his mind with the help of the fact that Lok was unprepared for the darkness and pain in the Force Hound's mind.\nXesh was created by John Ostrander and Jan Duursema for their comic series Star Wars: Dawn of the Jedi, which is set almost 26,000 years before Star Wars: Episode IV A New Hope and details the events that lead to the founding of the Jedi Order. Xesh was first mentioned in Star Wars: Dawn of the Jedi 0, a preview issue for the issues released on February 1, 2012, and Xesh has appeared in all fifteen issues of the series' three arcs, Force Storm, The Prisoner of Bogan, and Force War. Xesh appeared briefly in Dawn of the Jedi: Into the Void, a tie-in novel to the series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tau_Idair",
  "/wiki/Tau",
  "/wiki/Xesh/Legends",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi:_Force_War",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/In-universe",
  "/wiki/Wookieepedia:Welcome,_newcomers",
  "/wiki/Wookieepedia",
  "/wiki/25,793_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Infinite_Empire",
  "/wiki/Je%27daii_Order",
  "/wiki/Tul%27kar",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Species/Legends",
  "/wiki/Aurebesh/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force_Hound",
  "/wiki/Predor",
  "/wiki/Trill_(Force_Hound)",
  "/wiki/Planet/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Deep_Core/Legends",
  "/wiki/Tython/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Devourer_(Rakatan_ship)",
  "/wiki/Shae_Koda",
  "/wiki/Tasha_Ryo",
  "/wiki/Sek%27nos_Rath",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Rift",
  "/wiki/Force_storm_(weather)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Saarl",
  "/wiki/Moon/Legends",
  "/wiki/Bogan",
  "/wiki/Daegen_Lok",
  "/wiki/Forcesaber",
  "/wiki/Settled_Worlds",
  "/wiki/Tython_system/Legends",
  "/wiki/Death/Legends",
  "/wiki/Nox",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Volnos_Ryo",
  "/wiki/Tattoo/Legends",
  "/wiki/Yirt_(slave)",
  "/wiki/Force-drive",
  "/wiki/Skal%27nas",
  "/wiki/Byss/Legends",
  "/wiki/Isk_(Force_Hound)",
  "/wiki/Sriluur/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Flesh_Raider",
  "/wiki/Soldier/Legends",
  "/wiki/Givin/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Conquest_of_Tatooine",
  "/wiki/Kumumgah/Legends",
  "/wiki/Lonai",
  "/wiki/Rakatan_stronghold",
  "/wiki/Hyperspace/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Lanoree_Brock",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Madog_steel",
  "/wiki/Force_lightning/Legends",
  "/wiki/Rancor/Legends",
  "/wiki/Butch",
  "/wiki/Abyss_of_Ruh",
  "/wiki/Spider/Legends",
  "/wiki/Shadowed_wraith",
  "/wiki/Telekinesis/Legends",
  "/wiki/Quan-Jang",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Hawk_Ryo",
  "/wiki/Rori_Fenn",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Mahara_Kesh",
  "/wiki/Calleh",
  "/wiki/Standard_day/Legends",
  "/wiki/Masters%27_Council",
  "/wiki/Peacemaker-class_cruiser",
  "/wiki/Droid/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pho-V_fighter",
  "/wiki/Crystal/Legends",
  "/wiki/Krev_Coeur",
  "/wiki/Atmosphere/Legends",
  "/wiki/Parachute/Legends",
  "/wiki/Slug_(Koorivar)",
  "/wiki/Bel_Zana",
  "/wiki/Jake_Fenn",
  "/wiki/Gratz_Foundry",
  "/wiki/Gratz",
  "/wiki/General/Legends",
  "/wiki/Despot_Queen",
  "/wiki/Hadiya",
  "/wiki/Bakko",
  "/wiki/Shri-Lan",
  "/wiki/Gav_Vannar",
  "/wiki/Ka%27un_Damm",
  "/wiki/Cantina/Legends",
  "/wiki/City/Legends",
  "/wiki/Boneyard_(Nox)",
  "/wiki/Dianoga/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Shikaakwa",
  "/wiki/Ryo_Fortress",
  "/wiki/Clan_Ryo",
  "/wiki/Nine_Houses",
  "/wiki/Baron/Legends",
  "/wiki/Despot_Army",
  "/wiki/Ketu",
  "/wiki/Invasion_of_the_Tython_system",
  "/wiki/Rancor-dragon",
  "/wiki/Arena_of_Byss",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi_0",
  "/wiki/February_1",
  "/wiki/2012",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi:_Force_Storm",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi:_The_Prisoner_of_Bogan",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Category:Images_of_Xesh",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_1",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_2",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_3",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_4",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_5",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_1",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_2",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_3",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_4",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_5",
  "/wiki/Dawn_of_the_Jedi:_Force_War_1",
  "/wiki/Dawn_of_the_Jedi:_Force_War_2",
  "/wiki/Dawn_of_the_Jedi:_Force_War_3",
  "/wiki/Dawn_of_the_Jedi:_Force_War_4",
  "/wiki/Dawn_of_the_Jedi:_Force_War_5",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_132",
  "/wiki/Star_Wars_Insider_138",
  "/wiki/Star_Wars_Insider_143",
  "/wiki/Star_Wars_Insider_146",
  "/wiki/Star_Wars_Insider_150"
 ]
}