{
 "name": "Tauht",
 "display_name": "Tauht",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Khorm"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tauht was a Human male who served as a Jedi Master of the Jedi Order during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. Along with Jedi Masters Kit Fisto and Plo Koon, he was dispatched to the Separatist-occupied planet Khorm in order to secure the world's agrocite, a valuable ore used to exceptionally increase power to starfighters. Tauht participated in the Republic's initial assault on an Agrocite processing center, which was controlled by the native Khormai Warlord Unger Gout, who had aligned himself with the Confederacy.\nThe Republic forces captured the plant and established a base there, although Gout managed to escape. Hoping to minimize clone trooper casualties in the next battle, Koon and Fisto left to search for a Confederate weather-control station, which supposedly controlled storms above Khorm and was preventing the Republic from employing air support. Tauht was left in charge of the Republic station, which was soon attacked by the Confederate forces commanded by the Dark Jedi Asajj Ventress. During the battle, Tauht and Ventress confronted each other. After a brief fight, Tauht was killed by Ventress, who used the Force to manipulate one of her lightsabers and stabbed the Jedi Master with it.\nTauht was a Human male member of the Jedi Order, who had attained the rank of the Jedi Master by 22 BBY, the first year of the Clone Wars between the Confederacy of Independent Systems and the Galactic Republic. Early in the war, the Galactic Senate dispatched Tauht, along with fellow Jedi Masters Plo Koon and Kit Fisto, to the Separatist-occupied planet of Khorm in order to secure its valuable agrocite ore, used to substantially increase power to starfighters. Because of the extensive storm above Khorm, the Republic could not provide air support and was forced to rely entirely on the ground forces commanded by Major Kendal Ozzel.\nThe Republic troops—consisting of All Terrain Recon Transports and All Terrain Tactical Enforcers—soon approached an agrocite processing plant that was commanded by Warlord Unger Gout, a native Khormai who had betrayed his people and enslaved them to mine agrocite for the Confederacy. Upon sight of the Republic forces, Gout ordered his J-1 semi-autonomous proton cannons to open fire. As the battle began, Major Ozzel ordered the clone troopers to disembark from the AT-TEs, a move that exposed them to enemy fire. Realizing that the clones could not survive the barrage, Tauht, Koon, and Fisto decided to draw fire upon themselves.\nThe Jedi defended the clone troopers by deflecting blaster shots with their lightsabers, and then charged Gout's battle droids in the trenches that surrounded the plant. While Masters Koon and Fisto fought BX-series droid commandos and B2 super battle droids, Tauht proceeded to destroy the proton cannons. Meanwhile, Major Ozzel ordered Republic AT-TEs to open fire at the Jedi's position, thus annihilating the majority of droid forces at the cost of endangering the Jedi's lives. Tauht then noticed that Gout was trying to escape and warned Master Koon. It was too late, however, as the warlord managed to flee on a rail jet.\nAfter the facility had been secured and the Republic had established a base there, the three Jedi—together with Ozzel and Clone Commander CC-3636, nicknamed \"Wolffe\"—gathered inside to consider strategies for their next attack on the agrocite mines. Tauht witnessed as Major Ozzel proposed a direct assault, and Master Koon declined, stating that such an attack would result in too many clone casualties. At that moment, Admiral Wieler contacted the Jedi and informed them that a Separatist starship had somehow reached the planet's surface through an opening in the storm. This information led the Jedi to conclude that the Separatists possessed some sort of weather-control station on Khorm. If the station was destroyed, it could remove the storm, allowing the Republic to utilize air support in the battle and lessen the number of casualties. To this end, Koon and Fisto set off to search for that climate-control station, leaving Tauht in charge of the Republic base.\nAfter Koon and Fisto had departed the base, however, it came under attack from the Separatist forces commanded by Asajj Ventress—a Dark Jedi who had arrived to assist Gout on the starship that Wieler had reported. When Confederate Armored Assault Tanks opened fire on the base, Tauht ordered Ozzel to reinforce the lines and hold the facility while he contacted Koon. As Tauht rushed to deliver a message to Koon, the plant was shattered by explosives detonated by Ventress. The explosion threw Tauht on the ground, where he found himself face to face with Ventress herself, who pointed one of her lightsabers at him. Having been previously warned not to underestimate Ventress, Tauht quickly ignited his own lightsaber and deflected one of Ventress's weapons. Stating that his orders were to subdue her at any cost, Tauht hit Ventress in the face, causing her to drop one of her weapons. Ventress then expressed her respect for Tauht's strength but claimed that she did not have time to fight him, using the the Force to pick up her fallen lightsaber, ignite it, and send it flying into Tauht's back. Tauht did not notice the Dark Jedi's actions until too late, and was stabbed.\nWith Tauht's death, Ozzel assumed command of the remaining Republic forces. However, instead of staying put and holding the facility as Tauht had ordered him, Ozzel decided to charge the droids openly. This proved to be a flawed strategy, as the Confederacy revealed its previously hidden DSD1 dwarf spider droids, which eliminated the majority of the Republic task force and forced Ozzel to surrender. The major, along with Wolffe and several clone troopers, was taken prisoner and interrogated on Fisto and Koon's location, which Ozzel revealed.\nTauht was a blond-haired human male with blue eyes and light skin. He was a capable leader and had gained Plo Koon's trust, as indicated by Koon's notion to leave Commander Wolffe and the Republic base under Tauht's authority. Although warned not to underestimate the notorious assassin Asajj Ventress, Tauht did just that during their fight by failing to perceive Ventress's actions. Tauht's failure to take heed of the Dark Jedi ultimately cost him his life.\nA fully-trained Jedi Master, Tauht was skilled with his green-bladed lightsaber and used it to save the clones by deflecting enemy fire and to destroy Warlord Gout's proton cannons. Ventress herself acknowledged Tauht's skills during their fight. Despite all his talents, however, Tauht was unable to sense Ventress approaching him and her Force actions in manipulating her lightsaber.\nTauht's first and only appearance is in the comic The Clone Wars 7, written by Henry Gilroy and Steven Melching and illustrated by Scott Hepburn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/22_BBY/Legends",
  "/wiki/Khorm/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Blue",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/The_Clone_Wars_7",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Khorm/Legends",
  "/wiki/Agrocite/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Agrocite_processing_facility",
  "/wiki/Khormai/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Unger_Gout",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Weather-control_station",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Shiak",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Major/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/All_Terrain_Recon_Transport/Legends",
  "/wiki/All_Terrain_Tactical_Enforcer/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Mining/Legends",
  "/wiki/J-1_semi-autonomous_proton_cannon",
  "/wiki/Cloning/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/BX-series_droid_commando/Legends",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Rail_jet/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-3636",
  "/wiki/Admiral/Legends",
  "/wiki/Wieler",
  "/wiki/Trident_(starship)/Legends",
  "/wiki/Armored_Assault_Tank",
  "/wiki/Interlocking_hilt",
  "/wiki/DSD1_dwarf_spider_droid/Legends",
  "/wiki/Color/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Henry_Gilroy",
  "/wiki/Steven_Melching",
  "/wiki/Scott_Hepburn",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_111",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_6",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_30",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_8",
  "/wiki/Senate_Spy",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/StarWars.com",
  "/wiki/Holocron_Heist",
  "/wiki/Star_Wars:_The_Clone_Wars:_In_Service_of_the_Republic"
 ]
}