{
 "name": "Tav_Breil%27lya",
 "display_name": "Tav Breil'lya",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kothlis"
     ]
    },
    {
     "name": "Born",
     "values": [
      "25 BBY",
      "Kothlis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.4 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tav Breil'lya was a top aide to Borsk Fey'lya. However, he lacked Fey'lya's political guile, and his actions on New Cov trying to get Garm Bel Iblis to ally with Fey'lya's faction were exposed to the New Republic Provisional Council.\nTav was born on Kothlis to a family with an impressive lineage, which he often showed by wearing his family crest about his neck. He became Council-Aide to Borsk Fey'lya, and undertook a number of missions for Fey'lya during the Thrawn campaign. One of his regular tasks was to go to the planet New Cov to meet with Garm Bel Iblis, as part of Fey'lya's ongoing attempt to recruit Bel Iblis.\nIn 9 ABY, Tav was present on the planet New Cov. While on the planet, he noticed that Lando Calrissian and Han Solo were also there to find at thisat time some evidence of Fey'lya's activities. Han noticed Tav in the crowd and decided to follow him to find out what he was doing there. Tav evidently didn't realize that Han was following him, which led him to a warehouse. There, he was taken by a woman named Irenez who was a colleague of Bel Iblis. This was when he noticed that Han was following him. Before Han could interact, he was disarmed by Sena Leikvold Midanyl, another employee of Bel Iblis. While Sena interrogated Han, Tav described him as an Imperial spy and infiltrator. Tav suggested having him executed since it didn't matter who he was and what he had learned from the agreement between him and Sena. Before he could do so, Lando Calrissian and Luke Skywalker arrived. When Sena took Luke's lightsaber as proof of identity, she saw that Han was not a spy. She invited them to the secret base where Bel Iblis was. Tav made one last attempt to persuade Sena not to let them go easily, but she ordered him to go back to the ship, which he then did.\nLike all Bothans, Tav liked to play games of politics and power. Unlike Borsk Fey'lya, however, he was neither subtle nor clever. This was exactly what Borsk Fey'lya wanted, as he wished his Council-Aide to be a subordinate, not a rival. Tav is very loyal to Fey'lya, and continued to believe Fey'lya would end up on top even when circumstances turned against them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kothlis/Legends",
  "/wiki/25_BBY/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/New_Cov/Legends",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/New_Republic_Provisional_Council",
  "/wiki/Thrawn_campaign",
  "/wiki/Planet/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Irenez_(Human)",
  "/wiki/Sena_Leikvold_Midanyl",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Hunting_the_Hunters",
  "/wiki/Star_Wars_Galaxy_Magazine_6",
  "/wiki/Dark_Force_Rising",
  "/wiki/Dark_Force_Rising_(unabridged_audiobook)",
  "/wiki/Dark_Force_Rising_Sourcebook",
  "/wiki/Star_Wars_Miniatures_Battles_Companion",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}