{
 "name": "Tavetti",
 "display_name": "Tavetti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Protobranch"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bivall"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Tavetti was a Bivall male senator who represented Protobranch in the Senate of the Galactic Republic.\nAround 85 BBY, Tavetti served as a senator for his people's homeworld, Protobranch. When Jedi Master Lene Kostana's Padawan Sifo-Dyas received a Force vision of a deadly solar storm hitting Protobranch, she informed Tavetti against the wishes of the Jedi High Council. Tavetti believed Sifo-Dyas' vision could possibly come true due to the Tabor Plains being described in it. During the conversation, Tavetti only expressed concern for the large amount of bacta Protobranch produced rather than the population, which slightly unnerved Dooku. Tavetti also requested Kostana investigate, but in secret so as to avoid civil unrest.\nUltimately, Sifo-Dyas' vision came to pass; a powerful solar storm hit Protobranch, destroying much of the planet's population and resources. Tavetti immediately sent aid, but ordered the men he sent to search for and protect any surviving bacta rather than people.\nDooku's experience with Protobranch and Tavetti was among the reasons Dooku decided to leave the Jedi Order and the Republic.\nTavetti was a male Bivall who was shown to be proud of his homeworld Protobranch and the bacta it provided the galaxy. When informed of a potential danger to Protobranch, he only expressed concern for the planet's resources rather than its population, and after the disaster actually happened, ordered the authorities to prioritize salvaging any remaining bacta rather than search for any surviving Bivall, a fact that unnerved Dooku.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Protobranch",
  "/wiki/Bivall",
  "/wiki/Gender",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Senator",
  "/wiki/85_BBY",
  "/wiki/Homeworld",
  "/wiki/Jedi_Master",
  "/wiki/Lene_Kostana",
  "/wiki/Padawan",
  "/wiki/Sifo-Dyas",
  "/wiki/Force_vision",
  "/wiki/Jedi_High_Council",
  "/wiki/Tabor_Plains",
  "/wiki/Bacta",
  "/wiki/Dooku",
  "/wiki/Protobranch_solar_storm",
  "/wiki/Planet",
  "/wiki/The_galaxy",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Tavetti",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Asajj_Ventress",
  "/wiki/102_BBY"
 ]
}