{
 "name": "Tave",
 "display_name": "Tave",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Noghri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    }
   ]
  }
 ],
 "content": "Tave was a Noghri male Je'daii Master who served the Je'daii Order on Tython at the height of the Infinite Empire's reign.\nA Force-sensitive Noghri male, Tave was trained in the ways of the Force by the Je'daii Order on the planet Tython, one of nine planets in the Tython system which made up the Settled Worlds. Ascending to the rank of Je'daii Master, Tave was appointed as the assistant to Master Lha-Mi, the Je'daii Temple Master of the Great Temple of Martial Arts, Stav Kesh. Alongside Master Kin'ade, Tave was one of the primary instructors at Stav Kesh, and oversaw the initial breathing exercises necessary to survive in the thin atmosphere of the Ice Giant Range. Stoic and patient, instruction on the lower balconies of the Temple generally consisted of Master Tave instructing his students to attack him, with rarely a strike landing. Master Tave's defense typically relied on traditional martial arts techniques, without using the Force to defend himself from his students during hand-to-hand combat.\nDuring the Great Journey of Lanoree and Dalien Brock, Tave began their instruction alongside four other Je'daii Journeyers. When it was apparent that Dalien was of middling Force ability, Tave took over his instruction in traditional fighting styles while Kin'ade oversaw the other's instruction in Force-based martial arts. During the final combat exercise in the Great Hall of Stav Kesh, Tave and Kin'ade stand alongside the battle ring prepared to use the Force to soften blows and prevent any real harm from befalling the Journeyers.\nAs Sek'nos Rath, Tasha Ryo and Shae Koda completed their Great Journey after the arrival of the Force Hound Xesh on Tython and his subsequent exile to the Bogan moon, Tave instructed them in combat, training them with staffs. Cautioning them against dwelling too much on Xesh's exile and doubting the wisdom of the Je'daii Council, Tave assured them that their concerns were being taken seriously by the Temple Masters before dismissing them.\nAs the Infinite Empire launched an invasion of the Tython system, Tave donned black battle armor and wielded duel Forcesabers in a reverse-grip style as he took to the battle field. Alongside Masters Tem Madog and Daegen Lok, Tave participated in the battle of Shikaakwa where they ambushed the Flesh Raiders sent to attack Ryo Fortress. After driving the Empire off Shikaakwa, the Je'daii gave chase to Ska Gora where they engaged the Rakatan forces in violent combat. However, this was revealed to be a trap as the Rakatan forces ambushed the Je'daii task force and took many of them prisoner before encasing them in tubes in a chamber under the Rakatan fortress. Tave continued to fight on, even after the traitor Xesh caused psychic backlash among the Je'daii seers and caused a flood of dark side energy to encourage the Flesh Raiders and sap the strength from the Je'daii. Ordered to fall back to Tython as the Balance was completed titled to the dark side, Tave regrouped with Master Madog as they fled Ska Gora.\nA master of the Force, Tave was skilled in hand-to-hand combat, sword fighting, and other traditional methods of combat. Tave could use the Force to slip away and hide from the naked eye, to essentially disappear in the Force and shroud his physical presence and his signature in the Force. Tapping into the dark side of the Force and leaning out of Balance, Tave was able to activate and wield dual Forcesabers during the war with the Rakata.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tython/Legends",
  "/wiki/Noghri/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Je%27daii_Master",
  "/wiki/Infinite_Empire",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Tython_system/Legends",
  "/wiki/Settled_Worlds",
  "/wiki/Lha-Mi",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Stav_Kesh",
  "/wiki/Kin%27ade",
  "/wiki/Ice_Giant_Range",
  "/wiki/Great_Journey",
  "/wiki/Lanoree_Brock",
  "/wiki/Dalien_Brock",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Sek%27nos_Rath",
  "/wiki/Tasha_Ryo",
  "/wiki/Shae_Koda",
  "/wiki/Force_Hound",
  "/wiki/Tau_(individual)",
  "/wiki/Bogan",
  "/wiki/Moon/Legends",
  "/wiki/Je%27daii_Council",
  "/wiki/Invasion_of_the_Tython_system",
  "/wiki/Tython_system",
  "/wiki/Forcesaber",
  "/wiki/Tem_Madog",
  "/wiki/Daegen_Lok",
  "/wiki/Battle_of_Shikaakwa",
  "/wiki/Shikaakwa",
  "/wiki/Flesh_Raider",
  "/wiki/Ryo_Fortress",
  "/wiki/Ska_Gora",
  "/wiki/Attack_on_Ska_Gora",
  "/wiki/Seer",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Rakata/Legends",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)",
  "/wiki/Dawn_of_the_Jedi:_Force_Storm_1",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_1",
  "/wiki/Dawn_of_the_Jedi:_Force_War_1",
  "/wiki/Dawn_of_the_Jedi:_Force_War_2",
  "/wiki/Dawn_of_the_Jedi:_Force_War_3",
  "/wiki/Dawn_of_the_Jedi:_Force_War_4",
  "/wiki/Dawn_of_the_Jedi:_Force_War_5",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi_0"
 ]
}