{
 "name": "Taxer_Sundown",
 "display_name": "Taxer Sundown",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "37 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Taxer Sundown was a land baron who controlled much of the moisture farming property on Ord Mantell in 37 BBY, during the last decades of the Galactic Republic.\nSundown arrived on Ord Mantell with the goal of \"cleaning up\" the planet, but he simply killed the existing land barons and usurped their operations. Sundown then blamed the deaths on the Mantellian Savrips, and incited the villagers to kill them. In the meantime, Sundown set up his operations on Ten Mile Plateau, where he operated a solar energy collection facility. He employed a group of training lightsaber-wielding enforcers to protect his facility, in an effort to enhance his projected image as a Jedi Knight.\nQui-Gon Jinn and Obi-Wan Kenobi, who arrived on Ord Mantell while investigating the death of the Venan noble, Baron Sando, were attacked by Sundown's mercenaries, as he did not want their investigating to succeed. After defeating them, the two Jedi discovered that the enforcers lacked any independent will, as if Sundown were controlling them with the Force. When the Jedi began to discover Sundown's true motivations, he tried to capture their new-found ally, Nella Bold, and kill them. This failed, however, and the Jedi, allied to a tribe of Savrips led by Mawkran, defeated Sundown's private army, forcing him to flee the planet. When he tried to escape in Nella's T-24 airspeeder, Obi-Wan managed to destroy its top fin, and Sundown was unable to control the craft. It crashed on Ten Mile Plateau, and Sundown's neck was broken in the crash. Qui-Gon and Obi-Wan then discovered that Sundown had been using a mind control device to augment his claims of being a Jedi Knight, as part of a grander plot masterminded by the Venan Baroness Omnino to discredit the Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/37_BBY/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Land_baron",
  "/wiki/Moisture_farm/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Mantellian_Savrip/Legends",
  "/wiki/Ten_Mile_Plateau",
  "/wiki/Training_lightsaber/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Venan",
  "/wiki/Sando_(Baron)",
  "/wiki/Jedi/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Nella_Bold",
  "/wiki/Mawkran",
  "/wiki/T-24_airspeeder",
  "/wiki/Mind_control_device",
  "/wiki/Omnino",
  "/wiki/Qui-Gon_and_Obi-Wan:_Last_Stand_on_Ord_Mantell_2",
  "/wiki/Qui-Gon_and_Obi-Wan:_Last_Stand_on_Ord_Mantell_3",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_10",
  "/wiki/The_Official_Star_Wars_Fact_File_131",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}