{
 "name": "Taymor",
 "display_name": "Taymor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "2975 BBY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Taymor was a Human female Sith of the Lost Tribe of Sith who served as the thoughtcrier aboard the Candra. She had the ability to project thoughts through the Force. Taymor was a dark-skinned woman who was in her early twenties. She was a member of High Lord Edell Vrai's expedition to Alanciar in 2975 BBY. This ill-fated expeditionary force was shot down by Alanciari ballista and pursued by the Alanciari air force, which consisted of uvak-riders who were armed with hand-ballistas that fired diamond flak projectiles. During this skirmish, she was hit by multiple projectiles and succumbed to her wounds.\nTaymor was a member of the Lost Tribe of Sith, a group of Human Sith who had settled on the planet Kesh during the Great Hyperspace War. She grew up during the Hilts Restoration and participated in the Tribe's efforts to reach and conquer Alanciar, another continent in Kesh's southern hemisphere. Taymor became adept at thought projection, a Force ability which enabled the Tribe to transmit emotions and messages irrespective of distance. In 2975 BBY, she participated in the Tribe's expeditionary mission to Alanciar and served aboard the airship Candra. Taymor was part of a ten-person crew that included Captain Edell Vrai, the uvak-tenderer Peppin, five warriors including Ulbrick and Janns, and two Keshiri ambassadors including Tellpah. Her captain Vrai had invented the Tribe's airships after discovering that methane extracted from the volcano Sessal Spire could be used as hydrogen to power gasbags.\nTaymor and the Sith scouting expedition traveled across the Western Sea to Alanciar's southeastern peninsula region known as the Six Claws. Upon arriving off the coast of Alanciar, she sent a Force impression of the continent's coast. Taymor also sensed that there was a high concentration of emotions and energy in Alanciar, which meant that it was home to a large population. However, she and Vrai did not see any urban centers. Shortly later, the other two airships Lillia and Dann Itra were destroyed by black javelins fired from Alanciari ballista emplacements in the Six Claws. Thus, the Sith had made contact with the Keshiri living on Alanciar but quickly learnt that they had a strong military that was capable of resisting invasion.\nPrior to her death, Taymor managed to send a telepathic message back to the Tribe's capital of Tahv which conveyed shock, surprise, and confusion. This gave the Tribe some warning that something had befallen Edell's expedition and that the Alanciari were capable of resisting any Sith invasion. Before she could complete her message, she was hit by diamond flak projectiles which punctured the hejarbo flooring beneath her. Edell witnessed her death and noted that her body was lacerated with dozens of shining diamond projectiles. Taymor's body was presumably burnt or destroyed after the Candra crashed near the Alanciari fort of Point Defiance.\nDespite her death, Edell and six other Sith expeditionary members managed to survived the skirmish. These managed to capture two Alanciari Keshiri, the signal officer Jogan Halder and his lover Wardmaster Quarra Thayn, and also managed to gain access to invaluable intelligence on what the Alanciari already knew about the Sith. Edell's crew then hijacked an Alanciari harvester Mischance which they used to return to their continent of Keshtah Minor via the Southern Passage and Sea of Flames. In the end, the Sith managed to conquer Alanciar by using Jogan Halder to convince the Alanciari that the Sith did not actually pose a threat to them.\nTaymor was a skilled and talented thoughtcrier who was capable of sending messages through the Force. She was loyal and obedient to her captain Edell Vrai during the Lost Tribe of Sith's expeditionary mission to Alanciar, a new continent.\nTaymor first appeared as a minor non-point-of-view character in John Jackson Miller's novella Lost Tribe of the Sith: Pandemonium which was released on July 24 2012 as part of the mass paperback Star Wars: Lost Tribe of the Sith: The Collected Stories.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kesh",
  "/wiki/2975_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Sith/Legends",
  "/wiki/Thoughtcrier",
  "/wiki/Candra_(ship)",
  "/wiki/Telepathy/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/High_Lord_(Circle_of_Lords)",
  "/wiki/Edell_Vrai",
  "/wiki/Mission_to_Alanciar",
  "/wiki/Alanciar",
  "/wiki/Alanciari_air_force",
  "/wiki/Uvak",
  "/wiki/Hand-ballista",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Hilts_Restoration",
  "/wiki/Force_power/Legends",
  "/wiki/Airship_(Lost_Tribe_of_the_Sith)",
  "/wiki/Captain/Legends",
  "/wiki/Peppin",
  "/wiki/Ulbrick",
  "/wiki/Janns",
  "/wiki/Keshiri",
  "/wiki/Tellpah",
  "/wiki/Volcano/Legends",
  "/wiki/Sessal_Spire",
  "/wiki/Western_Sea_(Kesh)",
  "/wiki/Six_Claws",
  "/wiki/Lillia",
  "/wiki/Dann_Itra_(ship)",
  "/wiki/Hejarbo",
  "/wiki/Point_Defiance",
  "/wiki/Alanciari",
  "/wiki/Jogan_Halder",
  "/wiki/Wardmaster",
  "/wiki/Quarra_Thayn",
  "/wiki/Mischance",
  "/wiki/Keshtah_Minor",
  "/wiki/Southern_Passage",
  "/wiki/Sea_of_Flames",
  "/wiki/Invasion_of_Alanciar",
  "/wiki/John_Jackson_Miller",
  "/wiki/Lost_Tribe_of_the_Sith:_Pandemonium",
  "/wiki/July_24",
  "/wiki/2012",
  "/wiki/Star_Wars:_Lost_Tribe_of_the_Sith:_The_Collected_Stories"
 ]
}