{
 "name": "Tayvor_Slen",
 "display_name": "Tayvor Slen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zakuul"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3630 BBY",
      "Zakuul"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Empire",
      "Overwatch",
      "Overwatch"
     ]
    }
   ]
  }
 ],
 "content": "Tayvor Slen was a male Human citizen of the Eternal Empire of Zakuul and the father of Alianna Slen. He was the administrator of the Overwatch, which housed controls for over half the droids in the Spire, and his skills as a fighter were used as a model for the Skytroopers. In 3632 BBY the anarchist Kaliyo Djannis arrived on Zakuul and began bombing civilian and military targets under the name \"Firebrand,\" attracting a significant following. Tayvor was eventually able to convince to sell out by convincing Kaliyo to bomb only unarmed targets while protecting her from the skytroopers, to which Kaliyo, depressed by her inability to truly shock Zakuulans, agreed. However, she began using both Tayvor's growing affection with her and his daughter's place among her followers against Zakuul. After the Commander was released from carbonite in 3631 BBY and caused a mass blackout during the escape, Kaliyo began planting bombs throughout the city, while also obtaining the Overwatch data though Alianna. Eventually the Outlander came to ally with Kaliyo, and together they stormed the Overwatch, planting explosives at droid controls. Tayvor arrived with the skytroopers and attempted to stop them, but was defeated and mortally wounded during the fight. Before he passed away, Kaliyo mocked Tayvor's attempts to manipulate her and explained that destroying the droid controls along with the bomb detonation would cause a mass panic and throw the Spire into chaos.\nTayvor Slen appears in Star Wars: The Old Republic: Knights of the Fallen Empire Chapter 10: Anarchy in Paradise.\nHis surname is misspelled as Slenn in a Zakuul News Bulletin announcement.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zakuul",
  "/wiki/3630_BBY",
  "/wiki/Human/Legends",
  "/wiki/Zakuulan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Overwatch",
  "/wiki/Alianna_Slen",
  "/wiki/Spire_(Zakuul)",
  "/wiki/Skytrooper",
  "/wiki/3632_BBY",
  "/wiki/Kaliyo_Djannis",
  "/wiki/Alliance_Commander",
  "/wiki/Carbonite/Legends",
  "/wiki/3631_BBY",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Zakuul_News_Bulletin",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Galactic_Standard_Calendar"
 ]
}