{
 "name": "TD-334",
 "display_name": "TD-334",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "TD-334 was a Human male who served in the Galactic Empire's Stormtrooper Corps under Lieutenant Harburik. During his service as a sandtrooper, TD-334 was stationed on the Outer Rim world of Tatooine. Sometime following the Battle of Yavin in 0 BBY, TD-334 was caught in a radiation accident when the reactor repair facility he was guarding was destroyed by Rebels. Though he was the sole survivor, TD-334's mental faculties were negatively influenced by the radiation. After displaying an unorthodox desire to desert the Empire to become an image designer, Harburik commissioned an Imperial operative with quietly bringing the disturbed sandtrooper back to his base of operations in the city of Mos Eisley.\nDuring the time of the Galactic Civil War, the Human male identified as TD-334 served in the Stormtrooper Corps under a Humanocentric xenophobe known as Lieutenant Harburik. Operating out of his base in the spaceport city of Mos Eisley on the Outer Rim world of Tatooine, Harburik oversaw the command of stormtroopers conducting missions in the area.\nTD-334 and a number of other Imperial stormtroopers were responsible for guarding a reactor repair facility not far outside of Mos Eisley. However, sometime following the Battle of Yavin in 0 BBY, this reactor facility was blown up Rebel forces. The attack left all of TD-334's comrades dead. As the sole survivor, TD-334 began walking aimlessly throughout the desert, stricken by a sudden desire to desert the Empire to become an image designer. It became apparent that TD-334's brain was negatively affected by the radiation released by the explosion. This drastically altered the trooper's personality, compelling him to start a new life. When Lieutenant Harburik learned of the situation, he became concerned that news of the situation would become public knowledge.\nHarburik's concerns were alleviated when a spacer loyal to the Empire agreed to help resolve the situation. Harburik asked the operative to apprehend TD-334 without committing undue harm. He also asked that the situation be kept confidential, as other troopers may misunderstand the situation. Ultimately, the Imperial operative did not betray secrecy, and located the disturbed sandtrooper without resorting to combat.\nWhen TD-334 was approached by the Imperial operative, he commented that lavender highlights would give stormtrooper helmets a bold statement. With that said, TD-334 was placed under arrest, but not without further announcing his intentions to leave the Army to focus on more artistic pursuits. Despite this unorthodox behavior, TD-334 complied with operative and was safely brought back to Harburik in Mos Eisley.\nWith TD-334 now under Imperial custody, the operative received a reward of 5,000. Although he knew it to be a troubling situation, Harburik claimed there was no better way for the situation to have turned out. He asked that the Imperial-aligned spacer simply take the reward and pretend that the whole thing never happened.\nPrior to the radiation accident, TD-334 was an ordinary stormtrooper, diligently serving Lieutenant Harburik as a guard for a reactor repair facility. However, following the Rebel attack on the facility, TD-334's mind became adversely affected by the released radiation. This caused a significant change in the stormtrooper's personality, causing him to display unorthodox behavior. The once loyal Imperial stormtrooper had turned into an eccentric free agent, committed to starting a new life as an image designer. While TD-334 did initially object to being placed under arrest, he did comply without resorting to violence.\nDuring his affiliation with the Galactic Empire, TD-334 wore standard stormtrooper armor. He also wore a brownish colored pauldron, a type of padded material worn to signify rank.\nTD-334 was a non-player character in the 2003 video game Star Wars Galaxies: An Empire Divided, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Players who performed a series of quests for Harburik had to escort him safely back to Mos Eisley. Although the player could choose not to do Habrurik's quests, this article assumes 100% game completion.\nTD-334 wore a brownish colored shoulder pauldron, but his rank was never definitively identified in the quest dialogue.\nWhen the player approached TD-334, the stormtrooper mentioned that he would be leaving the Army to become an image designer. However, this does not make sense, as stormtroopers were part of the Stormtrooper Corps, an Imperial Military branch which operated separately from the Imperial Army. The developers may have simply erred when writing the dialogue, or it may have been an in-character mistake made by TD-334, due to his altered mental state. It is also possible that his use of the word 'Army' was generic, meant to colloquially refer to the Stormtrooper Corps as a whole.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Lieutenant/Legends",
  "/wiki/Harburik",
  "/wiki/Desert_stormtrooper/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Radiation/Legends",
  "/wiki/Reactor/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Brain/Legends",
  "/wiki/City/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Humanocentrism",
  "/wiki/Speciesism",
  "/wiki/Spaceport/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Canon",
  "/wiki/Spacer/Legends",
  "/wiki/Purple",
  "/wiki/Color/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Credit",
  "/wiki/Brown",
  "/wiki/Pauldron/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Imperial_Military/Legends"
 ]
}