{
 "name": "Tearfin",
 "display_name": "Tearfin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Tearfin was a Human female bounty hunter who lived during the Galactic Civil War.\nIn 1 ABY, Tearfin received a bounty to locate a smuggler who stole a crate of equipment. The equipment had a transponder, so the bounty hunter easily traced her mark to a city on Tatooine. However, the thief discovered the transponder and realized that he was being tracked, so he turned off the transponder, and blended in with a group of other fellow smugglers within the Tatooinan city. Tearfin located the group of smugglers, but because she did not know what what the identity of the thief, she was not able to know which one was her mark. The group included six smugglers, namely Rh'klin, Parugga, D'lonis, Barosk, Klaphini and Captain Himfan. The bounty hunter interrogated all of the smugglers but, unfortunately, she failed to find any information, basically because all of the smugglers simply blamed each other. Among them, Tearfin only knew Captain Himfan and she was convinced that she could trust him. Fortunately for Tearfin, a spacer seeking to become a Hero of Tatooine found Tearfin, and offered to help. Tearfin stubbornly conceded that she could use some help, and allowed the spacer to interrogate the smugglers. After a grueling interrogation, the spacer finally determined who was the smuggler who stole the equipment. The spacer informed Tearfin of this finding, and was awarded the Mark of Intellect for the successful interrogation.\nTearfin was a non-player character  in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.\nTearfin was added to the game as part of the \"Hero of Tatooine\" questline, released with \"Publish 9\" on June 29, 2004. This NPC periodically spawned in random cities across Tatooine, along with six smugglers. Players taking part in the \"Intellect\" segment of the \"Hero of Tatooine\" had to interrogate the smugglers to determine which one was Tearfin's mark. The identity of the culprit varied among the six smugglers each time the quest was reset. With the release of the \"Publish 24,\" on October 18, 2005, Tearfin and the smugglers were given proper names to replace randomly generated names.\nThe \"Hero of Tatooine\" questline was extensively revamped upon the introduction of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005 but the \"Intellect\" segment was not altered.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Transponder",
  "/wiki/City/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Rh%27klin",
  "/wiki/Parugga",
  "/wiki/D%27lonis",
  "/wiki/Barosk",
  "/wiki/Klaphini",
  "/wiki/Captain/Legends",
  "/wiki/Himfan",
  "/wiki/Spacer/Legends",
  "/wiki/Hero_of_Tatooine",
  "/wiki/Quest_of_the_Hero_of_Tatooine",
  "/wiki/Mark_of_Intellect",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_29",
  "/wiki/2004",
  "/wiki/October_18",
  "/wiki/2005",
  "/wiki/November_15",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}