{
 "name": "Teckla_Minnau",
 "display_name": "Teckla Minnau",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Scipio"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Teckla's family",
      "Royal House of Naboo",
      "Naboo Royal Handmaidens",
      "Naboo Royal Handmaidens",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Teckla Minnau was a human female handmaiden to Senator Padmé Amidala during the Clone Wars.\nShortly before the Clone Wars, Senator Padmé Amidala returned to Naboo under the protection of Jedi Padawan Anakin Skywalker. She stayed at her Varykino estate, where she was attended by Teckla Minnau. During one dinner, Teckla served Skywalker a plate of fruit.\nDuring the Clone Wars, Teckla was on Coruscant when an attack by the Separatists left the planet without power. The attack prompted certain members of the Galactic Senate to support a bill that would increase the Republic's spending on the clone army.\nFollowing a Senate debate on the proposal, Minnau accompanied Padmé from the Senate Building back to her office in the Senate Office Building. Minnau brought back a datapad and waited while Padmé spoke with her close allies, Senators Bail Organa and Onaconda Farr, about defeating the troop increase bill.\nA night later, when Padmé, bruised and battered after a run-in with bounty hunters, returned to her apartment, Minnau treated her facial wounds with an antiseptic. Though Minnau suggested that she report the incident to the Jedi High Council, the senator refused, as she knew that her assailants had been trying to prevent her from voting against the troop increase. Minnau provided moral support for Padmé, who was losing hope with her prospects of defeating the bill. At Padmé's request, Minnau stayed at the apartment and spoke to Padmé of the effects such spending was having on her family, who were living with limited power and bathing water in a small village on Naboo.\nThis prompted Padmé to deliver a speech in the senate, which Teckla witnessed. The senator told her fellow delegates about Teckla and her family, and cited them as an example of the great suffering the Republic's military spending was causing to its people. Because of Teckla's story and the senator's words, the bill was defeated.\nLater during the war, Teckla escorted Padmé on a mission to Scipio, the headquarters of the InterGalactic Banking Clan. Amidala sought to secure a new loan from the Banking Clan to aid refugees who had been displaced from their homes by the war. Minnau accompanied Amidala to the Main Vault amidst the icy mountains of Scipio. Mak Plain, a Banking Clan official, received Amidala, Minnau, and their associates at the entrance to the neutral zone surrounding the Main Vault, where all monetary transactions were conducted free of partisanship to the Republic and the Confederacy. While Senate Commandos remained outside, Minnau followed the senator and the Banking Clan representatives into the neutral zone and proceeded to the Vault's main rotunda. There, Amidala met with the Core Five, the primary leadership of the Banking Clan. As Core Five spokesman Clu Lesser introduced the special representative who would be directly discussing the terms with Amidala, both Padmé and Teckla were surprised to see Rush Clovis enter the rotunda.\nThat night, Plain showed Padmé and Teckla to their guest quarters, and Teckla thanked Plain before he left. Immediately thereafter, Teckla noticed someone creeping up behind Padmé and shouted a warning. Padmé, having smuggled an ELG-3A blaster pistol into the Neutral Zone, aimed her blaster at the intruder: Clovis. He told Padmé that he needed her help, and though Teckla protested, the senator decided to hear him out and followed him out onto the room's balcony to confer privately. Clovis explained that while he suspected there were no financial funds remaining in the banks, the evidence was out of his reach within the records of the Main Vault, to which only the Core Five were permitted entry.\nJust then, sniper shots fired by the bounty hunter Embo, who was too far away to be identified, narrowly missed the senators. Clovis pleaded with Padmé to pressure the Core Five into opening access to the Main Vault, then escaped on a hover sledge that he had parked several meters beneath the balcony. After the local Muun authorities arrived to verify that Amidala was safe, Teckla saw the security agents off. The next morning, after Amidala successfully negotiated access into the Main Vault, the two Naboo women accompanied Clovis aboard the executive shuttle to his personal residence in a remote area outside the city. There, the three discussed a plan to retrieve the hidden files within the Main Vault. Clovis intended to set off an explosive charge at the Main Vault's power generator, which would plunge the entire facility into shutdown. In the brief interlude preceding the backup generator's activation, Amidala would use a device to locate the secret data files and download them from the mainframe.\nThe next morning, the three met the Core Five at the Main Vault. After the Core Five had entered the Vault with Amidala, Clovis attempted to sneak off to plant his detonator at the power generator. However, Plain stopped Clovis and pressured him into waiting for Amidala to return, since opening the Vault had been his idea. Noticing Clovis's dilemma, Minnau discreetly took the explosive charge from him and undertook his part of the scheme.\nShe proceeded down several levels to the generator superstructure, and once she had glanced around to make sure no one had spotted her, she placed the detonator onto the structure. Unbeknownst to her, a droid sent by Embo had located her. Embo aimed at her from a long distance away with his bowcaster, and Minnau halted in her tracks when she saw his bowcaster's targeting light on her body. She frantically scanned her surroundings, but before she could pinpoint her attacker, Embo fired a single shot that killed her. Mere seconds later, Minnau's explosive activated, compromising the entire power grid and allowing Amidala to surreptitiously retrieve the required data files from the Vault mainframe.\nThe Muun authorities' following investigation into the power grid failed, and Teckla's body was found at the scene of the bomb site. It was concluded that she had sabotaged the power grid. Although Minnau's murderer went unidentified, Amidala and Clovis used the recovered data files to expose the Core Five as the masterminds of an embezzling scandal that had depleted the banks.\nTeckla had light skin and green eyes, and often kept her black hair covered under her handmaiden cowl. She was a quiet presence in Senator Amidala's household, often performing tasks unnoticed in the background. Despite this, she was on hand to deliver advice to the senator when needed. Amidala considered her a close friend.\nMinnau wore a blue dress with a light blue bodice.\nTeckla Minnau first appeared, albeit unidentified, in the 2002 Star Wars prequel trilogy film Star Wars: Episode II Attack of the Clones, where she was portrayed by Natalie Lewis. In the film's script, she was identified as a serving girl. She was identified as Teckla in author R. A. Salvatore's novelization of the film. During the Star Wars Legends era, Teckla was given her surname in a StarWars.com Databank entry written by Evan Burger through the Hyperspace feature What's The Story?, which was a reference to Nathan Hamill's self-named background character Rehtul Minnau.\nTeckla later appeared in the Star Wars: The Clone Wars episode \"Pursuit of Peace,\" where she was voiced by Ashley Moynihan. When Minnau appeared in the episode \"An Old Friend,\" she was voiced by Anna Graves, who voiced a number of characters in the series.\nIn the animated series, Teckla is shown to have green eyes, whereas the extra who portrayed her in Attack of the Clones has brown eyes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Teckla_Minnau",
  "/wiki/Teckla_Minnau/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Naboo",
  "/wiki/19_BBY",
  "/wiki/Scipio",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Galactic_Republic",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Varykino",
  "/wiki/Fruit",
  "/wiki/Coruscant",
  "/wiki/Bombing_of_Coruscant%27s_central_power_distribution_grid",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Planet",
  "/wiki/Galactic_Senate",
  "/wiki/Republic_financial_reform_bill",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Padm%C3%A9%27s_office",
  "/wiki/Imperial_Executive_Building",
  "/wiki/Datapad",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Onaconda_Farr",
  "/wiki/Bounty_hunter",
  "/wiki/Padm%C3%A9%27s_Apartment",
  "/wiki/Jedi_High_Council",
  "/wiki/Water",
  "/wiki/Mission_to_Scipio",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Refugee",
  "/wiki/Main_Vault",
  "/wiki/Mak_Plain",
  "/wiki/Senate_Commando",
  "/wiki/Core_Five",
  "/wiki/Clu_Lesser",
  "/wiki/Rush_Clovis",
  "/wiki/Smuggler",
  "/wiki/ELG-3A_blaster_pistol",
  "/wiki/Blaster",
  "/wiki/Embo",
  "/wiki/Hover_sledge",
  "/wiki/Muun",
  "/wiki/H-2_executive_shuttle",
  "/wiki/Main_Vault_fortress",
  "/wiki/Main_Vault_power_generator",
  "/wiki/Bowcaster",
  "/wiki/Death",
  "/wiki/Second",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/2002",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Natalie_Lewis",
  "/wiki/R._A._Salvatore",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones_(novelization)",
  "/wiki/Star_Wars_Legends",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Evan_Burger",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Nathan_Hamill",
  "/wiki/Rehtul_Minnau",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Pursuit_of_Peace",
  "/wiki/Ashley_Moynihan",
  "/wiki/An_Old_Friend",
  "/wiki/Anna_Graves",
  "/wiki/Pursuit_of_Peace_(short_story)",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark_(audiobook)",
  "/wiki/The_Rise_of_Clovis",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau",
  "/wiki/Standard_year",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Pablo_Hidalgo"
 ]
}