{
 "name": "Tee_Watt_Kaa",
 "display_name": "Tee Watt Kaa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Maridun"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lurmen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.03 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lurmen village"
     ]
    }
   ]
  }
 ],
 "content": "Tee Watt Kaa was a male Lurmen who led a village on the Outer Rim world of Maridun during the Clone Wars. A devout pacifist, Kaa refused to engage in any sort of combat, even if his own life was in danger.\nDuring the Clone Wars, Tee Watt Kaa lead his pacifist colony of Lurmen in a village on Maridun. Alongside his son Wag Too, he sought to find peace and solace away from the war, preferring to remain neutral and avoid galactic politics and conflict.\nFollowing the Battle at Quell, Kaa then met Jedi Knight Aayla Secura, Padawan Ahsoka Tano, and Clone Commander Bly. At first, he did not welcome the Jedi, saying that they were not peace keepers. He told them leave in order to preserve their peace. However, he could not ignore Ahsoka's plea for help for her badly wounded master. He allowed his healer son, Wag Too, to go with her and Bly while Secura stayed behind at his village. Kaa then gave Secura a drink to help her. During their time together, Secura and Kaa spoke about the Jedi's intentions to restore peace by fighting for the Republic.\nKaa and his fellow villagers then saw a Separatist landing ship coming towards their village. At first, he thought the Separatists were coming for the Jedi, but Tano told him that they did not know they were here. Kaa then told the Jedi to leave before they were found. He, despite Tano's objections, then went to speak with the Separatists. Kaa then met the Separatist commanding officer, General Lok Durd. Kaa stood by as Durd's battle droids searched the village for weapons and Republic contraband. Durd then told Kaa that he would do more random searches to insure security on the planet. After the Separatists left, Kaa then spoke with his son about preserving their peace.\nThe Jedi soon learned of Durd's plan to test a new weapon, the Defoliator, on the Lurmen village. The weapon had the ability to destroy any organic life but leave battle droids unharmed. Kaa was informed of this by the Jedi, who wanted to help defend the village. Kaa refused their help, however, due to his firm belief against fighting and conflict. His son, Wag Too, and his friends believed they should help the Jedi and clones defend the village. While the Republic group set up shield generators, which they had stolen from the Separatist base, around the village, they attempted to fight off the droids and protect the Lurmen. Wag Too and his friends eventually helped fight back, but Kaa was still curious about what the true cost of them fighting back was.\nTee Watt Kaa first appeared in the thirteenth episode of season one of Star Wars: The Clone Wars, \"Jedi Crash,\" and was voiced by George Coe.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tee_Watt_Kaa",
  "/wiki/Tee_Watt_Kaa/Legends",
  "/wiki/Maridun",
  "/wiki/Lurmen",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Lurmen_village",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Death",
  "/wiki/Wag_Too",
  "/wiki/The_galaxy",
  "/wiki/Battle_of_Quell",
  "/wiki/Quell",
  "/wiki/Jedi_Knight",
  "/wiki/Aayla_Secura",
  "/wiki/Ahsoka_Tano",
  "/wiki/CC-5052",
  "/wiki/C-9979_landing_craft",
  "/wiki/Lok_Durd",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Tee_Watt_Kaa",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Jedi_Crash",
  "/wiki/George_Coe",
  "/wiki/Defenders_of_Peace",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)"
 ]
}