{
 "name": "Tee_Va",
 "display_name": "Tee Va",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mooga"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Moogan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.31 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mooga smuggling ring"
     ]
    }
   ]
  }
 ],
 "content": "Tee Va was a Moogan male smuggler who led a smuggling ring in operation during the Clone Wars. Va once operated in Mandalore's capital city Sundari, diluting tea with slabin in order to double the amount he could sell and therefore doubling his profit. Va's operation was ended when he used a contaminated batch of slabin that ended up poisoning a number of Mandalorian children at the Sundari Mandalorian school. When the cause was traced back to his operation, he was imprisoned. However, eventually Va escaped and was seen on Zygerria at a slave auction, and later was on Mandalore again.\nTee Va, a male Moogan smuggler from the Commerce Guild-controlled world of Mooga, operated a black market smuggling ring during the Clone Wars. Va's ring was once tasked with diluting tea with slabin, a diluting agent, in Mandalore's capital city of Sundari. Tee Va, plus his Moogan and Gotal compatriots, arrived in the docks and were greeted by a customs official that questioned Va, as the arrival of their starship was not in his schedule. Va bribed the official with Galactic Republic credit ingots, as he explained that all of the other customs officials were off observing a parade welcoming Senator Padmé Amidala. The official then informed Va that the next time he arrived, he would have to deal with him directly.\nVa and the rest of the smugglers eventually set up shop in a warehouse on the docks, guarded by members of the Mandalorian secret service. Inside, Va ordered a Mandalorian man to mix the slabin with Ardees Beverage tea in order to get twice the tea at twice the profit. When asked if the slabin was toxic, Va responded by saying it was only toxic if the dosage was incorrect. The man then began the mixture of the tea and slabin.\nIn the evening, Va and his cronies returned, bribing the customs official again, but unbeknownst to them Senator Amidala and Duchess Satine Kryze were watching with a member of the Mandalorian Protectors.\nSome time after the second shipment of tea arrived on Mandalore, the warehouse at the Sundari docks was attacked by members of the Mandalorian Guard, led by Captain Patrok Ru-Saxon, Kryze, and Amidala. Va defended the warehouse with a blaster, but ultimately Va, members of his smuggling ring, and the workers at the warehouse were all taken into custody by the police. Kryze then ordered the captain to burn down the warehouse.\nVa, having somehow escaped Mandalorian custody, was later present at the Royal Slave Auction on the planet Zygerria, homeworld of the Zygerrian species. Va was at the Zygerrian slave market standing next to the Muun InterGalactic Banking Clan representative Nix Card, observing the auction.\nVa eventually returned to Mandalore, now under the control of the Shadow Collective, to continue smuggling, ordering other Moogans to move crates as Obi-Wan Kenobi arrived aboard the freighter Twilight. Va briefly looked over when there was scuffling aboard the freighter, but quickly turned back and continued to move the shipping containers.\nTee Va first appeared, albeit unidentified, in the Star Wars: The Clone Wars television series episode titled \"Corruption\" and was voiced by Dee Bradley Baker. Va was identified in the Episode Guide that went along with the episode.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tee_Va",
  "/wiki/Tee_Va/Legends",
  "/wiki/Mooga",
  "/wiki/Moogan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Mooga_smuggling_ring",
  "/wiki/Smuggler",
  "/wiki/Clone_Wars",
  "/wiki/Mandalorian_black_market_conspiracy",
  "/wiki/Mandalore",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Sundari",
  "/wiki/Tea",
  "/wiki/Slabin",
  "/wiki/Skirmish_at_the_Sundari_docks",
  "/wiki/Poison",
  "/wiki/Mandalorian",
  "/wiki/Youngling",
  "/wiki/Sundari_Mandalorian_school",
  "/wiki/Prison",
  "/wiki/Zygerria",
  "/wiki/Slavery",
  "/wiki/Commerce_Guild",
  "/wiki/Planet",
  "/wiki/Black_market",
  "/wiki/Gotal",
  "/wiki/Sundari_shipping_docks",
  "/wiki/Customs_official",
  "/wiki/Starship",
  "/wiki/Galactic_Republic",
  "/wiki/Credit_ingot",
  "/wiki/Parade",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Sundari_dock_warehouse",
  "/wiki/Mandalorian_secret_service",
  "/wiki/Ardees_Beverage",
  "/wiki/Duke",
  "/wiki/Satine_Kryze",
  "/wiki/Mandalorian_Protectors",
  "/wiki/Time",
  "/wiki/Mandalorian_Guard",
  "/wiki/Captain",
  "/wiki/Patrok_Ru-Saxon",
  "/wiki/Blaster",
  "/wiki/Law_enforcement_agency",
  "/wiki/Homeworld",
  "/wiki/Zygerrian",
  "/wiki/Species",
  "/wiki/Zygerrian_slave_market",
  "/wiki/Muun",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Nix_Card",
  "/wiki/Shadow_Collective",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Freighter",
  "/wiki/Twilight",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Corruption_(episode)",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Category:Images_of_Tee_Va",
  "/wiki/The_Academy",
  "/wiki/Slaves_of_the_Republic",
  "/wiki/The_Lawless",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)"
 ]
}