{
 "name": "Teela_Kaarz",
 "display_name": "Teela Kaarz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mirial"
     ]
    },
    {
     "name": "Born",
     "values": [
      "25 BBY",
      "Mirial"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Teela Kaarz was a female Mirialan political prisoner who worked on the construction of the first Death Star.\nIn her former life, Teela was an influential and well-to-do professional on Mirial. She was an architect, specializing in encapsulated arcology design, and had designed the Ralthhok Encapsulization on Corellia and the Blackstar wheelworld in the Sagar system. As such, she was much celebrated and moved in the higher echelons of Mirial society, as a guest to an assortment of monarchs, senators, heads of industry and starfleet admirals.\nDuring planet-wide elections on Mirial, Teela had supported a political candidate who was deemed a traitor by the Emperor, and by extension, so were his most influential supporters. Teela was rounded up along with a score of other well-to-do Mirialans and convicted of treason in hastily conducted trials. She was spared an equally expedient execution due to the public outrage that arose over the events. However, she was instead transported for life to the prison planet Despayre.\nTeela managed to survive for about a year in the harsh environs of the prison planet, thanks largely to the woodcraft taught to her by her father as a young girl. She cultivated an aura of disquieting menace which also held off the more dangerous criminal predators of Dungeontown, the shanty town where she dwelt. She was eventually recruited by Imperials seeking additional labor for the construction of the Death Star in orbit above the planet and finally left Despayre on board the prisoner transport ship GLTB-3181.\nGiven her qualifications, Teela was selected to work for Benits Stinex, chief architect and head of interior design and construction on the Death Star. She moved to the Death Star, residing in Cube 24556, Resiplex 19, Sprawl 20. During this time, she briefly attracted the attention of Darth Vader when she managed to 'block' his attempt to probe her mind when he was examining the crew of the Death Star despite her lack of Force sensitivity or any training, her strength of mind briefly reminding Vader of his wife before he crushed the thought.\nShe later was assaulted by a drunk worker in the Hard Heart in the cantina, but was rescued by Villian Dance. She later became the girlfriend of Dance, and soon witnessed the destruction of Despayre. She was horrified by this action, which was only to be outdone when Alderaan, a peaceful planet with billions of innocent lives, was destroyed as well. Teela became disgusted with the Empire and, along with Dance, Nova Stihl, Rodo, Atour Riten, Celot Ratua Dil, Memah Roothes, and Kornell Divini, decided to leave the Death Star and the Empire behind. During the Battle of Yavin, the group began to escape, although Riten was forced to stay behind in order to trick the landing bay controller to open the doors. He informed Teela of this when he ordered her to leave, and she revealed to him that she knew how the Rebels planned to destroy the station. Although Stihl and Rodo were forced to stay behind also, the others escaped from the Death Star with Dance shortly before its destruction. After the destruction of the Death Star, Teela decided to join the Rebel Alliance with her fellow defectors and Vil asked for her hand in marriage, something she said she would think about.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mirial/Legends",
  "/wiki/25_BBY/Legends",
  "/wiki/Mirialan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Benits_Stinex",
  "/wiki/Architect/Legends",
  "/wiki/Encapsulated_arcology",
  "/wiki/Ralthhok_Encapsulization",
  "/wiki/Corellia/Legends",
  "/wiki/Blackstar_wheelworld",
  "/wiki/Sagar_system",
  "/wiki/Senator/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Despayre",
  "/wiki/Dungeontown",
  "/wiki/GLTB-3181",
  "/wiki/Cube_24556",
  "/wiki/Resiplex_19",
  "/wiki/Sprawl_20",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Villian_Dance",
  "/wiki/Nova_Stihl",
  "/wiki/Rodo",
  "/wiki/Atour_Riten",
  "/wiki/Celot_Ratua_Dil",
  "/wiki/Memah_Roothes",
  "/wiki/Kornell_Divini",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Teela_Kaarz",
  "/wiki/Death_Star_(novel)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}