{
 "name": "Teemto_Pagalies",
 "display_name": "Teemto Pagalies",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Moonus Mandel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Veknoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.24 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange",
      "brown",
      "off-white"
     ]
    }
   ]
  }
 ],
 "content": "Teemto Pagalies was a Veknoid podracer pilot from Moonus Mandel. An outcast of his homeworld, Pagalies found fame as a podracer, and eventually went on to compete in a Boonta Eve Classic Podrace on the planet Tatooine. However, during the race's second lap, Pagalies' IPG-X1131 LongTail podracer was shot down on the Canyon Dune Turn by a native Tusken Raider. Despite the severity of the crash, Pagalies survived.\nA native of Moonus Mandel, the Veknoid male Teemto Pagalies was a Moonus Mandel outcast that eventually found solace in the deadly sport of podracing. Armed with an IPG-X1131 LongTail podracer and his good looks, Pagalies found fame in the sport, and eventually went to compete on the planet Tatooine, which annually hosted the Boonta Eve Classic race. At the start of the race, Pagalies found himself on the inside position of the third row, right next to two-time Boonta winner Boles Roor, and behind racer Clegg Holdfast. The race was overseen by the two-headed Troig commentator Fodesinbeed Annodue, and was hosted by the Hutt gangster Jabba the Hutt. Pagalies was formally introduced to the audience by the Annodue head named Beed.\nAfter Annodue wrapped up the pilot introductions, Jabba officially began the race. Pagalies performed well for the first lap, avoiding numerous hazards including stalactites, boulders, and the native Tusken Raiders who were trying to shoot the podracer pilots from a ledge overlooking the Canyon Dune turn. Early during the second lap, Pagalies bumped into the pod of Anakin Skywalker, which in turn caused Skywalker to scrape a cliff face. After wiping his goggles clean, Pagalies again neared Skywalker's craft, but the human pilot managed to swing his pod over Pagalies' LongTail, effectively moving out of harm's way. Pagalies was later able to overtake Skywalker, but was once again surpassed by the young pilot yet again.\nEventually, Pagalies attempted his second passing of the Canyon Dune turn, which still hosted several sniping Tusken Raiders. After avoiding several potshots, Pagalies' right engine was blasted by a Tusken's slugthrower, which caused the massive craft to plummet into the sand. Both engines were completely destroyed as Pagalies' circular cockpit was thrown through the air. Despite the crash's severity, the Veknoid pilot survived, and went on to race again.\nTeemto Pagalies was an outcast of his homeworld, but was able to find fame in the dangerous sport of podracing nonetheless. Pagalies was considered to be handsome, hilarious, and flamboyant. As far as looks are concerned, Pagalies stood 1.24 meters tall, and had predominately brown and orange skin all over his body, and had off-white skin on his underarms and lower jaw. Pagalies also sported black pupils in his eyes.\nPagalies flew a large IPG-X1131 LongTail podracer, which sported cylindrical engines and an upright, circular cockpit. The whole podracer was covered in an orange, white, and cyan color motif. Although the Veknoid flew the large craft successfully for the first lap of the Boonta, the right engine was not able to sustain a blast from a Tusken slugthrower.\nTeemto Pagalies was created for the 1999 film Star Wars: Episode I The Phantom Menace, but first appeared in the film's novelization by Terry Brooks. Conceptual art for the character, including bone structure, was created by concept artist Terryl Whitlatch.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Teemto_Pagalies",
  "/wiki/Teemto_Pagalies/Legends",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Moonus_Mandel",
  "/wiki/Veknoid",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Fodesinbeed_Annodue",
  "/wiki/Troig",
  "/wiki/Podracer",
  "/wiki/Pilot",
  "/wiki/Homeworld",
  "/wiki/Podracer_(profession)",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Podracing",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/IPG-X1131_LongTail",
  "/wiki/Canyon_Dune_Turn",
  "/wiki/Tusken_Raider",
  "/wiki/File:Fode-Tusken_Raiders.ogg",
  "/wiki/Boles_Roor",
  "/wiki/Clegg_Holdfast",
  "/wiki/Hutt",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Ben_Quadinaros",
  "/wiki/Anakin_Skywalker",
  "/wiki/Goggles",
  "/wiki/Human",
  "/wiki/Slugthrower",
  "/wiki/Cockpit",
  "/wiki/Eye",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Terry_Brooks",
  "/wiki/Terryl_Whitlatch",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_Star_Pilot_(2015)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Podracing",
  "/wiki/Databank_(website)"
 ]
}