{
 "name": "Teer%27aa",
 "display_name": "Teer'aa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Visionary"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Twin Suns"
     ]
    }
   ]
  }
 ],
 "content": "Teer'aa was a female Twi'lek assassin, who worked in partnership with Seer'aa. Once slaves from Ryloth, they killed their Masters and then became bounty hunters known as the Twin Suns, armed with deadly blades along with personal energy shields.\nIn 3951 BBY Atton Rand faced them in a cantina while separated from Meetra Surik on Nar Shaddaa and defeated them. Surik, along with two of her companions, later faced them aboard the Visionary and killed them shortly before it exploded.\nBorn on Ryloth, Seer'aa and Teer'aa were sold into slavery at young age. At some point they killed their master, taking their first steps into the career of assassins.\nDuring the aftermath of the Jedi Civil War, the Twin Suns traveled on the Visionary with several other bounty hunters. Goto instructed them to capture Meetra Surik alive, informing them that death would not be tolerated.\nThey successfully tracked down Surik's companion Atton Rand while Surik was in the Jekk'Jekk Tarr. At first, they attempted to get Atton to come with them peacefully, but soon resorted to violence. Atton managed to defeat them and escape. The outcome of the first encounter angered the duo, so they returned to the Visionary, where they waited for Surik and her friends. They finally got their chance just as the ship was falling apart. They tried to kill Surik, but she and two of her companions killed them. Their bodies were destroyed when the Visionary exploded.\nSeer'aa and Teer'aa appeared, though unnamed, in Star Wars: Knights of the Old Republic II: The Sith Lords video game. Their names were later revealed by Leland Chee.\nIf Atton comes aboard Goto's ship to rescue the Exile, he will groan at the sight of Teer'aa and her partner, and promises they will both stay down in the ensuing battle.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/3951_BBY",
  "/wiki/Visionary",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Twin_Suns_(assassins)",
  "/wiki/Vossk",
  "/wiki/Assassin/Legends",
  "/wiki/Seer%27aa",
  "/wiki/Twi%27lek_spinning_blade",
  "/wiki/Personal_energy_shield/Legends",
  "/wiki/Atton_Rand",
  "/wiki/Meetra_Surik",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/G0-T0",
  "/wiki/Death/Legends",
  "/wiki/Jekk%27Jekk_Tarr",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/June_4",
  "/wiki/2007"
 ]
}