{
 "name": "Teff%27ith",
 "display_name": "Teff'ith",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Around 3661 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Exchange",
      "Old Tion Brotherhood"
     ]
    }
   ]
  }
 ],
 "content": "Teff'ith was a female Twi'lek slaver who lived during the Cold War. She is reputed to be a hired killer for Rogun the Butcher, stolen for the Migrant Merchants' Guild, slaving for the Black Sun and affiliated with the Ziost Liberation Front.\nDuring the Cold War, Teff'ith was involved with a trio of Black Sun slavers. Then suddenly, Republic spy Theron Shan attacked them without warning. Teff'ith had a shot but decided to flee, only to be stunned by Theron's Toxicity Three. He then demanded to know what information she had on the Sith Empire, to which she refused. Theron then left her bound on his ship until the next morning. When he returned, he informed her that they're leaving to locate Jedi Master Ngani Zho.\nUpon arriving on Taris, Theron left Teff'ith alone with his droid M-6 while he searched for Zho. M-6 later set her free at Theron's command and gave her access to the armory, as Theron and Zho were being pursued by Darth Mekhis' Sith Knights. After escaping Taris, Teff'ith accompanied the two Humans to the Vesla system to discover what Mekhis was up to. Upon being captured by the Imperials, Teff'ith hid in the ship and avoided capture.\nAfter an unknown period of time snacking on rations, Theron's ship's computer deactivated the time lock and again granted her weapons access. The Twi'lek proceeded to find Theron and Zho. It was then that Theron chose to destroy the Sun Razer before Mehkis could manufacture more weapons. Teff'ith decided to make for the ship, giving Theron sixty minutes to accomplish his mission or she would leave him behind. As Zho accompanied her, they are discovered by the Imperials. In the middle of the firefight, Zho pushed Teff'ith out of the way before the blaster bolts could hit her, sacrificing his life for her's.\nThankfully, Theron was able to lower the Sun Razer's shields, causing the star to consume it, and was able to get aboard his ship with Teff'ith. The Twi'lek then held a blaster to his head, but chose not to pull the trigger out of respect for Zho, and tells Theron of his sacrifice. Theron then agrees to let her off at the next port and the two parted ways.\nIn 3640 BBY, Teff'ith began operating as a smuggler for the Old Tion Brotherhood on Nar Shaddaa. Teff'ith and her associates were unaware that Morbo the Hutt planned on killing them for violating his terms of spice smuggling in his territory and were also unaware that Theron intervened on her behalf and killed Morbo's thugs.\nTeff'ith was later recruited by Theron and Jedi Master Gnost-Dural at the Crooked Finger bar on Desevro to help them infiltrate the Ascendant Spear. When Theron learned that his superiors were going to let the Imperials attack Duro, he sent Teff'ith to Coruscant to inform his mother, Grand Master Satele Shan, of his plan to bring the Ascendant Spear to have her convince Supreme Commander Jace Malcom to send a fleet to intercept the dreadnaught.\nUpon arriving on Coruscant, Teff'ith was detained by two Coruscant Security Force police officers. She is able to surprise one of them and take his blaster and forces the other to contact Satele Shan. After arriving on the scene, Satele is told by Teff'ith what has occurred. They then go to Malcom, who became upset by Theron's actions and was more mistrustful of Teff'ith, believing her to be an Imperial spy, though Satele vouched for her sincerity. Teff'ith was then forced to observe as Malcom and Satele argue over old wounds and Theron. Agreeing over why Theron was so messed up, Teff'ith then asked the Supreme Commander if he was going to send a fleet or not.\nFollowing the battle of Duro, in which Theron and Gnost-Dural succeeded in destroying the Ascendant Spear, they and Teff'ith was granted the Cross of Glory for their actions. Three days later, Theron visits Teff'ith's hotel room and gives her the 10,000 credits he promised for delivering the message to Satele. Teff'ith accepts the money but rejects a job offer. Teff'ith tells Theron to stop watching her and leaves. Theron, to himself, vows to watch over Teff'ith because that's what family does.\nAt a later stage in the war, Teff'ith was set upon by SIS goons, who wanted to know Theron's whereabouts. After escaping them, Teff'ith attempted to contact Theron but got no response, so she sent messages to Republic heroes to try and get in touch with her friend.\nTeff'ith initially has a hostile and antagonistic relationship with Theron, as would be expected between a captured criminal and her jailer. However as they were forced to remain in proximity to one another their relationship became less hostile, if not exactly friendly. Still Theron eventually came to trust Teff'ith enough that in the event of an emergency she would gain access to the armory aboard his ship. He would eventually come to see her as family, going out of his way to ensure she would be safe.\nUnlike with Theron, Teff'ith enjoyed spending time with Ngani Zho, a curious reaction since she was a slaver and he was a Jedi Master. Still, as they worked on their mission Ngani would entertain her with stories of his youth and he treated her with more kindness than Theron did.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_The_Old_Republic%E2%80%94The_Lost_Suns",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Teff%27ith",
  "/wiki/3661_BBY",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Exchange",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Old_Tion_Brotherhood",
  "/wiki/Theron_Shan",
  "/wiki/Slavery/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/Migrant_Merchants%27_Guild",
  "/wiki/Ziost_Liberation_Front",
  "/wiki/Black_Sun/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ngani_Zho",
  "/wiki/Taris/Legends",
  "/wiki/Ambush_on_Taris",
  "/wiki/Darth_Mekhis",
  "/wiki/Sith_Knight",
  "/wiki/Vesla_system",
  "/wiki/Sun_Razer",
  "/wiki/3640_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Morbo",
  "/wiki/Hutt/Legends",
  "/wiki/Gnost-Dural",
  "/wiki/Crooked_Finger",
  "/wiki/Desevro/Legends",
  "/wiki/Ascendant_Spear",
  "/wiki/Duro/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Jace_Malcom",
  "/wiki/Battle_of_Duro",
  "/wiki/Cross_of_Glory",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Teff%27ith",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_1",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_3",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_4",
  "/wiki/The_Old_Republic:_Annihilation_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_137"
 ]
}