{
 "name": "Telan_Medon",
 "display_name": "Telan Medon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Utapau"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pau'an"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Taller than Gar Stazi"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black and blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light gray with dark gray pinstripes"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pau City",
      "Galactic Alliance Remnant"
     ]
    }
   ]
  }
 ],
 "content": "Telan Medon was a Pau'an from Utapau and the Port Administrator of the planet's Pau City during the Second Imperial Civil War. From 130 to 138 ABY, Medon repeatedly provided the Galactic Alliance Remnant's Core Fleet safe haven from the forces of the Sith Lord Darth Krayt's Galactic Empire. Medon welcomed Alliance Admiral Gar Stazi to Pau City in 138 ABY after a battle between the Alliance fleet and Krayt's Empire, but their conversation was secretly recorded by a mouse droid. Word that Utapau harbored enemies of the Empire reached Krayt's Sith; however, the Sith hunter Cade Skywalker was able to prevent the Sith scientist Vul Isen from poisoning the planet in retaliation.\nThe Pau'an Telan Medon lived on the planet Utapau and served as the Port Administrator of Pau City, a large sinkhole city that plunged deep into the planet's surface, during the Second Imperial Civil War. The war pitted Darth Krayt's Galactic Empire—a Sith-led organization that ruled much of the galaxy—against several rebel factions, among them the Galactic Alliance Remnant. Medon was sympathetic to the Remnant and constantly provided its fleet safe haven from Krayt's Empire throughout an eight-year period beginning in 130 ABY.\nIn 138 ABY, after the Sith scientist Vul Isen poisoned the oceans of the planet Dac, the Remnant fleet led a massive evacuation of the water world and suffered many casualties during a consequent battle with Krayt's forces. Medon welcomed the fleet to Pau City in the skirmish's aftermath and personally greeted its leader, Admiral Gar Stazi, upon his arrival onworld. As the wounded were unloaded from the ships of the fleet, Stazi promised Medon that he would leave as soon as possible.\nUnbeknownst to either of them, their conversation was recorded by a mouse droid that belonged to Muerdo, an Utai spy employed by the Hutt crime lord Vedo Anjiliac Atirue; Vedo in turn passed the information to the Sith in the hopes of luring Isen into a trap. The scientist had also poisoned the Hutt moon of Da Soocha, and, seeking revenge, Vedo hired Cade Skywalker—a former Jedi who was actively hunting Sith—to go to Utapau and kill Isen, whom Vedo suspected would seek to punish the Pau'ans for harboring Krayt's enemies. Vedo's gamble paid off, and Skywalker slew Isen on Utapau in time to save the planet from a poisonous fate.\nTelan Medon was sympathetic to the Galactic Alliance Remnant during their struggle against Darth Krayt's Empire and repeatedly gave their fleet safe haven from Krayt's forces over a period of eight years. As Pau'ans had previously been supportive of the Galactic Republic, a government from years past, Medon felt that aiding the Alliance was keeping with tradition. The Port Administrator additionally believed that Krayt's Sith were evil and was dedicated to countering their wickedness; Medon saw the genocide on Dac as particularly evil and, as Port Administrator of Pau City, refused to condone it.\nMedon was friendly with Alliance Admiral Gar Stazi, who was casual enough with Medon to use the Port Administrator's first name in conversation. Medon was taller than Stazi and was possessed of yellow teeth, black and blue eyes, no cranial hair, and light gray skin adorned with dark gray pinstripes.\nTelan Medon exclusively appears on the opening page of the forty-ninth issue of the comic series Star Wars: Legacy, which was written by John Ostrander, penciled by Jan Duursema, and released in June 2010. The character's sex was not established. Although Medon shares a surname with Tion Medon, a Clone Wars-era Port Administrator of Pau City who appears in the 2005 film Star Wars: Episode III Revenge of the Sith, no connection has been established between the two characters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Utapau/Legends",
  "/wiki/Pau%27an/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Color/Legends",
  "/wiki/Pau_City/Legends",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Master_of_Port_Administration",
  "/wiki/Planet/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/130_ABY",
  "/wiki/138_ABY",
  "/wiki/Galactic_Alliance_Core_Fleet",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Admiral/Legends",
  "/wiki/City/Legends",
  "/wiki/Evacuation_of_Dac",
  "/wiki/Fleet/Legends",
  "/wiki/MSE-series",
  "/wiki/One_Sith",
  "/wiki/Sith/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Mission_to_Utapau_(Second_Imperial_Civil_War)",
  "/wiki/Scientist/Legends",
  "/wiki/Vul_Isen",
  "/wiki/Viral_spore",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Final_Protocol",
  "/wiki/Ocean/Legends",
  "/wiki/Dac",
  "/wiki/Water/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Muerdo",
  "/wiki/Utai/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Vedo_Anjiliac_Atirue",
  "/wiki/Devastation_of_Da_Soocha",
  "/wiki/Moon/Legends",
  "/wiki/Da_Soocha",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sai_tok/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Genocide_on_Dac",
  "/wiki/Tooth/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Legacy_(2006)_49",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/June",
  "/wiki/2010",
  "/wiki/Gender/Legends",
  "/wiki/Tion_Medon/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Legacy_(2006)_47",
  "/wiki/137_ABY",
  "/wiki/Star_Wars:_Legacy_Volume_10:_Extremes",
  "/wiki/Legacy_(2006)_50"
 ]
}