{
 "name": "Telettoh",
 "display_name": "Telettoh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Navy",
      "Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "Telettoh was a Human male who served as a captain in the Galactic Republic's Navy during the Mandalorian Wars. In 3963 BBY, he became the official naval liaison to the Revanchist faction of Jedi after the Jedi Council allowed the Jedi Knight Revan and his followers to join the Republic's effort in the war against the Mandalorian Neo-Crusaders. After meeting the former Jedi Padawan Zayne Carrick and his companions on the planet Wor Tandell, Telettoh aided the Republic Admiral Saul Karath in the capture of the Republic fugitive Dace Golliard. He eventually ascended to the position of admiral in the Navy.\nTelettoh, a Human male, lived during the time period after the end of the Great Sith War. During his life, he joined the Navy of the Galactic Republic, and eventually became the captain of the Hammerhead-class cruiser Testament. In the year 3963 BBY, he became the official liaison to the Revanchists, the Jedi Knight ] faction of Jedi, who were organized under the banner of a Republic Mercy Corps. Telettoh was placed under the command of Jedi Knight and General Malak. Telettoh traveled to the planet Wor Tandell with Malak—who hoped to recruit his friend Jarael to the Revanchists—and the Cathar Jedi Ferroh.\nAfter landing in the capital city of Gantra Lea, Telettoh was introduced by Ferroh to the former Jedi Padawan Zayne Carrick, who was a companion of Jarael's. After the Cathar and the former Jedi conversed about the Revanchists' standing in the war, Telettoh, Ferroh, and Carrick made their way via swoops to the latter's camp based near his ship, the Hot Prospect. As they neared the camp, the three witnessed Malak engaging in a fight with the Mandalorian scientist Demagol, who was secretly masquerading as the Mandalorian commander Rohlan Dyre. Telettoh, who was aware of the Mandalorian's high profile due to his recent victory in the Tandem Open sporting event, helped Ferroh restrain Malak. The Republic captain berated Malak for attacking \"Dyre,\" reasoning that the Revanchists could not afford any scandals. After Malak had a conversation with Carrick and Jarael, during which the latter turned down the Jedi's offer, Telettoh departed the planet aboard the Testament with Malak and Ferroh.\nEventually, the Republic Defense Ministry received an anonymous tip about a full-scale Mandalorian raiding force set to arrive in the Ottega system. Telettoh and his command ship Testament traveled to the system as part of a Republic force under the Republic Admiral Saul Karath's direction. The Republic ships waited for a Mandalorian fleet led by Cassus Fett to exit hyperspace outside of the system's asteroid field. After the Mandalorians exited hyperspace, the Republic forces prepared to engage them; however, the Mandalorian ships went around the fleet and re-entered hyperspace. Saul Karath was then notified by Zayne Carrick, who was in the system to contact Karath to ask him a favor, that pirates led by Republic fugitive Dace Golliard—who aimed to capture and enslave any survivors of the prospective battle—were near the starboard flank of Karath's command ship Swiftsure. After aiding in the capture of Golliard, Telettoh was instructed by Karath to take Carrick to wherever he and his companions needed to go.\nAs they were in transit to the planet Osadia, Telettoh had a discussion with Carrick, Marn Hierogryph, and the actual Rohlan Dyre—who, after Carrick and Hierogryph figured out that Demagol had been masquerading as Dyre, escaped Republic authorities with Carrick and Hierogryph's aid—regarding the actual details of the Revanchist Jedi's involvement in the Mandalorian Wars. He explained that the Jedi Council had not sanctioned the Revanchist's participation with the Republic, even after Revan found proof of the Mandalorians' devastation of the planet Cathar. The captain informed Carrick and his companions that Revan organized his followers under the banner of a Republic Mercy Corps, leading to the Council sanctioning the Revanchist's participation in the war. Telettoh then gave Dyre, whom he knew as \"Spikes,\" a tour of the Testament, before arriving at Osadia.\nEventually, Telettoh was elevated to the rank of admiral in the Republic Navy. Millennia later, in 1032 BBY, Telettoh's Maxim, an ancient Republic protocol which banned the transport of Sith Lords aboard Republic vessels, was recited by the mercenary Jarrow Rusher when he was chiding the Jedi Knight Kerra Holt for bringing the Sith Quillan aboard his ship.\nTelettoh was quick to put a halt to the fight between Malak and Rohlan Dyre, and even berated the Jedi for attacking the Mandalorian, believing that news of the fight would create indignity for the Revanchists. He made a point of revealing the actual events of the Revanchist's involvement with the Republic war effort to Carrick and his companions, and believed that Revan was clever for organizing his followers under the banner of a Republic Mercy Corps. He had light skin and blond hair, and wore a Republic officer's uniform, and donned a set of spectacles.\nTelettoh was created by John Jackson Miller for the standalone comic Masks, the forty-second issue of the Star Wars: Knights of the Old Republic comic series. He later appeared in the series' forty-ninth issue, which was the third part of the Demon story arc. In Masks, Telettoh was drawn by Ron Chan, and he was penciled by Brian Ching in the third issue of Demon. The character was named after Pete Hottelet, who donated $14,000 at the Penny Arcade charity dinner which benefited the Seattle Childrens' Hospitals. Miller originally considered anagramming the character's name, but decided to spell Hottelet's surname backwards.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Captain/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/3963_BBY",
  "/wiki/Revanchist",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Zayne_Carrick",
  "/wiki/Planet/Legends",
  "/wiki/Wor_Tandell/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Saul_Karath",
  "/wiki/Dace_Golliard",
  "/wiki/Time/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Hammerhead-class_cruiser",
  "/wiki/Testament",
  "/wiki/Republic_Mercy_Corps",
  "/wiki/Jedi_General/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Jarael",
  "/wiki/Cathar/Legends",
  "/wiki/Ferroh",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Gantra_Lea",
  "/wiki/Swoop/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Hot_Prospect",
  "/wiki/Mandalorian/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Demagol",
  "/wiki/Rohlan_Dyre",
  "/wiki/Tandem_Open",
  "/wiki/Ministry_of_Defense",
  "/wiki/Ottega_system/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Cassus_Fett",
  "/wiki/Hyperspace/Legends",
  "/wiki/Asteroid_belt",
  "/wiki/Pirate/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Inexpugnable-class_tactical_command_ship",
  "/wiki/Swiftsure_(Inexpugnable-class)",
  "/wiki/Osadia",
  "/wiki/Marn_Hierogryph",
  "/wiki/Battle_of_Cathar",
  "/wiki/Cathar_(planet)",
  "/wiki/1032_BBY/Legends",
  "/wiki/Telettoh%27s_Maxim",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Jarrow_Rusher",
  "/wiki/Kerra_Holt",
  "/wiki/Sith/Legends",
  "/wiki/Quillan_(Sith)",
  "/wiki/Diligence_(New_Sith_Wars)",
  "/wiki/Spectacles",
  "/wiki/John_Jackson_Miller",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Knights_of_the_Old_Republic_42",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_(comic_series)",
  "/wiki/Knights_of_the_Old_Republic_49",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_Demon",
  "/wiki/Ron_Chan",
  "/wiki/Brian_Ching",
  "/wiki/Category:Images_of_Telettoh",
  "/wiki/Knight_Errant_(novel)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_110",
  "/wiki/Knights_of_the_Old_Republic_47",
  "/wiki/Knights_of_the_Old_Republic_50"
 ]
}