{
 "name": "Temora",
 "display_name": "Temora",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arda II"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Temora was a Human male who was a major business leader on the planet Arda II during the Galactic Civil War. Temora was an executive at a company that manufactured T-6 diodems, a device they sold to the Rebel Alliance for use in their starfighters, as well to local buyers for use in home service machines. In 1 ABY, however, Rebel leaders Luke Skywalker and Leia Organa visited Arda II, alleging to Temora that the diodems had fallen into the hands of the Empire, which allowed it to target Rebel starships and giving it a major combat advantage. Temora, who was unaware of how the Empire obtained the diodems, soon learned that colleague Mag Doum—secretly an Imperial spy—was the source of the leak. The revelation caused a near-riot and ultimately the arrival of an Imperial battle group led by the Sith Lord Darth Vader, whom Doum had tipped off about the Rebels' presence on Arda II. Although Temora was loath to forsake Arda II's official neutrality and fully back the Alliance, the executive reached a deal with Skywalker accepting Rebel defense in exchange for assistance rectifying the Empire's new advantage. The Rebels managed to fight Vader off in the ensuing battle, further cementing their new partnership.\nTemora appeared in the comic strip story arc As Long As We Live..., written by Don Christensen and released in 1980. In the comic, Temora was illustrated by Russ Manning.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arda_II",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/As_Long_As_We_Live",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/T-6_diodem",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mag_Doum",
  "/wiki/Spy/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Attack_on_Arda-2",
  "/wiki/Star_Wars_(comic_strip)",
  "/wiki/As_Long_As_We_Live...",
  "/wiki/Don_Christensen",
  "/wiki/1980",
  "/wiki/Russ_Manning"
 ]
}