{
 "name": "Tendra_Risant_Calrissian",
 "display_name": "Tendra Risant Calrissian",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sacorria"
     ]
    },
    {
     "name": "Born",
     "values": [
      "14 BBY",
      "Sacorria"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brownish-Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Tendrando Arms",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Tendra Risant Calrissian was a wealthy female Human Sacorrian businesswoman who was the wife of Lando Calrissian and the mother of Lando Junior.\nTendra Risant was the daughter of a wealthy businessman and a minor government official on Sacorria. In addition to her government position, she also had a hand in dealing with the paperwork of her father's business. She was wealthy, but she acknowledged her position was due to being \"in the know\" with friends and family in high positions throughout the Corellian sector. She grew lonely in her position, seeking the stability and love of a stable relationship, and began a search for an offworld husband. Sacorrian tradition dictated natives and offworlders could not marry, but Tendra had grown tired of life on Sacorria. Her personal advertisement attracted the attention of Lando Calrissian, who, after building the Dometown facility on Coruscant, was in the market for a well-to-do wife and partner. The two went on to become close friends and business partners and eventually were married.\nLando visited Sacorria to meet Tendra, and the two were instantly attracted to one another, but soon afterward Lando was expelled by the Sacorrian Triad, who were in the midst of plotting the Corellian Incident. Before leaving, Lando gave Tendra a primitive radionics device capable of sending and receiving messages limited by the speed of light. Tendra waited for his message for several days, but then became alarmed by an unexpected fleet buildup around Sacorria and took matters into her own hands. She acquired a makeshift starship called the Gentleman Caller and set out to Corellia to warn Lando, but only made it part way before being stranded in deep space by the system-wide interdiction field activated on Centerpoint Station. Without hyperdrive, the trip to Corellia would take months. Worse yet, the interdiction field was accompanied by impenetrable communications jamming.\nStranded and helpless, she used the only tool at her disposal, the primitive radionics device Lando had given her. The jamming device was only effective on subspace transceivers and had no effect on radio transmissions. Tendra sent a number of transmissions addressed specifically to Lando. Although these transmissions were limited to lightspeed, they arrived at Corellia. Once contact was made, she was put in contact with New Republic Intelligence Service and given the codename \"Source T.\" She described the fast-approaching Sacorrian fleet to the best of her ability, giving Republic and Bakuran forces valuable information before the Battle of Centerpoint Station.\nAfter the First Corellian Insurrection, Lando began courting Tendra and gave her an apartment in Dometown. Airen Cracken conveyed a message to her father about her bravery in saving the New Republic, which helped soften the blow of losing his daughter. Having broken with Sacorrian custom, she was no longer welcome on her homeworld.\nBy combining both of their acute business senses, they first established an underwater mining facility on Varn . Later they began mining operations on Dubrillion and Destrillion and then went on to found Tendrando Arms.\nDuring the Yuuzhan Vong War, Tendrando Arms created and produced the YVH 1 battle droids, which helped the Republic battle the Yuuzhan Vong. It was during this time that she, and Lando, became more involved with the Smugglers' Alliance, working with people like Booster Terrik and Talon Karrde to help the Republic's war efforts.\nAfter the Yuuzhan Vong surrender, Tendra and Lando decided to pursue more legitimate projects, as the galaxy needed help recovering and their resources could be used to achieve worthwhile success for everyone rather than personal success for themselves.\nBy 40 ABY, Tendra was pregnant with Lando's first child, Lando Calrissian, Junior, who was nicknamed Chance by 43 ABY. Tendra and Lando later hosted a party on the spice world of Kessel with their friends after saving the planet from ground quakes that threatened to destroy it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Tendra_Risant_Calrissian",
  "/wiki/Sacorria",
  "/wiki/14_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Tendrando_Arms",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Jenica_Sonsen",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Lando_Calrissian,_Junior",
  "/wiki/Corellian_sector/Legends",
  "/wiki/Dometown_(Coruscant)",
  "/wiki/Coruscant/Legends",
  "/wiki/Sacorrian_Triad",
  "/wiki/Corellian_Crisis",
  "/wiki/Radionics",
  "/wiki/Gentleman_Caller",
  "/wiki/Interdiction_field/Legends",
  "/wiki/Centerpoint_Station",
  "/wiki/Subspace_transceiver",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Battle_of_Centerpoint_Station_(Corellian_Crisis)",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Varn",
  "/wiki/Dubrillion/Legends",
  "/wiki/Destrillion",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/YVH_1",
  "/wiki/Battle_droid/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Smugglers%27_Alliance",
  "/wiki/Booster_Terrik",
  "/wiki/Talon_Karrde",
  "/wiki/40_ABY",
  "/wiki/43_ABY",
  "/wiki/Kessel/Legends",
  "/wiki/Ambush_at_Corellia",
  "/wiki/Assault_at_Selonia",
  "/wiki/Showdown_at_Centerpoint",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Legacy_of_the_Force:_Betrayal",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/Fate_of_the_Jedi:_Omen_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/Cracken%27s_Threat_Dossier",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/The_New_Essential_Guide_to_Droids",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Fate_of_the_Jedi:_Dramatis_Personae",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}