{
 "name": "Tenk_Lenso",
 "display_name": "Tenk Lenso",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Glova"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tenk Lenso was a Human male native of the planet Glova who served with the Alliance to Restore the Republic as a starfighter pilot during the Galactic Civil War. His career included service with the Deretta Destroyers, a mixed fighter squadron, where he proved his abilities as a gunner in a BTL-S3 Y-wing. After his squadron was all but destroyed during a raid on an Imperial depot, Lenso was transferred to the Rebellion's Echo Base on the ice planet Hoth and earned a place with the elite Rogue Group under the call sign Rogue Eleven. Lenso flew with the Rogues during the Battle of Hoth, participating in the delaying action that helped much of the base's personnel and equipment to escape the Imperial siege, but he was among the first to be shot down during the engagement.\nThe Human male Tenk Lenso hailed from the planet Glova. One of Lenso's earliest assignments with the Alliance to Restore the Republic during the Galactic Civil War saw him serving with the Deretta Destroyers, a mixed starfighter squadron consisting of T-65 X-wing and BTL Y-wing starfighters. The Destroyers were staged on the moon of Deretta, from which they received their moniker. There, Lenso proved his skill as a gunner aboard a BTL-S3 Y-wing starfighter.\nShortly before the Battle of Hoth, the Destroyers were tasked with the elimination of an Imperial depot, a typical assignment for the group—they were in part named for their ordnance-heavy proton torpedo strikes on such targets. While the Destroyers entered the target zone ahead of their main attack force and softened up the opposition, they were prevented from leaving after their initial strike by the presence of an Imperial Immobilizer 418 cruiser, a capital ship equipped with four gravity well projectors capable of restricting hyperspace travel. Several excruciatingly slow minutes passed for the group while they waited for the main Rebel strike force to arrive, during which all twelve Destroyers were wiped out.\nLenso managed to eject from his fighter at the last minute as his Y-wing was shot out from under him, but not before finding himself trapped in the cockpit. Heavy flak and laser fire from the battle killed his pilot after the fighter's deflector shields were overloaded, and Lenso had no control over the craft; his ejection mechanism locked up. With a TIE/LN starfighter lining up for the kill on the Y-wing, Lenso was able to climb over his dead pilot and fire the ejection system. He held onto the ejector seat as it jettisoned from the fighter, the blast knocking him unconscious. Although the Rebels eventually claimed victory at the depot skirmish, the loss of the Destroyers was a substantial blow.\nEventually rescued by a Rebel medical frigate, Lenso was soon transferred to the medical lab at the Rebels' secret Echo Base on the remote ice planet Hoth, where he received further treatment in the facility's bacta tank. At some point, he was assigned to the elite starfighter squadron Rogue Group, as Rogue Eleven, under the command of Luke Skywalker. Due to psychological trauma sustained during the depot run, including flashbacks, Lenso found that he could no longer operate as a gunner. Instead, he flew an X-wing with the Rogues.\nWhen an Imperial reconnaissance Viper probe droid discovered Echo Base in 3 ABY, Lenso and Rogue Ten, Tarrin Datch, were among the first pilots dispatched by base commander General Carlist Rieekan to investigate the threat. Rieekan instructed Lenso and Datch to fly a holding pattern at low altitude over Echo Station 3-8 and to expect trouble. They investigated Echo Station 3-8 and also transported Han Solo and the Wookiee Chewbacca to the area aboard T-47 airspeeders, dubbed \"snowspeeders.\" After Solo and Chewbacca located the probe soon thereafter and informed Rieekan that it may have detected the base's shield generator, Rieekan intended to order Lenso and Datch on an attack run for the droid. Solo, however, dismissed the idea, claiming that there was no time for that, and that the sight of overhead flying snowspeeders would alert the probe to their presence. Instead, he told Rieekan that he and Chewbacca would destroy the probe themselves. Although Solo and Chewbacca did eliminate the probe, the droid had already transmitted the location of Echo Base to the Empire.\nThe probe's discovery of the Rebel presence on the planet led to the subsequent Battle of Hoth. During the engagement, Lenso flew with the Rogues, tasked with the duty of delaying the advance of an invading line of Imperial All Terrain Armored Transport walkers long enough for Echo Base's transports and personnel to escape the planet. Still hampered by his mental scars, Lenso opted to sit in the \"front-row seat\" of one of the base's modified snowspeeders, rather than the familiar gunnery seat. His gunner was Jek Pugilio. While the Rogues succeeded in buying enough time for much of Echo Base to evacuate Hoth, the Rebels nevertheless suffered heavy casualties. Lenso was killed when his speeder was one of the first shot down during the engagement.\nTenk Lenso was a capable gunner, having proven his skills in the rear of a Y-wing while serving with the Deretta Destroyers. However, the heavy losses sustained during the destruction of the Destroyers on their final mission proved to be too much for the man to bear. He found he could no longer effectively serve as a gunner in combat. The stresses of battle fatigue would ultimately prove to be Lenso's undoing, as his piloting abilities, less honed by comparison, failed him during the Battle of Hoth.\nAside from his considerable starfighter gunnery and piloting abilities, Lenso was particularly skilled in mechanical airspeeder repulsorlift operation and repair, starship astrogation, and was adept at beast riding. He was also knowledgeable about planetary star systems.\nThe character of Tenk Lenso first appeared in the 1989 first edition of the West End Games sourcebook Galaxy Guide 3: The Empire Strikes Back as an example of a standard Rebel snowspeeder pilot, providing the character with a name and roleplaying stats only. The black and white artwork accompanying the article  was previously used in Galaxy Guide 1: A New Hope alongside the name and stats of pilot Fin Danglot. The 1996 second edition of Galaxy Guide 3 included a full profile for Lenso as part of a major expansion of the text by Pablo Hidalgo. Lenso's newly created biography first identified the character as the aforementioned \"Rogue Eleven\" from the film Star Wars: Episode V The Empire Strikes Back. The Rogue Eleven character was first mentioned in Donald F. Glut's April 1980 novelization of The Empire Strikes Back.\nLenso and Rogue Ten's involvement in responding to the Imperial probe droid outside of Echo Base just prior to the Battle of Hoth has been expanded on in several sources to include additional scenes not included in the original film. Specifically, the April 1980 The Empire Strikes Back Storybook, published just prior to the film's May release, makes mention of a group of snowspeeders that delivers Han Solo and Chewbacca to the location of the probe droid. The September 1980 Marvel Star Wars comic adaptation of The Empire Strikes Back, Star Wars  39, likewise includes a panel in which a snowspeeder patrol delivers Solo and Chewbacca to the probe. The substance of this scene, first detailed in The Empire Strikes Back Storybook, was referenced in the 2008 release of The Complete Star Wars Encyclopedia, under the \"Rogue Eleven\" entry, confirming that Lenso and Datch, specifically, transported Solo and Chewbacca to the probe, thus making The Empire Strikes Back Storybook the first retconned appearance, albeit indirectly, of Lenso's character. Brian Daley's 1983 radio adaption of The Empire Strikes Back and the radio drama's original script, published in 1995 in The Empire Strikes Back: The National Public Radio Dramatization, also include unique dialogue for the scene, in which General Rieekan considers ordering Lenso and Rogue Ten to attack the probe themselves. In 2013, an article in Star Wars Insider 146 linked Lenso's name to one of the unnamed pilots seen being briefed by Princess Leia during The Empire Strikes Back.\nLenso is included among the Rogue Squadron starfighter unit in the 2006 PC game Star Wars: Empire at War: Forces of Corruption. However, it should be noted that Lenso and the Rogue Squadron unit only appear in \"Galactic Conquest\" and \"Skirmish\" modes, which are not considered part of the game's canonical storyline.\nLenso's helmet, or a matching design was previously worn by John D. Branon in Star Wars: Episode IV A New Hope and Ace Merrick in the video game Rebel Assault II: The Hidden Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars_Insider",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_146",
  "/wiki/Glova",
  "/wiki/3_ABY/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Deretta_Destroyers",
  "/wiki/Squadron/Legends",
  "/wiki/Gunner/Legends",
  "/wiki/BTL-S3_Y-wing_starfighter",
  "/wiki/Battle_of_Tarabba",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Call_sign",
  "/wiki/Rogue_Eleven/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Evac_Rearguard_Action_101",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Deretta",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Immobilizer_418_cruiser/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Cockpit/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Death/Legends",
  "/wiki/Ejector_seat/Legends",
  "/wiki/Hospital_ship/Legends",
  "/wiki/Echo_Base_medical_lab",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Rogue_Ten/Legends",
  "/wiki/Tarrin_Datch",
  "/wiki/General/Legends",
  "/wiki/Carlist_Rieekan/Legends",
  "/wiki/Echo_Station_3-8",
  "/wiki/Han_Solo/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Droid/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Jek_Pugilio",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/1989",
  "/wiki/West_End_Games",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Galaxy_Guide_1:_A_New_Hope",
  "/wiki/Fin_Danglot",
  "/wiki/1996",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Donald_F._Glut",
  "/wiki/April",
  "/wiki/1980",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/The_Empire_Strikes_Back_Storybook",
  "/wiki/September",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_(1977)_39",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Retcon",
  "/wiki/Brian_Daley",
  "/wiki/1983",
  "/wiki/The_Empire_Strikes_Back_(radio)",
  "/wiki/1995",
  "/wiki/The_Empire_Strikes_Back:_The_National_Public_Radio_Dramatization",
  "/wiki/2006",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption",
  "/wiki/Canon",
  "/wiki/John_D._Branon/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ace_Merrick",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(junior_novelization)",
  "/wiki/Star_Wars_Manga:_The_Empire_Strikes_Back_1",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Cine-Manga)",
  "/wiki/Star_Wars_(1977)_40",
  "/wiki/The_Empire_Strikes_Back_Notebook",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/1995_Topps_Star_Wars:_The_Empire_Strikes_Back_Widevision",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/The_Hard,_Cold_Facts_About_Hoth",
  "/wiki/Star_Wars_Galaxy_Magazine_4",
  "/wiki/Princess_Leia:_A_Heroine%27s_Tale",
  "/wiki/Star_Wars_Galaxy_Magazine_12",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back:_The_Illustrated_Screenplay",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/The_Empire_Strikes_Back_(TCG)",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Official_Star_Wars_Fact_File_(2013)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_5_(2013)",
  "/wiki/Star_Wars_in_100_Scenes",
  "/wiki/Isplourrdacartha_Estillo",
  "/wiki/4_ABY/Legends",
  "/wiki/The_Making_of_%22The_Empire_Strikes_Back%22",
  "/wiki/Star_Wars:_X-Wing_Rogue_Squadron:_The_Rebel_Opposition",
  "/wiki/StarWars.com"
 ]
}