{
 "name": "Tenth_Brother",
 "display_name": "Tenth Brother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "18 BBY",
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Miraluka"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray",
      "later white"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tanned brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Mace Windu's squad",
      "Mace Windu's squad",
      "Galactic Republic",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "The Tenth Brother, formerly known as Prosset Dibs, was a Force-sensitive Miraluka male member of the Inquisitorius during the early reign of the Galactic Empire. Prior to the rise of Emperor Palpatine, Dibs held the rank of Jedi Master during his time in the Jedi Order. During the Clone Wars, Dibs was sent on a operation on Hissrich where his faith in the Jedi's role as peacekeepers conflicted with their new responsibilities as generals in the armed forces of the Galactic Republic. After returning to the Jedi Temple on Coruscant from Hissrich, Dibs was put on trial by Grand Master Yoda and the Jedi High Council for attempting to kill Mace Windu. Dibs expected a death penalty, but at Windu's request was sentenced to rehabilitation.\nIn the aftermath of the Great Jedi Purge, Dibs joined the ranks of the Inquisitorius—a group of Jedi hunters led by Darth Vader, Sith Lord and the Emperor's apprentice—as the \"Tenth Brother.\" He accompanied Vader, the Ninth Sister, and the Sixth Brother to the planet Mon Cala to hunt Padawan Ferren Barr, a survivor of the Purge. Although the Inquisitorius renounced their allegiance to the Jedi Order, Barr manipulated the Purge Troopers into executing Order 66 against the fallen Jedi, including the Tenth Brother who was shot to death by the clones in the ensuing firefight.\nFollowing the First Battle of Geonosis, the Jedi High Council sought to ascertain the truth behind the Separatist operation on the planet Hissrich. While assembling a special squad for this assignment, Prosset Dibs was chosen by Mace Windu, who felt that Dibs possessed a strong intuition in spite of his blindness. Windu also chose Jedi Master Kit Fisto and Jedi Knight Rissa Mano to be on his team. He believed that Dibs would provide useful insight and reconnaissance for the mission.\nAfter arriving on Hissrich via the T-6 shuttle Westwind, Dibs confided in Windu his feeling of unease in the Force as well as his belief that the teachings and beliefs of the Jedi Order were being tested, to which Windu concurred. Around the same time they noticed a group of battle droids patrolling the area. Windu told Fisto and Dibs to go above and around and told Mano to go with him. They almost immediately charged the droids and Dibs jumped on top of an Octuptarra tri-droid, cutting it in half. A B2-series super battle droid then attempted to catch him off guard and kill him. Fisto took him from behind and cut it down. Dibs thanked Fisto and the Jedi were suddenly confronted by the planet's inhabitants.\nDibs and the rest of the squad were led by the inhabitants into series of caverns hidden beneath Hissrich's surface, which led him to the native's home. Dibs and the others believed that the natives had brought them there for a reason. He also believed that the inhabitants had a clue about the Separatists' plans for Hissrich. As the Separatists drilled into the planet, their forces invaded the caverns in which the Jedi were in. Windu told the other to defend the natives while he handled the destroyers. Their mercenary commander AD-W4 then engaged Windu and when the other Jedi joined, the Separatist Harvester droids intervened splitting Windu and Mano from the other two the squad. Dibs continued to fight alongside Fisto to protect the inhabitants.\nDibs and Fisto ended up finding themselves in the darkness of the cave and used their lightsabers to light the place up. Dibs insisted to Fisto that they tend to the wounded inhabitants, to which he agreed. However, they sensed danger nearby and the two were confronted by a Milodon. Dibs cut through its side with his lightsaber and Fisto joined immediately. The two continued digging their lightsabers into the creature until it fell to the ground. After killing the creature, they found the remains of several deceased indigenous inhabitants. Alarmed by the numbers of deaths on Hissrich, Dibs began to question the Jedi's ability to maintain peace and protect others, to which Fisto countered by stating that casualties are inevitable in war and that the Jedi were now striving to mitigate the loss of life. Dibs, however, was not convinced.\nAfter reuniting with Windu and Mano, Dibs confronted Windu by voicing his disagreement with the Jedi's role in the Clone Wars. He made several accusations against both Windu and the Council, ranging from callousness towards collateral damage to corrupting the Jedi doctrine, and proceeded to physically assault Windu, who refused to entertain Dibs' claims, dismissing all of them as \"bold accusations\" and \"grand inquisitions.\" Dibs then ignited his lightsaber, intending to take Windu's life. Though he felt responsible for failing Dibs, Windu activated his own lightsaber in order to defend himself, resulting in a duel between the two Jedi Masters.\nAs they fought, Windu beseeched Dibs to cease his attack by reminding him that they were essentially brothers in the sense that they were both chosen to walk the path of the Jedi. Dibs rejected all of Windu's words as lies and declared his intent to no longer serve the Jedi Order and follow his own path. The duel pressed on until Windu Force-pushed Dibs to the ground and deprived him of his lightsaber. After a moment of contemplation, Windu decided that the Jedi Council should determine Dibs' fate and therefore arrested him. Leaving Dibs confined in the Westwind, the Jedi proceeded to complete their mission.\nA shackled Prosset Dibs was later brought back to the Jedi Temple. Placed on trial for turning against his team and attacking Windu—a Jedi Master, as well as a general in the Republic Military—Dibs, stood before the High Council accused of heresy and insubordination. He refused to find fault in his actions and again expressed his belief that the Council was twisting the Jedi doctrine for their own selfish gain. Ultimately, he was found guilty of treason, and though Dibs expected to be put to death, Windu, who harbored his own reservations against the Jedi's new military responsibilities, implored his colleagues to be merciful.\nHe believed that the Jedi had a duty to help rehabilitate the members of the Order who strayed from the light, and therefore requested for Dibs to be placed on probation, confined to work in the Jedi Archives, where he hoped the fallen Jedi would reevaluate his opinions. Dibs, however, remained skeptical of Windu's sincerity and as his former friend walked out of the chamber, taunted him that his hubris would be his undoing. Windu later confided in Mano his concern for Dibs and the future of the Jedi Order, but the experience ultimately renewed his faith in the Jedi's role as the protectors of all peoples across the galaxy.\nIn 19 BBY, the Jedi Order was all but wiped out by Order 66, a contingency order implanted into the clone troopers that ordered the deaths of all Jedi. Coinciding these events, the Galactic Republic was replaced by the Galactic Empire, who sought to hunt all of the remaining Jedi. Dibs fell to the dark side of the Force and eventually joined the Inquisitorius, a group of fallen Jedi turned agents for Darth Sidious. Dibs was named the Tenth Brother and worked under the Grand Inquisitor, the leader of the Inquisitorius.\nA year after the rise of the Galactic Empire, Tenth Brother was chosen by Darth Vader to assist a search for a possible Jedi influencing the monarchy on Mon Cala. Alongside Tenth Brother were Sixth Brother, Ninth Sister and a squad of elite clones known as Purge Troopers. They traveled to Dac City where negotiations between Ambassador Telvar and King Lee-Char were becoming hopeless. Upon arrival, the three Inquisitors were stopped by the King's chief of Security, Gial Ackbar, at the landing pad. The Mon Calamari demanded their business and Vader came down to explain the possible presence of a Jedi on their planet. Ackbar refused the possibility at first but as Telvar departed Dac City, his Lambda-class T-4a shuttle exploded, killing all on board. Vader and the Inquisitors passed Ackbar and traveled into the city.\nTelvar's superior, Moff Wilhuff Tarkin, responded to the assassination by sending his forces down to Mon Cala. Led by Major Rantu, the Imperial forces invaded Dac City with Vader and the Inquisitors fighting to take the landing pad. After taking the landing pad, the Ninth Sister asked Vader where they were to go. Vader told her they were going to the palace to question the king about the Jedi. The tenth Brother then questioned Vader as to why the Jedi would even stay in the palace after Tarkin's forces came down and Vader told him that the king remained there. The four fought their way into the palace where Ninth Sister interrogated the king. However the king had already ordered the final defensive maneuver and a school of giant fish-like creatures broke through the sea-level and caused a tsunami to erupt throughout the planet's surface. Tenth Brother and the other three attempted to hold off the wave but it was no use, they were swept away.\nDespite all odds, Tenth Brother and the other two Inquisitors survived the wave and began searching for Vader on an Imperial submarine. They found Vader alive and picked him up. Ninth Sister revealed she had found the location of the Jedi they were looking for from her interrogation with Lee-Char and they set a course for it in search of their target. There they found Jedi Padawan Ferren Barr and his six disciples evacuating their refuge. They immediately dispersed and one of them, Nipaltoo attempted to break the submarine's windscreen, only to have his helmet crushed by Vader using the Force. Another, Orvek, sacrificed himself to slow them down a bit.\nThe four continued to pursue Barr and his disciples to Bel City where another two, Stell and Rebb, stayed behind to slow them down. Vader then received a transmission from Tarkin requesting him to capture the king and end the fighting on Mon Cala. Vader complied and left the Inquisitors and their troopers to find Barr.\nThe Inquisitors found Barr at a dead end where Sixth Brother cut Daren in half, leaving the Jedi and his last disciple, Verla. Barr then confronted them and reminded them about their Jedi past, reciting their original names including Tenth Brother's. Barr claimed they will always be a Jedi to which Ninth Sister refused his claim. But Barr wasn't trying to tell it to them, but to the Purge troopers, as they were clones. Before the Inquisitors could realize this, Barr used a mind trick on the troopers saying \"execute Order 66\". The Purge troopers then turned to the Inquisitors and despite Tenth Brother's protests to them, they opened fire. The three Inquisitors began blocking the shots and deflecting them back at the manipulated troopers, but the Tenth Brother, taken by surprise, was hit in the chest before dropping to the floor, dead.\nImmediately after the Tenth Brother's death, Barr and Verla Force jumped over the fighting and escaped. Keen to not end up like the Tenth Brother, the Sixth Brother suggested to the Ninth Sister that they leap over the troopers as well to pursue Barr. But Ninth Sister told him to push them away instead and the two Inquisitors force pushed the troopers to the side. Sixth Brother cut Ninth Sister's leg off, leaving her to fend off the rest of the clones.\nIn the years following the fall of the Galactic Empire, Jedi Master Luke Skywalker traveled the galaxy to rediscover the history of the Jedi Order that had been suppressed by the Empire. In his search for knowledge, Skywalker became aware of the Tenth Brother's existence. During his self-imposed exile on Ahch-To, Skywalker wrote a book he titled The Secrets of the Jedi, which chronicled the information he had learnt on his travels. The Tenth Brother was one of several Inquisitors who were depicted in the book as illustrations, alongside information pertaining to the Inquisitorius.\nProsset Dibs was a tall Miraluka male with dark skin, long gray hair and no eyes. As a Jedi Master, he was a wise and sharp-witted individual who had exceptional hearing and intuition of what was around him. For this, he was held in high esteem by his colleague and superior Mace Windu, who believed Dibs was also capable of providing useful insight and reconnaissance. Dibs himself admitted that he had a great mind, and believed his only flaw was his tendency to \"speak about it.\"\nDibs was a firm believer in the Jedi's role as peacekeepers, and thus disagreed with their new responsibilities as warriors and military leaders in the Clone Wars. During a mission on Hissrich, his doubts about their new role and the loss of multiple natives, which he felt the Jedi were responsible for and should never have happened in the first place, led him to lose faith in the Order and the High Council. Eventually, his disillusionment turned to anger, and he came to believe that the Jedi had not only abandoned their traditions but were distorting them for their own selfish gain. This led Dibs to turn on Mace Windu with the intention of killing him, only to be defeated and arrested.\nDuring his trial before the Jedi Council, Dibs refused to find fault in his actions, insisting that he had done nothing wrong and the Council were the ones to blame for the war and its losses. He reacted with anger to Windu's decision to spare him and his attempts to sympathize with him, believing the other Jedi was simply \"patronizing\" him and making him an \"example of his false benevolence.\"\nFour years later, Dibs, now the Tenth Brother, had whiter hair and had since fallen to the dark side of the Force. He became a part of the Inquisitorius, where he adopted his name, and was willing to hunt down and kill the Jedi he once respected and fought alongside. The Tenth Brother was observant and assumed that Lee-Char would have left Dac City when Tarkin sent his forces down to Mon Cala. Vader put his mind to rest when he told him that Lee-Char remained at the palace. The Tenth Brother was more callous than his former self and openly insulted Mon Cala as smelling like fish upon his arrival. When the Ninth Sister told him it was just Sixth Brother, he pushed his ego by saying it was more like fish. When the Purge troopers were convinced to turn on the Tenth Brother and the other two, by Barr, he called them \"stupid clones\", even though he was trying to keep them on his side. The Purge troopers ended up firing on him and he was gunned down in the process.\nLike all Jedi, Prosset Dibs was Force-sensitive. He was described by Mace Windu as being \"as strong in the Force as any Jedi he had ever known.\" He also possessed considerable skill with a lightsaber despite having no eyes, being able to destroy several battle droids with ease and hold his own against Mace Windu, though he was ultimately disarmed and bested by the Jedi champion.\nDuring the Battle of Dac City, the Tenth Brother overpowered the Mon Calamari and Quarren guards when fighting at the landing pad and into the palace. When threatened by a large tsunami, the Tenth Brother and Sixth Brother were not able to hold it off, even when Vader assisted them. At Bel City, Tenth Brother and the other two Inquisitors were betrayed by their Purge troopers, who were forced to do so by their inhibitor chips. The Tenth Brother was able to deflect several blaster shots from the troopers, but was soon hit in the chest and killed.\nAs a Jedi, Prosset Dibs had a single-bladed green lightsaber. He wore brown Jedi robes and had a black blindfold to cover his empty eye sockets. He also had a black belt around his waist and wore brown boots. Furthermore, he wore beige trousers and had his long hair tied back with a bandanna. When part of the Inquisitorius, the Tenth Brother kept his eye sockets open and exposed rather than covered up. Unlike his fellow Inquisitors he did not wear armor, save for a pair of shoulder-mounted epaulettes in black with the Imperial crest on them and a pair of black bracers on his forearms, instead opting for a grey robe-like ensemble and cloth wrappings up the length of his arms to a point just above his bicep as well as wrapped around the lower half of his face like a mask. This provided little protection from blasterfire, as was shown when he was shot and killed quite easily.\nFurthermore he did not use the standard double-bladed spinning lightsaber, instead opting to use two single-bladed shoto lightsabers, wielded in a reverse grip, making him the only Inquisitor not to use a double-bladed spinning lightsaber.\nThe Tenth Brother first appeared in the 2017 comic Jedi of the Republic – Mace Windu 1 written by Matt Owens and penciled by Denys Cowan as Prosset Dibs, and was later identified as Tenth Brother in the 2018 Darth Vader  14 comic, written by Charles Soule and penciled by Giuseppe Camuncoli. Although the Tenth Brother and Prosset Dibs were not confirmed to be the same until Darth Vader  16, also written by Soule and penciled by Camuncoli.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/18_BBY",
  "/wiki/Mon_Cala",
  "/wiki/Miraluka",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Mace_Windu%27s_squad",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitorius",
  "/wiki/Anakin_Skywalker",
  "/wiki/Force-sensitive",
  "/wiki/Brother/Sister",
  "/wiki/Imperial_Era",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Jedi_Master",
  "/wiki/Time",
  "/wiki/Clone_Wars",
  "/wiki/Operation_on_Hissrich",
  "/wiki/Jedi",
  "/wiki/Law_enforcement_agency",
  "/wiki/Jedi_General",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Hissrich",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Jedi_High_Council",
  "/wiki/Death",
  "/wiki/Mace_Windu",
  "/wiki/Death_penalty",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi_hunter",
  "/wiki/Sith_Lord",
  "/wiki/Sith_apprentice",
  "/wiki/Battle_of_Dac_City",
  "/wiki/Ninth_Sister",
  "/wiki/Sixth_Brother",
  "/wiki/Planet",
  "/wiki/Padawan",
  "/wiki/Ferren_Barr",
  "/wiki/Mind_trick",
  "/wiki/Purge_Trooper",
  "/wiki/Order_66",
  "/wiki/Cloning",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Kit_Fisto",
  "/wiki/Jedi_Knight",
  "/wiki/Rissa_Mano",
  "/wiki/Prosset_Dibs%27_lightsaber",
  "/wiki/T-6_shuttle",
  "/wiki/Westwind",
  "/wiki/The_Force",
  "/wiki/Battle_droid",
  "/wiki/Octuptarra_tri-droid",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Unidentified_Hissrich_species",
  "/wiki/Squad",
  "/wiki/Cave",
  "/wiki/Mercenary",
  "/wiki/Commander",
  "/wiki/AD-W4",
  "/wiki/Harvester_(Confederacy_of_Independent_Systems)",
  "/wiki/Milodon",
  "/wiki/Mace_Windu%27s_lightsaber",
  "/wiki/Lightsaber_duel",
  "/wiki/Lightsaber",
  "/wiki/Stuncuffs",
  "/wiki/Republic_Military",
  "/wiki/Treason",
  "/wiki/Jedi_Archives",
  "/wiki/Jedi_Council_Chamber",
  "/wiki/19_BBY",
  "/wiki/Clone_trooper",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Agent",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Grand_Inquisitor",
  "/wiki/Mon_Calamari_monarchy",
  "/wiki/Dac_City",
  "/wiki/Ambassador",
  "/wiki/Telvar",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/King",
  "/wiki/Chief_of_Security",
  "/wiki/Gial_Ackbar",
  "/wiki/Mon_Calamari",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Major",
  "/wiki/Rantu",
  "/wiki/Dac_City_palace",
  "/wiki/Palace",
  "/wiki/Unidentified_Mon_Cala_creature",
  "/wiki/Imperial_submarine",
  "/wiki/Ferren_Barr%27s_disciples",
  "/wiki/Ferren_Barr%27s_cave_refuge",
  "/wiki/Nipaltoo",
  "/wiki/Orvek",
  "/wiki/Bel_City",
  "/wiki/Stell",
  "/wiki/Rebb",
  "/wiki/Daren",
  "/wiki/Verla",
  "/wiki/Force_jump",
  "/wiki/Force_push",
  "/wiki/New_Republic_Era",
  "/wiki/Luke_Skywalker",
  "/wiki/Ahch-To",
  "/wiki/The_Secrets_of_the_Jedi",
  "/wiki/Hair",
  "/wiki/Quarren",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Tenth_Brother%27s_lightsabers",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/2017",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/Matt_Owens",
  "/wiki/Denys_Cowan",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_2",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_3",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_4",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Darth_Vader_(2017)_15",
  "/wiki/Darth_Vader_(2017)_17",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Mace_Windu_and_Other_Force_Users",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Darth_Vader_(2017)_6",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Databank_(website)"
 ]
}