{
 "name": "Ter%27cay",
 "display_name": "Ter'cay",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Lanoree Brock",
      "Dalien Brock"
     ]
    }
   ]
  }
 ],
 "content": "Ter'cay was a Human male Je'daii Master who served as one of the instructors of Qigong Kesh for the Je'daii Order on Tython at the height of the Infinite Empire's reign.\nTer'cay was a Forceful Human member of the Je'daii Order on Tython. Very skilled in the art of telepathy, Ter'cay elected to serve as a Je'daii Master at Qigong Kesh and an instructor to young Je'daii Journeyers. When Lanoree and Dalien Brock came to Qigong Kesh on their Great Journey, Ter'cay served as their teacher, giving them a tour of the Temple complex and leading them out for training in the Silent Desert. A space devoid of all sound, Ter'cay taught that the first lesson of Qigong Kesh was to communicate in the mind, as verbal communication was impossible in the desert. Immediately Ter'cay perceives Dalien's weak Force-aptitude, and communicates this skepticism to Lanoree in her mind. She insists that her brother will do his best to learn, to which Ter'cay vows to do his best in return. Practicing illusions on their first day of training, Ter'cay is impressed with the elder Brock's proclivity for imaginary creatures, but when he attempts to open the younger Brock's mind, Dalien kicks sand in the Master's face, angered by the intrusion. On the first night the trio is camped out in the desert, Ter'cay touches Lanoree's mind and directs her sight out into the desert where bizarre and mysterious sand sculptures dance and sing in the Force. While Lanoree's skills grow and expand rapidly during their time in the dunes, every attempt Ter'cay makes with Dalien pushes the young man away from the Force.\nTer'cay is a Je'daii Master with considerable talents in telepathy. The ease at which he penetrated minds visibly shocked Lanoree Brock, a Journeyer who grew up with people communicating telepathically. His level of control and command would have required many years to hone. Like other Masters, Ter'cay was able to deduce Dalien Brock did not, or would not, interact with the Force almost immediately after meeting him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Lanoree_Brock",
  "/wiki/Dalien_Brock",
  "/wiki/Je%27daii_Master",
  "/wiki/Qigong_Kesh",
  "/wiki/Tython/Legends",
  "/wiki/Infinite_Empire",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Telepathy/Legends",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Great_Journey",
  "/wiki/Silent_Desert",
  "/wiki/Force_Illusion",
  "/wiki/The_Force/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ter%27cay",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}