{
 "name": "Tera_Sinube",
 "display_name": "Tera Sinube",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cosia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 231 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "By 9 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mottled green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Zang Arraira"
     ]
    }
   ]
  }
 ],
 "content": "Tera Sinube was a Cosian male Jedi Master who lived during the height and later descent of the Galactic Republic. Sinube was the marshal of a Jedi outpost on Derra during the High Republic Era, and sat on the Jedi High Council sometime before the Invasion of Naboo. By 9 BBY, Sinube had been killed and was entombed at Fortress Inquisitorius on the moon Nur.\nAround 231 BBY, Sinube had recently risen to the rank of Jedi Master, and was in charge of a Jedi Temple outpost on Derra. When the nearby planet Cyclor was attacked by the Nihil pirates, Master Stellan Gios contacted Sinube for assistance, and he dispatched the legendary Ikkrukkian Master Porter Engle to lead a drift of Jedi Vectors to assist.\nAs a Jedi investigator, Sinube was an expert in the planet Coruscant's criminal underworld. His connection to the Force allowed him to solve crimes faster than seasoned detectives in the Coruscant Police. Decades before the Invasion of Naboo, Sinube was the leader of the Jedi youngling Hawk-Bat Clan, whose members included Zang Arraira, Arath Tarrex, Sifo-Dyas, and Dooku. While Dooku was still a Jedi youngling, Master Sinube traveled to Serenno along with Dooku, Sifo-Dyas, Grand Master Yoda, Master Yula Braylon, and many other younglings and masters for the galactic festival there. He and Master Braylon rushed to Yoda's aid when the youngling Sifo-Dyas accidentally knocked into him. He selected Zang to be his Padawan apprentice in 86 BBY.\nSometime before the Invasion of Naboo, Sinube was seated on the Jedi High Council, and was present when the Padawan Cere Junda met with the Council in the fallout of the battle for Ontotho and was granted the rank of Jedi Knight for her conduct. Around this time, Sinube attended the funeral for Master Katri, who had died on Raxus Secundus.\nDuring the Clone Wars, Sinube had fallen asleep in the middle of some research in the Archives when he was approached by Padawan Ahsoka Tano for help in recovering her lightsaber, which had been stolen by a thief named Bannamu. Sinube elected to accompany the girl, not having been on an assignment in many years and confident that she would not succeed unless she learned to be patient and take things slowly. Tracking Bannamu to the Spider Arms Hostel, Sinube used a mind trick on the attendant to get past before the two Jedi located and confronted the thief in his room. Sinube was forced to interject on Bannamu's behalf to keep Tano from causing the Patrolian bodily harm in her anger; under duress, Bannamu revealed that he had sold the lightsaber to Nack Movers, a well-known criminal and assassin in the Coruscant underworld. When they traveled to Movers' apartment building, Sinube saw that the lock was broken and surmised it to be the Trandoshan's residence. Inside, they found the corpse of Movers and a terrfied girl who identified herself as Ione Marcy and who claimed that a group of men had killed Movers.\nTano searched the other rooms whilst Sinube remained behind with Ione, suspecting her of knowing more than she was letting on about what happened to Movers. Tano shortly reported being attacked by an intruder who had her lightsaber, a female Terrelian Jango Jumper, which contradicted Marcy's earlier claims. Sinube summoned the authorities and discretely planted a tracker on Marcy's back, then proceeded to interrogate her further on what had happend. Marcy's evasive and contradictory statements convinced the elderly Jedi that she was involved in Movers' death and ordered the arriving police droids to arrest her, only for Marcy to escape. Undaunted, Sinube borrowed a speeder bike from the police and picked up Tano before following the tracker signal to a nearby train station where they found Marcy and her accomplice, Cassie Cryar.\nWhilst police droids apprehended Marcy, Tano chased Cryar to the next station where the criminal used the stolen lightsaber to take two hostages in order to deter further Jedi pursuit. When the train door opened, however, she found Sinube waiting for her. Drawing his lightsaber from within his cane, Sinube engaged Cryar in a very brief duel before disarming and knocking her unconscious with a single move. Tano and Sinube then returned to the Jedi Temple, where Sinube asked Tano to pass on what she had learned from the situation. Visiting a class of younglings being taught by Master Yoda, whom Sinube greeted as an old friend, he then watched as Tano informed the younglings of the importance of keeping their lightsaber with them at all times.\nFollowing their adventure, Sinube continued to take interest in and observe Tano's Jedi training. He later volunteered his astromech droid, M5-BZ, for a mission to infiltrate a Separatist dreadnought and steal an encryption module scrambling communications within the region. He also trained younglings in the Jedi arts at the temple on Coruscant, where they were present to see the fallen Padawan Barriss Offee duel Tano's master, Anakin Skywalker, who defeated Offee before Sinube and the younglings.\nBy 9 BBY, Sinube had been killed and was entombed at Fortress Inquisitorius, the headquarters of the Inquisitorius, on the water moon Nur. Whilst infiltrating the base to rescue Princess Leia Organa, Kenobi found himself in the tomb, where he was horrified to discover the corpses of Sinube and many other murdered fellow Jedi. After informing former Imperial officer Tala Durith about the tomb, Kenobi ran from it to continue his mission.\nSinube was the owner of M5-BZ, and wielded a lightsaber with a very light blue blade that could also be used as a cane.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tera_Sinube",
  "/wiki/Tera_Sinube/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Tera_Sinube",
  "/wiki/Special:Upload",
  "/wiki/Cosia",
  "/wiki/231_BBY",
  "/wiki/9_BBY",
  "/wiki/Cosian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Zang_Arraira",
  "/wiki/Jocasta_Nu",
  "/wiki/File:ThatIsTeraSinube-LL.ogg",
  "/wiki/Jedi_Master",
  "/wiki/Marshal",
  "/wiki/Jedi_outpost",
  "/wiki/Derra",
  "/wiki/High_Republic_Era",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Death",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Moon",
  "/wiki/Nur",
  "/wiki/Planet",
  "/wiki/Cyclor",
  "/wiki/Attack_on_Cyclor",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Stellan_Gios",
  "/wiki/Ikkrukkian",
  "/wiki/Porter_Engle",
  "/wiki/Drift",
  "/wiki/Jedi_Vector",
  "/wiki/Jedi_investigator",
  "/wiki/Coruscant",
  "/wiki/Coruscant_Underworld",
  "/wiki/The_Force",
  "/wiki/Detective",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Naboo",
  "/wiki/Jedi_Initiate",
  "/wiki/Hawk-Bat_Clan",
  "/wiki/Arath_Tarrex",
  "/wiki/Sifo-Dyas",
  "/wiki/Dooku",
  "/wiki/Serenno",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Yula_Braylon",
  "/wiki/86_BBY",
  "/wiki/Padawan",
  "/wiki/Cere_Junda",
  "/wiki/Battle_for_Ontotho",
  "/wiki/Ontotho",
  "/wiki/Knighting_ceremony",
  "/wiki/Jedi_Knight",
  "/wiki/Katri",
  "/wiki/Raxus_Secundus",
  "/wiki/Clone_Wars",
  "/wiki/Ahsoka_Tano",
  "/wiki/Lightsaber",
  "/wiki/Bannamu",
  "/wiki/Spider_Arms_Hostel",
  "/wiki/Patrolian",
  "/wiki/Nack_Movers",
  "/wiki/Ione_Marcy",
  "/wiki/Terrelian_Jango_Jumper",
  "/wiki/Cassie_Cryar",
  "/wiki/Astromech_droid",
  "/wiki/M5-BZ",
  "/wiki/Jedi_training",
  "/wiki/Imperial_Palace",
  "/wiki/Barriss_Offee",
  "/wiki/Duel_at_the_Jedi_Temple",
  "/wiki/Anakin_Skywalker",
  "/wiki/Inquisitorius",
  "/wiki/Water",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Imperial_officer",
  "/wiki/Tala_Durith",
  "/wiki/Tera_Sinube%27s_lightsaber",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/Choices",
  "/wiki/Dooku:_Jedi_Lost",
  "/wiki/Dooku:_Jedi_Lost_(script)",
  "/wiki/Practice_Makes_Perfect_(episode)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Grievous_Intrigue",
  "/wiki/Lightsaber_Lost",
  "/wiki/Corruption_(episode)",
  "/wiki/The_Gathering_(episode)",
  "/wiki/Secret_Weapons",
  "/wiki/A_Sunny_Day_in_the_Void",
  "/wiki/Sabotage_(episode)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/The_Wrong_Jedi",
  "/wiki/Destiny_(episode)",
  "/wiki/The_Big_Bang",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_1",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_5",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Part_IV",
  "/wiki/Category:Audio_files_of_Tera_Sinube",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_12",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/June_13",
  "/wiki/2022",
  "/wiki/Template:KenobiDate",
  "/wiki/Poli_Dapatian",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/Reproduction",
  "/wiki/57_BBY",
  "/wiki/40_BBY",
  "/wiki/Time",
  "/wiki/Resolve_(episode)",
  "/wiki/Dave_Filoni",
  "/wiki/March_23",
  "/wiki/2011",
  "/wiki/File:DaveFiloniTCWLightsaber.png"
 ]
}