{
 "name": "Terec",
 "display_name": "Terec",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kotab",
      "Sagamore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kotabi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Non-binary"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Terec was a trans non-binary Kotabi Jedi Knight and the bond-twin of Ceret. Both twins were stationed at the Starlight Beacon space station during the High Republic Era. Their bond meant Ceret and Terec shared the same gestalt mind, frequently finishing each other's sentences even when not in the same room.\nTerec and Ceret joined Jedi Master Sskeer and Jedi Knight Keeve Trennis in traveling to the Kazlin system after Starlight received a scrambled distress signal from the system. Docking the T-1 shuttle with the wreckage of a ship, they began to search for survivors, donning rebreathers upon encountering gas that implied the Nihil had attacked the ship. Terec joined Master Sskeer as the group split up, Trennis and Ceret going towards the flight deck as Terec and Sskeer continued to search the ship. They were soon attacked by a lone Nihil marauder, who injured Terec before being killed by Sskeer. Sskeer managed to discover grain that pointed him in the direction of the planet Sedri Minor. Terec was treated by Trennis as Jedi Master Marshal Avar Kriss and Jedi Knight Vernestra Rwoh arrived. At the same time, Sskeer and Ceret went to Sedri Minor to investigate the source of the grain, but Ceret would go missing on Sedri Minor. Terec collapsed, declaring that they felt that Ceret was in pain. As Terec was supported by Rwoh, Kriss contacted Sskeer to learn what had happened.\nTerec developed an unexplainable condition and slipped into a delirious and uncontrolled state, spouting series of seemingly nonsensical phrases. Ceret had been taken under the control of the Drengir, a species of sentient amorphous plant-like creatures, and since Terec's mind was connected to Ceret's, Ceret was taken under the control of the Drengir too. After Avar Kriss left Sskeer alone with Terec, spores expelled out of Terec's mouth and into Sskeer's, bringing Sskeer under the Drengir's control too. Avar confronted the Drengir beneath the surface and freed Ceret from the Drengir's control, which freed Terec as well. Later, when the Hutt Cartel arrived on Sedri Minor, Terec joined Ceret in the fight against them and the two of them declared that they were whole once more.\nAfter the events on Sedri Minor, Terec assisted the Jedi and their new allies, the Hutts, in the assault on Mulita against the Drengir, and their leader the Great Progenitor. The assault was successful, and the Progenitor was defeated, but at the same time the Valo Republic Fair had been devastated by the group of marauders known as the Nihil.\nIn the aftermath of the attack, Terec agreed to go undercover within the Nihil alongside Trennis. Terec would be able to give the Jedi updates on what was happening through their connection with Ceret. However, Terec and Trennis's identities were discovered. To make matters worse, Nihil Tempest Runner Lourna Dee arrived to confront them. She unleashed the Great Leveler on Terec, causing them to start to turn to stone. But their connection to Ceret saved them, and instead of being turned to stone and killed, both Terec and Ceret were sent into a hibernation trance.\nMonths later, during the Destruction of Starlight Beacon, Keeve Trennis made it her mission to rescue Terec and Ceret from the station, as they were still in the healing chamber. Trennis attempted to move their hoverbeds out of the station, but was almost thwarted by a hole that opened up an threatened to suck her out into space. However, Master Avar Kriss had activated her unique ability to create a network between Jedi using the Force to connect all of the surviving Jedi on Starlight Beacon. Terec and Ceret were able to connect to the network and were thus woken up from their hibernation trance, just in time to use the force to save Trennis. The three of them then escaped from the station in an escape pod and landed on the planet Eiram, where they met up with Kriss.\nTerec first appeared along with Ceret in The High Republic  2. A post on the Star Wars Instagram for International Transgender Day of Visibility in 2021 expanded upon Terec's in-universe pronouns to confirm that Terec and Ceret are both trans non-binary. The post included Javier Garrón's The High Republic  6 variant cover, part of the line of Pride Month variant covers for Marvel comic books to be released in June 2021, which feature LGBTQIA+ artists paired with LGBTQIA+ characters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kotab",
  "/wiki/Sagamore",
  "/wiki/Kotabi",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Knight",
  "/wiki/Bond-twins",
  "/wiki/Ceret",
  "/wiki/Twin",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_Master",
  "/wiki/Sskeer",
  "/wiki/Jedi",
  "/wiki/Keeve_Trennis",
  "/wiki/Kazlin_system",
  "/wiki/Distress_signal",
  "/wiki/System",
  "/wiki/T-1_shuttle_(Jedi_Order)",
  "/wiki/Breath_mask",
  "/wiki/Gas",
  "/wiki/Nihil",
  "/wiki/Sedri_Minor",
  "/wiki/Avar_Kriss",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Drengir",
  "/wiki/Sentience",
  "/wiki/Plant",
  "/wiki/Hutt_Cartel",
  "/wiki/Hutt",
  "/wiki/Assault_on_Mulita",
  "/wiki/Mulita",
  "/wiki/Great_Progenitor",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Tempest_Runner",
  "/wiki/Lourna_Dee",
  "/wiki/Great_Leveler",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Avar_Kriss%27s_network",
  "/wiki/Eiram",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Terec",
  "/wiki/The_High_Republic_(2021)_2",
  "/wiki/Star_Wars",
  "/wiki/2021",
  "/wiki/In-universe",
  "/wiki/Javier_Garr%C3%B3n",
  "/wiki/The_High_Republic_(2021)_6",
  "/wiki/Marvel_Comics",
  "/wiki/June",
  "/wiki/The_High_Republic_(2021)_3",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/The_High_Republic_(2021)_8",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_6",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic_(2021)_12",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic_(2021)_14",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/Category:Images_of_Terec",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ahsoka_Tano_and_Other_Force_Users",
  "/wiki/Accessories_and_Structures",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/March_31"
 ]
}