{
 "name": "Termo",
 "display_name": "Termo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Termo was an Imperial admiral during the Galactic Civil War. He was the commanding officer of the Imperial II-class Star Destroyer Liquidator in 0 ABY. His ship arrived in the Yavin system after the Death Star's attack on Yavin 4. He was later informed by the Emperor of the Death Star's destruction.\nAdmiral Termo was tasked with an assault on Delrakkin City on the planet of Delrakkin, using a task force of captured T-65 X-wing starfighters from the Rebel Alliance to frame the Alliance as an enemy of the galaxy rather than its savior. This attack failed when a Rebel pilot demolished this task force in his Y-wing, forcing the stragglers to retreat. Upon his capture, Termo personally attempted to interrogate the pilot, only to see his command ship destroyed as the daring pilot fought his way through the Liquidator and rigged it to explode.\nAdmiral Termo and his communications officer survived the blast by fleeing in an escape pod, but were left stranded in space as it was damaged by the Liquidator's explosion.\nThe male individual Termo served as an admiral in the Imperial Navy. His command ship was the Imperial II-class Star Destroyer Liquidator, which was stationed in the Delrakkin system. In 0 ABY, Termo was awaiting a transmission from Grand Moff Wilhuff Tarkin's Death Star, which by last reports was heading into the Yavin system to destroy the Alliance to Restore the Republic base located on the moon Yavin 4. The admiral was under strict instructions to wait in the Delrakkin system until further instructions were issued by Tarkin.\nWhen there was no word from the Yavin system, Termo grew concerned, and consulted quietly with Communications Officer Tix aboard the Liquidator's bridge. Tix confirmed that there were no communications, and Termo, observing a storm on Delrakkin below, wondered whether any atmospheric disturbance could have interrupted the transmission. According to Tix, the Star Destroyer's range from the planet would prevent there from being such an issue. Speculating that some unknown fate had befallen Tarkin, Termo had Captain Skeezer report to the Liquidator's forward launch bay and prepare to investigate what had transpired at Yavin.\nSkeezer was to take his modified and downsized Carrack-class light cruiser to the Yavin system, determine what had happened to the Death Star, and deal with any issues accordingly before returning. Termo appraised the captain of the fact that they had completely lost contact with Tarkin, and he forbade Skeezer from making any hyperspace communications with the Liquidator, lest the Alliance be monitoring transmissions.\nTermo was typically a figure of surety, to such a degree that his indecisiveness in the wake of Tarkin's missing instructions caused shock among staff such as Officer Tix. The admiral disliked having his officers speak without having first been spoken to, but was able to mask his anger with a calm tone of speech.\nTermo maintained a calm tone in times of crisis.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Liquidator_(Imperial_II-class)",
  "/wiki/0_ABY/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Delrakkin_City",
  "/wiki/Delrakkin/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/Delrakkin_system",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Yavin_system/Legends",
  "/wiki/Great_Temple/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Communications_officer",
  "/wiki/Tix",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Skeezer",
  "/wiki/Carrack-class_light_cruiser/Legends",
  "/wiki/Star_Wars_Missions_1:_Assault_on_Yavin_Four",
  "/wiki/Star_Wars_Missions_2:_Escape_from_Thyferra",
  "/wiki/Star_Wars_Missions_3:_Attack_on_Delrakkin",
  "/wiki/Star_Wars_Missions_4:_Destroy_the_Liquidator",
  "/wiki/Star_Wars_Missions_17:_Darth_Vader%27s_Return",
  "/wiki/Star_Wars_Missions_18:_Rogue_Squadron_to_the_Rescue",
  "/wiki/Star_Wars_Missions_19:_Bounty_on_Bonadan",
  "/wiki/Star_Wars_Missions_20:_Total_Destruction"
 ]
}