{
 "name": "Terna-Gentu",
 "display_name": "Terna-Gentu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ahch-To"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lanai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "5:11"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray and white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Caretakers"
     ]
    }
   ]
  }
 ],
 "content": "Terna-Gentu lived on Temple Island on the planet Ahch-To and served as one of the Caretakers, a group consisting of all of the female Lanais on the island. In the year 34 ABY, she was washing clothing with another Lanai in the Jedi village when the scavenger Rey emerged from one of the village's stone huts, having just accidentally fired her blaster through the building's wall.\nTerna-Gentu was a Lanai female who lived in the Caretaker village on Temple Island on the planet Ahch-To. The group were responsible for the upkeep of the ancient Jedi village, which was inhabited by the Jedi Master Luke Skywalker.\nIn the year 34 ABY, the scavenger Rey traveled to Ahch-To to recruit Skywalker to the Resistance and receive training from him. After Skywalker reluctantly agreed to train Rey, the student began sleeping in one of the stone huts of the Jedi village. After seeing a vision of her adversary Kylo Ren, Rey accidentally blew a hole in the side of the hut and then emerged to find Terna-Gentu and the other Caretakers outside. While two of the other Lanais fussed over trying to repair the hut, Terna-Gentu and another Caretaker worked together to wash various items of clothing using a washstand, wash bucket and baleen-stripped washboard.\nTerna-Gentu had gray and white skin with blue eyes.\nTerna-Gentu wore a white habit which she covered with a work apron that she washed daily in sea water.\nTerna-Gentu first appeared in the film Star Wars: Episode VIII The Last Jedi, which was released on December 15, 2017. The character was not named in the film, but received identification in Star Wars: The Last Jedi: The Visual Dictionary, a reference book written by Pablo Hidalgo and released in conjunction with the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ahch-To",
  "/wiki/Lanai",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Caretakers",
  "/wiki/Temple_Island",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/34_ABY",
  "/wiki/Clothing",
  "/wiki/Jedi_village",
  "/wiki/Scavenger",
  "/wiki/Rey_Skywalker",
  "/wiki/Stone",
  "/wiki/Rey%27s_NN-14_blaster_pistol",
  "/wiki/Blaster",
  "/wiki/Caretaker_village",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Resistance",
  "/wiki/Sleep",
  "/wiki/Jedi",
  "/wiki/Force-bond",
  "/wiki/Ben_Solo",
  "/wiki/Eye",
  "/wiki/Standard_day",
  "/wiki/Ocean",
  "/wiki/Water",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/December_15",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Last_Jedi:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Saga_of_Rey",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/StarWars.com"
 ]
}