{
 "name": "Teroenza",
 "display_name": "Teroenza",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ylesia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Ylesia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "t'landa Til"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Besadii"
     ]
    }
   ]
  }
 ],
 "content": "Teroenza was a male t'landa Til who served as High Priest on Ylesia and worked for the Besadii Hutt clan. Like all male t'landa Til, he was able to produce a \"pleasure wave\" termed Exultation.\nTeroenza enjoyed collecting rare antiquities and was very proud of his extensive collection on Ylesia, which was raided by Han Solo and Bria Tharen during their escape from the planet. Teroenza believed himself to be rightful ruler of Ylesia, yet still he had to answer to Zavval, his Hutt overlord. It would take him nearly four years to reassemble his collection.\nInfuriated at his embarrassment and fall from grace because of Han Solo—whom he had previously believed to be Vykk Draygo—Teroenza posted a massive bounty on Solo's head. Aruk Besadii Aora, clan leader of Besadii, was appalled at the astronomical bounty and quickly cancelled it. This occurred multiple times and proved very frustrating for Teroenza, who believed that his ability to govern Ylesia justified his decisions. After Solo's escape and the death of the Hutt overlord, Kibbick the Hutt was sent as his replacement. This proved even more frustrating for Teroenza, for Kibbick was as stupid as they come.\nWhen Jabba Desilijic Tiure and his uncle/aunt Jiliac Desilijic Tiron began plotting against the Besadii clan, they contacted Teroenza. Jiliac had discovered an ultra-secret toxin that he/she wished to use against Aruk Besadii Aora, clan leader of Besadii. Teroenza had discovered that Aruk developed a taste for Ylesian tree frogs, and devised a means to intoxicate them with Jiliac's poison. Many months passed after Aruk's death before his son, Durga Besadii Tai, was able to trace it back to Teroenza. Even so, that was with the assistance of Black Sun.\nFurious at Teroenza's treachery, Durga spared no expense and hired Boba Fett to kill Teroenza. Teroenza made his final bid for power and allegiance to Jabba and Jiliac by murdering Kibbick. When the Rebel Alliance attacked Ylesia to free the slaves, Bria Tharen and Han Solo encountered Teroenza, who wished for nothing more than to see his foilers die in agony. It seemed that his wish was about to come true with the sudden arrival of Boba Fett.\nUnfortunately for Teroenza, killing Solo and Tharen was not Fett's goal. Informing Teroenza of Durga's even bigger bounty—on Teroenza—Boba Fett leveled his rifle at Teroenza's head and pulled the trigger, shooting him through the left eye. Fett removed Teroenza's cranial horn as proof and returned to Durga for the bounty.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Teroenza",
  "/wiki/Ylesia/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/T%27landa_Til",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Besadii/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Exultation",
  "/wiki/Han_Solo/Legends",
  "/wiki/Bria_Tharen",
  "/wiki/Zavval",
  "/wiki/Vykk_Draygo",
  "/wiki/Aruk_Besadii_Aora",
  "/wiki/Kibbick",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Jiliac_Desilijic_Tiron",
  "/wiki/Durga_Besadii_Tai",
  "/wiki/Black_Sun/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/The_Paradise_Snare",
  "/wiki/The_Hutt_Gambit",
  "/wiki/Rebel_Dawn",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Aurra_Sing:_Dawn_of_the_Bounty_Hunters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_35",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}