{
 "name": "Teroj_Kee",
 "display_name": "Teroj Kee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keteerian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Teroj Kee was a Keteerian male who claimed to work for the Mining Guild but was an agent of the First Order. Prior to the First Order's occupation of the Colossus, Teroj attempted to steal a phase connector from Flix and Orka but was stopped by the Resistance spy Kazuda Xiono.\nTeroj Kee was a criminal who had been trying to steal from Flix and Orka, the owners of the Office of Acquisitions aboard the Colossus. He also sometimes posed as a member of the Mining Guild. Prior to the First Order's occupation of the Colossus, Teroj came into the service of the First Order. Commander Pyre and Captain Phasma tasked Teroj with stealing a phase connector from Flix and Orka. The First Order wanted to use it for mining dedlanite and blowing asteroids and planetoids open.\nMonitoring Flix and Orka's communications, Teroj took advantage of Flix and Orka's visit offworld to obtain the phase connector. Flix and Orka had left the undercover Resistance spy Kazuda Xiono and the BB-series astromech droid BB-8 to look after his shop. Posing as a member of the Mining Guild, Teroj tried to buy the phase connector. However, Kaz found that Flix and Orka had already sold it to a mining company. Unaware of Teroj's true intentions, Kaz managed to \"placate\" Teroj by selling him three tool kits, ten lenses, and a crate of connector rods.\nTeroj lured Kaz into a container crate in the Colossus' loading docks, which was scheduled to be dumped into the sea. Teroj then went back to the Office of Acquisitions to obtain the phase connector. However, he encountered resistance from BB-8. Following a fight, Teroj managed to trap the droid under a cupboard. He then headed back to his Darius G-class freighter with his phase connector. However, Kaz, who had been alerted by BB-8 followed him aboard his ship with Flix and Orka's pet gorg Bitey.\nAboard the freighter, Teroj met up with three First Order stormtroopers and departed from the port. However, Kaz managed to prevent Teroj's freighter from leaving offworld with the phase connector by sabotaging the ship's power couplings and engines, causing it crash into the sea. Teroj and two of the stormtroopers managed to escape in escape pods as did Kaz and Bitey. Teroj contacted a displeased Commander Pyre, who informed him that Captain Phasma would not be pleased and ordered Teroj to report back at once.\nXiono subsequently related his encounter with Teroj to Flix and Orka, who were familiar with the criminal. Kaz later reported the First Order's interest in the phase connector to the Resistance.\nTeroj Kee was a male Keteerian criminal who worked as a spy for the First Order. He was deceptive and manipulative, tricking Xiono into entering a cargo container. Orka regarded Teroj as a \"slimy womp rat\" who threatened their business operations. Teroj could also fight and managed to trap BB-8 under a cupboard.\nTeroj Kee first appeared in \"Dangerous Business,\" a 2019 episode of the first season of the animated television series Star Wars Resistance. In the episode, he was voiced by John Ennis.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Keteerian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/First_Order",
  "/wiki/Mining_Guild",
  "/wiki/Agent",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Colossus",
  "/wiki/Theft_of_the_phase_connector",
  "/wiki/Phase_connector",
  "/wiki/Flix",
  "/wiki/Orka",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Kazuda_Xiono",
  "/wiki/Office_of_Acquisitions",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/Captain",
  "/wiki/Phasma",
  "/wiki/Asteroid",
  "/wiki/Planetoid",
  "/wiki/BB-series_astromech_droid",
  "/wiki/BB-8",
  "/wiki/Darius_G-class_freighter",
  "/wiki/Gorg",
  "/wiki/Bitey",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Escape_pod",
  "/wiki/Dangerous_Business",
  "/wiki/2019",
  "/wiki/Star_Wars_Resistance_Season_One",
  "/wiki/Star_Wars_Resistance",
  "/wiki/John_Ennis",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_First_Order",
  "/wiki/Databank_(website)"
 ]
}