{
 "name": "Terpfen",
 "display_name": "Terpfen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Terpfen was a Mon Calamari ship mechanic, who served as the personal mechanic of Admiral Ackbar.\nTerpfen was named after a species of coral indigenous to his homeworld.\nTerpfen became an Imperial slave with many of his fellow Mon Calamari and was forced to design and perfect Star Destroyers. He had also been brainwashed by Imperial forces on Carida who replaced half his brain with organic implants and forced to live life as a sleeper agent when he returned to the New Republic. He managed to sabotage Admiral Ackbar's personal B-wing shuttle, which caused the craft to crash, nearly killing the admiral and his passenger, Leia Organa Solo. He also stole the coordinates for the location of Anoth and sent them to Ambassador Furgan.\nWhen Carida was destroyed by Kyp Durron, Terpfen was freed from Imperial control. He was desperate to confess to his sins, so he stole a B-wing starfighter from the Imperial Palace on Coruscant and flew to Yavin 4 to warn Leia Organa that Furgan was planning to capture her son, Anakin Solo. In this escape from Coruscant, Terpfen felt guilty when a pilot died trying to capture him.\nIt was during a rescue mission to Anoth that Ackbar learned of Terpfen's betrayal. Yet, Terpfen finally overcame the implants in his brain, helping save young Anakin Solo and killing Furgan. Ridden with guilt, he tried to send his Mountain Terrain Armored Transport walker over a cliff. Quick action by Ackbar prevented him from taking his life, who said his punishment would be to live.\nUpon returning to Coruscant, Ackbar spoke to Mon Mothma about how Terpfen had not been acting of his own accord due to Imperial brainwashing. Mon Mothma agreed with Ackbar's conclusions and granted Terpfen a full pardon.\nShortly after, Terpfen told Ackbar and Mon Mothma - who had been suffering from a mysterious and devastating illness over the past several months - that she was not actually suffering from a biological illness. Instead her rapid deterioration was due to poisoning, which was caused by self-replicating nano-destroyers that Furgan had personally infected her with.\nAdmiral Ackbar convinced Terpfen that he still had much service he could do for the New Republic and the galaxy. Terpfen agreed, deciding to return to Mon Calamari to help oversee the rebuilding efforts repairing damage inflicted by rogue admiral Daala.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/A/SF-01_B-wing_starfighter/Legends",
  "/wiki/Terpfen_(coral)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Carida/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Anoth/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Furgan",
  "/wiki/Kyp_Durron",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Anakin_Solo",
  "/wiki/Mountain_Terrain_Armored_Transport",
  "/wiki/Mon_Mothma/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/I,_Jedi",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_3",
  "/wiki/The_Official_Star_Wars_Fact_File_74",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}