{
 "name": "Ters_Sendon",
 "display_name": "Ters Sendon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Ters Sendon was a male Zabrak Jedi Master who was among the founding members of the Jedi Order.\nA Force-sensitive Zabrak, Ters Sendon was a Je'daii Master of the Je'daii Order who resided on Tython after the Despot War. A Master stationed at Kaleth, Sendon had discovered an ancient Kwa holocron in the depths of Kaleth's foundations, which he theorized predated the Tho Yor Arrival. Despite meditating on the holocron on several occasions, Sendon was never able to access it. In the wake of a cataclysmic Force Storm brought on by the arrival of Xesh on the planet in 25,793 BBY, Sendon found Je'daii Journeyer Tasha Ryo attempting to identify an alien skull found aboard Xesh's ship. Drawn to her because of her frustration, the pair delved into the underlevels of Kaleth to consult the Kwa holocron. Sendon watched as Ryo successfully activated the device and awakened its gatekeeper A'nang of the Kwa. Recounting the Kwa's history on Tython, A'nang's holocron analyzed the skull as Sendon requested but turned off after realizing it was that of a Rakata. Realizing its importance, Sendon and Ryo took the skull and the holocron to Akar Kesh to seek further guidance. In the chambers of Je'daii Temple Master Ketu, Sendon and Ryo turned over the holocron to Master Rajivari, a respected Je'daii and a holocron scholar. Asking the holocron for guidance, A'nang identified the skull as Rakatan and warned of the Je'daii that their world was in terrible peril if the Rakata were seeking them out. Realizing their danger, Master Ketu began planning to mobilize the Order's defenses in preparation of war.\nWhen the Infinite Empire launched its invasion of the Tython system, Sendon was never far from Tasha Ryo, who served the Order as one of its foremost seers. Stationed at Ryo Fortress on Shikaakwa, Sendon was with Ryo when she suffered from a form of psychic backlash; an attack perpetrated by the Empire. Blinded, both to the Force and natural vision, Ryo collapsed into Sendon's arms screaming that Xesh was behind the attack and that war would come to the Chasm and the areas around Anil Kesh. Escorting Ryo back to Tython despite her blindness to the Force, the pair remained at Anil Kesh to meditate on the holocron in hopes that it might offer guidance in the coming battle. Deep in meditation, the holocron began to crackle between the pair, becoming too much for Sendon to handle. Recoiling, the holocron's power exerted itself on Ryo and began to awaken Tython so that it might defend itself from the Rakata. Taking Ryo and the holocron to Anil Kesh's lowest level, as the battle raged around the facility, Sendon listened as A'nang detailed the requirements to activate the Tho Yor and weaponize them against the Rakata. Realizing that Ryo would not survive the process, he hoped to find another way but Ryo quieted his fears. Telling Ryo that he would miss her, Sendon allowed the young Je'daii Ranger to leap out into the void and activate the Tho Yor. Realizing that the Temple was in danger when Ryo's body dissolved in the pure Force energy emanating from the holocron, Sendon fled while ordering an evacuation of the facility.\nSome times after the defeat of the Rakata, the Force Wars ravaged Tython in different ways. Along with Masters Garon Jard, Rajivari, and Cala Brin, Sendon was one of the original founders of the Jedi Order. The chronicler of the Order, Sendon instilled within the Order his thoughtfulness towards the collection of knowledge and wished for the Order to be the guardians of the galaxy's wisdom. He was the most traveled of the founder, echoing his belief that to dispel ignorance and share understanding with others, a Jedi has to learn from others cultures. He recorded his testimony and that of his compatriots on devices that would eventually be forgotten on Tython as the Jedi abandoned the world at the conclusion of the war.\nMany millennia later, following the Great Galactic War and the resurgence of the Sith Empire, a hologram of Master Sendon was discovered on the ancestral Jedi homeworld Tython when the Order relocated from Coruscant. As well as recordings of Masters Brin and Jard, a hologram of Master Sendon was retrieved from the Tythonian Gnarls.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Je%27daii_Master",
  "/wiki/Tython/Legends",
  "/wiki/Despot_War",
  "/wiki/Kaleth",
  "/wiki/Kwa",
  "/wiki/Holocron/Legends",
  "/wiki/Tho_Yor_Arrival",
  "/wiki/Force_Storm_(Tython)",
  "/wiki/Tau_(individual)",
  "/wiki/25,793_BBY",
  "/wiki/Je%27daii_Journeyer",
  "/wiki/Tasha_Ryo",
  "/wiki/Holocron_of_A%27nang",
  "/wiki/Gatekeeper",
  "/wiki/A%27nang",
  "/wiki/Rakata/Legends",
  "/wiki/Akar_Kesh",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Ketu",
  "/wiki/Rajivari",
  "/wiki/Infinite_Empire",
  "/wiki/Invasion_of_the_Tython_system",
  "/wiki/Seer",
  "/wiki/Ryo_Fortress",
  "/wiki/Shikaakwa",
  "/wiki/The_Chasm",
  "/wiki/Anil_Kesh",
  "/wiki/Tho_Yor",
  "/wiki/Force_Wars",
  "/wiki/Garon_Jard",
  "/wiki/Cala_Brin",
  "/wiki/The_galaxy/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/Teaching_hologram",
  "/wiki/Tythonian_Gnarls",
  "/wiki/Category:Images_of_Ters_Sendon",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_2",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_3",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_4",
  "/wiki/Dawn_of_the_Jedi:_Force_War_3",
  "/wiki/Dawn_of_the_Jedi:_Force_War_4",
  "/wiki/Dawn_of_the_Jedi:_Force_War_5",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}