{
 "name": "Teso_Broosh",
 "display_name": "Teso Broosh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy's officer corps",
      "Squadron Five",
      "Imperial Navy's officer corps",
      "Squadron Five"
     ]
    }
   ]
  }
 ],
 "content": "Teso Broosh was a human male TIE fighter pilot who held the rank of Second Lieutenant Commander in the Squadron Five within the 204th Imperial Fighter Wing of the Galactic Empire.\nBroosh was the leader of Squadron Five of Shadow Wing, appointed by Major Soran Keize. Keize approached Broosh while he was working on his TIE fighter and told him he was going to recommend that Broosh lead the rebuilt Squadron Five. He tried to decline the opportunity, saying he wasn't a natural leader and was afraid of the responsibility. Keize replied that he appreciated that Broosh viewed leadership as a duty and not a stepping stone to greater fame. Broosh claimed that other pilots might not want to follow him due to his reputation as surviving at the cost of his fellow pilots. Keize assured him that he was right man for the job and Broosh accepted the command.\nSix months later, he and his squadmates attacked a Rebel cell and managed to destroy all the enemies. He returned to the Star Destroyer Pursuer and told his squad they would be getting a new mission from Commander Shakara Nuress. When he was informed that Squadron Five would be flying escort duty on the mission to recover the Star Destroyer Celerity, he expressed his opinion that it seemed strange. Nuress told Broosh that she was worried that a disabled Star Destroyer was an easy target and wanted to make sure the rescue mission was well protected.\nWhile en route onboard the Summit, he and Lyttan Dree shared a drink and discussed the rumor that Broosh was the kind of leader that sacrificed his pilots to save himself. Broosh told Dree that he was like any other TIE fighter pilot and had only survived as long as he had due to luck. As they approached the Kudo system, Broosh conversed with the captain of the Summit about the upcoming mission. The captain was worried that they were under-staffed, but Broosh assured him that his squad would be ready. After entering the Kudo system, Broosh and the other pilots deployed from the carrier and started to approach the Celerity. Before they could get close, the carrier was disabled by an ion blast from the Star Destroyer, and Squadron Five was engaged by the TIE fighters from the Star Destroyer.\nBroosh ordered the squadron to execute a fell swoop formation and protect the carrier. As the battle raged around them, Broosh told his pilots to concentrate on staying alive. When the Celerity demanded that the carrier surrender and allow itself to be boarded, the captain of the ship refused. Broosh warned the captain that his squadron would be unable to protect the carrier if it was attacked. The captain ignored the information and attempted to jump to hyperspace and was destroyed. After the elimination of their carrier, Broosh broadcast their surrender to the attacking forces, much to the surprise of his squadmates. He flew to the Imperial mining operation on Kudo and was met by a group of stormtroopers. They escorted him to meet Gratloe.\nWhen Broosh was questioned by his pilots on what they should do, he told them to be quiet and see what Gratloe had to say. After Gratloe revealed his plan to secede from the Empire and offered to let the pilots join his group, Broosh requested some time to talk it over with his squadron. Once they were alone, he explained that while their mission was to protect the crew recovering the Celerity, with them killed, it fell to Squadron Five to finish the mission. He ordered Jeela Brebtin to produce her hidden weapons so they could break out of confinement. He tricked the stormtrooper guarding them to open the door and took his blaster when Brebtin disabled him.\nBroosh and his squadron made their way to their TIEs, but found they were locked out of them by Gratloe. Broosh revealed that he had built a backdoor code into his fighter. Before he could access his ship, his squadron was confronted by a group of stormtroopers. Instead of surrendering, Broosh talked to the leader of the group, and explained that it was unlikely that they would reap any of the benefits that Gratloe would get by leaving the Empire. He told them that if they assisted him, they would probably not be punished since it would be assumed they were just following orders. The leader agreed, and after disabling a Gratloe loyalist, he helped Squadron Five to regain access to their fighters. Once in space, he headed towards the Celerity.\nSquadron Five was intercepted by a group of TIE fighters, who let him know that they were loyal to the Empire and that a mutiny was taking place on the Star Destroyer in an effort to regain control of it. Before Broosh and his team could reach it, Lyttan Dree's ship was destroyed when a group of Rebel ships suddenly arrived. Broosh surmised that Gratloe had planned to cut a deal with the Rebel Alliance. In danger of being overwhelmed, Broosh made the decision to land on the Star Destroyer as quickly as possible. He, Brebtin, and Kahi were able to make it to safety. As soon as he disembarked from his fighter, he ordered the Star Destroyer to jump to hyperspace.\nBroosh was a skilled pilot and proficient with blasters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy%27s_officer_corps",
  "/wiki/Squadron_Five_(Shadow_Wing)",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Second_Lieutenant_Commander",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Major",
  "/wiki/Soran_Keize",
  "/wiki/Skirmish_with_a_Rebel_cell",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Star_Destroyer",
  "/wiki/Pursuer",
  "/wiki/Commander",
  "/wiki/Shakara_Nuress",
  "/wiki/Celerity",
  "/wiki/Summit",
  "/wiki/Lyttan_Dree",
  "/wiki/Kudo_system",
  "/wiki/Unidentified_Imperial_captain_(Summit)",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Fell_swoop_formation",
  "/wiki/Hyperspace",
  "/wiki/Unidentified_mining_facility",
  "/wiki/Kudo",
  "/wiki/Stormtrooper",
  "/wiki/Gratloe",
  "/wiki/Gratloe%27s_faction",
  "/wiki/Jeela_Brebtin",
  "/wiki/Blaster",
  "/wiki/TIE_Fighter_1",
  "/wiki/TIE_Fighter_2",
  "/wiki/TIE_Fighter_3",
  "/wiki/TIE_Fighter_4",
  "/wiki/TIE_Fighter_5",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Skystrike_Academy_Squadron_Pack"
 ]
}