{
 "name": "Tessek",
 "display_name": "Tessek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Cala"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Turquoise"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Salmon"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Tessek was a male Quarren who was an accountant for the Hutt crime lord Jabba Desilijic Tiure, as well as a patron of his, enjoying the decadent atmosphere of Jabba's Palace and frequenting parties there. A clever individual with good financial skills, Tessek approached his life in Jabba's employ with a highly calculating mind. He took advantage of his position as Jabba's bookkeeper to secretly embezzle money into his own accounts and plotted to assassinate his employer, aspiring to take over Jabba's vast criminal empire. Jabba was aware of Tessek's schemes, which were revealed to him by one of the B'omarr monks. Prior to serving Jabba, he was involved in galactic politics. The Empire's enslavement of his people caused him to go into hiding on Tatooine.\nTessek was a Quarren male from the planet Mon Cala who was involved in galactic politics until the Galactic Empire began to enslave his people. Because of this, the Quarren went into hiding on the desert planet Tatooine, where he put his financial skills to use for the Hutt gangsters found there, becoming employed as an accountant at the palace of the crime lord Jabba Desilijic Tiure. Behind his employer's back, Tessek embezzled funds from Jabba into a secret account, diverting money from the Hutt's many enterprises. He plotted to kill the crime lord and take over his criminal empire; although unbeknownst to the Quarren, Jabba had been informed of Tessek's plan by one of the B'omarr monks with whom the Hutt secretly conferred.\nAt some point between 19 BBY and 0 BBY, Tessek was part of the crowd in the Jabba's throne room when the Rodian Greedo returned from an unsuccessful mission to the planet Mygeeto. Greedo presented the lightsaber of Jedi Master Ki-Adi-Mundi as tribute to Jabba, which the Ithorian Dok-Ondar immediately offered to buy from Jabba. This caused Jabba to show leniency and spare Greedo rather then dropping the Rodian into the pit below the throne room where the crime lord kept his pet rancor, Pateesa.\nIn 0 BBY, Tessek was stood with the Askajian dancer Yarna d'al' Gargan in Jabba's throne room when the Hutt dropped an RA-7 protocol droid through a trap door into the rancor pit below the room. In 0 ABY, Tessek was again present in the throne room when the Sith Lord Darth Vader arrived and requested the services of bounty hunters in Jabba's employ. The Hutt then dismissed Tessek and the other court members present before beginning negotiations with the Sith.\nIn 3 ABY, Han Solo, a smuggler affiliated with the Alliance to Restore the Republic, was frozen in carbonite. The bounty hunter Boba Fett was tasked with delivering the frozen Solo to Jabba, who had placed a bounty on Solo's head. However, Fett failed in this task when the Crimson Dawn crime syndicate stole Solo from him, and so Jabba placed a bounty on Fett as well. Hoping to confront Jabba, Fett traveled to Jabba's Palace, where he passed Tessek and Jabba's pet minder Ree-Yees, walking together as he approached the palace.\nFett was greeted at the palace's entrance by Jabba's majordomo, Bib Fortuna, who explained the Hutt was not on Tatooine as he was attending the Crimson Dawn's auction for Solo. The majordomo then suggested the bounty hunter leave as a crowd, including Tessek and Ree-Yees, emerged behind him with their weapons aimed at the bounty hunter. Fett instead told the crowd that if they faced him then there was a chance they would die, and only for the sake of Fortuna. Silently, Tessek and the others in the crowd lowered their weapons and allowed Fett to enter the palace with Fortuna in order to see the invitation.\nSolo was eventually delivered to Jabba and put on display in his throne room, still frozen in carbonite. The smuggler's co-pilot, the Wookiee Chewbacca, began using a training space and remotes on the Rebel Alliance flagship, Home One, to plan a rescue for Solo and visualized fighting his way through Jabba's cronies as well as various bounty hunters. Tessek was among those he imagined encountering during a session of planning that was interrupted by the arrival of Qi'ra, head of the Crimson Dawn.\nIn 4 ABY, Tessek was stood with Fett in Jabba's throne room when the droids R2-D2 and C-3PO played a hologram of their master, Jedi Knight Luke Skywalker, for Jabba. In the message, Skywalker asked to bargain for Solo's freedom. The Jedi gifted the two droids to Jabba as a sign of good will, but the Hutt revealed he had no intention of negotiating, as he enjoyed displaying the frozen Solo on the throne room's wall.\nTessek later sat against a column in one of the throne room's booths during a performance of the song \"Jedi Rocks\" by the Max Rebo Band. When the band finished playing, Jabba ordered them to play the same song again, and they obliged. However, during the performance, Jabba tried to pull the enslaved dancer Oola closer to him, but she resisted his advances. This caused the Hutt to activate the throne room's trap door, dropping the dancer into the pit beneath his throne room. The music instantly stopped, and Tessek and other members of the court rushed forward from their seats in order to watch Oola's fate through a grate in the throne room floor. As the courtiers cheered and waved, the screaming dancer was devored by Pateesa.\nBefore the court could return to their seats, their attention was diverted by the sounds of blaster fire coming from the entryway to the throne room. Tessek and several others moved toward the sound of the noise, but stopped when Princess Leia Organa entered the room disguised as the bounty hunter Boushh with Chewbacca as her prisoner. Tessek back out of the way as Organa made her way to stand before Jabba, who was glad to see Chewbacca brought low before him and offered the promised twenty-five thousand credit bounty on the Wookiee. Organa demanded double that, and produced an active thermal detonator as incentive. Tessek fled for cover, as did many other court members, but Jabba simply laughed and counter offered thirty-five thousand credits, which Organa accepted. As Chewbacca was taken away to the palace dungeons, Tessek and the other caught members cautiously emerged from cover and the band soon resumed playing.\nOrgana's true objective in the palace was rescuing Solo, and later that night she crept back into the throne room while she believe the court was sleeping. Tessek was indeed slumbering in one of the room's booths next to Gargan, but Jabba and many other court members were instead hiding behind curtains waiting to ambush Organa, as Jabba had seen through her disguise. They allowed her to free Solo from the carbonite, but once Organa had removed her mask, Jabba revealed his trap and both Organa and Solo were captured. The court then celebrated their new prisoners late into the night.\nThe next morning, much of the court was sleeping off the night of partying, and Tessek slept with Gargan's head on his shoulder in one of the throne room's booths. While Jabba also slumbered, Skywalker arrived at the palace and mind tricked Fortuna in to bringing him to Jabba and waking the crime lord. Tessek and the other members of the court also awoke as Skywalker demanded that Jabba release Solo and Chewbacca, and the Quarren stood with Gargan as Jabba refused the Jedi's request. Skywalker then threatened Jabba with a blaster pistol, causing the Hutt to drop the Jedi into the rancor pit, along with the unlucky Gamorrean guard Jubnuk. The court eagerly gathered around the grating to watch another execution, but after Pateesa ate Jubnuk, the rancor was killed by the Jedi.\nTessek was still stood with Gargan when the outraged Jabba had Skywalker, Solo, and Chewbacca brought before him and sentenced the trio to be fed to the sarlacc that dwelt in the Great Pit of Carkoon. The pair then joined the crowd that followed the three prisoners as they were marched from the throne room. Tessek was then forced to accompany the Hutt on his sail barge, the Khetanna, in order to view the executions. During the journey, Tessek danced beside the musician Max Rebo as he played his red ball jett organ. Upon reaching the pit, Tessek stood beside Jabba as the Hutt gave the prisoners one last chance to beg for their lives then moved closer to the barge's shutters and laughed when Skywalker warned Jabba to release him and his allies or die.\nThings took a turn after Jabba ordered that Skywalker be put over the edge of the Bantha-II cargo skiff into the sarlacc below, as the Jedi leapt back aboard, now armed with his lightsaber, which had been launched to him by R2-D2. The Jedi began cutting down the guards around him as panic ensued onboard the barge, which only became worse when Organa smashed the control panel that operator the hold's shutters and plunged all on board into darkness. Tessek and the other court members ran around in blind panic as Organa strangled Jabba with her own chain, killing the Hutt before escaping onto the top deck. There she met up with Skywalker and fired the barge's deck cannon down into the vehicle before safely exiting with the Jedi as the barge exploded.\nTessek was a financially skilled and clever Quarren, who viewed the world of Jabba's palace with a clear and calculating mind. His loyalty to Jabba was a smokescreen to hide his desire to kill the Hutt, although the Quarren did not realize that Jabba probably knew of his schemes. The Quarren was however guilt ridden over embezzling from his employer and so was desperate to escape. He lived up to some of the worst qualities attributed to Quarren by others, who often viewed the species as untrustworthy schemers willing to take any advantage. The accountant stood 1.8 meters  tall and had orange skin and blue eyes.\nTessek wore white moisture-retaining robes with a white-lined gray cloak. He also wore a bronze-colored vand belt, gray gauntlets, and black shoes. He carried a blaster pistol and a polearm.\nTessek first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. In costume, the character stood 183 centimeters tall and was nicknamed \"Squid Head\" by designer Chris Walas, although it was also known as \"Squid Face\" or \"Squiddy\" on set. Maquettes of the creature's head and hands were created for the film and epoxy was used on areas of the final mask to make it look wet.\nTessek was portrayed by Gerald Home, one of nine mime artists who worked on the film. Originally the characters portrayed by the mime artists were supposed to have far more prominent roles in the palace, but due to the number of extras present, there ended up being no time or space for a lot of what they had intended to do. This meant that a lot of material that Home rehearsed with Claire Davenport, who portrayed Yarna d'al' Gargan, did not get used.\nWhile on set, Home's glass would sometimes steam up, causing him to worry that he would fall through the hole in the set that represented the rancor pit. Home acted drunk as Tessek while on the sail barge set, although this did not make it into the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tessek",
  "/wiki/Tessek/Legends",
  "/wiki/Mon_Cala",
  "/wiki/Quarren",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Accountant",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Currency",
  "/wiki/B%27omarr_Order",
  "/wiki/Planet",
  "/wiki/The_galaxy",
  "/wiki/Galactic_Empire",
  "/wiki/Slavery",
  "/wiki/Species",
  "/wiki/Desert",
  "/wiki/Tatooine",
  "/wiki/Gangster",
  "/wiki/Death",
  "/wiki/19_BBY",
  "/wiki/0_BBY",
  "/wiki/Throne",
  "/wiki/Rodian",
  "/wiki/Greedo",
  "/wiki/Mission_to_Mygeeto",
  "/wiki/Mygeeto",
  "/wiki/Ki-Adi-Mundi%27s_lightsaber",
  "/wiki/Jedi_Master",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Ithorian",
  "/wiki/Dok-Ondar",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Askajian",
  "/wiki/Yarna_d%27al%27_Gargan",
  "/wiki/RA-7_protocol_droid",
  "/wiki/0_ABY",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Bounty_hunter",
  "/wiki/Sith",
  "/wiki/3_ABY",
  "/wiki/Han_Solo",
  "/wiki/Smuggler",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Carbonite",
  "/wiki/Boba_Fett",
  "/wiki/Bounty",
  "/wiki/Crimson_Dawn",
  "/wiki/Buboicullaar",
  "/wiki/Ree-Yees",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Pilot",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Marksman-H_training_remote",
  "/wiki/Flagship",
  "/wiki/Home_One",
  "/wiki/Qi%27ra",
  "/wiki/4_ABY",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Hologram",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Max_Rebo_Band",
  "/wiki/Oola",
  "/wiki/Blaster",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boushh",
  "/wiki/Prisoner",
  "/wiki/Credit",
  "/wiki/Thermal_detonator",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Mind_trick",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Gamorrean",
  "/wiki/Security_guard",
  "/wiki/Jubnuk",
  "/wiki/Sarlacc",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Musician",
  "/wiki/Max_Rebo",
  "/wiki/Red_ball_jett_organ",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Foot",
  "/wiki/Eye",
  "/wiki/Water",
  "/wiki/Clothing",
  "/wiki/Cape",
  "/wiki/Bronze",
  "/wiki/Gauntlet",
  "/wiki/Blaster_pistol",
  "/wiki/Polearm",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Chris_Walas",
  "/wiki/Gerald_Home",
  "/wiki/Claire_Davenport",
  "/wiki/Bounty_Hunt",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/A_Vader_Family_Sithmas",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Databank_A-Z",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Gadgets_and_Gear",
  "/wiki/Star_Wars_Complete_Vehicles,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superlaser",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Superweapon",
  "/wiki/Death_Star",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Darth_Vader_(2015)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Battle_of_Yavin",
  "/wiki/Secret_mission_to_Geonosis",
  "/wiki/Darth_Vader_(2015)_4",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/Rebelscum.com",
  "/wiki/July_3",
  "/wiki/2011",
  "/wiki/December_1",
  "/wiki/2021",
  "/wiki/March_3",
  "/wiki/2016",
  "/wiki/July_5",
  "/wiki/June_18",
  "/wiki/2022"
 ]
}