{
 "name": "Tessa_Wylden",
 "display_name": "Tessa Wylden",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Tessa Wylden was a female accountant who worked for the Black Sun crime syndicate at the time of the Galactic Civil War.\nIn 1.5 years ABY, Garm Bel Iblis' aide Irenez was involved in fighting Black Sun on Corellia. She had identified Wylden as one of Black Sun's accountants on the planet and had her under surveillance for some time. Irenez then paid a spacer to track down Wylden and capture her. When the spacer found her, he killed the men guarding her and brought Wylden to Irenez in Coronet.\nWylden was questioned and revealed much information about Black Sun and its money streams. Her information revealed that the assassin Skazz had been hired to kill the head of CorSec and that the Empire had been selling weapons to Black Sun.\nTessa Wylden was a Non-Player Character  in Sony Online Entertainment's MMORPG Star Wars Galaxies. She was part of a mission given out by Irenez on Corellia that required the player to search out a place outside the city, kill the guards and then lead Wylden back to Irenez. In 2005 the NPCs Garm Bel Iblis and Irenez were removed from the game and the quest involving Wylden was therefore no longer available.\nDue to the way such quests were designed by the developers, the appearance, gender and species of the NPC are different each time a player runs the mission. Therefore there's no canonical description of the character's look and species, while her sex is mentioned by Irenez and therefore canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Irenez_(Twi%27lek)",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Accountant/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Skazz",
  "/wiki/Corellian_Security_Force",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sony"
 ]
}