{
 "name": "Teven_Gale",
 "display_name": "Teven Gale",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alderaan Flotilla"
     ]
    }
   ]
  }
 ],
 "content": "Teven Gale was a human male native of the planet Alderaan who survived his homeworld's destruction by the Galactic Empire in the year 0 BBY. He later joined the Alderaan Flotilla, a collection of starships housing the surviving Alderaanian population, and worked with Princess Leia Organa of Alderaan and the Rebel pilot Evaan Verlaine to lobby for the remains of the Death Star superweapon to be given to the flotilla. In 5 ABY, he attended a meeting to discuss the future of the flotilla, where an argument broke out about whether the flotilla should remain in the Alderaan system or resettle a new world. The argument was interrupted by the surprise arrival of the Death Star wreckage, which Gale hoped they could use to build a space station.\nTeven Gale was a male human who was native to the planet Alderaan. In the year 0 BBY, he survived the destruction of his homeworld by the Galactic Empire's Death Star superweapon. He later joined the Alderaan Flotilla, a group of starships established by Alderaanian Princess Leia Organa and Rebel pilot Evaan Verlaine to carry the surviving population of Alderaan.\nGale at some point began trying to have the New Republic give the wreckage of the Death Star to the Alderaan Flotilla. Organa and Verlaine then joined the effort and successfully organized the transfer of the wreckage.\nIn the year 5 ABY, Gale attended a meeting on board the Alderaanian escort frigate Sunflare within the flotilla, which was positioned amongst the remains of Alderaan in the Alderaan system. At the meeting, the flotilla's Regent Administrator Eglyn Valmor argued that they should remain in the Alderaan system, while the former teacher Icar Orliss and the diplomat Janis Pol claimed they should resettle on a new world. Gale tried to ignore the argument while staring out of one of the Sunflare's viewports but ended up joining in to defend Organa when she was criticized.\nThe argument was ended when communications officer Rickert Beagle alerted those present to the arrival of several New Republic vessels hauling the Death Star wreckage in the Alderaan system. All but Gale were surprised, as he had not shared the information about the wreckage with them, and he explained what was happening. Valmor suggested that they make a new space station from the wreckage, and Gale and Pol agreed, although Orliss was still not convinced.\nBy 5 ABY, Gale considered himself an old man and had come to believe that the galaxy was drifting into lawlessness, although he preferred that to the rule of the Galactic Empire. While in the Alderaan system aboard the flotilla, it made him sad to see the asteroids that made up the remains of his homeworld drifting into the perimeter shield that protected the flotilla's ships and breaking up even further on impact. He initially tried to tune out the argument over the flotilla's future while at the meeting, but became involved in order to sternly defend Organa's name, as she had done so much to aid the flotilla.\nTeven Gale first appeared in the novel Aftermath: Life Debt, which was written by Chuck Wendig and released released on July 12, 2016.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Alderaan",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alderaan_Flotilla",
  "/wiki/Planet",
  "/wiki/Homeworld",
  "/wiki/The_Disaster",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Starship",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Rebel_pilot",
  "/wiki/Evaan_Verlaine",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/5_ABY",
  "/wiki/Alderaan_system",
  "/wiki/Space_station",
  "/wiki/New_Republic",
  "/wiki/Alderaanian_escort_frigate",
  "/wiki/Sunflare",
  "/wiki/Regent_Administrator",
  "/wiki/Eglyn_Valmor",
  "/wiki/Star_system",
  "/wiki/Teacher",
  "/wiki/Icar_Orliss",
  "/wiki/Diplomat",
  "/wiki/Janis_Pol",
  "/wiki/Viewport",
  "/wiki/Communications_officer",
  "/wiki/Rickert_Beagle",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/The_galaxy",
  "/wiki/Asteroid",
  "/wiki/Deflector_shield",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Chuck_Wendig",
  "/wiki/July_12",
  "/wiki/2016",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall"
 ]
}