{
 "name": "Tey_How",
 "display_name": "Tey How",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "32 BBY; Vuutun Palaa",
      "Naboo system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mottled green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation",
      "Trade Federation fleet",
      "Trade Federation fleet"
     ]
    }
   ]
  }
 ],
 "content": "Tey How was a Neimoidian female who served as a battleship pilot for the Trade Federation during its blockade and subsequent invasion of the planet Naboo. During the initial blockade, How piloted the Federation flagship, the Saak'ak, and gave her superiors, Daultay Dofine and Nute Gunray, various reports and warnings concerning a pair of Jedi ambassadors from the Galactic Republic whom the Federation tried to kill aboard the vessel.\nAfter the Jedi escaped and the full invasion of Naboo began, How transferred to piloting the Droid Control Ship Vuutun Palaa. She activated the battle droid army deployed to fight the Gungan Grand Army during the Battle of Naboo but was killed when the child pilot Anakin Skywalker managed to fly an N-1 starfighter into the interior of the Vuutun Palaa and destroy its main reactor.\nThe Neimoidian female Tey How was a member of the Trade Federation during its blockade of the planet Naboo over a trade dispute in the year 32 BBY. She was stationed as the pilot of the Lucrehulk-class LH-3210 cargo freighter Saak'ak, which served as the flagship of the Trade Federation fleet under the command of Captain Daultay Dofine. How was seated in the navigation station on the bridge when the Jedi ambassadors Qui-Gon Jinn and Obi-Wan Kenobi arrived aboard the Saak'ak to negotiate the end of the blockade on the behalf of Supreme Chancellor Finis Valorum of the Galactic Republic.\nAfter Trade Federation Viceroy Nute Gunray tried to kill the Jedi using poisonous dioxis gas, a squad of OOM-series battle droids was sent to make sure they were dead. How reported to her superiors that contact had been lost with the squad after the battle droids were quickly destroyed by the Jedi. Panicked by the loss of the droids, Gunray ordered How to seal off the bridge and then to close the blast doors once Jinn started to cut through the bridge doors with his lightsaber. The Jedi were forced to cease their attempt to reach the bridge once a pair of droidekas attacked them, and How reported that they had moved into the ship's vents.\nAs the Jedi slipped aboard one of the Federation's landing craft and escaped the Saak'ak, How informed Gunray that they were receiving a transmission from Queen Padmé Amidala of Naboo on the surface below. After Amidala refused to give into the Federation's demands to surrender, droid forces were deployed to invade the surface of Naboo. How was then still present on the bridge when Gunray's master, the Sith Lord Darth Sidious, contacted him via hologram for an update on the invasion's progress, in which Gunray chose to avoid mentioning the escape of the two Jedi.\nAs the takeover of Naboo proceeded, How and Dofine transferred from the Saak'ak to the bridge of the Lucrehulk-class Battleship Vuutun Palaa. When the Gungan Grand Army gathered to oppose the Trade Federation's invasion in battle, Dofine ordered How to activate their droid army on the surface below. During the ensuing battle, the child Anakin Skywalker piloted an N-1 starfighter into the interior of the Vuutun Palaa and fired missiles into the vessel's main reactor.\nHow reported that the ship was losing power due to the apparent damage, but Dofine refused to believe anything had made it through the battleship's shields. However, the captain's confidence was misplaced, and the bridge erupted around them along with the rest of the ship, killing How and other members of the crew.\nTey How had mottled green skin.\nDuring the Invasion and Battle of Naboo, How wore a black-and-gray robe with a black mitre. She used a pair of data goggles and hand-operated data panels in the navigation station to control and pilot both the Saak'ak and the Vuutun Palaa.\nTey How was created for the prequel trilogy film Star Wars: Episode I The Phantom Menace, which was released on May 19, 1999. Her name is not spoken during the film but is listed in the credits. The character's voice was provided by two different actors, director George Lucas's daughter Amanda Lucas under the pseudonym \"Tyger\" and an uncredited Marc Silk. In the Star Wars Legends continuity, Tey How appeared prior to the release of The Phantom Menace in the film's novelization, which was written by Terry Brooks and released on April 21, 1999.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tey_How",
  "/wiki/Tey_How/Legends",
  "/wiki/32_BBY",
  "/wiki/Vuutun_Palaa",
  "/wiki/Naboo_system",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Trade_Federation",
  "/wiki/Trade_Federation_fleet",
  "/wiki/File:How-Ventilation.ogg",
  "/wiki/Battleship",
  "/wiki/Pilot",
  "/wiki/Blockade",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Planet",
  "/wiki/Naboo",
  "/wiki/Flagship",
  "/wiki/Saak%27ak",
  "/wiki/Daultay_Dofine",
  "/wiki/Nute_Gunray",
  "/wiki/Jedi",
  "/wiki/Ambassador",
  "/wiki/Galactic_Republic",
  "/wiki/Death",
  "/wiki/Starship",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Battle_droid",
  "/wiki/Trade_Federation_Droid_Army",
  "/wiki/Gungan_Grand_Army",
  "/wiki/Battle_of_Naboo",
  "/wiki/Youngling",
  "/wiki/Anakin_Skywalker",
  "/wiki/N-1_starfighter",
  "/wiki/Reactor",
  "/wiki/File:Gunray_and_How.ogg",
  "/wiki/Merchant",
  "/wiki/Standard_year",
  "/wiki/Lucrehulk-class_LH-3210_cargo_freighter",
  "/wiki/Commanding_officer",
  "/wiki/Captain",
  "/wiki/Astrogation",
  "/wiki/Bridge_(starship)",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Supreme_Chancellor",
  "/wiki/Finis_Valorum",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Poison",
  "/wiki/Dioxis",
  "/wiki/Gas",
  "/wiki/Squad",
  "/wiki/OOM-series_battle_droid",
  "/wiki/Droid",
  "/wiki/Blast_door",
  "/wiki/Qui-Gon_Jinn%27s_lightsaber",
  "/wiki/Droideka",
  "/wiki/File:How_and_Dofine.ogg",
  "/wiki/C-9979_landing_craft",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Hologram",
  "/wiki/B1-series_battle_droid",
  "/wiki/Army",
  "/wiki/Missile",
  "/wiki/Deflector_shield",
  "/wiki/Robe",
  "/wiki/Hat",
  "/wiki/Data_goggles",
  "/wiki/Limb",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/May_19",
  "/wiki/1999",
  "/wiki/George_Lucas",
  "/wiki/Amanda_Lucas",
  "/wiki/Marc_Silk",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Terry_Brooks",
  "/wiki/April_21",
  "/wiki/Category:Audio_files_of_Tey_How",
  "/wiki/Category:Images_of_Tey_How",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/William_Shakespeare%27s_The_Phantom_of_Menace:_Star_Wars_Part_the_First",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_30",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/General_Equipment_(I)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_Updated_and_Expanded_Edition",
  "/wiki/June_26",
  "/wiki/2018"
 ]
}