{
 "name": "Teyora_Rekab",
 "display_name": "Teyora Rekab",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ensolica"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Enso"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Teyora Rekab was a female Enso who purveyed hydroponic seeds and equipment during the Republic Classic era. She was the captain of her own starship, which her fellow Ensos crewed, and she used the vessel to ship hydroponics around the galaxy, including the planet Tatooine.\nTeyora Rekab hailed from the planet Ensolica—a cold world covered with tundra and ice. Like the rest of her people, she became an expert on the matter of plant hydroponics. During the Republic Classic era, Rekab was the captain of a starship, crewed by fellow Ensos. She and her crew made their living by selling hydroponics equipment and seeds. They regularly visited the arid world of Tatooine, where their customers were the local moisture farmers. While visiting the world, Rekab and her crew were forced to don rented coolth suits—the biological makeup of the Ensos made them abhorrent to the heat of Tatooine, and if exposed to the planet's twin suns, they would be susceptible to heat stroke. In 32 BBY, Rekab was present in Mos Espa around the time of Boonta's Eve.\nTeyora Rekab was a female Enso, a species of Near-Humans. In addition to providing herself and her crew with hired protective coolth suits, Rekab had the foresight to wear polarized goggles while visiting Tatooine, as the suit's bubble did not protect against the glare of the planet's twin suns. Rekab had blonde hair, blue eyes and light skin.\nThe character of Teyora Rekab first appeared in George Lucas's 1999 film, Star Wars: Episode I The Phantom Menace, as an unnamed background extra on the streets of Mos Espa. The character was later expanded upon and named by Nathan O'Keefe through StarWars.com's Hyperspace feature \"What's The Story?,\" published on the StarWars.com Databank on January 12, 2007.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Ensolica",
  "/wiki/Enso/Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Hydroponics/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Captain/Legends",
  "/wiki/Starship/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Water/Legends",
  "/wiki/Plant/Legends",
  "/wiki/Moisture_farmer/Legends",
  "/wiki/Coolth_suit",
  "/wiki/Binary_star/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Time/Legends",
  "/wiki/Boonta%27s_Eve",
  "/wiki/Species/Legends",
  "/wiki/Goggles/Legends",
  "/wiki/Star/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/George_Lucas",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Nathan_O%27Keefe",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Databank_(original)",
  "/wiki/January_12",
  "/wiki/2007",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}