{
 "name": "Thalassa_Tarkin",
 "display_name": "Thalassa Tarkin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "The wife of Grand Moff Wilhuff Tarkin, Lady Thalassa Tarkin was a Human female of the influential Motti family of Phelarion. Wilhuff Tarkin married Thalassa for power, not for love—he had an affair with Natasi Daala while he was still married. Thalassa Tarkin, however, remained supportive of her husband and the Empire, even after his death aboard the Death Star. She then headed a megonite moss operation on Phelarion, hoping to sell the megonite as ammunition for the Empire so that they might further work to crush the Rebellion. Just prior to the Thirteenth Imperial Diplomatic Conclave, for which Lady Tarkin was the host, Princess Leia Organa infiltrated Tarkin's slave operation and derailed the transaction of the megonite going to the Empire. Darth Vader, who was on Phelarion for the conclave, held Lady Tarkin personally responsible for the mishap.\nA member of the Motti family on Phelarion, the wealthy Lady Thalassa Tarkin was married to Imperial Governor Wilhuff Tarkin. Wilhuff Tarkin married her due to her powerful family connections, such as her cousin, Commander Conan Motti. In actuality, Wilhuff Tarkin did not love her; soon after their marriage, he instead began an affair with a young cadet on Carida, Natasi Daala.\nDespite the Governor's misgivings for his wife, the couple had one son named Garoche, who served as an admiral in the Imperial Navy. In 19 BBY, Garoche secretly defected to the Atoan system and aided in its insurgency against the Galactic Empire. The official reports read that he had gone missing and was later killed by Atoan natives. However, the real murderer was secretly Emperor Palpatine's right hand man, Darth Vader, who along with his master believed that Garoche's death would turn Governor Tarkin into a powerful, hate-driven ally that would show the Empire's enemies no mercy. Their plan succeeded.\nOn Governor Tarkin's homeworld of Eriadu in the post-Clone Wars era, the Tarkin family had earned a reputation as a force to be reckoned with. When members of the Nebula Front kidnapped Lady Tarkin's niece Shella Motti, the Tarkins hired agents to find the missing girl; Motti, however, hired their own agents to prevent her from having to go home to her family. In 5 BBY, when Lady Tarkin's brother-in-law Gideon Tarkin was killed during the Erhynradd Mutiny, his daughter Rivoche was invited to come live at the Tarkin estate; however, the teenage Rivoche frequently acted out in resentment, so Governor Tarkin had her sent to an exclusive preparatory academy on Clær.\nAround 1 BBY, Thalassa Tarkin and her spouse lived in an apartment on Coruscant. In that apartment, Thalassa learned of the existence of the Death Star, a moon-sized battlestation built by the Empire. Her husband explained to her that he had been given an new permanent assignment on the Death Star and showed her a hologram of that superweapon.\nWhile Grand Moff Tarkin was killed aboard the Death Star when it was destroyed by the Rebel Alliance, Imperial news agencies reported that he had died in a shuttle accident at the Tallaan shipyards. Lady Tarkin, however, knew the truth; she became obsessed with avenging his death by crushing the Rebellion. At Port Tarkin on Phelarion, she had a solid black monument constructed in his honor. The plaque on it read:\nLady Tarkin was the heiress of a mining industry for megonite moss on Phelarion, started by Lithio Motti centuries prior. Tarkin ran the business as an Imperial labor colony and used slaves to mine the explosive, heat-sensitive moss to develop ammunition for the Empire, to which she remained fanatically devoted, particularly for their dedication to destroying the Rebellion. Just prior to the Thirteenth Imperial Diplomatic Conclave, which Lady Tarkin was hosting, Princess Leia Organa became stranded on Phelarion. Mistaking her for a slave girl, Tarkin chose Organa, whom she called \"Lerna,\" as a servant to work at the conclave. After notifying an Imperial freighter to postpone its megonite pickup due to an explosion at the mine, Tarkin discovered that a large amount of megonite was not being accounted for and began to suspect thievery. Tarkin was then contacted by Darth Vader about the delay in landing, and he accused her of selling the megonite to the Rebel Alliance. Incensed, Tarkin set out to find whomever was stealing her megonite.\nTarkin returned to her private chambers after hearing a loud noise; there she found her servant Nardo dead from an explosion in her megonite display case. She nevertheless proceeded to her banquet hall to host the Imperial Diplomatic Conclave, for guests such as Shea Hublin, Chancellor Qua of the Zenox Star Cluster, the Most High Proctor of Thebeon 8, and Darth Vader himself. Tarkin had an embarrassing moment when she offered a drink to Vader, who reminded her that he neither ate nor drank. Vader grew impatient with Tarkin and again accused her of selling to the Rebels. His stormtroopers then discovered the crashed Rebel glider Organa had used for landing. When Tarkin spotted her servant girl Lerna and two other slaves fleeing the scene, Vader recognized the girl as Princess Leia Organa. While Tarkin doubted the Rebels' chances of escaping the planet, Vader vowed to hold Tarkin personally responsible if Organa escaped. Ultimately, the Princess was able to make it offworld.\nThalassa Tarkin was a severe and stately woman who idolized her husband. Even though Wilhuff Tarkin's heart belonged to another woman, Lady Tarkin considered the man to be a martyr and a hero, and remained faithful to his cause. She took pride in her devotion to the Empire, and was highly offended when Darth Vader accused her of selling war matériel to the Rebellion. Tarkin was also paranoid, fearing that Rebels were everywhere, trying to kill her. Despite her paranoid nature, she never once suspected that her handmaiden Lehra was not only a Rebel agent, but in fact Princess Leia.\nLady Tarkin first appeared in Russ Manning's 1979 newspaper strip Princess Leia, Imperial Servant. Thirty years after her debut, she was given the first name of \"Thalassa\" by Nathan O'Keefe in his 2009 short story \"Tinker, Tailor, Soldier, Praji.\" Thalassa means \"Sea\" in Greek and was the name of a primordial sea goddess in Greek myth, as well as a moon of Neptune. O'Keefe chose the name due to it sounding \"cool and Star-Warsy,\" rather than for any thematic significance of its existing meanings.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Thalassa_(disambiguation)",
  "/wiki/Tarkin_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Motti_family",
  "/wiki/Phelarion",
  "/wiki/Marriage/Legends",
  "/wiki/Natasi_Daala",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Megonite_moss/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Thirteenth_Imperial_Diplomatic_Conclave",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Slavery/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Conan_Antonio_Motti/Legends",
  "/wiki/Cadet/Legends",
  "/wiki/Carida/Legends",
  "/wiki/Garoche_Tarkin",
  "/wiki/Admiral/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Atoan_system",
  "/wiki/Death/Legends",
  "/wiki/Atoan",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Eriadu/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Tarkin_family/Legends",
  "/wiki/Nebula_Front/Legends",
  "/wiki/Shella_Motti",
  "/wiki/5_BBY/Legends",
  "/wiki/Gideon_Tarkin",
  "/wiki/Erhynradd_Mutiny",
  "/wiki/Rivoche_Tarkin",
  "/wiki/Cl%C3%A6r",
  "/wiki/1_BBY/Legends",
  "/wiki/Wilhuff_Tarkin%27s_apartment",
  "/wiki/Coruscant/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Battlestation",
  "/wiki/Hologram/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Tallaani_Shipyards",
  "/wiki/Port_Tarkin",
  "/wiki/Lithio_Motti",
  "/wiki/Mining/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Nardo",
  "/wiki/Shea_Hublin",
  "/wiki/Qua",
  "/wiki/Zenox_Star_Cluster",
  "/wiki/Most_High_Proctor",
  "/wiki/Thebeon_8",
  "/wiki/Orgone_bubbler",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Gossamer_glider",
  "/wiki/Planet/Legends",
  "/wiki/Russ_Manning",
  "/wiki/1979",
  "/wiki/Star_Wars_(comic_strip)",
  "/wiki/Princess_Leia,_Imperial_Servant",
  "/wiki/Nathan_O%27Keefe",
  "/wiki/2009",
  "/wiki/Tinker,_Tailor,_Soldier,_Praji",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Magazine_11",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Star_Wars_Galaxy_Collector_3",
  "/wiki/Star_Wars_Insider",
  "/wiki/Shining_Stars",
  "/wiki/Star_Wars_Insider_52",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_31",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/Star_Wars_Annual_2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/Grand_Moff_Tarkin_(article)",
  "/wiki/Star_Wars_Insider_113",
  "/wiki/Databank_(original)",
  "/wiki/Legendary_Authors",
  "/wiki/Star_Wars_Insider_140",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2013_Topps_Star_Wars_Illustrated:_A_New_Hope",
  "/wiki/Star_Wars:_Darth_Vader_and_the_Lost_Command",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_Blogs"
 ]
}