{
 "name": "Thale_Dustrunner",
 "display_name": "Thale Dustrunner",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Thale Dustrunner was a Human male officer of the Corellian Security Force who lived on Corellia during the Galactic Civil War.\nBy the time following the Battle of Yavin, Thale Dustrunner was the CorSec captain assigned to Coronet City. He was involved in a CorSec investigation against the Hutt crime lord Borvo. During the investigation, Captain Dustrunner arrested the criminal known as Aldalad for buying illegal weapons to Borvo, and convinced him to testify against the Hutt.\nIn 1 ABY, the CorSec investigation against Borvo the Hutt came to an end when a spacer working for Borvo murdered the infiltrated CorSec agent Niksel Frangee on Naboo. During the six years in infiltration, all of Frangee's direct superiors had retired and been replaced. Thus, nobody in the CorSec knew how Frangee looked like at the moment of his death, the spacer used Frangee's CorSec badge to pass himself off as Frangee on Corellia. The spacer met Dustrunner in the Coronet Capitol and the CorSec officer completely fell for the ruse and took the spacer for the long lost agent. Captain Dustrunner ordered the \"agent\" to protect Aldalad, the witness who wanted to testify against Borvo, and Maerzen, who had discovered evidence against Borvo the Hutt. The spacer killed both of them in the Riverlands, without Dustrunner suspected anything. Thale Dustrunner then asked Borvo's spy to deliver the evidence against Borvo retrieved from Maerzen to evidence storage. The spacer just left Corellia with the evidence, including Borvo's confiscated money, and brought it back to Borvo's guard on Naboo. Because of Dustrunner's ineptitude, the CorSec lost both its witness and its evidence against Borvo, making impossible to continue any investigation. Humiliated, Thale Dustrunner later issued an arrest warrant for the spacer to Imperial authorities but the spacer escaped.\nThale Dustrunner was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Thale Dustrunner was present in the original release of the game, being part of Borvo the Hutt's questline. With the release of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005, Borvo the Hutt's questline was revamped. While the gameplay of the questline was extensively upgraded, the storyline remained similar.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gray",
  "/wiki/Brown",
  "/wiki/Corellian_Security_Force",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Borvo%27s_guard",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Borvo",
  "/wiki/Aldalad",
  "/wiki/1_ABY/Legends",
  "/wiki/Niksel_Frangee",
  "/wiki/Naboo/Legends",
  "/wiki/Coronet_Capitol",
  "/wiki/Maerzen",
  "/wiki/Riverlands",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}