{
 "name": "Thanis_Gul-Rah",
 "display_name": "Thanis Gul-Rah",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Army",
      "Imperial Army",
      "Qulok's Fist",
      "FarStar"
     ]
    }
   ]
  }
 ],
 "content": "Thanis Gul-Rah was a member of the bounty hunter organization known as Qulok's Fist. He was later a member of the crew of the FarStar during the hunt for Moff Kentor Sarne.\nGul-Rah was a member of the Imperial Army forces that occupied the planet Siluria III. During his service on the planet, he was one of the troopers involving in killing Kaiya Adrimetrum's husband.\nAfter leaving the Imperial Army, Gul-Rah hooked up with the bounty hunter group Qulok's Fist. Around 7 ABY, a hunt on a backwater world turned into a slaughter. Gul-Rah wasn't proud of his role in the massacre, and left the group, eventually retiring to the planet Kal'Shebbol to live a quiet life. He never revealed his reasons for leaving the gang.\nFollowing the New Republic liberation of Kal'Shebbol, a call went out for good starship crew and ground soldiers to crew the CR90 corvette FarStar. Gul-Rah dragged himself out of his usual cantina booth and joined up in an effort to repent for his past crimes.\nDuring his time on the FarStar, Gul-Rah often seemed regretful and solemn, but was always professional and took his job seriously. He took orders without question, and appeared stoic at all times.\nDue to his experiences on Siluria III, he was unswervingly loyal to Kaiya Adrimetrum. Gul-Rah never expected to serve under her, but saw it as fate's way of letting him atone for his past actions.\nGul-Rah knew of many atrocities committed by Sarne, and was after revenge - not for himself, but for the dead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Qulok%27s_Fist",
  "/wiki/FarStar",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Kentor_Sarne",
  "/wiki/Siluria_III",
  "/wiki/Kaiya_Adrimetrum",
  "/wiki/7_ABY/Legends",
  "/wiki/Kal%27Shebbol/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/The_DarkStryder_Campaign_(series)",
  "/wiki/Rogue_Elements",
  "/wiki/The_Kathol_Rift",
  "/wiki/Showdown_(RPG_adventure)",
  "/wiki/Endgame_(RPG_adventure)",
  "/wiki/Endgame",
  "/wiki/The_DarkStryder_Campaign",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}