{
 "name": "Thanaer_ke_Sekae",
 "display_name": "Thanaer ke Sekae",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Adumar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Thanaer ke Sekae was a male Human blastsword duelist from the planet Adumar. ke Sekae held the title of Lord pilot and later became the Cartann Ground Champion in 13 ABY after defeating the former champion Cheriss ke Hanadi, who went through several successive duels before engaging ke Sekae. After defeating ke Hanadi, ke Sekae was about to kill her to please the Perator of Cartann, whom ke Hanadi insulted before the duel, when New Republic pilot Wes Janson intervened and issued a challenge of his own.\nThe terms of the challenge were if ke Sekae killed ke Hanadi, Janson would not consent to fight him. This was considered a great insult in Adumari culture, as it meant the challenger was more interested in the conditions rather than the duel. But Janson managed to provoke ke Sekae into accepting it by playing on the new champion's pride.\nHaving minimal experience with a blastsword, Janson used the blastsword as a decoy and turned the duel into a fistfight, something the noble ke Sekae did not expect and had no experience. In the end, Janson dealt out significant physical damage to ke Sekae, leaving him defeated and utterly humiliated.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Adumar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Blastsword",
  "/wiki/Planet/Legends",
  "/wiki/Cartann_Ground_Champion",
  "/wiki/13_ABY/Legends",
  "/wiki/Cheriss_ke_Hanadi",
  "/wiki/Perator",
  "/wiki/Cartann",
  "/wiki/New_Republic/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/X-Wing:_Starfighters_of_Adumar",
  "/wiki/Wizards.com",
  "/wiki/Adumar:_Pilots_Wanted"
 ]
}