{
 "name": "Thannik",
 "display_name": "Thannik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Thannik was a male Human bounty hunter active during the Galactic Civil War. In the course of his career, he associated with smugglers, other bounty hunters, known Rebels, and other figures on the fringe of galactic society. A skilled and aggressive fighter, Thannik engaged the forces of the Galactic Empire in combat on several occasions. His protocol droid GT-9R and a pilot named Rhen frequently accompanied him on his adventures, including a visit to the Dancing Dewback cantina and a scheme to deliver blasters to the Rebel Alliance.\nThannik, a male Human, worked as a bounty hunter during the Galactic Civil War. Unlike many bounty hunters of the period, he was on friendly terms with the sort of people most hunters considered targets, including several smugglers and known Rebels. His adventuring companions included his protocol droid GT-9R and a pilot named Rhen.\nAccompanied by GT-9R, Rhen, the outlaw Dirk Harkness, and a child named Cev Rees, Thannik once visited the Dancing Dewback cantina to meet with a Devaronian contact. Thannik, though he appreciated the ambiance of the establishment, hung back with his droid to assess the situation, keeping an eye out for heavily armed patrons and a path for a quick exit. The rest of his companions, meanwhile, headed directly for the bar.\nThannik accompanied the same group, minus Harkness, during an attempt to smuggle several crates of blasters to the Rebel Alliance. In the course of this enterprise, they were followed by a group who claimed Thannik and his associates owed them money. These pursuers caught up with Thannik and his companions in an open-air market on a world with a bright blue sun. Three of them, led by a tall, cloaked Human, pulled their blasters on the group and demanded their money. Thannik opened fire, wounding the leader, and avoided the return fire. In the meantime, his companions fled to a nearby cantina, where they found themselves surrounded by more armed individuals.\nThannik was also associated with a pirate named Drebble, who once tried to hurriedly fix a power coupling on Thannik's ship in order to make a quick liftoff. Another known associate was a Rodian bounty hunter named Reeveid, who Thannik once met with in a cantina.\nWhile Thannik's battle experiences sometimes involved vehicular combat, such as attacking his foes with the laser cannon on a speeder bike or firing on a snowspeeder flying overhead, most of these experiences involved close, personal combat. He fought other bounty hunters on at least one occasion, switching from longer-range blaster fire to close combat with a vibro-ax in the course of the fight. Similarly, during a fight with a stormtrooper, Thannik began by using a vibroblade, but later switched to an unarmed attack—namely punching the stormtrooper right in the helmet. Thannik fought against stormtroopers on several different occasions, once stealing and wearing a suit of stormtrooper armor.\nThannik was stunned or wounded in battle several times. He was once nearly killed in battle and required four days' treatment in a bacta tank to recover from his wounds.\nIn combat, Thannik was aggressive, and not afraid to get into close contact with the enemy. He was comfortable in potentially dangerous places like the Dancing Dewback, where he looked forward to the possibility of a brawl breaking out. This contrasted with several of his companions, such as Rhen and GT-9R, who preferred to stay out of personal combat. On the other hand, he showed caution when entering dangerous situations, in contrast to someone like Cev Rees or Dirk Harkness who would walk right into cantinas without checking for danger first.\nLike most bounty hunters, Thannik was skilled at searching for hidden objects and individuals. In personal combat, Thannik was a crack shot with a blaster, especially with blaster pistols, and at avoiding blaster bolts and other weapons fire. He was a skilled light freighter pilot as well, especially when at the controls of Ghtroc Industries models. Thannik also displayed some general expertise on Wookiee-related subjects.\nThroughout his career, Thannik worked to sharpen his combat and his non-combat skills. As he gained experience, he became a fairly shrewd bargainer and more generally knowledgeable than he was as a rookie. He once upgraded his blaster skills by training with a marksman named Hist for a week. By the end of the week, Thannik had matched his teacher in skill.\nThannik, like many bounty hunters, had an extensive arsenal. He carried several blasters, including a heavy blaster pistol, a hold-out blaster, and a regular blaster pistol. He also used grenades, including thermal detonators, and melee weapons such as vibroblades, vibro-axes, and a pair of combat knives. Thannik protected himself in combat by wearing a protective vest, and carried two medpacs in case of emergency. A jetpack and about a thousand credits in cash completed Thannik's personal equipment.\nThannik owned an old Ghtroc Class 720 freighter, which he acquired second-hand. Though it was in rough shape when he bought it, some of his smuggler friends upgraded it for him. Acquiring this vessel put Thannik at least 5000 credits in debt to a loan shark on Celanon.\nThannik is a sample player character appearing in several game play examples in Bill Smith's 1996 roleplaying game book Star Wars: The Roleplaying Game, Second Edition, Revised and Expanded, published by West End Games. These include examples of group play, skill use, and character creation. Thannik's player \"Greg\" shares a name with WEG designers Greg Farshtey, Greg Costikyan, or Greg Gorden, while the gamemaster \"Bill\" shares his name with WEG writers Bill Smith and Bill Slavicsek. Thannik's game statistics are based on the rulebook's player character template for a Human bounty hunter.\nFor the most part, the rulebook examples featuring Thannik are rewritten versions of examples previously included in Smith's 1992 game book Star Wars: The Roleplaying Game, Second Edition. In these reused examples, Thannik replaces Tirog, another bounty hunter character played by Greg. As a result, Thannik's biography closely parallels Tirog's.s Two of Thannik's associates, GT-9R and Drebble, are companions of Tirog's in the previous rulebook.\nIn game play examples related to space combat, Thannik's associate Rhen flies a Class 720 freighter named Thannik's Thunder. In these examples, Rhen flies Thannik's Thunder in combat against pirates flying Z-95 Headhunters and against Imperial TIE fighters. In another game play example, Thannik's Thunder is captured by the tractor beams of an Imperial I-class Star Destroyer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition,_Revised_and_Expanded",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/GT-9R",
  "/wiki/Pilot/Legends",
  "/wiki/Rhen",
  "/wiki/Dancing_Dewback",
  "/wiki/Cantina/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Dirk_Harkness",
  "/wiki/Cev_Rees",
  "/wiki/Devaronian/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Star/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Drebble",
  "/wiki/Power_coupling/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Reeveid",
  "/wiki/Laser_cannon/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Vibro-ax/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Light_freighter/Legends",
  "/wiki/Ghtroc_Industries/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Hist",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Blast_vest",
  "/wiki/Medpac/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Class_720_freighter",
  "/wiki/Loan_shark",
  "/wiki/Celanon/Legends",
  "/wiki/Bill_Smith",
  "/wiki/1996",
  "/wiki/West_End_Games",
  "/wiki/Greg_Farshtey",
  "/wiki/Greg_Costikyan",
  "/wiki/Greg_Gorden",
  "/wiki/Bill_Slavicsek",
  "/wiki/1992",
  "/wiki/Star_Wars:_The_Roleplaying_Game,_Second_Edition",
  "/wiki/Tirog",
  "/wiki/Thannik%27s_Thunder",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends"
 ]
}