{
 "name": "Thanisson",
 "display_name": "Thanisson",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "34 ABY",
      "Finalizer",
      "Jakku system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "First Order Navy",
      "First Order Navy"
     ]
    }
   ]
  }
 ],
 "content": "Thanisson was a human male who served the First Order as a Petty Officer on board the Resurgent-class Star Destroyer Finalizer, the flagship of General Armitage Hux. While on the bridge he wore a black uniform marked with the First Order insignia, along with black boots and a intercomm headset. Thanisson had fair skin and blond hair.\nHe was present aboard the Finalizer during the raid on Jakku, and reported the theft of a TIE/sf space superiority fighter by the rogue stormtrooper FN-2187 and the Resistance pilot Poe Dameron. Dameron and Finn then fired upon the hangar command center where Thanisson was seated, flinging the petty officer from his chair amongst the shattered remnants of the window in front of him.\nThanisson was a human male who served in the military branch of the First Order during their conflict with the Resistance, an offshoot of the New Republic. In the year 34 ABY, Thanisson held the rank of petty officer and was stationed onboard the Resurgent-class Star Destroyer known as the Finalizer, where he was posted in the main control room for Hangar Six under Colonel Kaplan and Chief Petty Officer Nastia Unamo.\nThanisson was onboard the Finalizer when it traveled to the planet Jakku in search of the retired explorer Lor San Tekka, who held a piece of a map to the location of Jedi Master Luke Skywalker. After the First Order deployed forces to San Tekka's home village of Tuanul, the explorer was killed and the Resistance pilot Poe Dameron was captured; however, the map was spirited away by Dameron's astromech droid BB-8, whom the First Order failed to capture.\nDameron was brought on board the Finalizer for interrogation, but as the hunt for BB-8 began, the pilot was freed by FN-2187, a stormtrooper hoping to defect from the First Order. The trooper brought Dameron into Hangar Six under the pretense of escorting the prisoner and then hurriedly boarded one of the TIE/sf space superiority fighters in Bay Two of the hangar. When the pair attempted to take off, they discovered the starfighter's support cabling was still attached, preventing their escape and drawing the attention of Thanisson in the control room.\nThanisson immediately reported the unsanctioned departure to Colonel Kaplan, who ordered that the TIE be stopped from escaping while General Armitage Hux, head of the First Order's military, be alerted. Squads of stormtroopers carrying F-11D blaster rifles and FWMB-10 repeating blasters then attempted to shoot down the starfighter, but were unsuccessful as FN-2187 used the vehicle's Lb-14 dual heavy laser turret to blast many of them. The trooper then turned the turret on the control room, shattering the windows in an explosion and throwing Thanisson from his seat while Kaplan and the other officers present tried to cower away from the blast. Once Dameron managed to disconnect the support cabling, the fighter escaped from the Finalizer and headed for Jakku, but was shot down by the battlecruiser en route and crashed on the planet's surface.\nThanisson first appeared in the film Star Wars: Episode VII The Force Awakens, which was released in North America on December 18, 2015. He was not identified in the film, but received a name in the reference book Star Wars: The Force Awakens: The Visual Dictionary, which was written by Pablo Hidalgo and released in conjunction with the film.\nHe was played by British actor Thomas Brodie-Sangster, best known for his roles as the son of Liam Neeson's character in the 2003 film Love Actually, Jojen Reed on HBO's Game of Thrones, Newt in The Maze Runner films, and as the voice of Ferb Fletcher on Disney's Phineas and Ferb.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_73",
  "/wiki/Starship_Fact_File",
  "/wiki/34_ABY",
  "/wiki/Finalizer",
  "/wiki/Jakku_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/First_Order",
  "/wiki/First_Order_Navy",
  "/wiki/File:Kaplan_Thanisson.ogg",
  "/wiki/Petty_Officer",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Flagship",
  "/wiki/General",
  "/wiki/Armitage_Hux",
  "/wiki/Bridge_(starship)",
  "/wiki/Clothing",
  "/wiki/First_Order_insignia",
  "/wiki/Boot",
  "/wiki/Comlink",
  "/wiki/Headset",
  "/wiki/Hair",
  "/wiki/Attack_on_Tuanul",
  "/wiki/Jakku",
  "/wiki/Escape_from_the_Finalizer",
  "/wiki/TIE/sf_space_superiority_fighter",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Finn",
  "/wiki/Resistance",
  "/wiki/Pilot",
  "/wiki/Poe_Dameron",
  "/wiki/Hangar",
  "/wiki/First_Order_officer",
  "/wiki/First_Order_military",
  "/wiki/Cold_War",
  "/wiki/New_Republic",
  "/wiki/Standard_year",
  "/wiki/Hangar_Six",
  "/wiki/Colonel",
  "/wiki/Kaplan_(colonel)",
  "/wiki/Nastia_Unamo",
  "/wiki/Planet",
  "/wiki/Scout",
  "/wiki/Lor_San_Tekka",
  "/wiki/Map_to_Skywalker",
  "/wiki/Jedi_Master",
  "/wiki/Luke_Skywalker",
  "/wiki/Tuanul",
  "/wiki/Death",
  "/wiki/Resistance_pilot",
  "/wiki/Astromech_droid",
  "/wiki/BB-8",
  "/wiki/Torture",
  "/wiki/Trooper",
  "/wiki/Prisoner",
  "/wiki/Bay_Two",
  "/wiki/Starfighter",
  "/wiki/TIE_line",
  "/wiki/Squad",
  "/wiki/F-11D_blaster_rifle",
  "/wiki/FWMB-10_repeating_blaster",
  "/wiki/Lb-14_dual_heavy_laser_turret",
  "/wiki/Turret",
  "/wiki/Viewport",
  "/wiki/Battlecruiser",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/December_18",
  "/wiki/2015",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Thomas_Brodie-Sangster",
  "/wiki/Liam_Neeson",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_1",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars_Insider",
  "/wiki/50_Things_to_Notice_in_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars_Insider_165",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/First_Order_Conversion_Kit",
  "/wiki/Databank_(website)",
  "/wiki/Rey%27s_Survival_Guide",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Aftermath:_Life_Debt"
 ]
}