{
 "name": "Thara_Nyende",
 "display_name": "Thara Nyende",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Ninety-Seventh Stormtrooper Legion",
      "Imperial Ninety-Seventh Stormtrooper Legion"
     ]
    }
   ]
  }
 ],
 "content": "Thara Nyende was a human female stormtrooper hailing from the planet Sullust. Nyende's designation was SP-475 and she served in the Galactic Empire's Ninety-Seventh Stormtrooper Legion stationed on Sullust. When rebels infiltrated the city of Pinyumb, she captured the rebel Hazram Namir. When attempting to take him to the Imperial garrison, however, they were attacked by the rebel operative Nien Nunb, who saved Namir. During the Siege of Inyusu Tor, Nyende was in a hospital bed and attempted to keep the Sullustan staff from joining the local uprising. Her attempt made no difference, though, and Pinyumb was liberated from the Empire.\nThara Nyende was born on the planet Sullust and lived in its capital, Pinyumb. She helped fix things when she was a teenager. In 2 ABY, she enlisted to the Galactic Empire's Stormtrooper Corps. With the intention of helping her mother, uncle and cousins with the high pay, she trained up as a cadet and joined the ranks of the Imperial Ninety-Seventh Stormtrooper Legion, receiving the designation \"SP-475\". Nyende was paid twice as much as the most of the workers at Pinyumb. She sometimes donated supplies to the ones who visited her uncle's cantina.\nOn day, in 3 ABY, Nyende was delivering supplies to her uncle's cantina. After they were handed out, she drew closer to the holotable. She over heard several people talking about the Cobalt Laborers' Reformation Front, a protest group opposing the Empire on Sullust. As they quarreled on whether the group were right about their cause, another older Sullustan claimed the Empire had taken their freedom. Nyende decided to leave at this point and went to the Imperial garrison to put on her stormtrooper armor.\nAlmost three weeks later, Nyende was present for the inspection of her group of stormtroopers. After inspecting the troopers, the lieutenant briefed them on the Cobalt Front, whose protests had lost them eighty percent of their membership to Imperial custody. The lieutenant claimed there was now evidence that the group was trying to affiliate with the Alliance to Restore the Republic, an armed rebellion that was at war with the Empire. He listed several Alliance members with known ties to Sullust, including Nien Nunb, Sian Tevv and Corjentain Malaqua. As he began to explain the rebels' possible intentions, the lieutenant received reports through his ear piece about an attack. The garrisons alarms sounded and the lieutenant began briefing the stormtroopers on the new situation.\nWhile more experienced teams were to the Inyusu Tor mineral processing facility in response to the attack, an apparent sabotage, Nyende spent the day blocking streets and searching civilians. Raid warrants were issued by the Imperial Security Bureau in the afternoon. Upon signal, Nyende and many other stormtroopers surrounded certain areas and searched civilians. She did not find any weapons or bombs, only a black-market holovids and Cobalt Front pamphlets. Nyende was later assigned to sentry duty at a tram station with the stormtrooper SP-156. 156 asked her questions which she tried to respond to professionally, deeming them beneath regulations in her mind.\nOnce her shift was over, Nyende returned to her uncle with more supplies to donate out. The cantina was full of fearful civilians who the Security Bureau had forced out of their homes. Uneasy about this, Nyende handed over her bag of supplies and began to leave. As she left, though, she impulsively scanned the crowd for any suspicious items. She noticed fresh supplies that had not some from her. The thought of this made her fear that someone with better resources was supplying them.\nNyende reported the influx of supplies in the hands of the Sullustans she scanned. As a result her uncle was taken into custody a week later, but was not charged. Although he would be free eventually, Nyende still received bitter looks from his friends. In the two weeks since the attack, the Empire enacted anti-terrorism policies that heightened stormtrooper security in Pinyumb.\nFifteen days after the attack, the Security Bureau targeted a suspected rebel vessel. Nyende and SP-156 were among the twelve stormtroopers sent to board it. Swiftly, they entered the docking bay and surrounded their target, the VCX-150 freighter Keepsake. Nyende was the second among eight troopers to enter the starship. They then began searching the dozen rooms. The lead stormtrooper, SP-113, ordered all equipment to be locked down to ready the ship for forensic technicians.\n156 then stepped away from the group and inspected a conduit access panel across the corridor to them. He studied it for a moment, before bashing it off with his rifle, revealing a Chadra-Fan hiding inside the cramped compartment. 113 questioned it, demanding the whereabouts of Nien Nunb and the contacts of the Sullustan resistance. The Chadra-Fan claimed they were working alone and told 113 Nunb was in the city. 113 ordered him to be taken away, and Nyende stepped back to watch three stormtroopers move in to restrain the Chadra-Fan. Suddenly, the alien set off a detonator and set it off. Nyende hesitated to move and was barely able to spin around before the explosion sent her hurling down the boarding ramp.\nNyende was among the few who survived the explosion. She suffered headaches in the following days, but was cleared for light duty within two weeks. On her first day back, 113, who had also survived the incident, approached her in the armory. He looked through her records and told her to return to patrol sooner.\nShortly after, Nyende joined many more stormtroopers to oversee the arrival of a transport carrying Imperial reinforcements to Sullust. One of the maintenance crew claimed it was oversight for a production increase to make up for a rebel attack on the planet Mardona III. As Nyende watched the reinforcements pass her, a high pitched whine broke out in her helmet. Trying to make sense of her surroundings, she saw another trooper gesture behind her. She turned around and spotted a small cam droid. With her rifle, Nyende shot at it three times and it fell to the ground. Two stormtroopers inspected the small droid and 113 congratulated her for shooting it down.\nOver the next three weeks, Nyende worked ten hour shifts. More transports arrived carrying reinforcements and the processing facility was being overworked. The situation worsened however. An entire rebel company—the 61st Mobile Infantry—arrived at Sullust and attacked the facility, liberating it within twelve hours. Nyende was sent to patrol the mountain during the night.\nThe next day, Nyende was stationed in the security office of Pinyumb Transport Station Four. She briefly took off her helmet to chew a ration when more orders came through her comlink. The 61st's CR90 corvette, the Thunderstrike had returned to swiftly collect them. Nyende cramped into a cargo lift with twenty other stormtroopers and they rose to the surface to deal with the emergency. When they got out of the lift, TIE fighters had damaged the corvette. Nyende witnessed it plummet the other side of the mountain, erupting a large explosion.\nAs a result of the sudden rebel presence, Pinyumb was locked down and massive roundup began. On the second night after the rebels became stranded, they sent a scout party down to Pinyumb to make contact with the Sullustan resistance. Nyende soon responded to a skirmish in the streets of the city. Two rebel scouts were killed and another, named Hazram Namir, was knocked unconscious under rubble. Nyende's helmet was damaged by a stray shot. She then inspected the unconscious rebel, who had now been under the rubble for an hour, and decided to take him into custody.\nAs the stormtroopers took Namir away on a speeder, Nyende asked him to tell her what the rebels were planning. The rebel refused to answer, but before she could keep trying, another problem formed. Nunb, who was positioned on a roof, shot at the stormtroopers, quickly gunning one of them down. Namir bowled over Nyende's comrade and a barrage of blaster shots showered the speeder bed, injuring Nyende. The rebel then clambered out and ran towards Nunb, quickly disappearing.\nWithin minutes, a medical evacuation arrived and rushed Nyende to the garrison's emergency ward. There, she had her wound tended to and was soon taken to a civilian clinic the next day. Later that day, the Imperial garrison attacked the rebels at the processing facility. Medics at Nyende's clinic started talking about opening the clinic to the civilians again. Nyende climbed into her boots and collected her blaster. She left her bed and entered the corridor where she found that one of the medics was talking to Malaqua. She held them at gunpoint to keep them from conspiring with the rebel again.\nLate in the day, Nyende received news that the garrison had been flooded with lava. The rebels on the mountain had defeated the local forces. An uprising led by the Sullustan resistance and the Cobalt Front quickly liberated Pinyumb. Nyende surrendered to the rebels without resisting. Her uncle was finally released by the rebels and he used his cantina as a distribution point for donated supplies. Due to the amount of Imperial captives, Nyende was put to work under the supervision of another worker. She intended to rejoin the Stormtrooper Corps if the Empire returned, but hesitated when thinking about turning her rifle against the patrons at her uncle's cantina.\nThara Nyende was first appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed. According to Freed, in an interview with Daily Dot, Nyende was created from conversations with his editor and people at Disney during the outlining process, who had suggested implementing a \"ground level Imperial point-of-view.\" He described her as the only place the novel dug into the rank-and-file of the Empire, with mainly Imperial higher-ups being included aside from that. Freed also listed his intention to humanize stormtroopers through Nyende as well as dehumanize the Imperial hierarchy, who he claimed treated the stormtroopers like clone troopers in the fact the troopers were given numerical designations, like \"SP-475,\" and were always monitored.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sullust",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Ninety-Seventh_Stormtrooper_Legion",
  "/wiki/Stormtrooper",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Operating_number",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/City",
  "/wiki/Pinyumb",
  "/wiki/Hazram_Namir",
  "/wiki/Imperial_Garrison_(Sullust)",
  "/wiki/Nien_Nunb",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/Capital",
  "/wiki/2_ABY",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Thara_Nyende%27s_mother",
  "/wiki/Thara_Nyende%27s_uncle",
  "/wiki/Cadet",
  "/wiki/Cantina",
  "/wiki/Standard_day",
  "/wiki/3_ABY",
  "/wiki/Holotable",
  "/wiki/Cobalt_Laborers%27_Reformation_Front",
  "/wiki/Stormtrooper_armor",
  "/wiki/Standard_week",
  "/wiki/Lieutenant",
  "/wiki/Sian_Tevv",
  "/wiki/Corjentain_Malaqua",
  "/wiki/Inyusu_Tor_mineral_processing_facility",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Holovid",
  "/wiki/SP-156",
  "/wiki/VCX-150_freighter",
  "/wiki/Keepsake",
  "/wiki/Starship",
  "/wiki/SP-113",
  "/wiki/Unidentified_Chadra-Fan",
  "/wiki/Chadra-Fan",
  "/wiki/Alien",
  "/wiki/Detonator",
  "/wiki/Attack_on_Mardona_III",
  "/wiki/Mardona_III",
  "/wiki/Cam_droid",
  "/wiki/Standard_hour",
  "/wiki/Company",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Pinyumb_Transport_Station_Four",
  "/wiki/Ration_pack",
  "/wiki/Comlink",
  "/wiki/CR90_corvette",
  "/wiki/Thunderstrike",
  "/wiki/Turbolift",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Corvette",
  "/wiki/Standard_minute",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Clone_trooper",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Legion",
  "/wiki/March_11",
  "/wiki/September_3",
  "/wiki/2017"
 ]
}