{
 "name": "Thaum_Rystra",
 "display_name": "Thaum Rystra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "Around 68 Kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Alliance to Restore the Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Valik Kodank"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tol Skaros"
     ]
    }
   ]
  }
 ],
 "content": "Thaum Rystra was a male Human Dark Jedi who was active during the Galactic Civil War. As a child, Rystra's Force-sensitivity was discovered by the Galactic Empire and he was trained in the Force to serve the Empire's New Order. After slaying his parents at the behest of his Imperial masters, Rystra was horrified by his actions and abandoned the Empire to enlist in the anti-Imperial Rebel Alliance. While scouting an unmapped system on behalf of the Alliance, Rystra encountered the Sith spirit Valik Kodank and, enthralled by her offer of power, became Kodank's apprentice.\nIn 3 ABY, Kodank set in motion a scheme to restore her physical form and to that end she tasked Rystra with capturing Caeleb, a child strong in the Force, and acquiring the powerful dark side relic the Soulsaber. After an unsuccessful attempt to abduct Caeleb on the planet Dalicron-4, in 4 ABY Rystra kidnapped the child from a Rebel Alliance safe world and with Caeleb's assistance stole the Soulsaber from a hidden cavern on a remote Outer Rim world. Three years later, Rystra lured a group of New Republic agents to Kodank's Sith temple so that Kodank could attempt to possess the body Force adept Sha'lia. However, the operatives defeated Rystra and vanquished Kodank.\nThaum Rystra was a Force-sensitive male Human from the planet Alderaan who lived during the reign of the Galactic Empire. The son of a diplomat and his wife, during Rystra's childhood his family relocated regularly as his father was reassigned to better postings, resulting in an unusual upbringing. When Rystra was eight years old, his family moved to Coruscant, the Empire's capital world. Rystra's Force-sensitivity soon came to the Empire's attention and the Imperials earmarked him for training in the ways of the Force in service to the New Order. An advisor of the Imperial leader Emperor Palpatine informed Rystra's parents that their boy was to be taken away to undergo special training for gifted youngsters; despite his parents' protests Rystra was forcibly escorted away by the man and several Imperial stormtroopers, crying desperately at being parted from his family.\nDuring his subsequent training, Rystra was educated in the use of the Force and instilled with loyalty to the Empire. He was schooled in how to identify traitors to the regime and as final lesson he was dispatched to eliminate two individuals that had betrayed the Empire. Equipped with a lightsaber weapon, Rystra snuck into the residence of his targets at night whilst the pair were asleep. Striking the pair down in their bed with his blade, at the last moment Rystra activated a glowpanel and to his horror realized his targets to be his parents. Aghast at what a monster he had became, Rystra abandoned the Empire and fled in a stolen starship.\nSeeking to atone for his crimes and combat the Empire, Rystra determined to join the Rebel Alliance, an anti-Imperial insurgent group. After months of searching, he made contact with the Rebels and joined their cause. Rystra attained the rank of lieutenant and was teamed with several beings holding similar anti-Imperial views including a Force-sensitive Twi'lek. Uncomfortable in the presence of another Force user, Rystra eventually arranged a transfer from his unit to become a scout.\nOn his third assignment as a Rebel scout, Rystra was tasked with charting an unmapped star system in the Abrion sector containing the Tascollan Nebula. There, through the Force Rystra sensed the voice of the spirit of the ancient Sith adept Valik Kodank reaching out to him. Directed by her call, Rystra piloted his starship into the nebula to her location at the Temple of Pain, a Sith temple situated on an asteroid within the nebula's depths. After landing his vessel, awed by the strength of the Force in the temple and compelled by the dark side of the Force to press on, Rystra followed Kodank's voice deep inside the edifice. At the entry way to a large chamber, the spirit of Kodank manifested and spoke into Rystra's mind, claiming to know his desires and offering him power in the Force if he became her servant. Rystra accepted her offer and surrendered to the dark side.\nKodank promised to teach Rystra the ways of the Sith and under her tutelage he became a Dark Jedi and dark side adept. He took the Whiphid bounty hunter Tol Skaros as his own Dark Jedi apprentice and taught Skaros much about the dark side of the Force. The Whiphid demonstrated total loyalty to Rystra and in preparation for future conflicts with other Force users, Rystra instructed Skaros in the fighting techniques employed by the Jedi, a Force-wielding order outlawed by the Empire. Rystra also made contributions to Skaros' weapons arsenal.\nIn 3 ABY, Kodank tasked Rystra with bringing to her Caeleb, the prophesied \"Child of Light\", a being strong in the Force who the Sith spirit believed could help her to regain her physical form. Rystra tracked the child to the sparsely-populated planet Dalicron-4 in the Outer Rim and traveled to the world in an MRX-BR Pacifier scout vessel, landing his ship in the village Dalia. Skaros joined him in Dalia and over course of the next week, Rystra hung about in the township, posing as a down-on-his-luck freelance courier whose starship was in need of repair after coming under fire from pirates that mistook him for a spice smuggler. He got to know the locals and made the acquaintance of the farmer Corvin.\nRystra pinpointed Caeleb's location to a homestead several hours journey from Dalia and transmitted the co-ordinates to Skaros, contacting the Whiphid remotely via a hologram to provide him with orders to capture Caeleb and kill the child's guardians. The boy's parents were both Force-sensitive and Rystra reasoned that fighting them would provide Skaros good practice in combating other Force users. While Skaros made his way to Caeleb's homestead a group of Rebel agents arrived in Dalia on a mission to take the Child of Light into the custody of the Alliance. Rystra had not foreseen the Rebels' involvement and chose not to immediately move against them, instead seeking to observe their next steps. Rystra approached the Rebels in the inn Daz's Tavern and introduced himself and engaged then in idle conversation, maintaining his cover story that he was just a harmless courier.\nA storm broke out and Rystra suggested to the Rebel agents that they wait out the squall in the tavern with him, and he played a game of sabacc with some local residents while waiting for the storm to settle. The child Zanner, the seven year old son of Corvin, went missing during the storm and the farmer asked Rystra to help find the boy, believing the scout to be his best hope for bringing his son home. Rystra entreated the Rebels to join the effort to find Zanner and advised the search party to maintain caution despite the impetus to bring the boy to safety as quickly as possible. While Rystra escorted Corvin home, the Rebels successfully tracked down Zanner. The following day Rystra crossed paths with the Rebels again and cheerfully greeted them when they passed by their starship whist he was conducting repairs with a hydrospanner.\nLater that day, Skaros was killed by the Rebel agents as he attempted to apprehend Caeleb from the Child of Light's home. In the aftermath of the fight, Rystra observed from a distance via a pair of macrobinoculars the Rebels and the body of his fallen apprentice. His plan for capturing Caeleb frustrated, Rystra determined to follow the Rebels and seize the boy from them when an opportunity arose. He returned to Dalia and came across the Rebels as they headed to their ship leave the planet and launched his starship to follow the Rebels's vessel, the YT-1300 light freighter Lazy Katarn. Their path to leave was blocked by the Imperial Nebulon-B escort frigate Harasser, which arrived in the system and declared Dalicron-4 to be under Imperial quarantine. Keen to ensure that the Rebel ship was not targeted by the frigate and Caeleb killed, Rystra hailed both the Rebel freighter and the Imperial warship, announcing himself as a Rebel lieutenant that had placed the Lazy Katarn under his protection. He distracted the Imperials by launching four sensor decoys that projected hologram images of X-wing starfighters, and once the Rebel ship successfully fled into hyperspace he departed the system himself.\nCaeleb was hidden by the Rebel Alliance at a secure location on a safe world, but despite the Rebels' security measures Rystra tracked down the boy. He landed at Caeleb's hiding place and mind tricked the boy's protector, the Mon Calamari Kylbar, into believing Rystra to be Commander Luke Skywalker of the Alliance, then took charge of Caeleb and departed with the boy. With Caeleb now captured, Kodank sent Rystra to bring to her the Soulsaber, an ancient dark side relic that she planned to use in her scheme to regain her physical form. The Rebel team that Rystra had encountered on Dalicron-4 were sent by the Alliance to find the Dark Jedi and return Caeleb to the Alliance's safekeeping. For months, the Rebels unsuccessful searched for Rystra as he advanced his quest to locate the Soulsaber.\nIn 4 ABY, four months after the death of Tol Skaros on Dalicron-4, Rystra learned that the Temples of Vormijj, a complex of ancient Jedi temples on the planet Pamorjal, contained information concerning the location of the Soulsaber. As a ploy to shake the Rebel agents that were tailing him, Rystra made contact with representatives of the Pamorjal Freeman's League terrorist group, seeking to turn the League against the Rebels. Rystra traveled to the moon Nar Shaddaa to meet the group and landed in a private landing bay in a busy spaceport. Some gangsters approach the Dark Jedi and demanded tribute, however Rystra mind tricked a Barabel among their group into killing the other hoodlums, then used the Force to kill the Barabel. Rystra met with his contact in bar, warning them about the Rebel agents and informing them that Rystra would soon be venturing to Pamorjal. The information merchant Rat secret observed Rystra's meeting and provided details of the liaison to the Rebel agents.\nFollowing his arrival on Pamorjal, Rystra met with the Pamorjal Freemans League leader Davit Berek and provided him descriptions of the Rebel agents, falsely claiming them to be special agents of the corporation TaggeCo who sought to exploit Pamorjal's garna trees and investigate its temples. While keeping Caeleb closed to him, Rystra investigated the Temples of Vormijj and inside one of the temples discovered a star map showing the location of the Soulsaber, in the remote Outer Rim ZXK-100346 system.\nRystra progressed to the world ZXK-100346.6a and found the Cavern of Light, a large cave where the Soulsaber had been hidden by the Jedi millennia earlier. A barrier of light side Force surrounded artifact which could not be crossed by individuals tainted by the dark side. Rystra sent Caeleb to collect the relic and as just as the child fetched the relic to him he was confronted by the Rebel agents, who had evaded Rystra's attempt to turn the Pamorjal Freeman's League against them. Rystra urged the Rebels to join him, claiming that they had a common enemy in the Empire and that he had the means to defeat the Imperial regime A fight ensured and Rystra fled the cavern with the Soulsaber, leaving Caeleb behind with the Rebels. To delay the Rebels pursuit of him, the Dark Jedi used a thermal detonator to bring down the exit tunnel to the cave, then hurried to his ship and left the world.\nReturning to Kodank with the Soulsaber, Rystra spent the next three years studying under the Sith spirit's tutelage, growing his power in the dark side of the Force. He took up residence within Kodank's personal quarters in the Temple of Pain and gathered together a force of pirates to defend the temple. Rystra also studied a Sith holocron that Kodank kept at the temple. The Dark Jedi's training regimen from Kodank filled his head with so many thoughts that he faced difficulty sleeping, and his weariness left him increasing susceptible to the Sith spirit's influence. Rystra told his master about the Rebel agents that he had faced at the Cavern of Light and Kodank devised to regain her physical form by inhabiting the body of one of the Rebels, the Twi'lek Force adept Sha'lia.\nThe Sith spirit tasked her apprentice with undertaking research on how how she could safely inhabit Sha'lia and to that end Kodank versed him in the ways of Sith sorcery. From the temple's Room of Change laboratory, Rystra performed experiments in Sith alchemy and refined his technique, writing notes documenting his expanding knowledge. He developed many means of altering sentient beings, though his procedures frequently cost his subjects their sanity. Among those that he experimented on were four pirates of the pirate group that he had hired to defend the temple; he transformed the lekku of the Twi'lek Desvin Tor'thal into Sith poison stingers, augmented the claws of the Wookiee Blaschowwa and also altered the Bothan Kamtis Bonai and the Dug Vobin Sobos.\nCirca 7 ABY, Kodank ordered Rystra to put the next phase of their plan in motion and lure the Rebel agents, who were now servants of the Rebel Alliance's successor the New Republic, to the Temple of Pain. The group had been searching for Rystra since his heist of the Soulsaber and to lure them to the Tascollan Nebula he carefully supplied snippets of information regarding his location to various individuals in his employ. The New Republic agents followed the trail of evidence and flew to the nebula to confront Rystra. Upon their arrival, the Dark Jedi dispatched four pirate-operated starfighters to open on fire on the group's starship, the YT-2400 light freighter Celestial Dancer, as a test of how the team had grown in strength since his last encounter with them.\nThe crew of the Celestial Dancer evaded Rystra's pirates and landed at the Temple of Pain and as team progressed through the Sith stronghold, Kodank conjured an illusory version of Rystra to greet them. The phantom Rystra engaged the operatives in small talk and invited them to play a game of sabacc, distracting them while an explosion occurred which the phantom falsely claimed had destroyed the Celestial Dancer and all other starships in the temple. The apparition urged the group to progress on, advising that their only means of escape lay deeper in the stronghold. Rystra and his Sith mentor awaited the agents in a cavern far beneath the main structure of the temple and Kodank ordered him to treat all of the team other than Sha'lia as expendable.\nWhen the New Republic agents arrived in the cavern, Kodank and Rystra observed hidden from view as some Sith Guardian Spirits attacked the group. Once the operatives had vanquished the spirits, Rystra and his master revealed themselves and Rystra made a plea for that the group join forces with Kodank. The New Republic agents rejected his offer and Rystra and his mentor attacked the group, fighting alongside a mutated battle hydra summoned by Kodank while the Sith spirit attempted to possess Sha'lia. However, Rystra was defeated in the struggle and Kodank vanquished.\nThaum Rystra had blue eyes and thick, wavy black hair. He stood at 1.7 meters in height and weighed approximately 68 kilograms. Rystra was intelligent and adept at lying, and when he traveled to Dalicron-4 he was willing to play the part of a friendly traveler so as to maintain his cover. When not in the company of his master Valik Kodank, he carried himself in a cheery manner, his eyes sparking with life and sporting a contagious, crooked smile, akin to that of a Corellian.\nAs a child, Rystra had a close relationship with his parents, particularly his mother. Though he developed a loyalty to the Empire and an eagerness to bring justice to the Empire's enemies, he was horrified when the Empire had him murder his parents and he consequently turned his back on his Imperial masters. He came to see the Empire's New Order as evil and vowed to fight back against it, joining the Rebel Alliance as a means of repentance for his crime. His actions left him feeling uncomfortable when in the presence of a fellow Force user so he disliked working alongside a Force-sensitive Twi'lek during his early service to the Alliance. He requested a post as a Rebel scout as he felt that he needed some time alone and when his transfer request was approved, he was excited at the prospect of a role where he could provide valuable intelligence to Alliance without facing a constant reminder of his past sins.\nWhen Rystra was first lured to the Temple of Pain by Valik Kodank, he was impressed by how dark and cool the stronghold felt due to the dark side power radiating from the structure and he was overcame by a hunger for the Force like he had never experienced before. He became devoted to Kodank and was convinced that only she could bring stable government to the galaxy.\nRystra felt disappointed by the failure of Tol Skaros to capture Caeleb on Dalicron-4, though owing to his caution and patience he chose to allow the Rebel agents that had killed Skaros to leave the planet unhindered and to capture Caeleb at a later date. He was pragmatic and when confronted by the Rebels at the Cavern of Light though he threatened to kill Caeleb if the group tried to prevent him from taking the Soulsaber he did not plan to make good on his threat, reasoning that the boy's death would not gain him anything yet would make the Rebels more unrelenting in their pursuit of the darksider. Though he also did not seek to kill the Rebel agents, he was willing to do so if faced with no other option.\nDuring the three years following his recovery of the Soulsaber, Rystra visibly aged, gaining a tired look to his eyes, a graying of his hair and hard lines on his face. He fell increasingly under Kodank's control and lost control of many of his faculties and when the Rebel agents traveled to the Temple of Pain to confirm him, he sought to destroy them at all costs. Rystra had little regard for the New Republic, considering it to be too similar to its predecessor, the Old Republic, which had allowed the Empire to come to power.\nRystra was proficient in the use of the Force to grip and move objects, to travel stealthily, to affect the minds of others, to move with speed, to heal himself and to sense the world around him. He was also adept in wielding the Force powers battlemind, Enhance Ability and empathy.\nRystra was familiar with the fighting techniques used by the Jedi, in combat he was capable of using his Force prowess to levitate himself or others and to push over his opponents. Following his training from Kodank during the years following his theft of the Soulsaber, Rystra mastered the dark side powers of hatred and rage. He also became skilled in Sith sorcery and could physically alter other sentient beings, making them stronger, more robust and more relentless in combat, though frequently as the cost of his subjects' sanity.\nIn addition to Basic, Rystra was fluent in the language Ryl.\nRystra wielded an amethyst-colored lightsaber and a DL-44 blaster pistol, and he was also equipped a set of macrobiniculars, a comlink and some thermal detonators. He also carried a Sith masking amulet that concealed his Force presence from other Force users. As his means of transportation, Rystra operated an MRX-BR Pacifier, a fast and well-armed model of scouting vessel that possessed powerful sensor capabilities.\nThough Rystra possessed the robes of a Jedi and a cloak, he wore them infrequently so as to blend in with the galactic population. On his assignment to Dalicron-4, the Dark Jedi donned a dark green jumpsuit, a brown nerf hide vest and matching black nerf hide boots. During his confrontation with the New Republic agents at the Temple of Pain he wore dark-colored robes.\nThaum Rystra featured as one of the primary antagonists of the Child of Light saga, a trilogy of roleplaying adventures written by Lee Pickler and set within Star Wars Legends continuity that were published by RPGA. Rystra first appeared in Child of Light, the opening instalment of the trilogy, released in 2000. He featured again in the second adventure of the saga, Soulsaber, published in 2001 and the closing chapter of the trilogy, Light and Dark, released in 2002.\nAn inconsistency exists between Light and Dark and an outline of the Child of Light saga set out in Child of Light regarding Rystra's actions during his confrontation with the New Republic agents at the Temple of Pain. Child of Light states that in the final adventure of the saga Rystra attempts to resurrect Kodank by wielding the Soulsaber to convert Caeleb's Force energy into dark side energy to return her to life. In Light and Dark however, Caeleb does not appear and Rystra does not attempt to use the Soulsaber to resurrect Kodank, who instead tries to regain physical form by possessing Sha'lia. This article depicts Rystra's actions during the battle in accordance with the potrayal of those events set out in Light and Dark.\nIn the Child of Light saga, the players roleplay as the Rebel agents that Rystra encounters on Dalicron-4 and subsequently at the Cavern of Light and the Temple of Pain, and Rystra's actions can be influenced by the decisions of the players.\nIn Child of Light, the players can choose to wait out the storm that erupts on Dalicon-4 either in Daz's Tavern or in the players' starship. If the players choose to linger at Daz's tavern, when the child Zanner is reported missing Rystra approaches the Rebels in the inn to enlist them in the search for the missing boy. If the players wait in their starship, Rystra and Corvin approach the ship in the pouring rain and Rystra taps on the vessel with a hydrospanner to attract the group's attention, then requests to be invited aboard and asks for their assistance in the search for Zanner. He also proffers guidance on flying the starship in the stormy conditions. When the Rebels subsequently locate Zanner and find the child to be injured, either Rystra or Corvin insist that the group take the boy to the Ithorian doctor Aloor for treatment if the idea to do so does not occur to the players. Caeleb's sister Jhara is seriously injured by Tol Skaros when the Whiphid attempts to abduct the boy and if the players mention her condition to Rystra upon their return to Dalia with Caeleb, Rystra offers to assist her.\nDuring Soulsaber, if the player characters arrive at the Cavern of Light as Caeleb is retrieving the Soulsaber for Rystra, the Dark Jedi urges the child to speed up. If the Rebels try to convince Caeleb not to hand over the Soulsaber to Rystra, the darksider is angered and warns the player characters not to get involved. Rystra does not initiate combat with the Rebels but retaliates if attacked. When Rystra then moves to flee with the dark side relic various options are possible for how he can secure his escape. Rystra can alternately levitate Caeleb above a chasm and threaten to throw him over unless the Rebels allow the Dark Jedi to leave; mind trick the player characters with the Force into assisting him or loosing recognition of him; use the Force to knock the Rebels over; or use the Force to fly himself to safety.\nIn Light and Dark Rystra dispatches four pirate starfighters to harry the player characters on their approach to the Temple of Pain and if following combat any of the pirates attempt to flee, Rystra remotely detonates their starships. When Kodank casts an illusory version of Rystra to converse with the New Republic agents inside the temple, if the player characters attempt to fight him the phantom Rystra swings its lightsaber to deflect their attack and then disappears. Rystra and Kodank's battle with the player characters at the end of Light and Dark can also conclude in various ways; it is possible for Rystra to be defeated and killed and Kodank vanquished, or conversely for Rystra and his master to be victorious and for Kodank to successfully possess Sha'lia. If Kodank's spirit is destroyed, Rystra is stricken by grief and madly attacks the player characters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Valik_Kodank",
  "/wiki/Tol_Skaros",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Death/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Force_ghost",
  "/wiki/3_ABY/Legends",
  "/wiki/Caeleb",
  "/wiki/Dark_side_artifact",
  "/wiki/Soulsaber",
  "/wiki/Planet/Legends",
  "/wiki/Dalicron-4",
  "/wiki/4_ABY/Legends",
  "/wiki/Cavern_of_Light",
  "/wiki/ZXK-100346.6a",
  "/wiki/7_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Temple_of_Pain",
  "/wiki/Force_Adept",
  "/wiki/Sha%27lia",
  "/wiki/Diplomat/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Imperial_Advisor",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Sleeper_(furniture)",
  "/wiki/Glowpanel",
  "/wiki/Starship/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Abrion_sector/Legends",
  "/wiki/Tascollan_Nebula",
  "/wiki/Force_sense/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Nebula/Legends",
  "/wiki/Sith_Temple",
  "/wiki/Asteroid/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_side_adept",
  "/wiki/Whiphid/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/MRX-BR_Pacifier",
  "/wiki/Scout_vessel",
  "/wiki/Dalia_(township)",
  "/wiki/Standard_week/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Farmer/Legends",
  "/wiki/Corvin",
  "/wiki/Standard_hour/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Daz%27s_Tavern",
  "/wiki/Sabacc/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Hydrospanner/Legends",
  "/wiki/Macrobinoculars/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Lazy_Katarn",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Harasser",
  "/wiki/Frigate/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Sensor_decoy",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Kylbar",
  "/wiki/Commander/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Temples_of_Vormijj",
  "/wiki/Pamorjal",
  "/wiki/Pamorjal_Freeman%27s_League",
  "/wiki/Terrorist/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Barabel/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Rat_(Human)",
  "/wiki/Davit_Berek",
  "/wiki/Tagge_Company",
  "/wiki/Garna_tree",
  "/wiki/Star/Legends",
  "/wiki/ZXK-100346_system",
  "/wiki/Cave/Legends",
  "/wiki/Millennium/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Sith_holocron_(Tascollan_Nebula)",
  "/wiki/Sith_magic",
  "/wiki/Room_of_Change",
  "/wiki/Sith_alchemy/Legends",
  "/wiki/Writing_system",
  "/wiki/Sentience/Legends",
  "/wiki/Lekku/Legends",
  "/wiki/Desvin_Tor%27thal",
  "/wiki/Sith_poison",
  "/wiki/Claw/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Blaschowwa",
  "/wiki/Bothan/Legends",
  "/wiki/Kamtis_Bonai",
  "/wiki/Dug/Legends",
  "/wiki/Vobin_Sobos",
  "/wiki/Starfighter/Legends",
  "/wiki/YT-2400_light_freighter/Legends",
  "/wiki/Celestial_Dancer",
  "/wiki/Light_and_Dark_(adventure)",
  "/wiki/Canon",
  "/wiki/Guardian_Spirit",
  "/wiki/Mutant",
  "/wiki/Battle_hydra/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_stealth",
  "/wiki/Force_speed",
  "/wiki/Force_healing/Legends",
  "/wiki/Battlemind",
  "/wiki/Enhance_Attribute",
  "/wiki/Force_empathy/Legends",
  "/wiki/Hatred",
  "/wiki/Force_rage",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Language/Legends",
  "/wiki/Twi%27leki/Legends",
  "/wiki/Amethyst",
  "/wiki/DL-44_heavy_blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Detonator/Legends",
  "/wiki/Sith_amulet",
  "/wiki/Sensor/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Clothing/Legends",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Nerf/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Child_of_Light_saga",
  "/wiki/Roleplaying_game",
  "/wiki/Lee_Pickler",
  "/wiki/RPGA",
  "/wiki/Child_of_Light",
  "/wiki/2000",
  "/wiki/Soulsaber_(adventure)",
  "/wiki/2001",
  "/wiki/2002",
  "/wiki/Force_energy",
  "/wiki/Ithorian/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Aloor",
  "/wiki/Jhara",
  "/wiki/The_Illustrated_Star_Wars_Universe",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galactic_Standard_Calendar"
 ]
}