{
 "name": "Thaya_Ferr",
 "display_name": "Thaya Ferr",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nihil"
     ]
    }
   ]
  }
 ],
 "content": "Thaya Ferr was a human female member of the Nihil who served as an assistant to the pirate organization's leader, Eye of the Nihil Marchion Ro. When Ro planned diversionary attacks on Aleen, Japeal, Yeksom, and Tais Brabbo to lure the Jedi away from the Starlight Beacon space station, Ferr reported to him about the progress of his plot to destroy Starlight Beacon. While she did not have the near-religious level of reverence for Ro most Nihil held towards the Eye, she obeyed his commands without question. She had decided she was not fit for leadership but could work well as Ro's most efficient follower, which the Eye did take notice of.\nOn the Gaze Electric, Ferr was tasked with giving transfer orders to various Nihil. Returning to the bridge, she talked to Ro about the Jedi's attempt to capture Lourna Dee. After delivering more transfer orders, she discussed the moves with Ro. She had sent Roborhyan to the Spectre who had a captain that held a grudge against him. She also ordered the Janikki clan to coordinate efforts in the Ishbix system where they were wanted for crimes. She explained to Ro that these moves would help weaken any rivals in the Nihil. After Ro dispatched a crew to sabotage Starlight Beacon, Ferr contemplated her position in the Nihil. She realized that she had no ambitions to lead, wanting only to follow and help Ro as a second-in-command. She arranged for a shipment of enforcer droids to be delivered to the Gaze Electric as a replacement for the living crewmembers who had been transferred off the ship.\nFerr continued to activate the droids who would crew the ship but was surprised by a small ship requesting permission to dock. Ro informed her it was Ghirra Starros who was coming to join him. Ferr realized that Ro had seduced her into betraying the Republic and was impressed. She arranged for Starros to take over Alfkenda's quarters. After the sabotage of Starlight Beacon, Ferr was instructed by Ro to monitor a comm channel to get news about the situation. She reported the distress call sent from Starlight Beacon after the separation and destruction of the top half of the station. As the situation above Eiram was broadcast across the holonet, Ro ordered Ferr to let the rest of the Nihil know that he was responsible for it. He also ordered her to tell them not to come to Eiram and disrupt his plans. Ferr watched as Starlight Beacon crashed onto Eiram, and stated that there was some symbolism to the Republic's grand project crashing on a non-descript planet. Ro agreed and ordered her to bring up the planet's holonews to they could watch the final destruction of the station.\nAfter the crash, Ferr arranged for a celebration in a system far from the Republic's control so the Nihil could enjoy the victory. Later, she sliced into communication buoys and let Ro broadcast his ultimatum on the same frequencies once used by Starlight Beacon.\nThaya Ferr first appeared in the 2022 novel The High Republic: The Fallen Star, written by Claudia Gray.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Marchion_Ro",
  "/wiki/Aleen",
  "/wiki/Japeal",
  "/wiki/Yeksom",
  "/wiki/Tais_Brabbo",
  "/wiki/Jedi",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Roborhyan",
  "/wiki/Spectre",
  "/wiki/Janikki_clan",
  "/wiki/Ghirra_Starros",
  "/wiki/Alfkenda",
  "/wiki/Eiram",
  "/wiki/Holonet",
  "/wiki/2022",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Claudia_Gray"
 ]
}