{
 "name": "The_General",
 "display_name": "The General",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "aboard the Brentaal Star"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Right eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Military",
      "Imperial Military",
      "Galactic Republic",
      "Republic Military",
      "Republic Military"
     ]
    }
   ]
  }
 ],
 "content": "The Human codenamed \"The General\" was an officer holding that rank in the military forces of the Sith Empire during the Great Galactic War. During the Cold War, the General defected to the Galactic Republic in an effort to stop both sides from restarting the war, learning that Republic and Empire alike were constructing doomsday weapons, and bringing the Empire's secrets to the Republic to prevent more bloodshed. The General was en route to Republic space onboard the warship Brentaal Star, under the protection of the Grand Master of the Jedi Order, Satele Shan.\nThe General's defection did not sit well with the Empire. Grand Moff Rycus Kilran, deputy to the Minister of War, ordered Captain Revinal Orzik of the transport ship Black Talon to intercept the Brentaal Star and capture or kill the General. Seeing no sense in sending a transport to fight a warship, Orzik refused, and so Kilran tapped a small strike team departing Vaiken Spacedock for Dromund Kaas onboard the Black Talon to carry out his orders. Setting the Black Talon on course to intercept, the strike team landed on the Brentaal Star and hunted the General through the decks, until finally catching up to him and his Jedi protector, Yadira Ban, near the ship's escape pods.\nAfter killing Yadira, the strike team confronted the General, who was less than surprised that Kilran was behind the attack. Seriously wounded, the General made no effort to fight or flee, instead stating his reasons for his defection. The strike team chose to execute the General, who grimly accepted his fate.\nPlayers are given two options to determine the General's fate. The first is to take him into custody, for interrogation and later execution , or to simply kill him on the spot .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/General_(disambiguation)",
  "/wiki/3643_BBY",
  "/wiki/Brentaal_Star",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/General/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_War",
  "/wiki/Grand_Master/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Rycus_Kilran",
  "/wiki/Minister_of_War_(Sith_Empire)",
  "/wiki/Revinal_Orzik",
  "/wiki/Black_Talon",
  "/wiki/Vaiken_Spacedock",
  "/wiki/Dromund_Kaas",
  "/wiki/Yadira_Ban",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}