{
 "name": "The_Shroud_(impersonator)",
 "display_name": "The Shroud  (impersonator)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Left eye and cranial implants"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Shroud's syndicate"
     ]
    }
   ]
  }
 ],
 "content": "A man was forced to impersonate the Shroud by Z0-0M, being the fifty-first and final person to play the role after real Shroud's death.\nThe Shroud was a legendary freelance spy who remained unaligned throughout the Galactic War and instead build a spy syndicate of his own. However, at some point the Shroud was betrayed and killed by a replicator droid in his service, Z0-0M who took over his identity and organization. Although her holographic disguise let her impersonate anyone, Z0-0M never put herself at risk and used actors as expendable decoys. The last man to play role was the fifty-first person to do so, having been put through hours of agonizing facial reconstruction that gave him the appearance of the original Shroud but numbed the feeling of his own face. He was forced to maintain the act at all times, even at Z0-0M's base at the Coil, where he was given voice and acting lessons to play the role to perfection. His Cyborg Construct contained an explosive device that his master could detonate at any moment.\nIn 3630 BBY Z0-0M initiated her plan to destroy the Alliance waging a war against the Eternal Empire of Zakuul. The impersonator infiltrated the Alliance base on Odessen and placed multiple thermal detonators in key locations. At the same time, Alliance assassin droid HK-55 was captured and taken to the Coil, where Z0-0M created a copy of him and prepared the erase the original's memories. However, an accident caused the electrical surge to wipe Z0-0M's memories instead, causing the ruthless spymaster to develop a new personality and continue to experience periodic memory resets. Z0-0M freed HK-55 and returned with him to Alliance base just as the impersonator was finishing his sabotage activities. Believing the man to be the real Shroud, HK-55 held him at gunpoint, only for the actor to cave in and expose his master as the true mastermind. Although lacking evidence, he layed out all the ways in which Z0-0M prepared him as a decoy, causing her new personality to recognize the truth. HK-55 then knocked out the impersonator for colluding with the real Shroud to destroy the Alliance base, so that he could be handed over to his master for interrogation.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eye/Legends",
  "/wiki/The_Shroud%27s_syndicate",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/The_Shroud",
  "/wiki/Z0-0M",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_War",
  "/wiki/IR-9X_Replicator_Droid",
  "/wiki/The_Coil_(Obus_VI)",
  "/wiki/File:The_Shroud_impersonator_on_Odessen.jpg",
  "/wiki/3630_BBY",
  "/wiki/Eternal_Alliance",
  "/wiki/Eternal_Empire",
  "/wiki/Zakuul",
  "/wiki/Alliance_base",
  "/wiki/Odessen",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Assassin_droid/Legends",
  "/wiki/HK-55",
  "/wiki/Alliance_Commander"
 ]
}