{
 "name": "The_Grand_Inquisitor",
 "display_name": "The Grand Inquisitor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Utapau"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 47 BBY",
      "Utapau"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 BBY",
      "Sovereign",
      "Mustafar system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pau'an"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "80 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Silver",
      "later brown and yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Ashen white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi Temple Guard",
      "Jedi Temple Guard",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Sidious",
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "The Grand Inquisitor was the title adopted by a Pau'an male Jedi Knight who turned to the dark side of the Force and became the leader of the Inquisitorius, a band of Jedi hunters who served the Galactic Empire. The Grand Inquisitor was once a Jedi Temple Guard and was involved in the events surrounding the bombing of the Jedi Temple during the Clone Wars, arresting the innocent and later exonerated Padawan Ahsoka Tano as well as the true culprit, Barriss Offee. After his fall to the dark side, the Grand Inquisitor was responsible for hunting down and eliminating Jedi during the Great Jedi Purge. Selected by the Emperor, Darth Sidious himself, for the position of Grand Inquisitor, he personally served the Dark Lord of the Sith, Darth Vader, from whom he received his orders. Throughout his tenure he proved to be one of the regime's most proficient tools in eradicating the last of the Jedi Order, being intimately familiar with the records of the Jedi Temple.\nThe Grand Inquisitor took an active interest in eliminating the rebel crew of the starship Ghost, particularly the Jedi Kanan Jarrus and his Padawan, Ezra Bridger. He encountered these two Jedi on a number of occasions, including a Duel on Stygeon Prime and a duel on the asteroid base Fort Anaxes. After the Grand Inquisitor and the government of Lothal, from which the rebels operated, were consistently unable to eliminate the rebels, Grand Moff Wilhuff Tarkin arrived on Lothal to hunt for the rebels. Together, they captured Jarrus and hoped to use him to learn more about a larger rebel movement that was operating in the galaxy. They brought Jarrus to Mustafar, where the rebels mounted a rescue mission in orbit. During the operation, the Grand Inquisitor engaged Jarrus and Bridger in lightsaber combat, and Jarrus eventually bested him. Rather than face the infamous wrath of Lord Vader for his repeated failures, the Grand Inquisitor chose to fall to his death.\nAfter the Pau'an's death over Mustafar, the former Jedi Grand Master Yoda utilized a vision of the Grand Inquisitor as his former Jedi Temple Guard self to appear before Jarrus in the Jedi Temple on Lothal. In the vision, this Sentinel warned Jarrus that Bridger could fall to the dark side, and the two engaged in a lightsaber duel. After Jarrus refused to fight any further, the Sentinel knighted Jarrus and told him he was a Jedi Knight as the Grand Inquisitor once was. But despite the Inquisitor's physical death, Vader still had use for him. The Dark Lord was able to prevent the Inquisitor's spirit from passing on, instead tying it down to a Jedi outpost on Tempes. Here his spirit remained, killing all those who sought Jedi knowledge. After losing his lightsaber in 3 ABY, Vader's own son Luke Skywalker encountered the Inquisitor's spirit on Tempes. The two engaged in a duel that saw the young Skywalker come out victorious. As punishment for allowing the boy to escape, Vader refused the Pau'an's pleas to be set free from his prison, leaving him to guard the outpost for what the Inquisitor believed would be an eternity.\nThe Force-sensitive Pau'an male who would one day become the Grand Inquisitor hailed from the planet Utapau, where he was born over fifteen years prior to the Invasion of Naboo. At some point, he became a member of the Jedi Order and rose to the rank of Jedi Knight. As a Jedi, he served in the Jedi Temple Guard, a group of Jedi tasked with defending the Jedi Temple on Coruscant.\nDuring his time as a Jedi Knight, the Jedi proved himself a skilled individual. He also developed a hatred unbecoming of a Jedi, for Chief Librarian Jocasta Nu, for when he would go to the Jedi Archives to read datafiles, he was denied access by the elder Jedi most of the time. When he was allowed to read an occasional datafile, he was watched closely by her, as she deemed him as unfit for education.\nDuring the Clone Wars, in a period of protests against the Jedi High Council for their continued leadership over the war between the Galactic Republic and the Confederacy of Independent Systems, a bombing at the Jedi Temple rocked the Jedi Order. Although the true culprit was Padawan Barriss Offee, who believed that the Jedi Order had lost its way and were the true villains in the war against the Confederacy, she framed her friend and fellow Padawan Ahsoka Tano for the crime. Tano fled into the Coruscant Underworld, away from the Grand Army of the Republic forces that pursued her, but she was eventually captured and brought to the Jedi Temple. She was brought before the Jedi Council, who stripped her of her Padawan status and expelled her from the Jedi Order.\nThe future Grand Inquisitor was one of the guardsmen who led Tano from the Jedi Temple, and she was ultimately brought to trial before Supreme Chancellor Palpatine. During the trial, Tano's master, Jedi Knight Anakin Skywalker, uncovered Offee's duplicity and had her arrested. The future Grand Inquisitor was one of the guards who escorted Offee into the trial, where she admitted her guilt in front of the chancellor and was subsequently taken away by the guards. Tano was exonerated, but she refused to rejoin the Jedi Order and chose to seek a new path.\nThe events with Offee and Tano left the future Grand Inquisitor feeling disaffected, and he lost faith in the Jedi Order. This left him susceptible to the pull of the dark side of the Force, and ultimately fell to the dark side. However, the Pau'an was still a Jedi by the time the Clone Wars ended, as he was a survivor of Order 66.\nAt the end of the war, the Supreme Chancellor—secretly the Dark Lord of the Sith Darth Sidious—transformed the Republic into the Galactic Empire and declared himself Emperor of the galaxy. During this time, the Emperor recruited him to become Grand Inquisitor of the Inquisitorius when he promised the Jedi Knight the chance to read through the secrets of the Jedi Archives.\nThe Inquisitor came into the service of the Empire and the Sith, though he was not a Sith himself. When the Inquisitor entered the Jedi Temple's Archives, he was confronted by the Sith Lord Darth Vader, who was once Anakin Skywalker before his own fall to the dark side. He and the cyborg then fought each other until the latter damaged his lightsaber. The fight was then stopped by the Emperor, who explained to Lord Vader who the Inquisitor and the Inquisitorius were. They then went to the Inquisitorius Headquarters in The Works to meet with the other Inquisitors.\nVader then tasked the Inquisitor with hunting down and eliminating any Jedi who had survived Order 66, the order given to the clone troopers of the Grand Army of the Republic to destroy the Jedi Order. To accomplish this task, the Inquisitor was trained in the ways of the dark side and studied the records of the Jedi Temple in order to better know his enemies. Seeing how his new master employed brutal training methods that resulted in the loss of limbs from various of his Inquisitors, the Grand Inquisitor questioned Vader's methods, but the Sith Lord responded by saying that he was teaching loss to the Inquisitors and that they still fought like Jedi. After some arguing, The Grand Inquisitor reminded Vader the if the Inquisitors were to fail, said failure would be reflected on him as the Emperor appointed him to train them.\nAs he and his master arrived at the former Jedi Temple, the Grand Inquisitor confides in Lord Vader about his hatred for Jedi Master Jocasta Nu as she denied him full access to the Jedi Archives. Now with a high ranking position at the Empire, the Grand Inquisitor claimed that he would read through everything in the Jedi Archives. Unbeknownst to the Inquisitor however, Jocasta Nu had infiltrated the Jedi Temple in hopes of retrieving a holocron with a list of every Force-sensitive child catalogued prior to Order 66. While the Inquisitor was unaware of Nu's presence, as he was poring over the Jedi archives, the Jedi Master soon revealed herseñf to him, claiming that he had no right to read her books nor toss them aside.\nWhile being held at bladepoint, The Grand Inquisitor soon revealed to Nu that he was once a Jedi who she denied access to her books even when they were on the same side, tough the Inquisitor soon whipped out his own lightsaber and started a duel with the Jedi Master. During their brief duel, the Grand Inquisitor explained to Nu why he left the Jedi Order and told her that he had dreamed of striking her down for a long time. Showing his prowess in lightsaber combat, the Grand Inquisitor gained the upper hand during the duel and defeated Jocasta by knocking her to the ground, but he was prevented from killing the Jedi Master by Darth Vader, who claimed that he did not wish for her to be executed, when in reality Vader was carrying the Emperor's orders of not to share information about Master Nu's importance. While the two argued, Nu took advatange of their distraction to hurl several holobooks at her opponents with the Force, which knocked the Grand Inquisitor, leaving him unconscious. Vader eventually carried the hunt for Jocasta and killed her.\nAt one point during his service to the Empire, the Inquisitor embarked on a quest for answers that involved him tracking down a bearded human. As the man hid, the Inquisitor pursued with his lightsaber ignited.\nOne Jedi that the Inquisitor led to their death was Jedi Master Luminara Unduli. After the execution of Order 66, Unduli was captured and held in the Spire, a former Separatist-turned-Imperial prison on Stygeon Prime. At her end, Unduli was in the presence of the Inquisitor, who stood in the doorway of her cell as she walked into an execution chamber and died. The Inquisitor kept her remains in the prison cell, using them to lure other Jedi to their deaths when they heard rumors that Unduli was still alive. A holographic recording of Unduli and her execution was kept by the Empire as part of this ruse.\nHaving risen to the rank of Grand Inquisitor, he led other members of the Inquisitorius. Among these Inquisitors were dark warriors such as the Second Sister, the Fifth Brother, the Sixth Brother, the Seventh Sister, the Eighth Brother, the Ninth Sister, and the Tenth Brother. Like the Grand Inquisitor, these Inquisitors had their roots in the Jedi Order. As the Grand Inquisitor, the dark side adept hunted down and dueled the former Jedi Padawan Naq Med. His lightsaber was damaged in the duel and Med escaped. At another point, the Grand Inquisitor took Force-sensitive children from an orphanage on Gaaten. One night when he went to the orphanage, he was confronted by a surviving Jedi, Kira Vantala, to which the Grand Inquisitor expressed his shock, believing her to be a weak Jedi. The Inquisitor was defeated by Vantala and a refugee named Elish, and never returned to the orphanage.\nOne year after the rise of the Galactic Empire, the Grand Inquisitor was alerted of the presence of a Force-sensitive being old enough to have received Jedi training on the farming moon of Raada. Though he wanted to hunt down the supposed Jedi himself, he was needed elsewhere, and the task instead went to the Sixth Brother, who then went to Raada to lay a trap for the Force-sensitive. However, he was killed in the following battle, and the Jedi, as well as the farmers who had rebelled against the recent occupation, escaped. Meanwhile, the Grand Inquisitor was alerted to the situation and traveled to the moon with a fleet of Star Destroyers to provide backup, but by the time they arrived, the insurgents were gone. The Grand Inquisitor personally examined the damage done by the battle and discovered the corpse of the Sixth Brother. Though annoyed by the incompetence and recklessness of his subordinate, the Grand Inquisitor was impressed by what the Jedi had done. He then went back to his ship and instructed his agents to set a course back to base and to inform Lord Vader that they had found evidence of another survivor—who was, in fact, Ahsoka Tano, Anakin Skywalker's former Padawan.\nLord Vader took the Fifth Brother and two other inquisitors to hunt the former Jedi Master and Council member Eeth Koth, the mission was a success as they not only managed to kill the Jedi Master but to kidnap his force-sensitive daughter. As his master arrived at The Works, the Grand Inquisitor congratulated Vader for capturing a child that would be used as part of Project Harvester. After they gave Eeth Koth's child to two masked red figures, the Inquisitor led Vader away and shows him a list of surviving Jedi that included Yoda, Obi-Wan Kenobi, Coleman Kcaj, Oppo Rancisis, Selrahc Eluos, and Ka-Moon Kholi on a holoprojector. The Inquisitor told Vader that a Jedi would slip up eventually, they just had to wait.\nThe Grand Inquisitor was at a cantina with his fellow Inquisitors when Lord Vader arrived and attacked two of the Inquisitors that had previously helped him during his hunt for Eeth Koth. The Grand Inquisitor asked Vader if this sudden attack was a test or more training, to which the Sith Lord replied that it was not before continuing his attacks on the two Inquisitors that ended up escaping from the headquarters. The Grand Inquisitor asked his master if he and the other Inquisitors could assist him in any way, but Lord Vader declined his offer and chased the rogue Inquisitors by himself before killing both of them. Unfortunately, the Dark Lord's chase resulted in the death of a Gran Senator that was important to the Emperor's plans; this resulted in the Inquisitorius being moved to Fortress Inquisitorius on Nur as Sidious wanted to maintain the organization's clandestine nature.\nIn 14 BBY, the Grand Inquisitor heard about a Jedi who caused problems for the Empire on Kashyyyk. This Jedi was Cal Kestis, who helped the Partisans to attack an Imperial Refinery. The Ninth Sister told the Grand Inquisitor that Kestis would not be someone stupid enough to return to Kashyyyk, especially after the resistance was eliminated by the Empire. The Ninth Sister was later proved wrong and defeated by Kestis when he returned to Kashyyyk.\nIn 9 BBY, the Grand Inquisitor traveled to Tatooine with the Fifth Brother and the Third Sister. They soon landed in Mos Eisley and the three Inquisitorius began to seek out a Jedi they were hunting. The Grand Inquisitor and his fellow Inquisitorious walked into a saloon and asked the establishment's owner if he knew who they were and what they did. The owner recognized them as Inquisitors and that they hunted Jedi, leading the Grand Inquisitor to express his point of view that actually the Jedi are the ones who \"hunt themselves down,\" since they left a trail of compassion.\nHe went on to inform the saloon's owner that the Inquisitorius had heard rumors about a Jedi hiding in the saloon, musing if that Jedi had come there to help with the owner's tensions with the locals in exchange for food and shelter. Just as the Grand Inquisitor began to conclude his speech, the Third Sister got tired of waiting and threw a patron's knife towards the saloon's owner. This made Nari, the Jedi they were seeking out, save him with the Force. Discovered, Nari tried to run away, but the Third Sister and the Fifth Brother cornered him. As the Grand Inquisitor ordered the Inquisitorius to prepare Nari for interrogation, the Third Sister tried to cut the Jedi down, leading the Inquisitor to stop and knock the Sister aside with the Force, enabling him to escape. As the Fifth Brother pursued Nari, the Grand Inquisitor reprimanded the Third Sister for her carelessness, warning her that if she didn't quit her fixation with finding Obi-Wan Kenobi—whom she deemed a bigger prey than \"scraps\" like Nari—she would be relieved of her duties. As the Grand Inquisitor strode off into the desert, the Third Sister retorted that she considered Kenobi forgotten.\nAfter the Third Sister hired Vect Nokru and his mercenaries to kidnap the Alderaanian Princess Leia Organa and bring her to Daiyu in hopes that Obi-Wan Kenobi would be contacted by Leia's adoptive father, Bail Organa, to rescue her, the Grand Inquisitor went to Daiyu accompanied by the Fifth Brother and the Fourth Sister so they could capture Kenobi.\nThey met up with the Third Sister, and the Inquisitor chastised her for kidnapping a senator's daughter and for not informing him. Feeling that the Third Sister wanted to capture Kenobi to gain favor within the Inquisitorius ranks, the Grand Inquisitor reminded her how they rescued her from the \"gutter\" and that she would always be the \"least\" of them, leading the Sister to insult him. Unamused, the Inquisitor asked the Fifth Brother to secure the city and informed the Third Sister of his intentions to deliver Kenobi himself, dismissing her from the hunt by saying that she was no longer required and that he would deal with her once he returned from hunting Kenobi.\nAs they secured the city, the Grand Inquisitor requested the Fifth Brother to shut down the planet's port and request a garrison within an hour. The Fourth Sister then came to him and showed him a bounty hunter alert advertising a bounty placed on Kenobi's head, leading the Grand Inquisitor to deduce that the Third Sister had once again acted behind his back. Soon afterward, two stormtroopers brought Nokru to his presence, and the Grand Inquisitor activated his lightsaber to threaten Nokru if he didn't tell him where Kenobi was, knowing that he had put the bounty on Third Sister's behalf. However, Nokru knew nothing, leading the Inquisitor to kill him for his uselessness.\nNot long after, the Grand Inquisitor intercepted the Third Sister as she taunted Kenobi, wishing him to come out from where he was hiding so she could deliver him personally to Lord Vader. The Inquisitor stated that he would not tolerate the \"reek\" of her ambition any longer and ordered her to move aside, not wanting to lose Kenobi again, thanks to the Third Sister's recklessness. He then instructed her to watch and learn as he used the Force to move aside the crates which Kenobi was using to hide, but the Third Sister instead used her lightsaber to stab the Grand Inquisitor, mockingly asking him if he thought that she would let him take all the credit, before letting him drop to the ground.\nFollowing the purported death of the Pau'an, the Third Sister communicated with Vader via hologram. There, Reva asserted that Kenobi would pay for the Grand Inquisitor's a assumed demise, but Lord Vader responded that the Grand Inquisitor no longer meant anything. He went on to promise her the position of Grand Inquisitor to the Third Sister should she prove herself, though the Fifth Brother, who was next-in-line for the position, contested her claim.\nDue to her success in placing a tracker to uncover the location of the Path network and Kenobi, the Third Sister was granted the title of Grand Inquisitor. However, due to his desire for revenge, the Pau'an was able to survive his wound and recover from Reva's attack. After the Third Sister betrayed Vader during their mission on Jabiim, she was struck down by her former master. As she lay weakened on the ground, the Grand Inquisitor reappeared and revealed his survival to Reva. He told Sevander, since her rage had become tiresome, the Inquisitorius would abandon her in the gutter. He then took the pin signifying the rank of Grand Inquisitor from her, reclaiming his rank, before he and Vader left Reva for dead.\nThe Grand Inquisitor and Vader returned to the latter's flagship, the Devastator, as it pursued the Kawlan Roken's freighter. In the midst of their pursuit, the Imperials noticed a single drop ship exit the freighter and detected one lifeform aboard. Vader immediately realized that it was Kenobi, but the Grand Inquisitor counseled his master that they continue their pursuit of Roken's ship, opining that they should not prioritize one Jedi. However, Vader countered that Kenobi was no ordinary Jedi, then ordered the Devastator to pursue Kenobi's ship. As Kenobi reached a rocky moon, Vader asked the captain to prepare his ship. As Vader walked off the bridge, the Grand Inquisitor eyed him briefly.\nIn the years prior to the Battle of Yavin, the Grand Inquisitor was contacted by Lord Vader, who told the Jedi hunter that the Emperor had foreseen a new threat rising to challenge his rule: the \"children of the Force,\" who could not be allowed to become Jedi. Thus, the Inquisitor was instructed to hunt these individuals down and either make them serve the Empire or destroy them, along with any Jedi survivors who could train them. With the orders of the Emperor given, the Inquisitor told his master that it would be done.\nOne method that the Inquisitor used to find Force-sensitive individuals was to look for cadets at the Academy for Young Imperials on Lothal who met a set of criteria, one that indicated their ability to use the Force, an operation known as Project Harvester. One known target of Project Harvester was Dhara Leonis, a promising cadet and the daughter of Imperial agricultural scientists. The Imperial authorities attempted to cover up her kidnapping by claiming that she had run away from the Academy. However, her mother, Tepha, and younger brother Zare Leonis suspected that the Empire was lying. To ascertain his sister's fate, Zare enrolled at the Academy the following year.\nSometime later, fourteen years after the rise of the Empire, a group of rebels who operated on Lothal came to the attention of Agent Alexsandr Kallus of the Imperial Security Bureau. The rebels rescued a group of Wookiees that had been enslaved in the spice mines of Kessel, a mission in which the rebel leader, Kanan Jarrus, used a lightsaber and revealed himself as a Jedi survivor. After the rebels escaped, Kallus contacted the Inquisitor and informed him about what happened on Kessel. The Inquisitor was pleased that Kallus informed him of the rebel cell and the Jedi in its ranks.\nThe Grand Inquisitor laid a trap for Jarrus and his Padawan, Ezra Bridger, in the Spire. The Empire was able to project an image suggesting that she was alive, and this information was then reported by Gall Trayvis, a former member of the Imperial Senate who claimed to have gone into exile after speaking out against the Empire—in reality, Trayvis was a loyal agent of the Empire, one who used his position to lure rebel groups into traps around the galaxy. Not wanting to pass up an opportunity to rescue a Jedi survivor, the rebels undertook a mission to the Spire, where they intended to rescue the Jedi Master.\nOnce in the prison, the rebels fought their way through stormtroopers who were stationed there. Jarrus and Bridger made it to the detention area, and Jarrus believed he could sense the Jedi Master—though, in actuality, it was the power from her bones. They entered the cell and saw a projected image of Unduli, which faded into a sarcophagus that revealed the remains of the Jedi Master. The Grand Inquisitor entered the cell, his lightsaber ignited, and approached the two Jedi, revealing that Luminara had been dead for many years. Jarrus attacked the Inquisitor and the two engaged in lightsaber combat. The Inquisitor was able to correctly deduce that Jarrus had been trained by Jedi Master Depa Billaba, as she had been a teacher of Form III lightsaber combat in close-quarter fighting, which Jarrus employed extensively. The two continued their duel within the cell until Bridger set off a small detonator that allowed him and Jarrus to flee.\nThough they had escaped the cell, the Grand Inquisitor pursued them and continued his fight with Jarrus in the halls of the prison. He soon pushed Jarrus away through the Force and, per Vader's command, attempted to convert Bridger to the dark side. The boy refused, however, and the Inquisitor prepared to strike him down, but Jarrus used the Force to pin the Inquisitor to the ceiling, giving the two Jedi a chance to flee. The Grand Inquisitor followed them and chased them through the prison before they met back up with their fellow rebels. Separated by a number of closed doors, the Inquisitor sliced through them with his lightsaber and arrived in time to see the rebels beginning to escape. He made one last attempt to stop them by throwing his lightsaber towards them, but Jarrus deflected it and the rebels escaped aboard the Phantom, the attack shuttle that belonged to their main ship, the Ghost.\nAfter his failure to stop the rebels on Stygeon Prime, the Inquisitor was contacted by Commandant Cumberlayne Aresko, the lead officer at the Imperial Academy on Lothal, who informed him of two students who potentially met his criteria for Force-sensitivity. He learned that these cadets were Dev Morgan—who, unknown to the Academy, was Bridger in disguise, who infiltrated the Academy to learn the location of a giant kyber crystal of great power—and Jai Kell. Having learned this information, the Inquisitor, speaking via hologram, told Aresko that he would arrive at the Imperial Academy the next day. Bridger overheard the conversation, and he and Kell escaped the Academy with another cadet, Zare Leonis, who suspected that the Inquisitor was behind the disappearance of his sister, Dhara Leonis; Dhara was the star cadet at the Academy before her disappearance, which the Empire claimed was a result of her running away from the Academy.\nUpon his arrival at the Imperial Academy, Aresko and Agent Kallus informed him of Bridger and Kell's escape. The Jedi hunter was shown the data files on the two cadets and recognized \"Dev Morgan\" as Bridger from their encounter on Stygeon Prime. The Inquisitor informed Aresko that the incident was a black mark on the Academy's record, though he did have hope of learning more about the rebels, as Leonis was also present in the meeting. During the escape, Leonis had opted to stay behind so he could find out what happened to his sister and pretended to try to stop Bridger and Kell upon their escape. The Inquisitor spoke to Leonis and told the cadet to tell him everything he knew about Bridger and Kell.\nDuring his private chat with Leonis, the Inquisitor led the young cadet to an interrogation room. Once inside, the Inquisitor asked Leonis everything he knew about Morgan while trying to probe the cadet's thoughts. While hiding his collaboration with Morgan, Leonis pretended to support the Inquisitor's assessment that something was not right about Morgan. When the Inquisitor told Leonis that Morgan was a pseudonym, Zare pretended to be a \"perfect cadet\" and asked whether the victories in his assessments would be vacated. The Inquisitor merely replied that he should ask Commandant Aresko.\nZare then attempted to convince the Inquisitor that he was Force-sensitive like his missing sister Dhara. He claimed that he could somehow sense that there was something wrong with Dev and Jai and that they were hiding something. The Inquisitor quickly deduced that Leonis was Dhara's younger brother. While the Inquisitor was fully aware that Dhara had been abducted and forcibly inducted into Project Harvester, he repeated the official Imperial account that Dhara had merely run away. When Zare claimed that he and his sister could always sense each others' presence, the Inquisitor merely told the young cadet that it made sense and that in time he would understand why.\nThe Inquisitor and his Imperial forces arrived in a village on the planet Vyndal in search of Jarrus after he had been seen close by. The Inquisitor and his forces were greeted by the protector of the village, Yeleb, who lied to the Inquisitor that he had not seen Jarrus in their village; however, the Inquisitor could see through the protector's lies, and when Yeleb ordered the Imperials to leave, the Pau'an ordered his stormtroopers to destroy the village.\nJarrus revealed himself to the Inquisitor and attacked him. Yeleb would soon join the combat as well, wielding his own green-bladed lightsaber, leading the Inquisitor to assume that Yeleb was a Jedi too, although, in actual fact, a few years earlier Yeleb had taken the lightsaber from a crashed Eta-2 Actis-class light interceptor with a dead Jedi pilot inside. Using the Force, the Inquisitor pushed Jarrus out of combat, allowing him to focus on Yeleb and slash the man across the chest with his blade. After Yeleb collapsed onto the floor, the Inquisitor took Yeleb's lightsaber and Jarrus fled from the Inquisitor to draw him away from the wounded human. The Pau'an along with his stormtroopers gave chase, and Jarrus was able to trick the Imperials into thinking he had fled Vyndal on one of their cruisers, causing them to chase after it and leave the planet in the other.\nAfter the Imperials left the planet, Yeleb died of his injuries, and Jarrus ended up leaving the planet and returning to the rebels, leaving the people of Vyndal with hope that without him and the lightsaber on the planet, the Empire would not return, and even if they did, the people were able to protect themselves.\nThe Inquisitor was on Lothal for Empire Day when the rebels destroyed the prototype TIE Advanced v1. When the rebels attempted to smuggle Tseebo, an Imperial Information Office worker who had fled with Imperial secrets, off Lothal, he led a TIE fighter squadron while piloting his own TIE Advanced v1 to stop them from escaping. He was able to plant an XX-23 S-thread tracker on their ship moments before they jumped to hyperspace.\nRealizing they were being tracked, Jarrus and Bridger boarded the Phantom and ejected from the Ghost, flying it to Fort Anaxes. The Inquisitor took a squad of troops and its commander with him aboard a Sentinel-class landing craft to confront the two Jedi. As the Inquisitor and his troopers entered the base, they spotted Jarrus and Bridger along with a multitude of fyrnocks. The two Jedi used the Force to command the fyrnocks to attack the stormtroopers. Jarrus fought the Inquisitor once more, but he was easily overwhelmed and knocked out. Cornering Bridger, the Inquisitor told him to give in to the dark side, and that his friends would die and that everything he fought for would be lost. Bridger briefly succumbed to the dark side and summoned a giant fyrnock to attack the Inquisitor. Jarrus reawakened, grabbing Bridger and reclaiming his lightsaber. After driving off the mother fyrnock, the Inquisitor attempted to halt their escape, but they managed to board their ship, the Phantom, and destroy the Imperial landing craft. Accepting his failure, the Inquisitor simply stated that his Master would not be pleased.\nFollowing the Lothal rebels' attack on the Empire Day celebrations, the Grand Inquisitor returned to Lothal to deal with another unfinished business: Dhara Leonis' younger brother Zare Leonis. While Zare was a promising cadet at the Academy for Young Imperials who had earned the glowing praise of his instructors, the Inquisitor suspected that Leonis was connected to Ezra Bridger and the other Lothal rebels. A perfect opportunity to make his move against Zare surfaced when the young cadet took action against an unscrupulous fellow cadet named Nazhros Oleg, who had attempted to shield his smuggler uncles from Imperial justice. Under the pretext of rewarding Leonis, the Inquisitor arranged for the cadet to be transferred to the Arkanis Academy, which was connected to Project Harvester. There, he hoped to create the circumstances that would expose Leonis as a traitor to the Empire. In addition, the Inquisitor wanted to ascertain whether Zare was actually Force-sensitive as he had claimed earlier.\nFollowing Leonis' raid on a group of smugglers, the Inquisitor and Captain Piers Roddance summoned Zare for a private meeting. When Leonis suggested that Oleg was genuinely unaware that his uncles were involved in smuggling and suggested showing the delinquent some compassion, the Inquisitor replied that compassion was the most insidious business. After ordering Captain Roddance to leave the room, the Inquisitor told Leonis that he had arranged for the cadet to be transferred to the Arkanis Academy as a \"reward\" for his loyalty to the Empire. Throughout the meeting, the Inquisitor made every effort to probe Leonis' thoughts.\nPretending to be a \"model\" cadet, Leonis expressed gratitude at the opportunity to serve the Empire. Sensing Leonis' true motivations for joining the Imperial Academy, the Inquisitor patronized Leonis by asking \"who could doubt the commitment of such a promising young cadet.\" Intimidated by the Inquisitor, Leonis turned away from the Pau'an's gaze, prompting the Inquisitor to ask the cadet to make eye contact with him. Prior to Leonis' departure, the Inquisitor told the cadet that he looked forward to his training on Arkanis and \"assured\" the Cadet that his service to the Empire would be more important than he had hoped for. While Leonis was uncertain whether the Inquisitor knew his true agenda, his girlfriend Merei Spanjaf uncovered Imperial documents which confirmed that the Inquisitor had intended to use the Arkanis transfer to break the young cadet.\nLater, the Inquisitor visited the Arkanis Academy and landed at Area Null, a secluded tower in the Academy that hosted several top-secret Imperial projects including Project Harvester and Project Unity, the latter a program for re-educating former dissident youths. After dining with Commandant Brendol Hux and the cadets in the Academy's banquet hall, the Inquisitor summoned Cadet Leonis for a private meeting at the Commandant's balcony. There, the Inquisitor asked Leonis why he had tried to enter Area Null even though it was off-limits to Cadets. Leonis claimed that he thought that a fellow cadet was in trouble but the Inquisitor quickly realized that he was lying.\nHe then gave Leonis a second chance to answer his question. Leonis claimed that he had sensed that there was something in that tower that he was meant to find. The Inquisitor then asked if Morgan had told him about the tower on Lothal or something called Project Harvester. In response, Leonis feigned ignorance but the Inquisitor could see that he was trying to hide something. Before the Inquisitor could carry on with the interrogation, the Commandant's droid DDM-38 arrived and informed him that he had received a priority encrypted message from Lothal. Before leaving, the Inquisitor warned Leonis that he would soon have Morgan and his companions. He also vowed to get to the truth behind Leonis' connection to Morgan. Unknown to the Inquisitor and Leonis, this was to be their last meeting due to unexpected developments.\nTo continue tracking the rebels, at some point the Grand Inquisitor sought information from Vice Admiral Rae Sloane of the Imperial Navy. Sloane once had a run-in with Jarrus on the planet Gorse, where Jarrus first met Captain Hera Syndulla and joined her rebel cause. The Grand Inquisitor found the officer on Lahn, where she had set a trap for the Jedi. Jarrus escaped, but Sloane remained on Lahn when she was confronted by the Inquisitor—who wanted to know everything she knew about Jarrus.\nHaving had his first experience with the dark side on Fort Anaxes, Bridger ventured to the Jedi Temple on Lothal with Jarrus, who wanted to make sure that his Padawan could actually become a Jedi. Once inside the temple, Bridger encountered visions of the Grand Inquisitor killing his friends, whom he had come to regard as his family. The Inquisitor first dueled and killed Jarrus in the vision, before entering the Ghost and killing the crew inside. Soon thereafter, the vision of the Grand Inquisitor moved to kill Bridger himself. Bridger realized, however, that he was not afraid of dying. Rather, he was afraid of losing those he cared about and being abandoned like he was when he lost his parents at a young age—a fear represented through the threat of the Inquisitor. Once Bridger realized what his fear was, the vision of the Grand Inquisitor disappeared.\nThe Inquisitor was present in the Imperial Complex hangar when Grand Moff Wilhuff Tarkin arrived to investigate the situation on Lothal. Reports of the rebel activities had reached the highest levels of the Imperial government and worries had begun to emerge as Lothal's industries were vital for the Empire's expansion into the Outer Rim. Immediately upon arriving, Governor Tarkin berated Minister Maketh Tua and Agent Kallus for their inability to stop the rebellion. He also dismissed the rumors that a Jedi was leading the rebels, claiming that all the Jedi had died during the Purge and that he knew because he had witnessed it.\nLater that day, Governor Tarkin summoned Commandant Cumberlayne Aresko and Taskmaster Myles Grint who had been pursuing the rebels for some time and who had failed at every turn. After a brief conversation during which he revealed that other rebel cells were active in the Empire and that the rumors of a Jedi leading a rebellion could spark hope and encourage unity, the Grand Moff informed the assembled dignitaries that there would be consequences for failure henceforth. Upon these words, the Inquisitor activated his lightsaber directly behind Aresko and Grint and triggered the spinning feature, decapitating the two officers as a horrified Tua and Kallus watched on. When Kallus discovered that the Rebels were planning to strike at the Imperial communications tower, Tarkin instructed him to let them enter the tower but prepare his troops to intervene as soon as they did. After the Agent left, the Grand Moff told the Grand Inquisitor that this was his chance to redeem himself for his previous failures. The Pau'an promised Tarkin that his faith would be rewarded.\nAfter the Rebels struck the tower, Kallus and his troops intervened, surrounding the tower and forcing the Rebels to escape to the roof. Only Kanan Jarrus remained behind to give them time to escape, at which point the Inquisitor arrived to confront the Jedi. Jarrus destroyed the console giving them access to the tower. Once again, the Inquisitor and the Jedi fought, with the former noticing that Jarrus had improved his technique. However, the Inquisitor proved the stronger of the two once again and he subdued Jarrus with the Force. However, the rest of the Rebels escaped. With Jarrus in custody, Governor Tarkin arrived and was given the captured Jedi just as a signal broadcast by the rebels begun to transmit by the tower. The Grand Moff gave orders for the tower to be destroyed before leaving with his prisoner.\nAfter Jarrus was captured, he was brought aboard Governor Tarkin's flagship in orbit above Lothal: the Sovereign. Tarkin and Kallus proceed to interrogate Jarrus with a mind probe but the Jedi proved stronger than this tactic. As the Grand Moff grew more frustrated with the lack of results, the Inquisitor arrived and told them that Jedi were trained to resist mind probes. Instead, he claimed that pain would be a more effective technique, as Jedi still felt it. The Inquisitor used the Force to try and pry the information from Jarrus' mind but, once again, the Jedi resisted. Instead, the Inquisitor electrocuted Jarrus to make him talk. However, the rebel proved to be far stronger than he believed, and he resisted the torture. The Inquisitor came to believe that Jarrus did not know anything of a larger rebellion. Tarkin eventually suggested transferring him to a facility that had never failed to gain results. The Sovereign then departed Lothal for Mustafar, a world deep in the Outer Rim.\nOver Mustafar, the Inquisitor continued his interrogation of Jarrus, asking him about other rebels he may have known. Specifically, he wanted to know about a mysterious rebel known as \"Fulcrum.\" Jarrus still refused to talk, so the Inquisitor changed tactics: he asked Jarrus how he had survived Order 66. When Jarrus failed to answer, the Inquisitor revealed that he knew how; Jarrus' Master, Depa Billaba, had sacrificed herself to save him, losing her own life in the process. The Inquisitor taunted Jarrus, asking him if he remembered his Master's last words, and Jarrus answered that she told him to run. The Inquisitor told Jarrus that he could not save his friends any more than he could save his Master because he feared his own power and did not even dare wear his lightsaber in public because of it. When alarms went off, the Inquisitor was unsurprised to find that the other rebels had come to rescue their friend.\nAfter Bridger broke Jarrus out of his cell, they headed back for their evacuation ship through the generator complex. The Inquisitor waited for them and ignited his lightsaber. Jarrus borrowed Bridger's lightsaber and attacked the Inquisitor. As he was about to reach him, he activated the lightsaber's stun gun, surprising his opponent. The two engaged in a lightsaber duel with Jarrus using both the blade and the stun gun to attack the Inquisitor. When Bridger used the Force to snatch Jarrus' lightsaber from the Imperial agent's belt, the Inquisitor disengaged from the duel with Jarrus and, activating his second blade, claimed that he would finally get the challenge that he had always wanted. After a brief engagement, he used the Force to push Jarrus back before throwing his spinning lightsaber at Bridger, who fell from the pathway, to Jarrus' horror.\nDistraught at the apparent loss of his Padawan, Jarrus remained on his knees for a while as the Inquisitor stood over him, smiling sadistically at the Jedi's obvious anguish. However, he eventually pulled himself together, remembering his Jedi training, and rose to his feet. When the Inquisitor asked him what would happen now that no one else would die for him, Jarrus replied that he no longer had anything left to fear. He then used the Force to draw his lightsaber to him, using both it and Ezra's. After saluting each other, the Inquisitor and the Jedi resumed their duel.\nThis time, however, Jarrus proved a much more effective foe, and he gradually started to drive the Inquisitor back, the latter of whom began to show fear and uncertainty for the first time. When the Inquisitor came perilously close to the edge, Jarrus interrupted the duel to say that his foe was right: he was a coward but that he had discovered that there was something far more powerful than fear: the Force. The Inquisitor made his blades spin to defend himself, but Jarrus destroyed the Inquisitor's lightsaber and the Imperial agent fell off the edge, catching the side of the pathway in his fall. The two halves of his lightsaber hit the generator, causing it to catch fire and starting a chain reaction within the Sovereign. As Jarrus stood over his defeated foe, the Inquisitor looked up at him and told him that his defeat would unleash something far worse upon them all. Knowing the punishment he would receive from his master for his failure, the Inquisitor told the Jedi that there were some things far more frightening than death before letting himself fall into the exploding generator, killing himself.\nThe Inquisitor's warning to Jarrus proved true. With their primary agent on Lothal dead and a growing rebellion in the galaxy, the Empire sent out a far deadlier agent to Lothal to root out and destroy the rebels: Darth Vader. After the Dark Lord attacked and crippled Phoenix Cell and learned that his former Padawan, Ahsoka Tano, was still alive and in league with the rebellion, Sidious ordered Vader to dispatch another Inquisitor to hunt the rebels. The latteer sent the Seventh Sister and the Fifth Brother, both of whom hoped to become the new Grand Inquisitor.\nSometime after the death of the Grand Inquisitor, Jarrus and Bridger traveled with Ahsoka Tano to the Jedi Temple on Lothal to seek the guidance of Jedi Master Yoda, with whom Jarrus and Bridger had communed with from there before. It was there that they hoped to find guidance for how to deal with the threat of the Inquisitors, who attacked the rebels at every turn. While in the temple, Jarrus entered a vision in which he saw a Jedi Temple Guard known as the Sentinel within a dojo. Unknown to Jarrus, this was a vision conjured by Yoda of the Grand Inquisitor, as the Jedi he once was. The Sentinel warned Jarrus that Bridger would fall to the dark side of the Force and that the boy had to be eliminated.\nJarrus refused and the two engaged in a lightsaber duel. By the end of the duel, Jarrus refused to fight any further and admitted that while he may not be able to protect Bridger forever, he would continue to do his best to train him. The Sentinel looked as if he was about to strike Jarrus down but instead performed the knighting ritual. Then he removed his mask to reveal the face of the Grand Inquisitor. Jarrus asked what everything that had happened meant, and the Sentinel said that it meant Jarrus was now a Jedi Knight, as the Grand Inquisitor once was. As the Seventh Sister and the Fifth Brother descended on the temple, the Sentinel told Jarrus to flee and said he would hold off the enemy. The vision of the Sentinel, flanked by other Jedi Temple Guards, surrounded the two Inquisitors as Jarrus, Bridger, and Tano fled from the Jedi Temple.\nIn 0 BBY, shortly after Jarrus' own death, his confrontation with the Grand Inquisitor was heard among numerous voices by Bridger as he passed through a hyper tunnel while riding a Loth-wolf on his mission to the Lothal Jedi Temple. The Grand Inquisitor's helmet fell into the hands of Maz Kanata after she hired smugglers Han Solo and Chewbacca to recover it.\nDespite his defeat above Mustafar, the Pau'an's usefulness to the Sith had not run dry. Through the intervention of Vader, the Grand Inquisitor was prevented from passing on from the mortal world; instead, Vader forced the Inquisitor's spirit to serve his purposes. The Dark Lord installed his servant into a High Republic Era Jedi outpost on Tempes, hoping that anyone seeking knowledge from the place would be caught in his trap. The Inquisitor's spirit, still burning from the flames his body had been destroyed in aboard the Sovereign, haunted the structure for years, killing any seekers of knowledge who stepped foot into its halls. At some point, the partially trained Padawan Verla discovered the outpost, but abandoned the place after sensing the dark presence of the Inquisitor that resided within.\nAfter losing his lightsaber in a duel with Vader on Cloud City in 3 ABY, the aspiring Jedi Luke Skywalker learned of the Tempes outpost from Verla and traveled there, hoping to retrieve a new weapon. Inside, the Inquisitor's spirit confronted the boy and taunted him for his lack of training. Armed with the lightsaber of a Jedi Temple Guard, Skywalker battled the spirit. The ghostly Inquisitor gained the upper hand in the duel, knocking the would-be Jedi to the ground and mocking him for his devotion to the Jedi Order. Although the dark side adept sneered that the Force did not save the Order from extinction, the sight of ancient relics in the outpost, still standing after centuries, motivated Skywalker to push back. The aspiring Jedi recognized that service to a greater good was worth dying for, and, with his new weapon, sliced off the spirit's hand and delivered a slash to his chest, causing the Inquisitor to disappear.\nIn another part of the galaxy, Vader sensed the skirmish on Tempes and ordered the crew of his shuttle to bring him there. However, by the time he arrived, Skywalker had escaped. The Dark Lord berated the Inquisitor, whose ghostly figure had since reformed itself. The Pau'an pleaded with his master, begging to be set free from the curse the latter had bestowed upon him. Vader, however, was not satisfied with his pawn's work and refused. The Inquisitor looked on as the latter departed from the place that he could not, repeating to himself that there were things worse than death before fading away into darkness.\nDuring his attempt to restore the Jedi Order, Jedi Master Luke Skywalker, along with his nephew and apprentice Ben Solo, and the explorer Lor San Tekka went on a mission to the planet Elphrona where they found a Jedi Outpost filled with Jedi artifacts. Skywalker mentioned to Solo about how the last time he found a lightsaber in a similar outpost, it had been a trap and had almost killed him.\nA male Pau'an, the Grand Inquisitor had furrowed ashen white skin, stood 1.98 meters in height, and weighed 80 kilograms. Prior to his fall to the dark side, his eyes had gray sclerae and silver irises and pupils, along with light red markings around his eyes and down the sides of his face. After his fall, the Grand Inquisitor's pupils turned black and his irises became yellow with red rims, though his irises sometimes faded to brown when he was unagitated. He also adorned his face with dark side tattoos inked in the same shade of red as human blood, striking fear into targets and subordinates alike. Although he was a physical opponent for Jedi and tapped into the dark side of the Force, he did not appear overly emotional, instead operating as a cold and analytical mind. Whatever intensity he showed was a result of his purpose in completing his mission. He also resented the Jedi for taking him from his home before he was old enough to resist. He also felt that Jocasta Nu's refusal to let him search through the Jedi Archives, feeling the Jedi restricting knowledge of the dark side of the Force was repressive.\nThrough the dark side, the Grand Inquisitor was able to learn about individual Jedi and use their secrets against them. He studied the records of the Jedi Temple to not only identify Jedi but also have an understanding of their combat forms and traditions. His knowledge was extensive enough that he could identify who a Jedi was trained by, such as when he identified Depa Billaba as Jarrus' Jedi Master, and identify their fighting style in 10.6 seconds. He utilized this, like his lightsaber, to inflict an opponent with fear, which was his most powerful weapon against his enemies. Once in combat, he did not show mercy, having been tasked with judging and eliminating Jedi survivors. The Inquisitor also supported Captain Piers Roddance's view that the Empire needed to purge itself of all weakness and regarded compassion as the most insidious weakness.\nAfter realizing he had been defeated by Jarrus, the Grand Inquisitor chose death rather than face the wrath of his master for his failure. He could not truly escape Vader, however, as the Dark Lord continued to use the Pau'an's spirit for his personal needs. After years of serving as Vader's watchdog on Tempes, the Inquisitor believed that he would be cursed to do so for eternity.\nThe Grand Inquisitor was a practitioner of the dark side of the Force and trained in lightsaber combat, having learned to use and counter all seven forms recognized by the Jedi Order. He wielded a double-bladed lightsaber, which he used in multiple settings: single-bladed, double-bladed, as well as double-bladed with the blades spinning on the hilt. In addition to using the weapon to unnerve his enemies, he wielded it in order to quickly and efficiently end combat with as little effort as was required. This allowed him to skillfully execute the Jedi he encountered. The Inquisitor also demonstrated skill in the use of dual blades to the point of using a single-bladed lightsaber and his double-bladed spinning lightsaber at the same time, such as when he fended off a giant fyrnock in Fort Anaxes. The Grand Inquisitor held some skill in Makashi, able to hold the upper hand against Kanan Jarrus twice whilst using the form before quickly defeating him. He would sometimes use a one-handed dueling technique not unlike that of Count Dooku, a Makashi master.\nIn addition to being a formidable lightsaber duelist, the Grand Inquisitor was skilled in the use of telekinesis. He possessed enough telekinetic power to push Kanan Jarrus clear across a hall and throw his lightsaber with lethal precision. The Inquisitor had a keen Force Sense, which he demonstrated during his pursuit of Kanan Jarrus and Ezra Bridger on Empire Day. While interrogating Kanan, the Inquisitor demonstrated an affinity for mind tricks and the mind probe, allowing to potentially compel his victims to divulge information or to scan their thoughts and emotions for it. The Grand Inquisitor was also able to easily stop a lightsaber strike from the Third Sister and knock her aside with the Force. He was also a skilled pilot, and commonly demonstrated his competence in flying a TIE prototype while hunting rebels.\nEven in death, the Grand Inquisitor was a force to be reckoned with. He served as a formidable opponent to the young Luke Skywalker, although the boy was able to best him in combat. As a spirit, the Inquisitor was able to float above the ground and interact physically with his surroundings, similar to the light side's Force spirits. He could also be injured in this state, noticeably grimacing in pain and evaporating into the air after Skywalker cut off his ghostly hand and slashed his chest. These wounds, however, were not permanent, as the Inquisitor was later able to reform.\nThe Jedi Knight who would become the Grand Inquisitor wore formal robes and an identity-concealing mask during the days of the Jedi Order, the ultimate expression of emotional detachment required in service to a higher calling. He also carried a folding lightsaber pike, a thick and imposing double-bladed weapon that produced a distinctive yellow blade.\nAs an Inquisitor, he wore an Imperial style uniform and on one occasion a hooded robe over his Imperial uniform. During his flights in his TIE Advanced v1 starfighter, he wore a Special Adjutant's Helmet. As a Pau'an, he wore coverings to protect his hypersensitive ears. The Grand Inquisitor carried his own gyroscopic double-bladed lightsaber, a shared weapon among members of the Inquisitorius. He used this lightsaber in order to intimidate his opponents. In particular, he was able to throw inexperienced Jedi off-balance. Because Jedi relied on balanced emotions, the imbalance gave the Inquisitor an edge in combat. He carried this weapon even as a spirit.\nThe Grand Inquisitor was created as one of the primary antagonists of the animated television series Star Wars Rebels. When designing the character, who is voiced by actor Jason Isaacs, the look and species went through several iterations and was a topic of much discussion at Lucasfilm. The production team wanted to ensure that the character was not a carbon copy of iconic past villains such as Darth Maul or Darth Vader. At one point, the Inquisitor was designed as a Chagrian. Eventually, they decided to make the character a Pau'an, which, according to series executive producer Dave Filoni, was when the character fell into place. Fellow executive producer Simon Kinberg felt it gave the character a real and human quality, while at the same time evoking a \"creaturely,\" terrifying, and nightmarish look.\nIn further differentiating the Inquisitor from past villains, the production team crafted him as a cold and analytical character who presents himself as elegant, sophisticated, and educated. Furthermore, they did not want him to be similar to villains from cartoons from the 1980s, which Lucasfilm's Pablo Hidalgo described as having the villains lose in every episode yet still be presented as a credible threat. Instead, the Inquisitor was meant to be someone whose arrival was significant and a challenge to the rebels.\nThe character was revealed at New York Comic Con 2013 during a panel about the show, in which a video was shown introducing the Inquisitor as a Jedi hunter who would be a recurring antagonist for the heroes. The Inquisitor made his first on-screen appearance in Star Wars Rebels: Spark of Rebellion, which premiered on October 3, 2014.\nOn October 28, 2015, Filoni revealed that the Grand Inquisitor appeared in Star Wars: The Clone Wars, although the audience didn't know it. The episode \"Shroud of Darkness\" revealed that the Inquisitor was once a Jedi Temple Guard and a Jedi Knight. At a press conference for \"Twilight of the Apprentice,\" the finale of the show's second season, Filoni revealed that the Grand Inquisitor was in The Clone Wars fifth season finale, \"The Wrong Jedi,\" as one of the Jedi Temple Guards who escorted Ahsoka Tano from the Jedi Temple and brought Barriss Offee to trial before Supreme Chancellor Palpatine. At Dragon Con 2018, Henry Gilroy revealed an idea that the Inquisitor murdered the other Temple Guards when Order 66 happened to allow Anakin Skywalker and the 501st Legion access into the Jedi Temple.\nPlans were initially conceived to include the Grand Inquisitor in the video game Star Wars Jedi: Fallen Order in a role that would see him kill the Second Sister as punishment for her failure to complete her mission. Ultimately it was decided that his tragic story was too similar to the Second Sister's, leading them to include Darth Vader in that role instead. Concept art for his character would end up being included in the game's art book, with one of the pieces of art depicting him standing next to Cal Kestis when Vader appears.\nThe character also ended up being mentioned briefly in the game during the boss fight with the Ninth Sister.\nThe Grand Inquisitor appeared in Obi-Wan Kenobi, a 2022 television series aired on Disney+, where he was portrayed by Rupert Friend. In Stuart Beattie's script for an Obi-Wan Kenobi feature film, Reva was going to be the only Inquisitor. The writer didn't include the Grand Inquisitor because he later appeared in Star Wars Rebels, meaning that he couldn't be killed. Beattie felt like having no one die would take away from the jeopardy of the story. The film eventually became a series and the Grand Inquisitor was included. Friend wanted to honor the character as he saw him, so he almost deliberately didn't watch Star Wars Rebels. Friend, director Deborah Chow, Dave Filoni, and the crew wanted a fresh portrayal that was faithful to the character's spirit without doing an impression of the animated version. Writer Joby Harold wrote that the Grand Inquisitor enjoys the sound of his own voice and talks a lot, so Friend spoke like someone who likes their own voice.\nThe lightsaber was shifted to accommodate for Friend's hands. Friend went through lightsaber training with the stunt guys who are master swordsmen and masters of several forms of martial arts. The make-up and prosthetics took four hours to apply every day. Most mornings, Friend had three people working on him until the rest of the crew arrived. All of the armor together weighed about 45 pounds and the cape was weighted with chains to move in \"a badass way.\" Between takes, the crew rushed to Friend to cool him off with neck fans they invented, though the actor still sweated a lot on set.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Inquisitorius",
  "/wiki/Grand_Inquisitor",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Maz%27s_Scoundrels",
  "/wiki/Force_Collector",
  "/wiki/The_Orphanage",
  "/wiki/Star_Wars:_The_Dark_Side",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Utapau",
  "/wiki/47_BBY",
  "/wiki/4_BBY",
  "/wiki/Sovereign",
  "/wiki/Mustafar_system",
  "/wiki/Pau%27an",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Temple_Guard",
  "/wiki/Galactic_Empire",
  "/wiki/Darth_Sidious",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi_Knight",
  "/wiki/Jedi_hunter",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Imperial_Palace",
  "/wiki/Clone_Wars",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Barriss_Offee",
  "/wiki/Death",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Galactic_Emperor",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Spectres",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Jedi",
  "/wiki/Kanan_Jarrus",
  "/wiki/Ezra_Bridger",
  "/wiki/Duel_on_Stygeon_Prime",
  "/wiki/Rescue_of_Tseebo",
  "/wiki/Asteroid",
  "/wiki/Fort_Anaxes",
  "/wiki/Lothal",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Raid_on_the_communications_tower",
  "/wiki/Mustafar",
  "/wiki/Action_at_Mustafar",
  "/wiki/Orbit",
  "/wiki/Lightsaber_combat",
  "/wiki/Lord",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Jedi_outpost_(Tempes)",
  "/wiki/Tempes",
  "/wiki/Skywalker_lightsaber",
  "/wiki/3_ABY",
  "/wiki/Luke_Skywalker",
  "/wiki/Standard_day",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Reproduction",
  "/wiki/Standard_year",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Coruscant",
  "/wiki/Jedi_Code",
  "/wiki/Chief_Librarian",
  "/wiki/Jocasta_Nu",
  "/wiki/Jedi_Archives",
  "/wiki/Datafile",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Coruscant_Underworld",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Supreme_Chancellor",
  "/wiki/Duel_at_the_Jedi_Temple",
  "/wiki/The_Force",
  "/wiki/Order_66",
  "/wiki/Darth",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/The_galaxy",
  "/wiki/Emperor",
  "/wiki/Sith",
  "/wiki/Duel_in_the_former_Jedi_Temple",
  "/wiki/Sith_Lord",
  "/wiki/Cyborg",
  "/wiki/The_Grand_Inquisitor%27s_lightsaber",
  "/wiki/Inquisitorius_Headquarters",
  "/wiki/The_Works",
  "/wiki/Clone_trooper",
  "/wiki/Jedi_Master",
  "/wiki/Luminara_Unduli",
  "/wiki/Spire_(Stygeon_Prime)",
  "/wiki/Prison",
  "/wiki/Stygeon_Prime",
  "/wiki/Hologram",
  "/wiki/Second_Sister",
  "/wiki/Fifth_Brother",
  "/wiki/Sixth_Brother",
  "/wiki/Seventh_Sister",
  "/wiki/Eighth_Brother",
  "/wiki/Ninth_Sister",
  "/wiki/Tenth_Brother",
  "/wiki/Naq_Med",
  "/wiki/Unidentified_orphanage",
  "/wiki/Gaaten",
  "/wiki/Kira_Vantala",
  "/wiki/Refugee",
  "/wiki/Elish",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_training",
  "/wiki/Farm",
  "/wiki/Moon",
  "/wiki/Raada",
  "/wiki/Raada_Uprising",
  "/wiki/Farmer",
  "/wiki/Fleet",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Agent",
  "/wiki/Iskat",
  "/wiki/Unidentified_Twi%27lek_Inquisitor",
  "/wiki/Eeth_Koth",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Coleman_Kcaj",
  "/wiki/Oppo_Rancisis",
  "/wiki/Selrahc_Eluos",
  "/wiki/Ka-Moon_Kholi",
  "/wiki/Rogue_Inquisitor_chase",
  "/wiki/14_BBY",
  "/wiki/Kashyyyk",
  "/wiki/Cal_Kestis",
  "/wiki/Partisans",
  "/wiki/Liberation_on_Kashyyyk",
  "/wiki/Imperial_Refinery",
  "/wiki/Kashyyyk_resistance",
  "/wiki/9_BBY",
  "/wiki/Mission_to_Tatooine_(Galactic_Empire)",
  "/wiki/Tatooine",
  "/wiki/Reva_Sevander",
  "/wiki/Mos_Eisley",
  "/wiki/Unidentified_saloon_owner",
  "/wiki/Nari",
  "/wiki/Vect_Nokru",
  "/wiki/Mercenary",
  "/wiki/Kidnapping_of_Leia_Organa",
  "/wiki/Alderaanian",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Daiyu",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Fourth_Sister",
  "/wiki/Hunt_for_Obi-Wan_Kenobi",
  "/wiki/Senator",
  "/wiki/Garrison",
  "/wiki/Standard_hour",
  "/wiki/Bounty",
  "/wiki/Lightsaber",
  "/wiki/Jabiim",
  "/wiki/Devastator",
  "/wiki/Kawlan_Roken",
  "/wiki/Unidentified_Devastator_captain",
  "/wiki/Battle_of_Yavin",
  "/wiki/Cadet",
  "/wiki/Academy_for_Young_Imperials",
  "/wiki/Project_Harvester",
  "/wiki/Dhara_Leonis",
  "/wiki/Tepha_Leonis",
  "/wiki/Zare_Leonis",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Mission_to_free_Wookiee_prisoners",
  "/wiki/Wookiee",
  "/wiki/Slavery",
  "/wiki/Spice_mines_of_Kessel",
  "/wiki/Kessel",
  "/wiki/Gall_Trayvis",
  "/wiki/Imperial_Senate",
  "/wiki/Stormtrooper",
  "/wiki/Depa_Billaba",
  "/wiki/Form_III",
  "/wiki/Phantom",
  "/wiki/Commandant",
  "/wiki/Cumberlayne_Aresko",
  "/wiki/Mission_to_destroy_a_kyber_crystal",
  "/wiki/Kyber_crystal",
  "/wiki/Jai_Kell",
  "/wiki/Unidentified_village_(Vyndal)",
  "/wiki/Vyndal",
  "/wiki/Yeleb",
  "/wiki/Skirmish_on_Vyndal",
  "/wiki/Eta-2_Actis-class_light_interceptor",
  "/wiki/Unidentified_Jedi_(Vyndal)",
  "/wiki/Pilot",
  "/wiki/Human",
  "/wiki/Cruiser",
  "/wiki/Unidentified_Vyndal_species",
  "/wiki/Empire_Day",
  "/wiki/TIE_Advanced_v1",
  "/wiki/Tseebo",
  "/wiki/Imperial_Information_Office",
  "/wiki/The_Inquisitor%27s_TIE_Advanced",
  "/wiki/XX-23_S-thread_tracker",
  "/wiki/Unidentified_Stormtrooper_Commander_(PM-1203)",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Fyrnock",
  "/wiki/Nazhros_Oleg",
  "/wiki/Arkanis_Academy",
  "/wiki/Captain",
  "/wiki/Piers_Roddance",
  "/wiki/Merei_Spanjaf",
  "/wiki/Area_Null",
  "/wiki/Project_Unity",
  "/wiki/Brendol_Hux",
  "/wiki/DDM-38",
  "/wiki/Vice_Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Imperial_Navy",
  "/wiki/Gorse",
  "/wiki/Hera_Syndulla",
  "/wiki/Officer",
  "/wiki/Lahn",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Governor",
  "/wiki/Minister",
  "/wiki/Maketh_Tua",
  "/wiki/Taskmaster",
  "/wiki/Myles_Grint",
  "/wiki/Flagship",
  "/wiki/Mind_probe",
  "/wiki/Fortress_Vader",
  "/wiki/Ezra_Bridger%27s_lightsaber",
  "/wiki/Attack_on_Phoenix_Squadron_(4_BBY)",
  "/wiki/Phoenix_Cell",
  "/wiki/0_BBY",
  "/wiki/Hyperspace_tunneling",
  "/wiki/Loth-wolf",
  "/wiki/Mission_to_the_Lothal_Jedi_Temple",
  "/wiki/Maz_Kanata",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/High_Republic_Era",
  "/wiki/Verla",
  "/wiki/Duel_on_Cloud_City",
  "/wiki/Cloud_City",
  "/wiki/Jedi_artifact",
  "/wiki/Standard_century",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Ben_Solo",
  "/wiki/Lor_San_Tekka",
  "/wiki/Mission_to_Elphrona",
  "/wiki/Elphrona",
  "/wiki/Elphrona_Outpost",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Blood",
  "/wiki/Second",
  "/wiki/Jar%27Kai",
  "/wiki/Form_II",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Force_push",
  "/wiki/Mind_trick",
  "/wiki/Mind_probe_(Force_power)",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Force_spirit",
  "/wiki/Hinged_double-bladed_lightsaber",
  "/wiki/Lightsaber_pike",
  "/wiki/Special_Adjutant%27s_Helmet",
  "/wiki/Ear",
  "/wiki/Double-bladed_lightsaber",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Jason_Isaacs",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Maul",
  "/wiki/Chagrian",
  "/wiki/Dave_Filoni",
  "/wiki/Simon_Kinberg",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2013",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion",
  "/wiki/October_3",
  "/wiki/October_28",
  "/wiki/2015",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Shroud_of_Darkness",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/The_Wrong_Jedi",
  "/wiki/2018",
  "/wiki/Henry_Gilroy",
  "/wiki/501st_Legion",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/2022",
  "/wiki/Disney%2B",
  "/wiki/Rupert_Friend",
  "/wiki/Stuart_Beattie",
  "/wiki/Deborah_Chow",
  "/wiki/Joby_Harold",
  "/wiki/Armor",
  "/wiki/Pound",
  "/wiki/Cape",
  "/wiki/Category:Images_of_the_Grand_Inquisitor",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_Force_Arena",
  "/wiki/Retcon",
  "/wiki/Darth_Vader_(2017)_6",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Darth_Vader_(2017)_8",
  "/wiki/Darth_Vader_(2017)_9",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Darth_Vader_(2017)_20",
  "/wiki/Part_I",
  "/wiki/Part_II",
  "/wiki/Part_III",
  "/wiki/Part_IV",
  "/wiki/Part_V",
  "/wiki/Part_VI",
  "/wiki/Rise_of_the_Rebels",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/The_Rebellion_Begins",
  "/wiki/Droids_in_Distress_(book)",
  "/wiki/The_Secret_Jedi:_The_Adventures_of_Kanan_Jarrus:_Rebel_Leader",
  "/wiki/Rise_of_the_Old_Masters",
  "/wiki/The_Inquisitor%27s_Trap",
  "/wiki/Servants_of_the_Empire:_Rebel_in_the_Ranks",
  "/wiki/Breaking_Ranks",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/The_Fake_Jedi",
  "/wiki/Star_Wars_Rebels_Magazine_3",
  "/wiki/Empire_Day_(episode)",
  "/wiki/Ezra%27s_Duel_with_Danger",
  "/wiki/Gathering_Forces",
  "/wiki/Kanan_12",
  "/wiki/Path_of_the_Jedi",
  "/wiki/Kanan%27s_Jedi_Training",
  "/wiki/Servants_of_the_Empire:_Imperial_Justice",
  "/wiki/Vision_of_Hope",
  "/wiki/Assessment",
  "/wiki/Star_Wars_Rebels_Magazine_11",
  "/wiki/Servants_of_the_Empire:_The_Secret_Academy",
  "/wiki/Call_to_Action",
  "/wiki/Battle_to_the_End",
  "/wiki/Rebel_Resolve",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Fire_Across_the_Galaxy",
  "/wiki/Star_Wars_Rebels:_Recon_Missions",
  "/wiki/Star_Wars_Rebels:_The_Siege_of_Lothal",
  "/wiki/Always_Two_There_Are",
  "/wiki/Ice_Breaking",
  "/wiki/Star_Wars_Rebels_Magazine_16",
  "/wiki/Wolves_and_a_Door",
  "/wiki/Age_of_Resistance_Special_1",
  "/wiki/Star_Wars_(2020)_5",
  "/wiki/Star_Wars_(2020)_6",
  "/wiki/Star_Wars_(2020)_19",
  "/wiki/Star_Wars_(2020)_20",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/The_Rise_of_Kylo_Ren_2",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/Dark_Legends",
  "/wiki/Angry_Birds_Star_Wars_II",
  "/wiki/Minecraft_Star_Wars",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_148",
  "/wiki/Bantha_Tracks_(newsletter)",
  "/wiki/Star_Wars_Magazine",
  "/wiki/Star_Wars_Magazine_1",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/Star_Wars_Rebels:_Meet_the_Rebels",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Ultimate_Sticker_Collection:_Star_Wars_Rebels",
  "/wiki/A_New_Hero",
  "/wiki/Star_Wars_Rebels:_Head_to_Head",
  "/wiki/Rebel_Rouser",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/Cowboy_Jedi",
  "/wiki/Dave_on_the_Dark_Side",
  "/wiki/Star_Wars_Insider_153",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars_Command",
  "/wiki/Star_Wars_Rebels_(toy_line)",
  "/wiki/Star_Wars_Rebels:_Beware_the_Inquisitor!",
  "/wiki/Designing_Star_Wars_Rebels",
  "/wiki/Star_Wars_Insider_154",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Rebels",
  "/wiki/Star_Wars_Insider_155",
  "/wiki/Rebels,_Animated",
  "/wiki/Note_for_Note:_The_Music_of_Star_Wars_Rebels",
  "/wiki/Sabine_My_Rebel_Sketchbook",
  "/wiki/Star_Wars_Rebels_Recounted",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/Star_Wars_Insider_157",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars_Rebels:_Complete_Season_One",
  "/wiki/StarWars.com",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Jedi_Challenge!",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_38",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_16",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Imperial_Light_Carrier_Expansion_Pack",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars_Helmet_Collection_28",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Star_Wars_Helmet_Collection_33",
  "/wiki/Star_Wars_Helmet_Collection_36",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Star_Wars:_Lightsaber_Battles",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Promise_of_Power",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/VT-49_Decimator_Expansion_Pack_(X-Wing:_Second_Edition)",
  "/wiki/Inquisitors%27_TIE_Expansion_Pack",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Helmet_Collection_69",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Star_Wars_Helmet_Collection_75",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_22",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/TIE_Fighters",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Inside_Intel:_The_Inquisitorius",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Sabotage_(episode)",
  "/wiki/January_31",
  "/wiki/2020",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Darth_Vader_(2017)_10",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_1",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/19_BBY",
  "/wiki/Servants_of_the_Empire:_Edge_of_the_Galaxy",
  "/wiki/A_New_Dawn_(novel)",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Knights_of_Fate",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Rebel_Journal_by_Ezra_Bridger",
  "/wiki/September_8",
  "/wiki/July_9",
  "/wiki/July_6",
  "/wiki/2021",
  "/wiki/Entertainment_Weekly",
  "/wiki/May_19",
  "/wiki/July_1"
 ]
}