{
 "name": "The_Client",
 "display_name": "The Client",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "Between 70 BBY and 61 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Nevarro"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Gideon's Imperial remnant",
      "The Client's squad",
      "The Client's squad"
     ]
    }
   ]
  }
 ],
 "content": "\"The Client\" was a human male who served as an Imperial officer in the Galactic Empire. After the Empire's fall, he continued with an Imperial remnant led by Moff Gideon. In 9 ABY, he and the Imperial scientist Doctor Pershing operated out of a safe house on the planet Nevarro, under orders to acquire and extract blood from the Force-sensitive infant alien Grogu, whom he called \"the asset.\" The Client hired many bounty hunters from the local Bounty Hunters' Guild in pursuit of his goal.\nOne such bounty hunter was the Mandalorian Din Djarin, whom the Client met with at his safe house. The Imperial gave the Mandalorian a beskar ingot as a down payment for the job and provided information and a tracking fob to secure the asset. Djarin was successful in his hunt and brought Grogu back to the safe house. Pleased at the mission's success, the Client paid the bounty hunter with a camtono of twenty beskar ingots. When Djarin questioned what would be done with the infant, the Imperial shut him down and had him leave.\nThe Client and Pershing extracted blood from Grogu, with the doctor keeping the infant from dying despite his colleague's lack of care for the asset's life. Meanwhile, Djarin, having a change of heart, returned and rescued the Child from the safe house. As a result, the Client took control of Nevarro City with Imperial reinforcements and sent bounty hunters from the Bounty Hunters' Guild to retrieve Grogu. The Guild agent Greef Karga coaxed Djarin back to Nevarro to try seize the Child back for the Client, but shifted loyalties and chose to help the Mandalorian and his allies.\nDjarin was cuffed and taken by Cara Dune, an ally of the Mandalorian's, and Karga to the Client in Nevarro City cantina, bringing an empty pram as a decoy of Grogu. There the Imperial spoke with Djarin about the planet Mandalore's rebelliousness against the late Empire and then requested to see the Child. Before he could so the Client was interrupted by a call from Gideon. The moff asked his associate to check the pram for the infant again, before having his squad of death troopers fire on the cantina and kill the Client and his men.\nBorn between 70 and 61 BBY, the human male known as \"the Client\" eventually became an Imperial officer in the Galactic Empire, earning himself an Imperial medallion indicative of high honor. The Empire fell at the Battle of Jakku in 5 ABY, but the Client continued to serve with remnants of the government and wore his medal in doing so, coming to work with an Imperial remnant led by the warlord Moff Gideon. While under Gideon's command, the Client operated from a safe house in Nevarro City on the Outer Rim planet Nevarro. Doctor Pershing, a scientist who had also served as an officer within the Empire, worked under the Client and Gideon and had a laboratory in the safe house.\nIn 9 ABY, the Client was under orders from Gideon to acquire and extract blood from a Force-sensitive male infant of the same species as former Jedi Grand Master Yoda named Grogu, although the Imperial referred to him as \"the asset.\" The Imperials possessed the coordinates of the Child's last known location and tracking fobs that could follow the asset's position when close enough.\nThe Client planned to use bounty hunters to retrieve Grogu and informed Greef Karga, the Bounty Hunters' Guild's agent on Nevarro, of the job. Rather than providing the traditional puck and chain code, the Client wished to meet the hunter who accepted the job face to face and provided chits for them to visit his safe house. Many bounty hunters from the Guild accepted the job. Karga informed the Mandalorian bounty hunter Din Djarin of the job after he turned in his previous bounties. After the Mandalorian accepted, the guild agent then contacted the Client to let him know Djarin was coming to meet him, describing the hunter as the best in the parsec, but also expensive.\nThe Client waited at his desk in the safe house, guarded by four armed stormtroopers. A GNK power droid led Djarin to the room, where the Client greeted him. Pershing then hastily entered the room, startling the Mandalorian into immediately drawing his weapons and prompting the stormtroopers to do the same on the bounty hunter. Pershing apologized, and the Client stood to introduce the scientist before asking that Djarin lower his guns. When the bounty hunter demanded that the stormtroopers lower theirs first, stubbornly bragging about his odds to defeat the four, the Client obliged and signaled to the troopers.\nWith the standoff settled, Djarin sat at the Client's request and the Imperial presented an ingot of beskar to him as a down payment, explaining that more of the material would be handed over on delivery of the asset they sought. After Pershing clarified that the asset they wanted needed to be delivered alive, the Client revealed that he would also accept proof of termination for a lesser payment, a statement that did not please the scientist.\nWhen Djarin asked for the puck, the Client revealed that, for discretionary reasons, they could only provide a tracking fob, the last four digits of the asset's chain code—his age of fifty years old—and the Child's last known location. The Imperial assured the Mandalorian that an individual of his skill should make short work of the job. Djarin thus took the down payment and the fob and exited the room to complete the job. As the bounty hunter did so, the Client remarked that the beskar belonged back into the Mandalorians' hands, adding that it was good to restore the natural order of things.\nWith the data and the fob, Djarin was able to find and acquire Grogu on the planet Arvala-7. He informed Karga as he made his way back to Nevarro and was advised to take the asset straight to the Client. When the Mandalorian arrived, the Imperial waited at his desk with a fob with Pershing standing at his side. Excited, the Client rose from his seat and approached the Child's hovering pram, using the fob to confirm it was indeed the asset. Pershing then scanned Grogu and confirmed he was in good health and fit for experiments.\nThe Client then remarked that Djarin's reputation was justified. The bounty hunter asked him how many other hunters had fobs, to which the Imperial responded that he had to ensure the acquisition of the asset. The Client then produced the promised payment, a camtono containing twenty ingots of beskar and handed it over to Djarin. Before he left, the Mandalorian asked what the Imperials planned to do with the infant, but the Client glared at him and refused to say, stating that per Guild tradition the transaction was over and so should be forgotten.\nAfter Djarin left, the Client and Pershing discussed extracting Grogu's blood. The Imperial wished for the blood to be extracted swiftly by any means possible, but the doctor kept him from harming the asset, arguing that Gideon had specifically ordered Grogu to be brought back alive in a confrontation later that day. In that argument, the Client told Pershing to simply extract what they needed from the Child as quickly as possible, as he could no longer promise that the doctor would be kept safe.\nUnbeknownst to the pair, Djarin was spying on their conversation. The Mandalorian had become fond of Grogu and was there to rescue the Child. After the Client left him, Pershing was able to retrieve some of the asset's blood. That was when Djarin broke into the safe house and liberated Grogu from Pershing, sparing the doctor. The fobs for the Child were reactivated to have the members Bounty Hunters' Guild intercept their rogue hunter and take the asset back, but Djarin's Mandalorian tribe intervened and helped their fellow Mandalorian escape with the infant.\nAfter Djarin escaped with Grogu, the Client took control of Nevarro City, with Imperial remnant reinforcements coming from an Imperial facility on the far side of the planet where Pershing was experimenting with Grogu's blood. The Imperial forces attacked the Mandalorian tribe at its covert in the city's sewers and killed many of them. The Client also used the Guild, sending its hunters out to find Djarin while he sought to lie low where the Client could not find him.\nWith all the Guild hunters that intercepted Djarin being killed, Karga coaxed Djarin to return to Nevarro, pretending to want help in overthrowing the Client and freeing Nevarro City from its occupation. The agent in reality intended to kill the Mandalorian and take Grogu to the Imperial. Both convened on the planet with their respective posses, but after having his life saved by the Child, Karga betrayed his own hunters and chose to help Djarin and his allies, the ex-rebel Cara Dune and the Ugnaught Kuiil, to take out the Client.\nKarga and Dune escorted a cuffed Djarin to Nevarro City, intending to get close to the Client before releasing the Mandalorian and killing the Imperial. They also brought Grogu's pram empty as they made their way to the public house where the Client was based. The Client himself was seated in the cantina, guarded by a squad of stormtroopers. Rising from his seat, the Imperial inspected Djarin's new Mandalorian armor, forged from the beskar he had given the Mandalorian. Offering Karga a drink, he had the agent and Djarin sit with him at a table.\nThe Client questioned Djarin why Mandalore, the Mandalorian homeworld, resisted Imperial rule, claiming that the Empire brought justice to every system it conquered. He then asked the Mandalorian if peace had truly been restored after the Empire's fall and stated that it only resulted in death and chaos. The Client then requested that he see Grogu with his own eyes, but was informed by Karga that it was asleep. The Imperial insisted that they would be quiet and ordered the agent to open the hovering pram, before he was interrupted by a call from Moff Gideon.\nThe Client answered Gideon's call, with the moff asking him if Grogu was secured. The Imperial confirmed that he was in their hands and was sleeping, but Gideon told him to inspect the pram again. As the Client looked on in suspicion, a squad of Gideon's death troopers, positioned outside the public house, immediately opened fire on the cantina, killing the Imperial, his stormtroopers, and the protocol droid that served as the bartender. Afterward, Gideon and his battalion of troops surrounded the establishment and gave Djarin and his allies an ultimatum to surrender Grogu. The moff's attempt, though, was unsuccessful, as the Mandalorian and his cohorts were able to escape the Imperial forces in the end, killing many troopers in the process.\nA human male standing at 1.83 meters , the Client had light skin, white hair and light blue eyes. Stoic- and stern-faced, he had a very refined, calm and polite way of speaking. The Imperial remained calm while Din Djarin and the stormtroopers drew arms in his presence and being willing to have his men lower their weapons first. His appearance intimidated Greef Karga, who spoke cautiously when referring to him.\nThe Client was very loyal to the Empire and looked back fondly at the times when the government was in power, continuing to wear the Imperial medallion after its fall. He believed the late faction provided every system it touched with peace and prosperity and saw it as the only one worth pursuing, claiming that only death and chaos had ensued in its absence. The Client disliked those who resisted Imperial rule and hindered what he called the \"natural order of things.\" His expression was grave when talking about the times that had come after the Empire's end.\nThe Client was knowledgeable in Mandalorian culture, disheartened that their world Mandalore had resisted Imperial rule. He saw Djarin's beskar payment as a beginning to make up for the Empire's destruction of Mandalore. As Djarin left, the Client stated he was pleased to see the beskar returned to its rightful owners. Inspecting Djarin's newer Mandalorian armor, he complemented the craftsmanship of the traditional Mandalorian artisans. The Imperial was sure to acknowledge the Mandalorian's own reputation, considering it proven when the bounty hunter brought Grogu to him.\nThe Client was obsessed with acquiring Grogu, set on acquiring him by any means necessary whether he came back alive or not. Despite having previously agreed with Pershing that they would required the asset to be delivered alive, he offered Djarin the alternative of termination and claimed to be pragmatic when the scientist complained. When the Mandalorian brought Grogu to the Imperial, the Imperial rose from his seat in excitement and smiled as he inspected the asset.\nThe Client was secretive and serious about his intentions with the Child, glaring at Djarin when the bounty hunter asked what would happen to the creature and making an insult about how endangered the Mandalorian's kind had become. He wished for the task of acquiring Grogu's blood to be completed as soon as possible, continuing to set aside the need to keep the creature alive in the process. After Karga pretended to return the asset to him, he requested to be able to see the Child, being insistent on opening the hovering pram despite claims that the creature was asleep.\nThe Client wore a black, fur-edged, coat over a brown shirt with dark gray trousers and black boots. His Imperial medallion hung around his neck. He also possessed a camtono of beskar that had been taken during the Great Purge of Mandalore.\nThe Client first appeared in the \"Chapter 1: The Mandalorian,\" the debut episode of the Disney+ television show The Mandalorian's first season, which was directed by Dave Filoni and aired on November 12, 2019. The character also appeared in the \"Chapter 3: The Sin\" and \"Chapter 7: The Reckoning,\" later episodes of the season that were directed by Deborah Chow and released on November 22 and December 18 of that year. The Client was portrayed by the award winning film director Werner Herzog, with John Dixon serving as a stunt double for him in \"Chapter 7: The Reckoning.\"\nWhile Herzog was included in The Mandalorian's initial casting announcement on December 12, 2018, the character of the Client was first mentioned in the show's panel at Celebration Chicago on April 14, 2019. The character then appeared in the show's official trailer, published on YouTube on August 24 of that year. His credited title of \"the Client\" was first mentioned in the Walt Disney Company's Direct-to-Consumer \u0026 International website.\nHerzog was invited to play The Mandalorian by its showrunner and creator, Jon Favreau, who was reportedly very set on having him for the role. The highly acclaimed director's only knowledge of the Star Wars saga by that point had been from trailers and excerpts as, by his own account, he did not watch many films. He had no knowledge of what Favreau's past work had been either, but believed that the showrunner looked highly upon his acting, and requested to look at the screenplay. The filmmaker liked what he saw of the screenplay given to him and felt that the dark, untrustworthy figure pitched to him would be easy to play. Herzog also saw the acting job as an opportunity to earn money back after financing his 2019 film Family Romance, LLC out of his own pockets.\nArtist Brian Matyas created concept art of the Client after Herzog was cast to play the character. The artist attempted to give an Italian mob boss design to the character. Filming for \"Chapter 1: The Mandalorian\" and \"Chapter 3: The Sin\" took place between October 1 and October 26 in 2018, while \"Chapter 7: The Reckoning,\" was filmed shortly after, from October 29 to November 12. During production, Herzog was given a completely different title for the series, instead of The Mandalorian, due to the secrecy.\nWith the Star Wars universe being new to him, Herzog was briefed on his character and the setting, coming to question whether the stormtroopers were the Client's allies or enemies. He was deeply fascinated by the technology of The Mandalorian's set, the Volume, calling it a step out of the \"obsolete\" use of green screens as one could better view the environment their character was in during the filming process.\nFor one scene involving Greef Karga and Din Djarin in the Nevarro cantina, in \"Chapter 1: The Mandalorian,\" Karga's actor Carl Weathers attempted to convey the Client's power over Karga by trying to sound more cautious when discussing Herzog's character than he was when generally talking to the Mandalorian. Weather had a lot of respect for Herzog and his work, referring to the acclaimed filmmaker as \"maestro\" the entire time the pair worked together on set. In a later interview, the actor reflected that working with Herzog was the highlight of his career.\nFiloni later remarked that the Client was one of the first human faces he ever filmed in live-action, the director's experience having been with animated projects such as Star Wars: The Clone Wars up to that point. Herzog considered his part in The Mandalorian's first season to provide the \"basic ingredients\" of the story. From understanding more of the Star Wars universe, he considered it like an expanding mythology.\nUpon first seeing Grogu, known to many as \"Baby Yoda,\" Herzog was astounded by how realistic the puppet and animatronic for the character worked and saw it as a great mechanical achievement, calling it \"heartbreakingly beautiful.\" According to Chow, when she was shooting the Client and Grogu's scene in \"Chapter 3: The Sin,\" Herzog was so entranced with the Child's puppet that he seemingly forgot the baby was a puppet at all, starting to direct it as if it was a person.\nAt the end of that shot, Chow and Jason Porter, a visual effects supervisor for Industrial Light \u0026 Magic , went to do a \"plate shot,\" where the puppet was removed and ILM could implement a CGI version of Grogu in case the practical shot was not satisfactory. Herzog disliked the decision, considering the Child's practical look to be a great step forward for filming. He reportedly told the creators to commit to the magic of the puppet and called them all cowards. Favreau and Filoni, who were among the recipients of Herzog's complaint, came to agree and used Grogu's puppet for the shots as much as possible, making sure that the CGI—the rendered Baby Yoda—did not exceed the puppet's abilities.\nJoe Schreiber's 2021 junior novelization of The Mandalorian's first season presents a number of the Client's lines differently to how they were said or presented in the show. The 2020 storybook The Mandalorian: A Clan of Two, written by Brooke Vitale, states that the Client's soldiers attacked Din Djarin's group, injuring Greef Karga, whereas in Chapter 7, the attackers were a flock of Nevarro reptavians. This article follows the show's version of events.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/The_Client",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/61_BBY",
  "/wiki/9_ABY",
  "/wiki/Nevarro",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/The_Client%27s_squad",
  "/wiki/Imperial_officer",
  "/wiki/Battle_of_Jakku",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Scientist",
  "/wiki/Doctor",
  "/wiki/Pershing",
  "/wiki/Imperial_Remnant_safe_house",
  "/wiki/Planet",
  "/wiki/Blood",
  "/wiki/Force-sensitive",
  "/wiki/Youngling",
  "/wiki/Yoda%27s_species",
  "/wiki/Grogu",
  "/wiki/Bounty_hunter",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Beskar",
  "/wiki/Tracking_fob",
  "/wiki/Camtono",
  "/wiki/Incident_on_Nevarro",
  "/wiki/Nevarro_City",
  "/wiki/Greef_Karga",
  "/wiki/Stun_cuffs",
  "/wiki/Carasynthia_Dune",
  "/wiki/Nevarro_school",
  "/wiki/Hovering_pram",
  "/wiki/Mandalore",
  "/wiki/Gideon%27s_guard",
  "/wiki/Death_trooper",
  "/wiki/Cantina",
  "/wiki/Death",
  "/wiki/File:DjarinKarga-Bounty-TMS1C1.ogg",
  "/wiki/Medal",
  "/wiki/5_ABY",
  "/wiki/Politics",
  "/wiki/Warlord",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Officer",
  "/wiki/Laboratory",
  "/wiki/Jedi",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Holopuck",
  "/wiki/Chain_code",
  "/wiki/Chit",
  "/wiki/Parsec",
  "/wiki/File:Client-Expensive.ogg",
  "/wiki/Stormtrooper",
  "/wiki/GNK_power_droid",
  "/wiki/Weapon",
  "/wiki/Trooper",
  "/wiki/Standard_year",
  "/wiki/File:DjarinClient-Child-TMS1C3.ogg",
  "/wiki/Arvala-7",
  "/wiki/The_Tribe",
  "/wiki/Nevarro_Imperial_base",
  "/wiki/Attack_on_the_Tribe",
  "/wiki/Mandalorian_covert",
  "/wiki/Nevarro_sewer",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Ugnaught",
  "/wiki/Kuiil",
  "/wiki/Mandalorian_armor",
  "/wiki/Homeworld",
  "/wiki/Star_system",
  "/wiki/Unidentified_RA-7_protocol_droid_bartender",
  "/wiki/Bartender",
  "/wiki/Gideon%27s_battalion",
  "/wiki/Skirmish_on_Nevarro",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Time",
  "/wiki/Mandalorian_Armorer",
  "/wiki/File:Client-camtono.ogg",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Great_Purge_of_Mandalore",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/The_Mandalorian_Season_One",
  "/wiki/Dave_Filoni",
  "/wiki/November_12",
  "/wiki/2019",
  "/wiki/Chapter_3:_The_Sin",
  "/wiki/Chapter_7:_The_Reckoning",
  "/wiki/Deborah_Chow",
  "/wiki/November_22",
  "/wiki/December_18",
  "/wiki/Werner_Herzog",
  "/wiki/John_Dixon",
  "/wiki/December_12",
  "/wiki/2018",
  "/wiki/Celebration_Chicago",
  "/wiki/April_14",
  "/wiki/August_24",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Jon_Favreau",
  "/wiki/Star_Wars",
  "/wiki/Brian_Matyas",
  "/wiki/October_1",
  "/wiki/October_26",
  "/wiki/October_29",
  "/wiki/November",
  "/wiki/Carl_Weathers",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Jason_Porter",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Joe_Schreiber",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/2020",
  "/wiki/The_Mandalorian:_A_Clan_of_Two",
  "/wiki/Brooke_Vitale",
  "/wiki/Soldier",
  "/wiki/Nevarro_reptavian",
  "/wiki/Category:Audio_files_of_the_Client",
  "/wiki/Category:Images_of_the_Client",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_(manga)",
  "/wiki/The_Mandalorian_1",
  "/wiki/The_Mandalorian_2",
  "/wiki/The_Mandalorian_3",
  "/wiki/The_Mandalorian_4",
  "/wiki/Chapter_6:_The_Prisoner",
  "/wiki/The_Mandalorian:_Magnetic_Fun",
  "/wiki/The_Mandalorian:_This_is_the_Way",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Man_from_Mandalore",
  "/wiki/Star_Wars_Insider_193",
  "/wiki/November_20",
  "/wiki/Carl_Weathers_The_Weathers_Report",
  "/wiki/Star_Wars_Insider_194",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_196",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_One",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Cast",
  "/wiki/Technology",
  "/wiki/Practical",
  "/wiki/Score",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/The_Mandalorian:_Allies_%26_Enemies",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_Two",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Mando_Mania",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/Template:MandoDate",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Chapter_12:_The_Siege",
  "/wiki/Chapter_13:_The_Jedi",
  "/wiki/Chapter_8:_Redemption",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/November_15",
  "/wiki/April_29",
  "/wiki/2022",
  "/wiki/December_31",
  "/wiki/May_4",
  "/wiki/August_6",
  "/wiki/June_3",
  "/wiki/August_9",
  "/wiki/November_14",
  "/wiki/November_23",
  "/wiki/August_26"
 ]
}