{
 "name": "The_Ronin",
 "display_name": "The Ronin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Jaw prosthetic",
      "Respirator"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi clan",
      "Sith"
     ]
    }
   ]
  }
 ],
 "content": "The Ronin was the alias used by a male human former Sith who wandered the far edge of the Outer Rim Territories in the aftermath of the Sith rebellion. He would later be nicknamed as Grim. The Ronin had begun the rebellion as the Dark Lord of the Sith and led the Sith armies in battle after they broke away from the Jedi clans, seeking to control their own destinies and end the cycle of never-ending wars between rival feudal lords and their Jedi knights. The lords formed alliances as they sent their Jedi to battle the dark lord, his witch, their forces, and the Sith demons that the witch resurrected after their deaths. However, the dark lord grew disenchanted with what the Sith became during their rebellion and turned on his followers, ending the rebellion. The dark lord renounced the Sith, shed his former identity, and became the Ronin. After the rebellion failed, the former rival lords led a revitalized Empire that ruled much of the galaxy.\nAccompanied by the faithful astromech droid, B5-56, the Ronin wandered through the Outer Rim in a self-imposed exile and did not speak about his past. Pledging allegiance to no clan, he made it his life's mission to hunt and eliminate other Sith, collecting their kyber crystals to prevent them from causing any more evil. He was both guided and taunted by the disembodied voice of the Witch in his head to whom he sometimes responded aloud.\nTwenty years after his rebellion, he came upon a village on the planet Genbara that was being attacked by a bandit group led by Kouru, who claimed the title of Dark Lord of the Sith. Their lightsaber duel ended when the Ronin killed her; however, she awoke from her death as a Sith demon.\nAs the Ronin continued his journey, he met the Traveler when he heard them playing their flute. The Traveler accompanied him to the Osou spaceport.\nPrior to the reunification of the Empire, Jedi knights had served various constantly-warring feudal lords. The Sith arose as a splinter faction of the Jedi clans seeking self-determination and an end to the constant wars plaguing the galaxy. The individual who became the Ronin had once been a Dark Lord of the Sith who initiated and led the Sith rebellion against the state of feudalism in the galaxy. Together with a Sith witch, the future Ronin led the rebellious faction. The witch would resurrect the bodies of the dead before they could join the Force to create Sith demons that continued to fight for the Sith.\nAs the dark lord, he devised lightsaber auxiliary technology that extended the capabilities of lightsabers, and blueprints for his designs were distributed amongst the Sith cells. After the young warrior Kouru built her lightsaber, she received the dark lord's blueprints to construct a parasol auxiliary, and her Sith master made a fan auxiliary. The dark lord and the Sith witch had been in love, and they conceived a daughter, unknown to the dark lord.\nDuring the great muster on Rei'izu, the dark lord looked into the divine kyber mirror of Shinsui Temple and saw a vision of horrors and warfare. He became disenchanted with the rebellion he had led and turned his lightsaber against the Sith who had followed him. The Sith rebellion came to an end after the Ronin's change of heart. At the culmination of the rebellion, the Empire was reunited through alliances amongst the rival feudal lords, and the Jedi came to be the Emperor's most faithful servants. The Sith became scarce in the galaxy as they were hunted down by Jedi Knights and agents of the Empire, as well as by the Ronin himself. Unknown to the Ronin, the witch gave birth to their daughter on Rei'izu.\nTwo decades after the Sith rebellion, the Ronin wandered the Outer Rim Territories with his droid companion, B5-56. At some point, a lord fired a blaster bolt at the Ronin; although he dodged, it struck the left side of his face and left his jaw misshapen and scarred. Thereafter, the Ronin wore a metal prosthetic that supported his jaw from ear to ear, and he took the lord's blaster to carry on his own belt. He also acquired a mysterious voice whispering in his mind, urging him to danger. He made it his life's mission to hunt down other Sith, collecting their kyber crystals as to prevent them from causing further harm.\nEventually, the duo came to the planet Genbara, where the Ronin stopped at a teahouse just outside a village. He repaired the shopkeeper's power droid in exchange for food and tea, when a gang of bandits led by a self-styled Dark Lord of the Sith named Kouru attacked the village. Kouru's bandits rounded up the village's residents in a central area when a group of bounty hunters who had been hired to protect the village counter-attacked. They began to turn the tide of the battle when Kouru emerged, killing a Trandoshan guard with her lightsaber parasol.\nB5-56 had sustained damage from the attackers' shrapnel. The teahouse's the Sullustan shopkeep had once been a mechanic, so the Ronin entrusted his astromech to the store owner for repairs while a pot of tea boiled and departed to duel Kouru. The former Sith strolled casually down the village road towards the bandit leader amidst violent carnage until he reached her. Kouru asked the Ronin who would dare challenge her, telling the man he did not look like a villager. The errant Sith identified himself as \"just a simple wanderer.\" Kouru removed her lightsaber's parasol auxiliary and lept ferociously to strike him. However, the Ronin froze the bandit mid-air with telekinesis, leading her to boast \"it's been a long time since I killed a Jedi.\" The Ronin drew his red lightsaber and retorted that he was not a Jedi, unfortunately for her; claiming that if he were, she may have stood a chance.\nThe pair dueled in the village square before moving to a river. They continued to fight on floating logs down the river to the edge of a waterfall that concealed a temple. The bandits had killed all but one guard, a Gran, when the shopkeep's tea boiled. At that moment, B5-56 flew up in the air and launched a salvo of missiles which killed every bandit except Kouru.\nThe Ronin jumped off the log upon which he and Kouru had been balancing and lay in ambush in the temple below. Kouru followed his footsteps into the temple, where she saw the more handsome of his lightsabers activated. She struck the being holding his saber, cleaving it in half, only to see that it had been held by a metal statue of a Jedi rather than her foe. The Ronin then killed Kouru, stabbing her through the chest with the blade of his scabbard auxiliary. After returning to the village, he was initially mistaken for a Jedi knight by the child village chief. He demonstrated to the villagers that he was not by unsheathing one of his red blades and using it to shatter Kouru's lightsaber hilt. Although he initially collected the kyber crystal from within, the voice in the Ronin's head observed to him that the boy had a familiar look on his face. Recognizing that the boy was too ready to become old but had no protection to help him survive, the Ronin gave the crystal to the child and said it would ward off evil.\nAs the Ronin made his way to the Osou spaceport, he met a being who was playing their flute with little musical skill. They told the Ronin to call them the Traveler.\nHaving his status as a Sith revealed, he was hunted down by the mobilized Genbara army, but intercepted by Kouru, narrowly escaping her.\nThe Ronin joined the Traveler and their crew aboard the Poor Crow.\nThough no longer in the prime of his health in the decades after his rebellion, the Ronin was a capable lightsaber duelist and skilled with the Force. At the time of his duel against Kouru on Genbara, the Ronin believed his sensitivity to the Force had dulled with lack of practice.\nThe Ronin had long been skilled as a mechanic, with the Force amplifying his affinity for the workings of electrical and mechanical systems including droids and vehicles. He believed those talents made him better understand intricate electronics than other sentient beings. He used his talent for repairs to earn credits, food, and lodging during his travels. Likewise, his mechanical genius made him skilled at designing the Sith lightsaber auxiliaries and at breaking starships.\nAfter the Sith rebellion, the Ronin used a prosthetic jaw support due to a prior blaster injury, and later a respirator after his duel with Hanrai resulted in weakened lungs. The Ronin carried two lightsabers with him, one of which had an elegant hilt and was sheathed in a scabbard constructed from other lightsaber hilts, and the other a scabbard auxiliary that had a cruder appearance. He more publicly utilized the former lightsaber, while the second was a backup and used to trick his opponents. He also carried the blaster that had injured his jaw and kept it well-maintained.\nThe Ronin first appeared in \"The Duel,\" a short film and episode of Star Wars: Visions produced by Kamikaze Douga and released for streaming on Disney+ on September 22, 2021.\nIn real-life, rōnin were vagrant, masterless samurai warriors in feudal Japan.\n]",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ronin_(disambiguation)",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Template:Cleanup",
  "/wiki/Template:Expand",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Mouth",
  "/wiki/Cybernetics",
  "/wiki/Breath_mask",
  "/wiki/Jedi_clan",
  "/wiki/Sith",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Sith_rebellion",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Feudalism",
  "/wiki/Lord_(feudal)",
  "/wiki/Jedi_knight_(feudal)",
  "/wiki/Unidentified_witch",
  "/wiki/Sith_demon",
  "/wiki/Death",
  "/wiki/Empire_(feudal)",
  "/wiki/The_galaxy",
  "/wiki/Astromech_droid",
  "/wiki/B5-56",
  "/wiki/Exile_(punishment)",
  "/wiki/Kyber_crystal",
  "/wiki/Mirahi",
  "/wiki/Standard_year",
  "/wiki/Unidentified_village_(Genbara)",
  "/wiki/Planet",
  "/wiki/Genbara",
  "/wiki/Skirmish_of_unidentified_village_(Genbara)",
  "/wiki/Unidentified_bandit_group",
  "/wiki/Kouru",
  "/wiki/Lightsaber_duel",
  "/wiki/The_Traveler",
  "/wiki/Flute",
  "/wiki/Osou_spaceport",
  "/wiki/Galaxy",
  "/wiki/The_Force",
  "/wiki/Lightsaber_auxiliary",
  "/wiki/Lightsaber",
  "/wiki/Parasol_auxiliary",
  "/wiki/Reproduction",
  "/wiki/Great_muster",
  "/wiki/Rei%27izu",
  "/wiki/Kyber_mirror_of_Shinsui_Temple",
  "/wiki/Jedi",
  "/wiki/Unidentified_Emperor",
  "/wiki/Standard_decade",
  "/wiki/Blaster",
  "/wiki/Metal",
  "/wiki/Ear",
  "/wiki/Belt",
  "/wiki/Unidentified_teahouse_(Genbara)",
  "/wiki/Unidentified_teahouse_shopkeep",
  "/wiki/Power_droid",
  "/wiki/Tea",
  "/wiki/Bounty_hunter",
  "/wiki/Unidentified_Trandoshan_guard",
  "/wiki/Lightsaber_parasol",
  "/wiki/Sullustan",
  "/wiki/Unidentified_waterfall",
  "/wiki/Unidentified_temple_(Genbara)",
  "/wiki/Unidentified_Gran_guard",
  "/wiki/Gran",
  "/wiki/Missile",
  "/wiki/Youngling",
  "/wiki/Unidentified_child_village_chief",
  "/wiki/Lightsaber_hilt",
  "/wiki/Crystal",
  "/wiki/Skirmish_at_the_Osou_spaceport",
  "/wiki/Force-sensitive",
  "/wiki/Sentience",
  "/wiki/Starship",
  "/wiki/Lung",
  "/wiki/Scabbard",
  "/wiki/The_Duel_(short_film)",
  "/wiki/Kamikaze_Douga",
  "/wiki/Disney%2B",
  "/wiki/September_22",
  "/wiki/2021",
  "/wiki/Category:Images_of_Ronin",
  "/wiki/Visions_1",
  "/wiki/Ronin:_A_Visions_Novel",
  "/wiki/Ronin:_A_Visions_Novel_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Star_Wars",
  "/wiki/March_31",
  "/wiki/2019"
 ]
}