{
 "name": "The_Entity",
 "display_name": "The Entity",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow/Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "The Entity was a Sith spirit enslaved by Darth Baras, who helped facilitate his rise to power and ascendancy onto the Dark Council with her powers of precognition and farseeing. Centuries before the Great Galactic War, the Entity nearly conquered the galaxy and almost eradicated the Jedi Order. Darth Vowrawn said that she was as old as the Force and an embodiment of the dark side itself.\nSome time before the Galactic War between the Galactic Republic and the Sith Empire, Darth Baras bound and indentured the Entity on Corellia. He fed off the spirit's power and stole all her visions of the future, from which he used to build his power base in the Empire. The Entity abhorred being used in this way but could do nothing about it due to the strength of Baras' enchantments.\nSomehow, the Dark Councilor Darth Vowrawn discovered that the Entity was being enslaved by Darth Baras and worked for an unknown period of time to free her from his grip. Once he discovered how to free the Sith spirit, an opportunity in which to do so would not come until years later, with the appearance of the second Emperor's Wrath, Baras' former apprentice. But Vowrawn was not convinced that the former apprentice was actually trying to help him until he was attacked by Darth Baras' assassin on Corellia, during which the Wrath protected him; this relationship eventually led to an assault on Baras' on-world base. After finally reaching the chamber of the Entity, they were confronted by a now-cyborg Draahg, who used a death field on Vowrawn to prevent him from freeing the spirit. The Entity then informed the Wrath that Draahg's cybernetics powered the death field, and that his death would cancel it. After a long and vicious duel, the Wrath beheaded Draahg, releasing Vowrawn. But, before freeing the Entity, Vowrawn had her confirm that Baras was viewing all that had transpired through her, guessing that he must have been twisting with fury. After the Entity had been set free, she told the Wrath to remember her to Baras before returning to the Force.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sith/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/The_Entity_(adventure)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:The_Entity",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Force_ghost",
  "/wiki/Darth_Baras",
  "/wiki/Dark_Council",
  "/wiki/Precognition/Legends",
  "/wiki/Farsight/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Darth_Vowrawn",
  "/wiki/The_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Mission_to_Corellia_(Emperor%27s_Wrath)",
  "/wiki/Draahg",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}