{
 "name": "The_Wolf",
 "display_name": "The Wolf",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3642 BBY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cathar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Tall"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "\"The Wolf\" was the nickname of a Cathar male. He was killed on the planet Hoth around 3642 BBY at the hands of another individual.\n\"The Wolf\" was the nickname of a Cathar male who lived during the period of time marked by the Cold War between the Galactic Republic and the Sith Empire. Around the year 3642 BBY, he was present on the planet Hoth in the region known as the Glacial Fissure, near the Republic's Outpost Senth, in an area heavily populated by tauntauns and wampas. There, the Cathar stayed beside a transport, two speeder bikes, and the body of a dead tauntaun.\nDuring that time, an individual came across the Wolf. The Wolf attacked that person but was defeated and killed in the skirmish.\nThe Wolf was tall, with brown eyes, brown fur covering his body, and a number of dark marks on his face.\nA proficient sharpshooter, the Cathar wielded his sniper rifle to great effect, using both standard fire and more well-aimed, concentrated shots. He was also able to fire heavy explosive rounds from his weapon, and he used other tools at his disposal, including grenades. In emergency situations, the Wolf was able to emit an energy discharge, knocking his enemies a short distance away.\nDuring his time on Hoth, the Wolf wore a set of armor and was armed with a sniper rifle, which fired armor-piercing charges. He also carried a number of grenades, including thermal grenades that exploded on impact, as well as sticky grenades that attached to the enemy and detonated a few seconds later. His armor was equipped with a grappling hook, which the Wolf used to drag his opponents to him. The Cathar was also equipped with a device that projected a defensive energy field around him, offering additional protection from enemy attacks.\nThe Wolf first appeared in the 2011 BioWare video game Star Wars: The Old Republic as a \"Champion\"–type boss on Hoth. He is not directly involved in any quests but can be killed for loot, both directly from the boss, as well as a security chest that periodically spawns near his location. This article assumes 100 percent game completion, which means he was killed. However, since Hoth is a planet open to both factions of the game, it is unknown if he was killed by a Republic or an Imperial character.\nThe Wolf was originally designed as a Level 40 boss. However, with the release of Game Update 2.0 and the Rise of the Hutt Cartel expansion, the area in which the Wolf was located was converted into a dig site for a Level 55 side activity involving the subterranean seeker droids introduced in the expansion. All the non-player characters in the area—the tauntauns, wampas, and the Wolf himself—were subsequently upscaled to Level 55, significantly increasing their health and damage output. However, the loot rewards for killing them were unchanged. The expansion also notably introduced the achievement system into the game, with a number of achievements on most planets that involved killing uniquely named boss opponents who were not related to any quests. However, the Wolf was not included as part of any achievement, nor was he mentioned in any The Old Republic–related supplementary material.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Cathar/Legends",
  "/wiki/Wolf_(disambiguation)",
  "/wiki/3642_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Time/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Standard_year/Legends",
  "/wiki/Glacial_Fissure",
  "/wiki/Outpost_Senth",
  "/wiki/Tauntaun/Legends",
  "/wiki/Wampa/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/Sniper_rifle/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Rifle/Legends",
  "/wiki/Thermal_grenade",
  "/wiki/Sticky_grenade",
  "/wiki/Standard_second",
  "/wiki/Grappling_hook/Legends",
  "/wiki/Personal_energy_shield/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Seeker_Droid",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Battle_of_Ilum",
  "/wiki/In-universe",
  "/wiki/Galactic_Standard_Calendar"
 ]
}