{
 "name": "The_Archivist",
 "display_name": "The Archivist",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pink",
      "later white"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Beige-pink",
      "later pale green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "University of Bar'leth",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Madelin Sun, also known as \"The Archivist,\" was a human female Force-sensitive individual who was active during the reign of the Galactic Empire. She was once a sava at the University of Bar'leth. She was lightly sensitive to the Force, being able to sense it but unable to use Force powers. She believed that there was no difference between the light side and dark side. Eventually Madelin came to claim that most called her by the title that described what she was. When Qi'ra, the leader of the Crimson Dawn criminal syndicate, gathered various individuals and groups aboard her flagship, the Vermillion, Sun was among those present. Qi'ra revealed knowledge of the Sith and the true state of the galaxy, ruled by the Sith Lords Darth Sidious and Darth Vader, telling her allies of her plan to defeat them and change the power structure of the galaxy. Sun recorded the events in a holocron that could be accessed by either the light or dark side of the Force, which was found and viewed by individuals after the fall.\nMadelin Sun worked as a sava at the University of Bar'leth during the Republic Era, being slighty Force-sensitive, she dedicated herself to investigate relics related to the Dark side of the Force. Unfortunately, after Order 66 occured and the Empire took over the galaxy, every evidence related to the Jedi was to be removed and this cost Sunher job.\nLate into the Imperial Era, Sun was working as a junk seller on Antillion. One day, she was met by a smuggler who asked about her possession of an urn containing the ashes of one of Jabba the Hutt's most hated rivals. Sensing trouble, Sun turned the smuggler away. However, her shop was later inspected by a few stormtroopers who found an old artifact that was forbidden under Order 66 Codicil Nine. As one trooper told Sun they would report the incident, the soldiers were shot down by a mysterious woman who introduced herself as Qi'ra.\nQi'ra told Sun that she had heard of her work and asked her why the Empire had forbid the study of the Force after the disappearance of the Jedi Order. Sun explained that the Empire needed to install fear in the public and to do so they needed to remove the hope that the Force and Jedi represented, as Emperor Palpatine made the very idea a death sentence.\nAs the two continued to talk, Qi'ra revealed to Sun that Palpatine was really the Sith Lord Darth Sidious, realizing that her life was taken from her, Sun decided to join Qi'ra on her ship. The sava was stunned to find various ancient Sith artifacts inside Qi'ra's ship. Qi'ra eventually convinced Sun to work as her dark side expert in an effort to build a plan to defeat the Emperor.\nQi'ra said that she believed some Jedi survived the Great Jedi Purge, particularly Master Yoda as the Empire never announced his death and tasked Sun with the mission to find him. Sun was given any resource necessary in order to find the missing Master, including some old artifacts. She used her abilities to research the facts that were known about him like his last known appearance which, thanks to Qi'ra's information, learned that it was not the Battle of Kashyyyk but on Coruscant.\nDue to Master Yoda's unique appearance, he would need private help from a powerful source in order to disappear from Palpatine's net. Realizing that it was most likely the late Bail Organa who helped Yoda escape, believing that he flew Yoda on the Corellian corvette called the Tantive III, Sun though that someone that was on that ship that day had to still be alive. After going through various flight records, she finally arrived found that Jeremoch Colton was still alive and imprisoned on the Accresker Jail. With the help of an Imperial office that worked in secret for Crimson Dawn, Sun managed to enter Colton's cell and interrogated him with a thought dowser which caused him increasing pain as he resisted telling her what he knew. Colton finally gave in an told Sun that later left on his own vessel to the Sluis sector.\nAfter more research she found on an academic paper from the High Republic Era the description of a world called Dagobah, which seemed to be very strong in the Force. Sun traveled to the planet alone and immediately sensed its astonishing aura, she was also attacked by a native creature. After being mysteriously saved by what seemed to be luck, she found a cave on the planet, after entering it Madalin saw visions that cleared her view on the Force and also changed her appearance. She soon left the planet after realizing that not only Master Yoda was indeed in Dagobah but that his location needed to be kept a secret as he was the one who saved Sun from the creatures on the planet and lead her to the cave. After returned to Qi'ra she told her that Yoda was dead.\nSun eventually helped Qi'ra track the location of the Knights of Ren, who soon were convinced to join Crimson Dawn and their cause. Following the auction for Han Solo and the battle over Jekara, Sun was present at the Vermillion where Qi'ra told her allies about the Empire and how they planned on defeating them. Around this time Sun also contacted Kho Phon Farrus, hoping that the archaeologist would recover the artifact known as the Spark Eternal for Crimson Dawn.\nYears after the Fall of Crimson Dawn and the failure of Qi'ra's plan, Sun recorded the story on a Holocron, calling it a tragedy.\nMadelin Sun was a human female. She had pink hair and beige-pink skin. After her experience at the Cave of Evil her hair turned white and her skin became pale green. She was very fond of her job, considering it her life, this drove her to keep one of her old artifacts of study after becoming a junk seller, despite being illegal contraband under the Imperial rule. Her desire to continue doing her research work was what made her join Lady Qi'ra and Crimson Dawn.\nBeing Force-sensitive, Sun was particularly drawn to studying the Dark side of the Force, which she considered closer to how people actually acted. After her experience in the Cave of Evil on Dagobah, Sun's understanding became richer, as she realized that if the dark side showed how people normally are, the Light side of the Force represented what people could be. She also understood that Yoda choose to teach her this lesson instead of letting her die on Dagobah, which made her keep the Jedi Master's location a secret even if revealing it could give her back her old life, this decision made her feel happy for the first time in a long time.\nMadelin Sun was lightly Force-sensitive, meaning that while she could not perform the powerful feats and displays of other force users, she could sense the Force around things. She was capable of sensing the Force in various artifacts and could even tell if they were connected to the light side or dark side of the Force. Sun was also able to sense the strong connection to the Force that Dagobah had, claiming that she could almost see the web of life connecting all living things.\nOutside of this, Sun's greatest asset was her ability to do research. Due to her time as a sava, she was one of the best researchers of the galaxy during the Imperial Era. Preharps her greatest achievement was using her abilities with Crimson Dawn's resources in order to find a way to track Master Yoda and find his hiding place. She understood that Yoda needed private help from someone powerful to escape from Darth Sidious without being captured and Sun was later capable of tracking one of the only people related to Yoda's journey from Coruscant before his hiding.\nMadelin Sun first appeared, albiet unidentified, in the fifth issue of the Star Wars: War of the Bounty Hunters comic miniseries, written by Charles Soule, and published on October 13, 2021. She was later identified as the Archivist in a StarWars.com article previewing the first issue of the Star Wars: Crimson Reign miniseries, also written by Soule, on October 21, 2021. On December 21, 2021, her name was revaled in a StarWars.com article providing details of the comics to be released in March 2022.\nSoule later revealed in his monthly newsletter that her design was based on unused concept art by Iain McCaig for a Sith Witch in Star Wars: Episode I The Phantom Menace.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Archivist_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:The_Archivist",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/University_of_Bar%27leth",
  "/wiki/Crimson_Dawn",
  "/wiki/Force-sensitive",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Sava",
  "/wiki/The_Force",
  "/wiki/Force_power",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Qi%27ra",
  "/wiki/Flagship",
  "/wiki/Vermillion_(Crimson_Dawn)",
  "/wiki/Sith",
  "/wiki/The_galaxy",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Archivist%27s_holocron",
  "/wiki/Republic_Era",
  "/wiki/Order_66",
  "/wiki/Antillion",
  "/wiki/Han_Solo",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Krestrel_D%27Naran",
  "/wiki/Stormtrooper",
  "/wiki/Codicil_Nine",
  "/wiki/Jedi_Order",
  "/wiki/Sith_Lord",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Battle_of_Kashyyyk",
  "/wiki/Coruscant",
  "/wiki/Tantive_III",
  "/wiki/Jeremoch_Colton",
  "/wiki/Sluis_sector",
  "/wiki/Unidentified_academic_paper",
  "/wiki/High_Republic_Era",
  "/wiki/Dagobah",
  "/wiki/Unidentified_Dagobah_creature",
  "/wiki/Knights_of_Ren",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Attack_on_the_Executor",
  "/wiki/Jekara",
  "/wiki/Kho_Phon_Farrus",
  "/wiki/Archaeologist",
  "/wiki/Spark_Eternal",
  "/wiki/Holocron",
  "/wiki/Hair",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Star_Wars:_War_of_the_Bounty_Hunters",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Charles_Soule",
  "/wiki/October_13",
  "/wiki/2021",
  "/wiki/StarWars.com",
  "/wiki/Crimson_Reign_1",
  "/wiki/Star_Wars:_Crimson_Reign",
  "/wiki/October_21",
  "/wiki/December_21",
  "/wiki/March",
  "/wiki/2022",
  "/wiki/Iain_McCaig",
  "/wiki/Witch",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Category:Images_of_the_Archivist",
  "/wiki/Han_Solo_%26_Chewbacca_3",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Doctor_Aphra_(2020)_17",
  "/wiki/Doctor_Aphra_(2020)_20",
  "/wiki/Doctor_Aphra_(2020)_23",
  "/wiki/Doctor_Aphra_(2020)_24",
  "/wiki/Doctor_Aphra_(2020)_25",
  "/wiki/Crimson_Reign_2",
  "/wiki/Crimson_Reign_3",
  "/wiki/Crimson_Reign_4",
  "/wiki/Crimson_Reign_5",
  "/wiki/Hidden_Empire_2",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Marvel_Comics",
  "/wiki/March_11"
 ]
}