{
 "name": "The_Exalted",
 "display_name": "The Exalted",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zakuul"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3631 BBY",
      "Zakuul"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Heralds of Zildrog"
     ]
    }
   ]
  }
 ],
 "content": "The man known as the Exalted was a male Human living on the Eternal Empire capital of Zakuul. He was the leader of the Heralds of Zildrog, a cult worshipping the mythical serpent-god Zildrog that controlled the Old World of Zakuul due to the deal made with Emperor Arcann. In 3631 BBY he, Zoran Velfahsa and two other Heralds confronted the Outlander wanted for the assassination of Emperor Valkorion. The Outlander offered to take Arcann out and removed the restriction of power placed upon Heralds in exchange for the location of The Lady of Sorrows. The Exalted had no problem with eliminating Arcann, but saw the Outlander's involvement as interfering with the prophecy about Zildrog's return. He was about to order the Outlander and their companion killed on spot, when Thea, the assistant to the Lady, made a holocall and presented his son Brennen as the hostage. The Exalted departed to the Razor, leaving the other Herlalds to deal with the Outlander. Upon the meeting with the Lady of Sorrows, the Heralds were overpowered and all of them were killed. The Exalted himself was personally killed by the Lady, who made his son into the new Exalted, leaving him to lead the Heralds.\nThe Exalted appears in Star Wars: The Old Republic: Knights of the Fallen Empire Chapter 7: The Lady of Sorrows.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zakuul",
  "/wiki/3631_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Heralds_of_Zildrog",
  "/wiki/Eternal_Empire",
  "/wiki/Zildrog",
  "/wiki/Old_World",
  "/wiki/Arcann",
  "/wiki/Zoran_Velfahsa",
  "/wiki/Alliance_Commander",
  "/wiki/Valkorion",
  "/wiki/SCORPIO",
  "/wiki/Thea_(Nautolan)",
  "/wiki/Brennen",
  "/wiki/Razor_(Zakuul)",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire"
 ]
}