{
 "name": "The_Mythrol",
 "display_name": "The Mythrol",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mythrol"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "\"The Mythrol\" was a Mythrol male who worked for Greef Karga until he stole from him and fled. By the time he had a bounty placed upon him during the New Republic Era, the Mythrol was on the ice world of Pagodas, where he was harassed by a group of trawlers within a bar. After a Mandalorian bounty hunter named Din Djarin entered the bar and incapacitated the trawlers, he captured the Mythrol, later freezing him in carbonite before delivering him, along with others, to Karga, who worked as an agent of the Bounty Hunters' Guild, in order to collect the rewards. Karga later let him pay off his debt at work.\nWorking for him since his days youth as a pollywog, a Mythrol male known simply as \"the Mythrol\" or \"Mythrol\" worked for Greef Karga on the planet of Nevarro in the Outer Rim Territories, looking after his accounting until he decided to take some of the money for himself and flee the planet. That put him in debt to Karga, and, by the time he was a fledgling, a bounty was placed on the Mythrol. Thus, circa 9 ABY, Mandalorian bounty hunter Din Djarin tracked the Mythrol to a bar on the ice planet Pagodon where he had been hiding. Inside the bar, the Mythrol was harassed by a group of trawlers. One of the humans claimed that his glands would be profitable at the port, and that the musk he would produce would be sweet due to his young age. He offered them his credits on the table, but to no avail. The Quarren then pulled him up to his feet as the human prepared to cut him with his knife.\nBefore they could continue, Djarin entered the bar, attracting the group's attention. The Mythrol then watched as the trawlers surrounded Djarin at the counter. As a fight ensued, he observed the brawl from behind the table. Once Djarin had incapacitated the three trawlers, he approached the Mythrol.\nThe Mythrol thanked Din Djarin for saving him, giving him the credits he had presented to the trawlers earlier, suggesting that he buy himself a drink. However, Djarin presented a bounty puck with his face and wanted status. \"The Mythrol\" offered him more credits, claiming there was a misunderstanding. Djarin then threatened him, saying he could bring him dead or alive. With no other options, the Mythrol obliged.\nTrailing behind Djarin, they approached a ferryman, who provided them transportation to Djarin's personal starship, the Razor Crest. While on the landspeeder, the Mythrol spoke with the pilot regarding ravinaks, with the pilot replying that they were currently away from the ship. After arriving at the Razor Crest, the Mythrol offered to hire a Livery Cruiser, but was refused. He then watched as the pilot drove away, who was then killed by a ravinak, causing the Mythrol to panic. He was quickly pulled out of the creature's way by Din Djarin and into the starship. As the ravinak pulled the ship towards the ground, Djarin then repelled it with his Amban phase-pulse blaster, allowing them to fly away. The Mythrol then breathed a sigh of relief.\nWhile in space, the Mythrol complimented the Razor Crest and reminded the Mandalorian that he still had a lot of credits. He then asked him if Mandalorians never took off their helmets, but Djarin remained silent throughout the flight. The Mythrol then asked Djarin if he could use the vacc tube, stating that the bounty hunter would not want to see a fledgling Mythrol evacuate their thorax. He then left the cockpit to search for the vacc tube.\nAfter making his way to the ship's lower deck, he proceeded to tamper with the controls, opening a weapons cabinet in the process. Using the beeping noises produced by them, he attempted to fool Djarin into believing he had used the tube. The Mythrol then proceeded to inspect a number of individuals frozen in carbonite, while claiming that he wanted to be home for Life Day. Unbeknownst to him, Djarin made his way to the lower deck and stood beside him, who then grabbed him and placed him in a carbonite block, freezing him completely. After arriving on Nevarro, Djarin turned over his bounties to Karga, who was an agent for the Bounty Hunters' Guild who sent an individual to collect the frozen targets, including the Mythrol.\nEventually, the Mythrol was unfrozen and presented with a chance to work off his debt, which translated into three hundred and fifty years of service, by working for Karga again. After the planet had fallen under the control of Moff Gideon's Imperial remnant, Karga, who became the Magistrate of Nevarro, and Carasynthia Dune, who became the marshal of Nevarro City, worked to better Nevarro instead of allowing it to fall into the hands of the Bounty Hunters' Guild once again. Thus, in the now-prosperous Nevarro city, the Mythrol worked in Karga's office to make a living for himself and to pay off his debt.\nOne day, Djarin, who had since become the caretaker to his own foundling, a member of Yoda's species named Grogu, returned to Nevarro for repairs on the Razor Crest. After Djarin, Karga, and Dune dropped Grogu off in the local school, they arrived at Karga's office, where the Mythrol tried to inform Karga who he believed the Razor Crest belonged to until he saw Djarin with the magistrate. Both Djarin and the Mythrol were surprised to see each other, though the Mythrol was visibly scared at the sudden appearance of his captor, before Karga and him explained why he was working in the office. When Djarin promised Karga he could hunt the Mythrol down again if he tried to flee for a second time, the Mythrol promised he would not, not wanting to be placed into carbonite ever again.\nWhen Dune and Karga enlisted Djarin to help take out a surviving Imperial base, the Mythrol drove them to the base on his speeder, with Karga stating he would remove years off his debt if he did so or make him walk back to the city if he did not. Karga promised a further thirty years off his debt if he did not leave, and the Mythrol went onto accompany them inside to take out the base. After learning that Gideon had survived their previous encounter, Djarin left via his jetpack to get Grogu from the school, while the Mythrol, Karga, and Dune escaped the exploding base aboard a Trexler 906 Armored Marauder. They were pursued by scout troopers on 74-Z speeder bikes and then Outland TIE fighters, though all their pursuers were eventually destroyed. The last TIE fighters had been taken out by Djarin aboard the now-repaired Razor Crest.\nA cowardly, but friendly, criminal, the fledgling male Mythrol had blue eyes and skin. Initially believing Din Djarin to be his savior, The Mythrol happily rewarded him with credits, before being presented with a bounty puck with his face on display. When dealing with the trawlers and Din Djarin, he would attempt to elude them by offering them credits, but would be ignored both times. While under the custody of Djarin, the Mythrol offered to pay the full expense for a Livery Cruiser, but was silently rejected by the bounty hunter. He later attempted to fool Djarin into thinking he was using the Razor Crest's vacc tube, but was eventually caught and frozen in carbonite by the bounty hunter.\nThe Mythrol wore a brown jacket, as well as a pair of brown gloves, boots, and pants. He claimed to possess a sizable amount of credits, which he offered to both the trawlers and Din Djarin.\n\"The Mythrol\" first appeared in the first episode of the 2019 Disney+ television show The Mandalorian, which aired on November 12, 2019. The character's makeup was done by makeup artist Brian Sipe. The character was portrayed by Horatio Sanz, with Tsuyoshi Abe serving as a stunt double.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chapter_12:_The_Siege",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Mythrol",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/File:MythrolCruiser-TMS01CH01.ogg",
  "/wiki/Greef_Karga",
  "/wiki/Bounty",
  "/wiki/New_Republic_Era",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Pagodon",
  "/wiki/Boatman%27s_Reach",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Carbonite",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/File:MythrolCredits-TMS01CH01.ogg",
  "/wiki/Nevarro",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Currency",
  "/wiki/Time",
  "/wiki/9_ABY",
  "/wiki/Unidentified_alpha_trawler",
  "/wiki/Port",
  "/wiki/Credit",
  "/wiki/Unidentified_Quarren_trawler",
  "/wiki/Human",
  "/wiki/Knife",
  "/wiki/File:MythrolBounty-TMS01CH01.ogg",
  "/wiki/Holopuck",
  "/wiki/Unidentified_Kubaz_ferryman",
  "/wiki/Starship",
  "/wiki/Razor_Crest",
  "/wiki/Landspeeder",
  "/wiki/Unidentified_human_speeder_pilot",
  "/wiki/Ravinak",
  "/wiki/Livery_Cruiser",
  "/wiki/Amban_phase-pulse_blaster",
  "/wiki/File:MythrolLifeDay-TMS01CH01.ogg",
  "/wiki/Realspace",
  "/wiki/Helmet",
  "/wiki/Toilet",
  "/wiki/Carbon-freezing",
  "/wiki/Life_Day",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Magistrate",
  "/wiki/Carasynthia_Dune",
  "/wiki/Marshal",
  "/wiki/Nevarro_City",
  "/wiki/Office_of_the_Magistrate_of_Nevarro",
  "/wiki/Standard_day",
  "/wiki/Foundling",
  "/wiki/Yoda%27s_species",
  "/wiki/Grogu",
  "/wiki/Nevarro_school",
  "/wiki/Second_skirmish_on_Nevarro",
  "/wiki/Nevarro_Imperial_base",
  "/wiki/Skirmish_on_Nevarro",
  "/wiki/Jetpack",
  "/wiki/Trexler_906_Armored_Marauder",
  "/wiki/Scout_trooper",
  "/wiki/74-Z_speeder_bike",
  "/wiki/Outland_TIE_fighter",
  "/wiki/File:MythrolVaccTube-TMS01CH01.ogg",
  "/wiki/Eye",
  "/wiki/File:MythrolLotCredits-TMS01CH01.ogg",
  "/wiki/Jacket",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/November_12",
  "/wiki/Brian_Sipe",
  "/wiki/Horatio_Sanz",
  "/wiki/Tsuyoshi_Abe",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_(manga)",
  "/wiki/The_Mandalorian_1",
  "/wiki/The_Mandalorian:_Magnetic_Fun",
  "/wiki/The_Mandalorian:_This_is_the_Way",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/The_Mandalorian:_The_Path_of_the_Force",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/Snowflake_Snack",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_One",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Cast",
  "/wiki/Practical",
  "/wiki/Score",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Mandalorian",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Topps_Star_Wars_Living_Set",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Databank_(website)",
  "/wiki/Category:Audio_files_of_unidentified_Mythrol",
  "/wiki/Category:Images_of_The_Mythrol",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Chapter_8:_Redemption",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}