{
 "name": "Theala_Vandron",
 "display_name": "Theala Vandron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Vandron",
      "Galactic Empire",
      "COMPNOR",
      "COMPNOR"
     ]
    }
   ]
  }
 ],
 "content": "Lady Theala Vandron was the name of both the wife and daughter of Lord Crueya Vandron, the founder of COMPNOR and head of House Vandron, considered the eldest of the Ancient Houses of Senex sector, and thus the Galaxy's senior aristocratic lineage by precedent.\nThe elder Lady Theala Vandron had married her husband by 33 BBY, in which year she served as the Senex sector ambassador to the Eriadu Trade Summit; her daughter was born within a few years, and by 12 ABY, she had succeeded her father as head of House Vandron. In that year, the younger Theala Vandron became embroiled in Roganda Ismaren's plot to establish her son Irek as Emperor with the firepower of the Eye of Palpatine behind him.\nThe distinction between the Lady Theala Vandron of Cloak of Deception and the Lady Theala Vandron of Children of the Jedi is necessitated by the fact that the former is a grown woman in 33 BBY while the latter is still in her forties forty-six years later. Additionally, it should be noted that while the Lady Theala Vandron of Cloak of Deception seems merely to be married to the Lord Vandron of the time, the Lady Theala Vandron of Children of the Jedi is herself Lady Vandron, Head of the House in her own right.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Vandron",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Crueya_Vandron",
  "/wiki/Senex_sector/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Eriadu_Trade_Summit",
  "/wiki/Theala_Vandron_Jr.",
  "/wiki/12_ABY/Legends",
  "/wiki/Roganda_Ismaren/Legends",
  "/wiki/Irek_Ismaren",
  "/wiki/Eye_of_Palpatine",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Theala_Vandron",
  "/wiki/Cloak_of_Deception"
 ]
}