{
 "name": "Thea_(Nautolan)",
 "display_name": "Thea  (Nautolan)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Lady of Sorrows"
     ]
    }
   ]
  }
 ],
 "content": "Thea was a female Nautolan information broker living during the Galactic War. Following the Eternal Empire conquest, the Eternal Empire capital of Zakuul became the new seat of power in the galaxy and Thea relocated to the Old World of Zakuul, where information was the most valuable. She eventually became an assistant to SCORPIO, who operated under the name \"The Lady of Sorrows\". In 3631 BBY Thea contacted The Exalted regarding the recent killing of Mona Gale by the Heralds of Zildrog and presented his captured son Brennen as bait to convince the Exalted to come to the Razor. Upon arriving to meet with the Lady, the Heralds were overpowered and all of them were killed. The Exalted himself was personally killed by SCORPIO, who made Brennen into the new Exalted, leaving him to lead the Heralds. After conversing with The Commander who arrived in the company of Senya Tirall and Koth Vortena, SCORPIO decided to leave with them, leaving Thea to continue the operations in her stead.\nSCORPIO eventually joined the Outlander's Alliance against Zakuul, but betrayed and abandoned it when presented with the opportunity to claim the Eternal Throne. She used it to seize control of the majority of the Eternal Fleet, and engineered the Battle of Odessen to assume complete control. At the Battle's conclusion, SCORPIO contacted Thea, who reported that every vessel in the fleet was now under her control, allowing SCORPIO to grant free will to all GEMINI Captains of the fleet.\nThea appears in Star Wars: The Old Republic: Knights of the Fallen Empire Chapter 7: The Lady of Sorrows and Chapter 16: The Battle of Odessen.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thea",
  "/wiki/Nautolan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/SCORPIO",
  "/wiki/Information_broker/Legends",
  "/wiki/Galactic_War",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Eternal_Empire",
  "/wiki/Zakuul",
  "/wiki/The_galaxy",
  "/wiki/Old_World",
  "/wiki/3631_BBY",
  "/wiki/The_Exalted",
  "/wiki/Mona_Gale",
  "/wiki/Heralds_of_Zildrog",
  "/wiki/Brennen",
  "/wiki/Razor_(Zakuul)",
  "/wiki/Alliance_Commander",
  "/wiki/Senya_Tirall",
  "/wiki/Koth_Vortena",
  "/wiki/Eternal_Alliance",
  "/wiki/Eternal_Throne",
  "/wiki/Eternal_Fleet",
  "/wiki/Battle_of_Odessen",
  "/wiki/GEMINI",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire"
 ]
}