{
 "name": "Theenu",
 "display_name": "Theenu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Theenu was a female Rodian Jedi Master serving the Jedi Order and the Galactic Republic during the Galactic War and the ensuing conflict with the Eternal Empire. The surprise attack of the Eternal Empire on both the Sith Empire and the Galactic Republic. Their campaign saw Jedi numbers thin over time, leading to surviving Jedi going underground. Jedi Master Gnost-Dural recruited her to join him on Ossus.\nA Force-sensitive Rodian female,Theenu was trained by the Jedi Order in the ways of the Force. She would eventually rise to the rank of Jedi Master. At some point prior to her time on Ossus she would tell fellow Jedi Master Dazh Ranos that \" her mind wandered too easily\". Theenu would be one of the many Jedi to join Jedi Master Gnost-Dural in hiding on Ossus in the aftermath of the surprise attack of the Eternal Empire on both the Sith Empire and the Galactic Republic.\nTheenu would be on planet in 3628 BBY when the reconstituted Sith Empire sent their forces to eliminate the Jedi stationed on Ossus. Theenu would be injured during the Sith attack on the Great Jedi Library and would ask a Republic spacer to rescue any Jedi that were still in the Library. Theenu would survive and be reunited with Master Ranos.\nTheenu first appeared in a 2018 update for Star Wars: The Old Republic. She serves as a Quest Giver for Republic Players assigning the Heroic Mission \"Expel The Darkness\".\nHer advice to Master Ranos and her survival of the Empire's attack would be revealed in a mail from Ranos if the player completed the story as a Republic aligned individual.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Purple",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Galactic_War",
  "/wiki/War_against_Zakuul",
  "/wiki/Eternal_Empire",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Gnost-Dural",
  "/wiki/Ossus/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Dazh_Ranos",
  "/wiki/Jedi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/3628_BBY",
  "/wiki/Great_Jedi_Library/Legends",
  "/wiki/2018",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne"
 ]
}