{
 "name": "Themion",
 "display_name": "Themion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Eriadu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Peace Brigade"
     ]
    }
   ]
  }
 ],
 "content": "Themion was a lieutenant in the Eriaduan judicial forces in 26 ABY during the Yuuzhan Vong War. He was a tall and thin man with a craggy face and a black eye. Themion was also a Humanocentricist, evidenced by describing Rodians as \"a vile and murderous lot\".\nThemion secretly worked with the Peace Brigade, an allied government of the Yuuzhan Vong. On one occasion, he had the Jedi Anakin Solo and Tahiri Veila arrested for being involved in a fight in which a group of Brigaders attacked the Rodian Jedi Kelbis Nu because he knew that the Yuuzhan Vong would target Yag'Dhul next since it was located on where the Corellian Trade Spine and the Rimma Trade Route met.\nDuring their incarceration, he had them kept in separate cells and then interrogated each one of them. When interrogating Anakin, he assaulted the young Jedi after Anakin refused to cooperate with him. This angered Tahiri whom sensed this through the Force. She then used her Force powers to break out of her cell before proceeding to storm Anakin's cell.\nWith a blaster in one hand, Tahiri shouted Do-ro'ik vong pratte—the battle cry of the Warrior caste—before hurling Themion against the wall. Tahiri then handcuffed him with his own stun cuffs. Another guard entered the cell though Anakin threw him against the corridor wall as well, knocking him out and giving the two Jedi enough time to escape and reclaim their lightsabers.\nThis involved fighting through more judicials outside the prison and hijacking a police speeder though the two Jedi eventually reached the spaceport and escaped off-world with their fellow Jedi Corran Horn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Peace_Brigade",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Themion_Hejaran",
  "/wiki/House_Mecetti",
  "/wiki/Eriadu/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Tahiri_Veila",
  "/wiki/Lieutenant/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/26_ABY",
  "/wiki/Humanocentrism",
  "/wiki/Rodian/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Anakin_Solo",
  "/wiki/Kelbis_Nu",
  "/wiki/Yag%27Dhul/Legends",
  "/wiki/Corellian_Trade_Spine/Legends",
  "/wiki/Rimma_Trade_Route/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Yuuzhan_Vong_(language)",
  "/wiki/Warrior_caste",
  "/wiki/Stun_cuffs",
  "/wiki/Corran_Horn",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth"
 ]
}