{
 "name": "Theo_Meltsa",
 "display_name": "Theo Meltsa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Resistance Starfighter Corps",
      "Resistance Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Theo Meltsa was a human male who flew for the Resistance in their Starfighter Corps. At the time of the conflict between the Resistance and the First Order, Meltsa was stationed at the Resistance base on the planet D'Qar. Meltsa was also infatuated with Peet Deretalia. The BB-series astromech droid BB-8 brought Meltsa and Peet together by sabotaging his T-70 X-wing starfighter.\nTheo was a Resistance pilot who lived during the New Republic era. He had a crush on the Resistance technician Peet Deretalia, which the BB-series astromech droid BB-8 took noticed. Unwilling to let other people know his feelings for Peet, Theo apologized and climbed aboard his T-70 X-wing starfighter. However, BB-8 noticed that Peet also had a crush on Theo and decided to bring them together.\nBB-8 sabotaged the ship's wire, prompting Theo to fix it back. BB-8 then removed a panel, preventing Theo from leaving. These engine problems caused Theo to cry out in frustration. Catching BB-8 in the act, he ordered the droid to leave the airfield. However, BB-8 was not deterred and sabotaged the fighter's motivator.\nTheo became frustrated and agitated, screaming aloud how the Resistance could keep going with \"junk\" like this. BB-8 then went to seek Peet's help. She crashed into Theo and the two lovers crossed eyes. After exchanging greetings, Peet apologized that BB-8 was being difficult. Theo responded that he was having issues with the droid as well.\nPeet offered to help him. Theo accepted her offer, telling Peet that he kept losing parts on his ship and thought that BB-8 was the culprit. Peet reassured Theo that the only problem was that his ship's motivator was disengaged. She offered to repair his ship for him. After repairing his motivator, Peet invited Theo for a meal at the mess hall, which he gratefully accepted. Before leaving for the mess hall with Theo, Peet pursed her lips towards BB-8, thanking the little droid for bring them together.\nTheo Meltsa was a human male who had auburn hair, blue eyes and light-colored skin. As a pilot in the Resistance, Meltsa flew a T-70 X-wing starfighter and wore a flight suit.\nMeltsa had a crush for Resistance technician Peet Deretalia. However, he was shy about letting other people know his feelings for Peet. Meltsa expressed anger when BB-8 sabotaged his X-wing several times in order to bring him into contact with Peet. Meltsa was grateful to Peet for fixing his ship and accepted an invitation for a meal at the mess hall.\nTheo Meltsa was introduced in \"SaBBotage,\" a mini-comic that was attached to Poe Dameron 1.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Theo_(disambiguation)",
  "/wiki/Poe_Dameron:_Flight_Log",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Resistance_Starfighter_Corps",
  "/wiki/Resistance_pilot",
  "/wiki/Time",
  "/wiki/Cold_War",
  "/wiki/First_Order",
  "/wiki/Resistance_base",
  "/wiki/Planet",
  "/wiki/D%27Qar",
  "/wiki/Peet_Deretalia",
  "/wiki/BB-series_astromech_droid",
  "/wiki/BB-8",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/New_Republic_era",
  "/wiki/Technician",
  "/wiki/Motivator",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Pilot",
  "/wiki/X-wing_starfighter",
  "/wiki/Flight_suit",
  "/wiki/SaBBotage",
  "/wiki/Poe_Dameron_1",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_62",
  "/wiki/Droid_Directory"
 ]
}