{
 "name": "Theraguin",
 "display_name": "Theraguin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Coruscant Security Force",
      "Coruscant Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Theraguin was a Human male police officer living on the Galactic Republic capital planet, Coruscant, during the Cold War between the Republic and the Sith Empire. Theraguin served with the Coruscant Security Force  and had attained the rank of captain. By 3643 BBY, Therguin was working in the Black Sun territory. Although most CSF forces had abandoned the area, Theraguin continued to do his best to serve the locals who were oppressed and abused by the Black Sun criminal syndicate.\nTheraguin was a Human male who lived on Coruscant, capital planet of the Galactic Republic, and served as a police officer with the Coruscant Security Force . He achieved the rank of captain, and during the Cold War between the Republic and the Sith Empire, Theraguin worked in the Black Sun territory of Coruscant. After the Sacking of Coruscant, the CSF struggled to maintain order and eventually called for Republic Military support. However, large areas of the planet were lost to gangs who consolidated into the Black Sun criminal syndicate. Claiming sectors as their own, mostly in Coruscant's lower levels, Black Sun sought to impose its own order. The CSF, having sustained casualties both during the Sacking and the years after, all but abandoned the area as they drew back to police vital government and commerce districts. Theraguin was one of the few officers who stayed behind to help as best as he could, although CSF could do little more than build blockades and keep the street battles contained to certain areas.\nAround 3643 BBY, Black Sun developed a new way of terrorizing the locals and refugees. Its members stole crates of Republic supplies and then placed them in public areas, but not before rigging them with explosives. When refugees went to open them, the crates exploded and killed all in the immediate area. Theraguin did not originally believe the stories about the \"game\" until he witnessed a woman blown to pieces by one of the explosive crates. He tried to defuse the crates, but there was little he could do without being killed himself by Black Sun thugs.\nAt that time a Republic individual offered to defuse the explosives. Theraguin accepted the offer, and the individual proceeded to disarm the rigged crates, in the process also killing the Black Sun thugs who were behind the terror. Theraguin offered the individual a reward upon return, but was refused. He was pleasantly surprised to find someone not out to make a profit. Theraguin was thankful for the individual's assistance and continued his work in the Black Sun Territory.\nTheraguin was a large, older man with dark skin, brown eyes, and graying hair. A veteran police officer, Theraguin was one of the few, if not the only, cop who continued to work in the Black Sun Territory, which most officers, including his superior, had abandoned. Determined to do what he could to relieve the suffering of the locals, Theraguin defied Black Sun's thugs and went beyond the CSF's barricades into the territory. He went so far as to risk his life to diffuse explosives if it would save lives. However, the violence and hopelessness of the Black Sun Territory left Theraguin frustrated. He sarcastically referred to himself as the \"last officer on the job\" in that sector.\nAs with many of his fellow veteran cops, Theraguin had joined the CSF to keep the peace. The years after the Sacking of Coruscant, however, brought with them a brutal urban warfare—something for which Theraguin and the CSF were not trained. While he knew his limitations, Theraguin continued to work in the Black Sun Territory despite all the difficulties.\nTheraguin appears in the \"Boom\" Republic-sided Coruscant mission in Star Wars: The Old Republic, a massively multiplayer online roleplaying game by BioWare released on December 20, 2011. The player can choose to accept the mission or not. Upon completion of the mission, the player can choose to not accept the reward for light side points.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Police_officer/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Police_rank",
  "/wiki/Captain/Legends",
  "/wiki/3643_BBY",
  "/wiki/Black_Sun_territory",
  "/wiki/Black_Sun/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Coruscant_riots_(3653_BBY)",
  "/wiki/Republic_Military/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Refugee/Legends",
  "/wiki/Bomb/Legends",
  "/wiki/Death/Legends",
  "/wiki/Scoundrel",
  "/wiki/Canon",
  "/wiki/Time/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Unidentified_Coruscant_Security_commander",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}