{
 "name": "Theus_Paddox",
 "display_name": "Theus Paddox",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pelagon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Pelagia"
     ]
    }
   ]
  }
 ],
 "content": "Theus Paddox was High Lord of House Pelagia during the Rebellion era. He was very young during the House Mecetti sponsored purge and downfall of his house but grew up quickly in the difficult years that followed. Within the first few years of becoming High Lord he strengthened the relationship with House Cadriaan through marriage to the daughter of Lady Bathos and by opening up the worlds of the Pelagia Province to Cadriaan financial investment. In subsequent years Pelagia, under Theus' leadership, made efforts to establish a political coalition with House Melantha and House Barnaba by secretly instigating diplomatic talks. Theus also oversaw a significant secret military re-armament program.\nShortly before the Battle of Hoth Theus Paddox's long lost brother and sister were discovered onboard the Regal Destiny starship by Captain Nils Wender and the crew of the Bright Seeker. Trad Paddox and Verinia Paddox were evacuated during the Mecetti purge along with other Pelagian Nobles and the children's governess Mistress Winslo. A Mecetti agent was able to infiltrate the ship and released a deadly bio-agent into the air supply in an attempt to prevent the Pelagian noble from escaping. The children were frozen in stasis but all others onboard were killed. The children were discovered 20 years later.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Pelagon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Pelagia",
  "/wiki/High_Lord",
  "/wiki/Rebellion_era",
  "/wiki/House_Mecetti",
  "/wiki/Standard_year/Legends",
  "/wiki/House_Cadriaan",
  "/wiki/Bathos",
  "/wiki/Pelagia_Province",
  "/wiki/House_Melantha",
  "/wiki/House_Barnaba",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Regal_Destiny",
  "/wiki/Starship/Legends",
  "/wiki/Nils_Wender",
  "/wiki/Bright_Seeker",
  "/wiki/Trad_Paddox",
  "/wiki/Verinia_Paddox",
  "/wiki/Winslo",
  "/wiki/Stasis",
  "/wiki/Death/Legends",
  "/wiki/West_End_Games",
  "/wiki/Lost_Destiny",
  "/wiki/Tapani_Sector_Instant_Adventures",
  "/wiki/Lords_of_the_Expanse",
  "/wiki/Player%27s_Guide_to_Tapani"
 ]
}