{
 "name": "Thi-Sen",
 "display_name": "Thi-Sen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Orto Plutonia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Talz"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.48 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Talz High Council"
     ]
    }
   ]
  }
 ],
 "content": "Thi-Sen was a Talz male who served as the chieftain of a Talz tribe on Orto Plutonia during the Clone Wars. When the Galactic Republic and the Confederacy of Independent Systems sent troops to Orto Plutonia, the Confederacy's battle droids attacked the Talz and in retaliation, they attacked both the droids' base and a Republic listening outpost caught in the middle, leaving no survivors. The attacks caught the attention of the Republic, who sent in a task force lead by Jedi Knights Obi-Wan Kenobi, Anakin Skywalker, and Pantoran representatives Senator Riyo Chuchi and Chairman Chi Cho to investigate.\nWhen Obi-Wan and Anakin find out that Thi-Sen and his tribe were behind the attacks and that they just want to be left alone. The two Jedi Knights then arranged a meeting between Thi-Sen and Cho to negotiate peace between them. However, Cho arrogantly refused to negotiate and declared war on Thi-Sen and his tribe. Thi-Sen and his tribe then fought against Cho and his forces in a battle that both sides suffered heavy casualties, Cho himself being fatally wounded in the process. After the battle, Thi-Sen and Chuchi negotiated a peace treaty between Orto Plutonia and Pantora, and the Talz were left in peace.\nThi-Sen and his tribe led a secretive life on the frozen world of Orto Plutonia. During the Clone Wars, the Galactic Republic and Confederacy of Independent Systems set a considerable amount of troops to Orto Plutonia. The droids encountered the Talz and attacked them. Thi-Sen took this as a threat to his people and so in retaliation attacked the droids in their base. A Republic listening outpost got caught in the middle, as the Talz slaughtered the clones in the outpost, leaving both their helmets and the droids' heads on spears.\nLater, Jedi Knights Obi-Wan Kenobi and Anakin Skywalker, who were both sent in as part of a task force to investigate the massacre, encountered Thi-Sen and his tribe, who explained to them what happened and that the Talz merely want to be left alone. The Jedi then explained that they came in peace and only want to be friends and arranged a meeting between the Talz and the Pantorans. Before the Jedi left, Thi-Sen gave Obi-Wan a bear hug as a sign of friendship. Thi-Sen's Talz came to the meeting in the wreckage of a destroyed Confederate XT Beetle Transport and politely asked the Pantorans to leave his world. However, Chairman Chi Cho didn't want to lose ownership of Orto Plutonia and at the meeting called the Talz trespassers and savages, using the protocol droid C-3PO to communicate with the Talz. Once again, Thi-Sen said he and his people wanted to live in peace, and asked the Pantorans to pull their people off the planet. Cho, refusing to use diplomacy, deliberately provoked and offended the Talz. Thi-Sen stated that there would be war if the Pantorans didn't do as he asked, and Cho accepted the challenge.\nWith war officially declared, the Jedi left for the Republic base to request that Senator Riyo Chuchi make contact with the Pantoran Assembly to declare Cho out of order and strip him of power. Thi-Sen rallied his army and led his people against the Pantorans and Republic. Engaging the clone troopers assigned to protect the Chairman, Thi-Sen's forces quickly overwhelmed the Republic troops, mortally wounding Cho and killing several clone troopers. After the Talz cornered the surviving clones, reinforcements of the Republic arrived in LAAT/i gunships. Chuchi, who had been given authority to negotiate with the Talz by the Pantoran Assembly in the interest of peace, arrived and Thi-Sen chose to stop the attack. Chairman Cho, who had been struck in the back by a spear during the battle, appealed to Senator Chuchi to continue to fight the Talz, proclaiming that it was for the \"good\" of his people, and was shocked to hear that his authority had been overruled by the Pantoran Assembly, he died shortly thereafter. Chuchi along with C-3PO approached Thi-Sen and told him that it is a greater sacrifice to live for his people then to die for them. The Senator then offered to concede the sovereignty of Plutonia to the Talz and Thi-Sen agreed. The Republic troops left Orto Plutonia and the Talz returned to their village.\nThi-Sen was primarily focused on the governing of his people despite being an ally of the Republic. When he came across people who wished to make friends and peaceful towards him and his people, Thi-Sen would be kind to those who treat him and his people with respect.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Thi-Sen",
  "/wiki/Thi-Sen/Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Orto_Plutonia",
  "/wiki/Talz",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/High_Council_(Talz)",
  "/wiki/Chief",
  "/wiki/Talz_village",
  "/wiki/Clone_Wars",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/B1-series_battle_droid",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Pantoran",
  "/wiki/Senator",
  "/wiki/Riyo_Chuchi",
  "/wiki/Chairman",
  "/wiki/Chi_Cho",
  "/wiki/Pantora",
  "/wiki/Planet",
  "/wiki/Troop",
  "/wiki/Droid",
  "/wiki/Skirmish_on_Orto_Plutonia",
  "/wiki/Clone_trooper",
  "/wiki/Clone_trooper_armor",
  "/wiki/Spear",
  "/wiki/Jedi",
  "/wiki/XT_Beetle_Transport",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Battle_of_Orto_Plutonia",
  "/wiki/Pantoran_Assembly",
  "/wiki/Cloning",
  "/wiki/Trooper",
  "/wiki/Death",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Trespass",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Mustafar_and_Other_Outer_Rim_Planets",
  "/wiki/Databank_(website)"
 ]
}