{
 "name": "Thi_Xon_Yimmon",
 "display_name": "Thi Xon Yimmon",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Whiplash"
     ]
    }
   ]
  }
 ],
 "content": "Thi Xon Yimmon was a male Cerean who was the leader of the resistance group Whiplash, which was based on Coruscant. Though not a Jedi himself, he lived by many Jedi ideals.\nA male Cerean, Thi Xon Yimmon resided on Coruscant during the last days of the Clone Wars. While not a known Force-sensitive, Yimmon was loyal to the Jedi Order and lived by the Jedi Code as best he could, mastering several martial arts and renowned for his wisdom. When the Grand Army of the Republic executed Contingency Order 66 and wiped out the Jedi Order, Yimmon and several other Jedi loyalists formed an underground resistance group known as Whiplash to assist surviving Jedi escape persecution by the newly formed Galactic Empire. As the Jedi Temple lay in smoldering ruin on the surface, Yimmon was appointed leader of the group as his binary brain was able to process the multitudes of information flowing into the organization at all times. During a meeting with Jedi Knight Jax Pavan, Yimmon was unsure of whether or not to assist the young Force Adept Kajin Savaros or the initiation of Tuden Sal into the organization. Fearing that Savaros status of a person of interest by the Inquisitorius would put the whole organization in danger, Yimmon agreed to think on it while permitting Sal to form a plan to assassinate the Galactic Emperor.\nAs Pavan agreed to Sal's plan and the use of I-5YQ in the plot, Savaros and Gray Paladin Laranth Tarak were captured by Dark Lord of the Sith Darth Vader encouraging Pavan to see Sal's plan come to fruition. While Yimmon scoured the group's membership for a possible traitor, the Sullustan Den Dhur informed him of Pavan's intentions to speed up the plan. Escorted by Dhur and Sal to the meeting place, they arrived moments after Vader obtained and contained a sample of the bota plant from Laranth Tarak and became intoxicated with the power of the Force. Unleashing raw energy in an unbelievable manner, Yimmon and his allies would have surely been killed had Vader not have been defeated by his aide Haninum Tyk Rhinann and allowing them to escape. Regrouping, Yimmon agreed to transport the amnesic Savaros to Shili for healing with the Silent.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/The_Last_Jedi_(novel)",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Whiplash",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jax_Pavan",
  "/wiki/Force_Adept",
  "/wiki/Kajin_Savaros",
  "/wiki/Tuden_Sal",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/I-5YQ",
  "/wiki/Gray_Paladin",
  "/wiki/Laranth_Tarak",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Den_Dhur",
  "/wiki/Bota",
  "/wiki/Haninum_Tyk_Rhinann",
  "/wiki/Shili/Legends",
  "/wiki/The_Silent",
  "/wiki/Coruscant_Nights_III:_Patterns_of_Force"
 ]
}