{
 "name": "Thilis-Brin",
 "display_name": "Thilis-Brin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "36 BBY–32 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ishi Tib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Shroud Team",
      "Shroud Team"
     ]
    }
   ]
  }
 ],
 "content": "Thilis-Brin was a female Ishi Tib serving with the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. A technician, she was assigned to the Mon Calamari Shipyards as a troubleshooter after completing recruit training. After two years, Thilis-Brin desired a more active Alliance posting and accepted an offer to join Shroud Team—an all-alien unit of Foster Agents tasked with returning stranded operatives to the Alliance—under the command of Lieutenant Dutra Zeneta, a member of the Jin species. Based out of Corint City on the planet Pirik, she served as the group's technician and secondary Foster Agent after the Rodian Dheendo. A thrill-seeker, Thilis-Brin reveled in using her personal Sunwolf speeder bike to assist in operative extractions while evading Imperial pursuit, such as the time she successfully helped a high-ranking officer return to the Alliance after a speeder bike chase through the Talamp Industrial Sector.\nThilis-Brin was a female Ishi Tib born sometime between 36 BBY and 32 BBY. During the Galactic Civil War, she joined the insurgent Alliance to Restore the Republic and underwent recruit training, placing first in her class. She also placed fourth in the desert training seminar, an impressive achievement given the aquatic physiology of the Ishi Tib. Upon graduation from her training, Thilis-Brin was regarded as SpecForce material, but she was assigned to the Mon Calamari Shipyards, working as a technical troubleshooter. However, she longed to take a more active role in the Alliance. Two years after enlisting, Thilis-Brin received the opportunity she desired. She was selected by the Jin Lieutenant Dutra Zeneta to serve as part of Shroud Team, an all-alien unit of Foster Agents. A posting as a Foster Agent was one of the most dangerous assignments in the Alliance; they were the point of contact for operatives stranded in the field who were attempting to rejoin the Alliance. The names and locations of the Foster Agents were provided to those operatives who may have need of their services; if the operatives were captured and interrogated, the Foster Agent was in danger of being compromised.\nShroud Team was inserted into Corint City on the planet Pirik in the Divis Arm; in addition to Thilis-Brin and Zeneta, the team also consisted of the Rodian Dheendo, the Carosite Tamo Lan, and the Aqualish Gondara. The unit's composition blended well with the inhabitants of Corint City, as non-Humans made up 95 percent of the local population. Thilis-Brin served as the team's chief technician and procurement specialist, who would obtain needed supplies, such as vehicles and rations. She was also Shroud Team's secondary Foster Agent, with Dheendo operating as the primary. However, her Ishi Tib physiology meant that she needed to immerse herself in a brine solution every day. The closest available source to Corint City was the Uloitir Sea, located fourteen kilometers from the settlement, and Thilis-Brin had to find the necessary time in the day to attend to her physiological needs while also performing her duties with Shroud Team. At some point during her assignment on Pirik, Thilis-Brin was involved in a high-speed speeder bike chase through the Talamp Industrial Sector. Riding her modified Ikas-Adno Sunwolf speeder bike, she evaded a squad of Imperial scout troopers while transporting a high-ranking Alliance officer. Evading pursuit and positive identification, she ensured her charge was safely delivered to their destination.\nThilis-Brin was an individual driven to succeed, be it on a personal level or in her goal to assist in the destruction of the Empire. Her scores during her Alliance training marked her as an operative with a promising career, which Thilis-Brin began to live up to once she started working with Shroud Team. Although she enjoyed her work with the unit, Thilis-Brin was unsure of exactly what kind of career she wanted to pursue with the Alliance and in what capacity she wanted to serve in the future. While Ishi Tib were generally known to be mild-mannered individuals, Thilis-Brin was not. She was a show-off who lived for thrills and was noted for rescuing Alliance operatives in a high-profile manner.\nThilis-Brin was qualified to pilot both capital ships and space transports, and she was rated to handle the weapon and shielding systems aboard the former. She was also capable of navigating vessels through hyperspace and using communications and security equipment. A skilled technician, Thilis-Brin was trained to repair capital ships, with particular expertise with EF76 Nebulon-B escort frigates and MC80 Star Cruisers, and space transports, as well as maintaining their weapon systems. She was also able to program and repair both droids and computers.\nThilis-Brin's assignment to the Calamari shipyards gave her an insight into the bureaucracy needed to keep the installation functioning efficiently, as well as knowledge regarding Mon Calamari's law enforcement procedures. She was also well-informed about business protocols, item valuation, and Corint City itself. She was skilled in the operation of repulsorlift-equipped vehicles and could repair them when the need arose. Trained in survival techniques, Thilis-Brin placed fourth in desert survival during her training. A member of the aquatic Ishi Tib species, Thilis-Brin was a natural and strong swimmer, although her need to be immersed in salt water on a daily basis was an occasional hindrance, as she would have to find the time to do so while also operating as a member of the Alliance. In addition to that species trait, Thilis-Brin also possessed a hardened beak capable of inflicting harm during unarmed combat, and she was a natural planner like the majority of her race. She was trained in the use of a blaster and could also operate vehicle-mounted blasters.\nThilis-Brin generally armed herself with a blaster pistol and carried a comlink and tool kit. She also owned a Sunwolf speeder bike, which was the military variant of the Ikas-Adno's civilian-model Starhawk.\nThilis-Brin first appeared in an installment of the \"Cracken's Rebel Operatives\" article series published in Star Wars Adventure Journal 10 by West End Games in 1996. Detailing the members of Shroud Team, the feature was written by C. Robert Carey with illustrations provided by Kathy Burdette. Thilis-Brin was later namechecked as an example name for Ishi Tib characters in the Ultimate Alien Anthology, published in 2003, and The Unknown Regions, released in 2010, both from Wizards of the Coast.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Brin_(disambiguation)",
  "/wiki/36_BBY/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Ishi_Tib/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Shroud_Team",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Mon_Calamari_Shipyards/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Foster_Agent",
  "/wiki/Lieutenant/Legends",
  "/wiki/Dutra_Zeneta",
  "/wiki/Jin",
  "/wiki/Species/Legends",
  "/wiki/Corint_City",
  "/wiki/Planet/Legends",
  "/wiki/Pirik",
  "/wiki/Rodian/Legends",
  "/wiki/Dheendo",
  "/wiki/Sunwolf_speeder_bike",
  "/wiki/Time/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/Unidentified_Alliance_officer_(Pirik)",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Talamp_Industrial_Sector",
  "/wiki/Reproduction/Legends",
  "/wiki/Desert/Legends",
  "/wiki/Water/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Operative",
  "/wiki/Divis_Arm",
  "/wiki/Carosite",
  "/wiki/Tamo_Lan",
  "/wiki/Aqualish/Legends",
  "/wiki/Gondara",
  "/wiki/City/Legends",
  "/wiki/Human/Legends",
  "/wiki/Quartermaster/Legends",
  "/wiki/Ration_pack/Legends",
  "/wiki/Salt/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Uloitir_Sea",
  "/wiki/Kilometer/Legends",
  "/wiki/Ikas-Adno/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Scout_trooper/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/MC80_Star_Cruiser/Legends",
  "/wiki/Programmer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Dac",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Starhawk_speeder_bike/Legends",
  "/wiki/Cracken%27s_Rebel_Operatives_(article)",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/West_End_Games",
  "/wiki/1996",
  "/wiki/Craig_Robert_Carey",
  "/wiki/Kathy_Burdette",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/2003",
  "/wiki/The_Unknown_Regions",
  "/wiki/2010",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/0_ABY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim"
 ]
}