{
 "name": "Tho%27natu",
 "display_name": "Tho'natu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Army of Light",
      "Ambria strike team",
      "Army of Light",
      "Ambria strike team"
     ]
    }
   ]
  }
 ],
 "content": "Tho'natu was a male Twi'lek Jedi during the final years of the New Sith Wars. As a Jedi Knight, he fought in the Ruusan campaign, and by 990 BBY he had ascended to the rank of Jedi Master. In that year, the Jedi Order received a message revealing that an injured Sith Lord was on the planet Ambria, and Tho'natu and a team of thirteen other Jedi were sent to arrest the Dark Lord. Upon their arrival, they were attacked by the former Padawan Darovit, who Tho'natu and the others quickly killed, believing him to be the Sith Lord. Unbeknownst to the Jedi, Darth Zannah had hidden herself and her Master, Darth Bane—the Sith Lord to whom the message actually referred—and had driven Darovit insane. Erroneously believing the Sith to be eliminated, Tho'natu and the team of Jedi left, resulting in the survival of the Sith Order.\nTho'natu was a Force-sensitive male Twi'lek who served in the Jedi Order during the final days of the New Sith Wars. As a Jedi Knight, he joined the Army of Light and fought in the Ruusan campaign, the final campaign of the war. Before the Seventh Battle of Ruusan, however, Tho'natu was assigned to Jedi Master Valenthyne Farfalla's gunship, the Fairwind, and thus survived the catastrophic detonation of a thought bomb, a deadly Force power that the Brotherhood of Darkness used in a failed attempt to destroy the Army of Light.\nBy 990 BBY, ten years after the war, Tho'natu had been granted the rank of Jedi Master. In that year, a message drone was sent to the Jedi, alerting them to the presence of a helpless, grievously injured Sith Lord under the care of the healer Caleb on the planet Ambria. Realizing that this must refer to the Sith Lord after whom Lord Farfalla and four other Jedi had recently hunted on Tython—a mission from which they did not return—the Jedi High Council assembled a team led by Tho'natu, consisting of five other Jedi Masters and eight Jedi Knights. Aboard the Jedi cruiser Light of Truth, Thon'atu led the team to Ambria to arrest the Sith Lord. Upon arriving, Tho'natu and his team of Jedi found the brutally mutilated remains of Caleb's corpse outside the healer's hut. As the Jedi approached the abode, Tho'natu announced their presence, claiming that they had arrived to help. They were abruptly attacked by the maniacal former Padawan Darovit, and Tho'natu and the other Jedi quickly struck him down.\nTho'natu then entered Caleb's hut, where he found five lightsaber hilts, which he assumed were taken as trophies from the five Jedi who had been killed on Tython. Observing that Darovit had a missing hand and that he was in possession of a golden lightsaber identical to Farfalla's, Tho'natu assumed incorrectly that Darovit was the Sith Lord whom Farfalla and the others had hunted. He surmised that Darovit had killed them, but had been grievously injured and had gone to Caleb for help after driving himself insane by attempting to heal himself with the dark side. Tho'natu then assumed that Caleb had sent the message to the Jedi, but that Darovit had found out and killed the healer in retaliation. Mistakenly believing the Sith to finally be obliterated from the galaxy, Tho'natu and the other Jedi returned to the galactic capital of Coruscant, taking with them the stolen lightsabers, so that they could be kept in the Jedi Temple, as well as Caleb's remains, so that he could be given a proper funeral. A monument was later created in the Jedi Temple on which the names of Caleb and the Jedi killed on Tython were commemorated.\nHowever, unbeknownst to Tho'natu, Darovit's cousin—the Sith apprentice Darth Zannah—had killed Caleb and driven Darovit insane so that he would attack the Jedi when they arrived. She had then concealed the presences of herself and her Master, Darth Bane—the true Sith Lord to whom the message actually referred—and hidden in a small trapdoor inside Caleb's hut. As Tho'natu reported the final destruction of the Sith to the Jedi Council upon his return to Coruscant, Zannah's plan to keep the survival of the Sith Order a secret was completed.\nDue to his time spent on Ruusan in the New Sith Wars, Tho'natu was well aware of the danger that a Sith Lord presented. As such, he was initially cautious during the mission to Ambria. He and his team of Jedi were fooled by Zannah's ploy to keep the Sith a secret, as Tho'natu surmised incorrectly that the Sith had been eliminated.\nTho'natu was a Force-sensitive and trained in the ways of the Jedi during the final years of the New Sith Wars, achieving the rank of Master by 990 BBY. Tho'natu was proficient in combat, and when he was sent to deal with the last known Sith Lord on the planet Ambria, he and his team of Jedi killed Darovit with ease.\nTho'natu was created by author Drew Karpyshyn for his 2006 novel Darth Bane: Rule of Two, the second installment in the Darth Bane Trilogy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Ambria_strike_team",
  "/wiki/Jedi/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ruusan_campaign",
  "/wiki/990_BBY",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Message_drone",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ambria/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Confrontation_on_Ambria",
  "/wiki/Padawan/Legends",
  "/wiki/Darovit",
  "/wiki/Death/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Force_stealth",
  "/wiki/Sith_Master/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Summon_fear",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Valenthyne_Farfalla",
  "/wiki/Gunship/Legends",
  "/wiki/Fairwind",
  "/wiki/Thought_bomb",
  "/wiki/Force_power/Legends",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Caleb",
  "/wiki/Jedi_Lord",
  "/wiki/Tython/Legends",
  "/wiki/Duel_on_Tython",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_cruiser",
  "/wiki/Light_of_Truth",
  "/wiki/Lightsaber_hilt/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Funeral/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Time/Legends",
  "/wiki/Ruusan/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Drew_Karpyshyn",
  "/wiki/2006",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Star_Wars:_Darth_Bane_Trilogy",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Darth_Bane:_Path_of_Destruction",
  "/wiki/Standard_year/Legends",
  "/wiki/1000_BBY"
 ]
}