{
 "name": "Thok_(Gamorrean_guard)",
 "display_name": "Thok  (Gamorrean guard)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pzob"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Skunnt Clan",
      "Jabba Desilijic Tiure's criminal empire",
      "Galactic Empire",
      "Zaarin coup forces"
     ]
    }
   ]
  }
 ],
 "content": "Thok was a Gamorrean warrior, who served Jabba Desilijic Tiure's criminal empire as well as the forces of Arden Lyn and Demetrius Zaarin in the Galactic Empire.\nThok was born and raised on Pzob, alongside his brother Gorc. Although they were typical of their species in the sense of their innate desire for battle and hatred of droids, Thok and Gorc were also unique in that they possessed a \"magical power\" where, when they finished a huge brunch topped off with a gallon of Gamorrean hooch and engaged in impromptu fisticuffs, they belched a fireball. After their inadvertent first attempt had occurred that resulted in flambéing and scorching his clan-rival Scumbo's snout, Thok decided along with his brother to go to other worlds to fight, as there were far bigger hogs to fry than on Pzob.\nHe eventually bought a translator so he and Gorc could enter fights for various fortunes. Sometime later, they found work on Zlarbv IV as guinea pigs for the scientist, Dr. Pineas Pontak's development of the Pontak Hypergland. This made them swell up their muscles if sufficiently enraged, although the process was painful. After leaving Pontak's employment, they eventually went to Tatooine, where they were recruited by Ortugg into the bodyguard profession of Jabba Desilijic Tiure and his criminal empire, as Jabba himself saw their potential.\nHe had many adventures under Jabba's employ. He once bolted when Ortugg told him to bring in the Rancor, as he recognized the creature as being the mythological spider-crab from Gamorr mythology when one such creature was introduced to their planet by the Rakata Empire millennia back. He also ratted out Pontak's location to Jabba when the latter required his presence to one-up Suppoon, his gang rival, in a Punjab. He received a promotion to personal bodyguard for this due to Jabba being impressed with his deduction.\nHe and his brother were eventually arrested by The Prophetess one night on Mos Eisley's bar where he and Gorc, after drinking seven gallons of Zelostian wine, got into an immense bar fight where he and Gorc, with a Kloo Horn, bludgeoned three Gungan patrons to death, as well as fricasseed five Ugnaught patrons. He exposed Gorc's ability to erupt fire in an attempt to save his own hide, although this only resulted in their separation, with Thok specifically being placed in Prefect Orun Depp's prisons to rot while Gorc was experimented on.\nHe was eventually freed by the ancient and cybernetic Emperor's Hand Arden Lyn, in exchange for supplying the Prophetess with information regarding a Panathan mineral baron, as she had sensed his Force potential. Thok, due to his species' hatred of mechanical things as well as Gamorr tradition, informed her that he'd rather die than serve someone who couldn't defeat him in single combat, especially someone who was part-droid. Although it was a grueling fight, Thok ended up defeated by a single uppercut from Lyn's cybernetic arm. Lyn, impressed with his Force-enhanced abilities, then recruited him into her Teräs Käsi students, alongside the Force-sensitive stormtrooper 17786 and the former Grave Tuskens member KkH'Oar'Rrhr. He trained extensively for Lyn's mission to terminate the \"Heroes of Yavin,\" and managed to engage them in battle, with Chewbacca being a particularly challenging foe. In truth, however, Lyn was gathering soldiers to overthrow Emperor Palpatine. Unfortunately for Lyn, fellow Emperor's Hand Mara Jade reported her treachery to her master, prompting Lyn and Thok to disappear. Months after the Battle of Hoth, Thok and Lyn reemerged, now in league with Demetrius Zaarin and his coup against Emperor Palpatine. After the coup failed, he was subsequently released from Lyn's service.\nThok returned to working for Jabba; he would be one of nine Gamorrean guards on duty in Jabba's Palace in 4 ABY. He was an interior guard, and served alongside Thug. He was later killed by Luke Skywalker during the Battle of the Great Pit of Carkoon, after he attempted to ambush Luke with a blaster. In his dying moments, he saw Scumbo looking down at him. Although he feared that he was going to be killed by his hated nemesis, Scumbo instead honored the dying Gamorrean by squealing the Gamorrean war cry as the Khetanna exploded around them.\nThok was one of the Gamorrean guards in Star Wars: Episode VI Return of the Jedi. He was given some backstory in the Dark Forces Saga and also appeared in the fighting game Star Wars: Masters of Teräs Käsi, which revealed his Force abilities. He was eventually given an extensive history in part 2 of Barely Tolerable: Alien Henchmen of the Empire, which also retconned his homeworld as being Pzob instead of Gamorr, which Dark Side had implied. In addition, although his role in Gorc becoming a Sithspawn was retained, the exact circumstances were different: In Dark Side Forces, he sold him out to prevent his going into slavery when Imperial slavers arrived on the planet, but in Barely Tolerable, he instead squealed on the Imperials on Gorc's Force Potential when they were arrested for a violent brawl at Mos Eisley in an attempt to save their hide.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Barely_Tolerable:_Alien_Henchmen_of_the_Empire",
  "/wiki/Talk:Thok_(Gamorrean_guard)",
  "/wiki/Pzob/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Skunnt",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Zaarin_coup_forces",
  "/wiki/Arden_Lyn",
  "/wiki/Demetrius_Zaarin",
  "/wiki/Gorc",
  "/wiki/Droid/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Scumbo",
  "/wiki/Zlarbv_IV",
  "/wiki/Pineas_Pontak",
  "/wiki/Ortugg",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Gamorr/Legends",
  "/wiki/Infinite_Empire",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Prefect/Legends",
  "/wiki/Orun_Depp",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Panatha",
  "/wiki/17786",
  "/wiki/Grave_Tuskens",
  "/wiki/KkH%27Oar%27Rrhr",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Zaarin_insurrection",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Thug",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Battle_of_the_Great_Pit_of_Carkoon",
  "/wiki/Khetanna/Legends",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/Star_Wars:_Masters_of_Ter%C3%A4s_K%C3%A4si",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sithspawn/Legends",
  "/wiki/Jabba_the_Hutt:_The_Gaar_Suppoon_Hit",
  "/wiki/Retcon",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/Game_Room",
  "/wiki/Star_Wars_Galaxy_Magazine_12",
  "/wiki/Masters_of_Ter%C3%A4s_K%C3%A4si:_Prima%27s_Official_Hints_and_Tips",
  "/wiki/Star_Wars_Kids_(1997)",
  "/wiki/Who_Is_That_Alien%3F",
  "/wiki/Star_Wars_Kids_8_(1997)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Be_the_Jedi_in_Three_New_LucasArts_Games",
  "/wiki/Star_Wars_Insider_36",
  "/wiki/Star_Wars:_Boba_Fett",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Jedi_Knights_Trading_Card_Game",
  "/wiki/Premiere_(Jedi_Knights_TCG)",
  "/wiki/Masters_of_the_Force_(Jedi_Knights_TCG)",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Reflections_III",
  "/wiki/Wizards.com",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_138",
  "/wiki/StarWars.com"
 ]
}