{
 "name": "Thorn",
 "display_name": "Thorn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Scipio"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Diplomatic service",
      "Diplomatic service"
     ]
    }
   ]
  }
 ],
 "content": "\"Thorn\" was the assumed nickname of a clone shock trooper who held the rank of Clone Commander in the Galactic Republic's Coruscant Guard during the Clone Wars. When in combat, Thorn was armed with a Z-6 rotary blaster cannon, titled by the commander as \"Hammer.\" In 19 BBY, the Clone Commander escorted Senator Padmé Amidala alongside a garrison of diplomatic service clone troopers to the planet Scipio, where control of the InterGalactic Banking Clan was claimed by Baron Rush Clovis with support from the Republic and Confederacy of Independent Systems.\nNot long after, Scipio underwent an invasion by the Separatist Droid Army, where a group of Hyena-class Droid Fighter/Bombers attacked the clone shock troopers' position, destroying their Low Altitude Assault Transport/infantry gunships. The invasion then brought waves of battle droids, with the clone troopers surrounded and fighting to their final soldier. Thorn, standing as the last of his troopers, destroyed several battle droids in his defense, but was soon killed after multiple blaster shots to the chest.\nLike all clone troopers, \"Thorn\" was cloned from the genetic code of Jango Fett—the original source of the Grand Army of the Republic—on the planet Kamino. During the Clone Wars, he served the Galactic Republic as a clone shock trooper and held the military rank of Clone Commander in the Coruscant Guard's diplomatic service.\nIn 19 BBY, Thorn and a garrison of shock troopers escorted Senator Padmé Amidala and Rush Clovis to the planet Scipio, home of the InterGalactic Banking Clan's vaults. Thorn's men landed in twelve specialized Republic gunships and one Consular-class Armed Cruiser. After corruption was found in the previous ruling council, Clovis was elected to lead the Banking Clan with the support of the Republic and the Confederacy of Independent Systems on the condition that he would work in the interests of both factions. Upon arriving on Scipio, Amidala and Clovis entered the Main Vault fortress with the Separatist representative Bec Lawise, leaving Thorn and his troopers to guard their ships outside of the main compound. Thorn assured Amidala that the clone troopers would remain close by in case the senator required their assistance. Clovis assumed control of the banks but was later forced by the Confederate leader Count Dooku to raise interest rates on the Republic. Afterward, Dooku sent an invasion force to occupy Scipio so he could frame Clovis for conducting a Separatist takeover of the banks.\nThorn was inside the cruiser when another trooper alerted him or the invasion force that was quickly approaching them, and, realizing that his men's position on the landing platform was vulnerable, ran outside and ordered the clones to retreat into the city. By then a squadron of Hyena-class Droid Bombers arrived and destroyed their gunships as they attempted to take off as well as their cruiser. Unable to reach the senator, Thorn used a comlink to contact Amidala and advised her to find a way to escape from Scipio. A force of super battle droids and commando droids were deployed by HMP droid gunships, intercepting the clones and surrounded them, forcing Thorn and his soldiers to make their last stand outside of the Main Vault.\nAs the fight progressed, more clone troopers began to fall, while Thorn destroyed numerous droids with his Z-6 rotary blaster cannon, known as \"the Hammer.\" He continued to fight after the last of his troopers were killed, destroying more droids despite being wounded by a blaster bolt. As the droids closed in around him, Thorn used his blaster cannon as a melee weapon to keep them away and defiantly shouted a Republic war cry before ultimately dying in battle. Despite the loss of Thorn and his men, the Republic military defeated the Separatist army and occupied Scipio, allowing Supreme Chancellor Sheev Palpatine to take control of the Banking Clan.\nAs a clone of Jango Fett, Thorn was a human male who stood at 1.83 meters. When the Separatists invaded Scipio, he acted with haste in warning Padmé Amidala about the invasion. He fought alongside his troops as they did everything they could to impede the Separatist attack. Despite losing his men and being surrounded, he continued to fight by unleashing a torrent of blaster bolts on the battle droids and bashing them with his Z-6 rotary cannon before falling valiantly in service to the Republic.\nCommander Thorn wore the Phase II clone trooper armor, an improved version of the Phase I model that most clones had adopted by the late Clone Wars. His clone armor featured the distinctive red patterns of the Coruscant Guard in addition to several attachments including a black visor, an antenna on his left shoulder piece, and a kama. He also had a military officer's badge on his armor.\nThorn wielded several weapons such as the DC-15A blaster carbine and two DC-17 hand blasters. He also possessed a Z-6 rotary blaster cannon nicknamed \"the Hammer.\" Thorn used it for both ranged attacks and melee combat against his droid adversaries on Scipio.\nThorn first appeared in \"Crisis at the Heart,\" the seventh episode of the sixth season of Star Wars: The Clone Wars. The wings on Thorn's helmet and the fact that his blaster is named \"the Hammer\" are nods to the Marvel Comics superhero Thor.\nA 3.75-inch action figure of Commander Thorn was released in 2015 in the Black Series toy line.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Thorn",
  "/wiki/Thorn/Legends",
  "/wiki/Thorn_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Scipio",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Diplomatic_service",
  "/wiki/Imperial_shock_trooper",
  "/wiki/Military_rank",
  "/wiki/Clone_Commander",
  "/wiki/Coruscant_Guard",
  "/wiki/Clone_Wars",
  "/wiki/Z-6_rotary_blaster_cannon",
  "/wiki/Commander",
  "/wiki/Hammer",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Garrison",
  "/wiki/Clone_trooper",
  "/wiki/Planet",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Baron",
  "/wiki/Rush_Clovis",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Invasion_of_Scipio",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Hyena-class_Droid_Fighter/Bomber",
  "/wiki/Trooper",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Gunship",
  "/wiki/Battle_droid",
  "/wiki/Droid",
  "/wiki/Death",
  "/wiki/Blaster",
  "/wiki/DNA",
  "/wiki/Jango_Fett",
  "/wiki/Clone_template",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Republic_Military",
  "/wiki/Consular-class_Armed_Cruiser",
  "/wiki/Main_Vault_fortress",
  "/wiki/Bec_Lawise",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/City",
  "/wiki/Squadron",
  "/wiki/Comlink",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/BX-series_droid_commando",
  "/wiki/HMP_droid_gunship",
  "/wiki/Soldier",
  "/wiki/Blaster_cannon",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Troop",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Clone_trooper_armor",
  "/wiki/Color",
  "/wiki/Coruscant",
  "/wiki/Antenna",
  "/wiki/Armor",
  "/wiki/Kama",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Cannon",
  "/wiki/Crisis_at_the_Heart",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Category:Images_of_Thorn",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Legion",
  "/wiki/Phase_II_Clone_Troopers_Unit_Expansion",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau",
  "/wiki/Standard_year"
 ]
}