{
 "name": "Thracia_Cho_Leem",
 "display_name": "Thracia Cho Leem",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "approx. 1.35 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Vergere"
     ]
    }
   ]
  }
 ],
 "content": "Thracia Cho Leem was a female Human Jedi Master serving in the Jedi Order in the waning years of the Galactic Republic. While not always agreeing with the Jedi High Council's choices, Master Leem maintained a good relationship with Councilor Mace Windu. One of her most prominent Padawans was the Fosh Jedi Vergere.\nA Force-sensitive Human, Thracia Cho Leem was educated in the ways of the Force by the Jedi Order; eventually attaining the rank of Jedi Master. After achieving the rank of Knight, Leem undertook independent study as a Jedi Consular, becoming a renowned healer and well respected by many of her peers. A contemporary of Mace Windu, she was one of his few close friends who could make him smile heartily. Their friendship was maintained despite Leem's unorthodox lifestyle and her disregard for formality or finesse.\nIndeed, Master Leem was somewhat of a rogue. Taking predominantly female Padawans, the diminutive woman roamed the galaxy, returning very rarely to the Coruscant Jedi Temple. In fact, Master Leem violated the Jedi Code's ban on attachments, frequently marrying several times and giving birth to sons and daughters on several worlds. Despite this, Leem never received censure from the High Council; the august body continued to allow her to teach apprentices and carry her lightsaber.\nOne of Master Leem's most prized Padawans was the Fosh Jedi Vergere. Having been with Vergere the moment she hatched, Leem took the avian as her apprentice and raised her to the rank of Knight. Therefore, when Vergere did not report back after departing for Zonama Sekot in 29 BBY, Master Leem petitioned the High Council to dispatch a rescue team to find her wayward apprentice. Assigning Jedi Obi-Wan Kenobi and his young Padawan Anakin Skywalker, the team searched for evidence of Vergere on the planet. When the two returned to Coruscant, they concluded that Vergere had been taken by beings known as the Far Outsiders and that she was beyond the Order's reach. Not long after, Master Leem left the Order without stating her reasons, this time for good. Maintaining contact with the Temple, Leem no longer served the Republic, but the Force.\nThough she left the Jedi Order as a Master, Thracia Cho Leem is not considered a member of the Lost Twenty.\nThe Power of the Jedi Sourcebook identifies her surname as \"Cho Leem\", while the newer source Jedi vs. Sith: The Essential Guide to the Force has it simply as \"Leem\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Vergere",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Fosh",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Consular",
  "/wiki/Jedi_healer/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Zonama_Sekot/Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Lost_Twenty/Legends",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Cloak_of_Deception",
  "/wiki/Rogue_Planet",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_45",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}