{
 "name": "Thrackan_Sal-Solo",
 "display_name": "Thrackan Sal-Solo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "35 BBY",
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "40 ABY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Solo family",
      "Human League",
      "Centerpoint Party",
      "Yuuzhan Vong empire",
      "Peace Brigade",
      "Peace Brigade",
      "Five Worlds"
     ]
    }
   ]
  }
 ],
 "content": "Thrackan Sal-Solo was a Human male who was the son of Randil Sal and Tiion Sal-Solo and the first cousin of Han Solo. He was a few years older than Han and bore a striking resemblance to his cousin. Thrackan even had a voice that corresponded to Han's. Known to the galaxy as a convicted felon, Sal-Solo, despite his vicious crimes, came into power multiple times. As of 40 ABY, Thrackan became Head of State of Corellia and its Minister of War. He was responsible for the Second Galactic Civil War.\nDuring the war, Thrackan issued a bounty on Han Solo's family, hiring Boba Fett's daughter, Ailyn Vel, to carry out the job. However, his plan to rule Corellia backfired as he was killed by Boba Fett, Mirta Gev, and Han Solo.\nHis father died when he was very young, and his mother was a reclusive, distrustful woman, who surrounded herself with a staff of droid servants. The family was apparently descended from the ancient emperors of Corellia, and while his lonely childhood left him arrogant and domineering, Tiion Sal-Solo nevertheless raised her son to think of himself as a gentleman.\nIn 18 BBY, Thrackan encountered his cousin Han, a teenage orphan who had run away from gangster Garris Shrike and was searching for clues about his own origins. His mother, when introduced to Han, became hysterical after noticing his resemblance to her lost loved ones. Thrackan angrily pulled Han from the room, blaming him for upsetting her. When Han asked what was wrong with her, Thrackan became angrier and struck him, shouting that there was nothing wrong with Tiion and that Han had no right to talk about her.\nDespite the way this first meeting unfolded, Han stayed with Thrackan for a short time in an attempt to learn about the rest of his family and because he had nowhere else to go—Han feared Thrackan would turn him over to the authorities if he were ever to defy him, which would result in his being found and recaptured by Shrike.\nHan found his cousin to be a violent bully; seen from the other side, however, it is not impossible that Han's existence had shattered Thrackan's belief that he was the rightful heir of Corellia's ancient monarchy. Be that as it may, during his stay with Thrackan, Han endured much abuse both physical and verbal from the older boy. In order to placate his cousin Han was required to do everything he was told, including helping to break into and burglarize neighboring homes and try to teach Thrackan to pilot a speeder. Thrackan would torture animals or insects for fun, doing it more frequently once he realized how much it unsettled Han to have to watch.\nOne day, Thrackan's bullying became too much for Han. When Thrackan held a knife to him and threatened him with cutting off his ears, Han attacked his bigger cousin with a viciousness and talent that he learned on the street, which caught Thrackan off guard. Han savagely beat Thrackan and finally held a knife to his throat, the same knife Thrackan had been threatening Han with moments earlier.\nHan forced the terrified Thrackan to tell him about everything he knew about their family, with Thrackan answering truthfully. Once Han became calmer and let down his guard, Thrackan overpowered him and locked him in a storeroom for three days, feeding him only bread and water, vowing to make him sorry. Han's confinement ended when Thrackan walked into the room accompanied by Garris Shrike; his cousin had cruelly decided to turn him back over to the sadistic captain. This incident was the first of many which would lead to a lifelong family feud between Thrackan and Han.\nThrackan later attempted to pursue a career in the Imperial Navy, but Han's cashiering, smuggling career and fighting with the Rebellion thwarted his ambition, and confined him to a bureaucratic role within the Corellian sector. Nevertheless, Thrackan's ruthless ambition and his family connections enabled him to prosper in the Imperial administration, and when Daclif Gallamby became Diktat in 2 BBY, Thrackan was appointed as his deputy. He found himself frustrated in his romantic ambitions, however, as women often tended to think of him not on his own terms, but merely as Han Solo's cousin. His sense that his cousin thwarted him in every aspect of his life was further compounded when the Imperial government on Corellia was undermined by the Battle of Endor and the subsequent rise of the New Republic—with Han, of course, playing a vital role in the Rebel victory.\nEventually, when the New Republic took control of Corellia, Thrackan disappeared. He formed a speciesist underground movement known as the Human League, and allied himself with the Sacorrian Triad, who had control of Centerpoint Station—or perhaps more specifically with the Imperial General who was one of the Sacorrian troika.\nIn 18 ABY, Han and his family arrived in the system, on a diplomatic mission to end the First Corellian Insurrection, and the two cousins met again for the first time in more than thirty years. Thrackan declared himself Diktat and attempted to kill Han, but his attempts were foiled by Han's children, and he was arrested.\nHaving spent the next eight years at Dorthus Tal Prison, he was released during the Yuuzhan Vong War, to help make the main weapon on the Centerpoint Station work, after it was unlocked by Anakin. Thrackan Sal-Solo appealed to his first cousin once removed, Anakin Solo, to help him activate Centerpoint Station and destroy the Yuuzhan Vong armada in orbit over Fondor. After a lengthy debate involving Thrackan, Anakin, and Anakin's brother Jacen, the younger Solo decided that firing Centerpoint could lead to the dark side. Angered, Thrackan fired the device himself, decimating not only half of the invader's fleet, but nearly all of the Hapan fleet rendering aid at Fondor. Despite the friendly fire casualties, Sal-Solo had administered one of the few reverses then inflicted upon the Yuuzhan Vong, and he was hailed as a hero in many quarters. He became the leader of the Centerpoint Party and was elected Governor-General of the Corellian sector a year later. A few months later, he informed the Yuuzhan Vong about the Jedi Praxeum on Yavin 4.\nAfter the Battle of Coruscant, Sal-Solo traveled to Yuuzhan'tar, to meet with Shimrra Jamaane, the Supreme Overlord of the Yuuzhan Vong, and Nom Anor. He offered to sign a treaty of friendship in exchange for Corellian neutrality, but the Yuuzhan Vong took him captive  and forced him to become the president of the Peace Brigade, Jedi hunters working for the Yuuzhan Vong. Shimrra knew that being associated with the Peace Brigade would destroy Sal-Solo's reputation among Corellians. Sal-Solo was later captured at Ylesia after a battle between New Republic and Peace Brigade forces , and was extradited back to Corellia to stand trial for treason.\nThrackan was able to reverse his bad fortune by portraying himself as a nationalist and fighter for the Corellian cause, and returned to a position of power following the Yuuzhan Vong conflict. This time, however he returned to power as an independent , although with considerable support from members of the Centerpoint Party. In the Second Galactic Civil War, Sal-Solo served as the Head of State of the planet Corellia under the system's Prime Minister, Aidel Saxan. During this time Thrackan had planned to use Anakin Solo's biometrics to activate the Centerpoint Station to use on the Galactic Alliance. However his plans were foiled when Ben Skywalker convinced the droid Anakin Sal-Solo to shut it off.\nJacen Solo saw through the Force how Thrackan was the main cause of a war, one that would spread out from Corellia causing pain not felt since the last War and attempted to kill him, although thwarted by Thrackan's clever devices.\nIn 40 ABY, when Saxan was assassinated and Admiral Gilad Pellaeon nearly killed, Sal-Solo was suspected of involvement. As it turned out, Thrackan was indeed responsible for Saxan's death by conspiring with the Sith Lady Lumiya to assassinate her. To make matters even worse, Thrackan Sal-Solo approved Wedge's plan, Operation Noble Savage, thus starting a full-scale war.\nAt this point in his life, he had at least three mistresses, as well as an estate that was more like a military fortress than a mansion.\nAs the crisis continued to flare up across the galaxy, Sal-Solo placed a bounty on his cousin Han, and the rest of Han's family. The bounty was picked up by Ailyn Vel, the daughter of Boba Fett. However, she was captured by the GAG before she could carry it out and later died at the hands of Jacen Solo during a torture session. Sal-Solo then tried to hire Boba Fett to finish the job and have his Mandalorian warriors provide security for the Corellian teams that were trying to make Centerpoint Station operational again. Fett was only interested in the job because he knew that if he found Han then he would find his daughter, but after being approached on Corellia by Dur Gejjen's offer to kill Sal-Solo for one million credits and then Han who wanted to kill Sal-Solo himself, he decided to join forces with him and along with his granddaughter, Mirta Gev to assassinate him.\nAfter the three of them had Sal-Solo alone in his office, and Han attempted to choke him with his own hands, Sal-Solo revealed that he had sold out Ailyn to the GAG. Enraged, Gev felled Sal-Solo with three shots to the forehead. Fett then shot him twice in the chest to make sure that he was dead. However, Sal-Solo's death was not the end of the crisis, and the events of the Second Galactic Civil War that followed would deal grievous blows to many of those involved.\nThrackan Sal-Solo was widely known for his firm Humanocentrism, love of Corellia, and support of the Empire's New Order. However, his pro-Empire leanings had a limit, and the speciesism professed was more akin to xenophobia and isolationism. He also tried to portray himself as a Corellian nationalist and a proponent of the Corellian Independence cause, with considerable success as he rose to power three times before his death. Once in power, he used bullying tactics to get his way. Sal-Solo was traumatized as a child since his father, Randil Sal, died when he was one year old. His mother, Tiion, never recovered, and constantly wept. This made Thrackan angry and sad, as his mother was full of life when his father was alive. This lead to him developing an aggressive and mean-spirited personality that would characterize him later in life. He was unpopular with his peers, although he remained well loved by the people of Corellia.\nIn Legacy of the Force: Betrayal, it was hinted that Thrackan would attempt to become Prime Minister by killing or toppling Denjax Teppler. But in Legacy of the Force: Bloodlines, mention is made neither of Teppler or the Prime Minister position, and he is still listed as being \"Head of State\". However, he is also called \"President\" and made to seem the head of the full Corellian government. Presumably this was the result of editing errors as well as due to Bloodlines having been finished before Betrayal. These errors were retconned near the beginning of Legacy of the Force: Tempest when it was stated that Thrackan had declared himself President of Five Worlds in addition to his position as Head of State of Corellia. Dur Gejjen abolished this position and took up the titles Head of State of Corellia and the previous executive position Five World Prime Minister.\nThrackan's name is frequently misspelled as \"Thracken,\" even in official sources, such as Cracken's Threat Dossier and the back cover of the Assault at Selonia paperback.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thrackan_Sal-Solo_(starship)",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Thrackan_Sal-Solo",
  "/wiki/Corellia/Legends",
  "/wiki/35_BBY/Legends",
  "/wiki/40_ABY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/House_of_Solo",
  "/wiki/Human_League",
  "/wiki/Centerpoint_Party",
  "/wiki/Yuuzhan_Vong_empire",
  "/wiki/Peace_Brigade",
  "/wiki/Five_Worlds",
  "/wiki/Randil_Sal",
  "/wiki/Tiion_Sal-Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Minister_of_War_(Five_Worlds)",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Ailyn_Vel",
  "/wiki/Assassination_of_Thrackan_Sal-Solo",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Mirta_Gev",
  "/wiki/Droid/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Garris_Shrike",
  "/wiki/Torture/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Daclif_Gallamby",
  "/wiki/Diktat",
  "/wiki/2_BBY/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Speciesism",
  "/wiki/Sacorrian_Triad",
  "/wiki/Centerpoint_Station",
  "/wiki/General/Legends",
  "/wiki/18_ABY/Legends",
  "/wiki/Corellian_Crisis",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Dorthus_Tal_Prison",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Anakin_Solo",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Fondor/Legends",
  "/wiki/Hapan",
  "/wiki/Corellian_sector/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Coruscant/Legends#Yuuzhan'tar",
  "/wiki/Shimrra_Jamaane",
  "/wiki/Supreme_Overlord",
  "/wiki/Nom_Anor",
  "/wiki/Jedi_hunter/Legends",
  "/wiki/Ylesia/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Treason/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Five_World_Prime_Minister",
  "/wiki/Aidel_Saxan",
  "/wiki/Ben_Skywalker",
  "/wiki/Anakin_Sal-Solo",
  "/wiki/The_Force/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Lumiya",
  "/wiki/Battle_of_Tralus_(Second_Galactic_Civil_War)",
  "/wiki/Sal-Solo_Estate",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Dur_Gejjen",
  "/wiki/Humanocentrism",
  "/wiki/Legacy_of_the_Force:_Betrayal",
  "/wiki/Denjax_Teppler",
  "/wiki/Legacy_of_the_Force:_Bloodlines",
  "/wiki/Legacy_of_the_Force:_Tempest",
  "/wiki/President_of_Five_Worlds",
  "/wiki/Cracken%27s_Threat_Dossier",
  "/wiki/Assault_at_Selonia",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/The_Paradise_Snare",
  "/wiki/The_Hutt_Gambit",
  "/wiki/Ambush_at_Corellia",
  "/wiki/Showdown_at_Centerpoint",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/The_New_Jedi_Order:_Recovery",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Ylesia",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/InQuest_Gamer",
  "/wiki/Star_Wars_Episode_VII:_Rise_of_the_New_Republic",
  "/wiki/InQuest_Gamer_50",
  "/wiki/Wizards.com",
  "/wiki/Making_a_Full_Recovery",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_103",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Han_Solo:_The_Early_Years",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/Databank_(original)",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com",
  "/wiki/Galactic_Architecture_101_and_the_History_of_Centerpoint_Station",
  "/wiki/Showdown_At_Centerpoint",
  "/wiki/Micamberlecto",
  "/wiki/Governor-General/Legends",
  "/wiki/Marcha",
  "/wiki/26_ABY",
  "/wiki/28_ABY/Legends",
  "/wiki/Corellian_governor-general",
  "/wiki/Commander-in-Chief/Legends",
  "/wiki/Rorf_Willems",
  "/wiki/Minister_of_Defense_(Five_Worlds)",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Supreme_Commander_of_the_Corellian_forces",
  "/wiki/39_ABY"
 ]
}