{
 "name": "Three-Five",
 "display_name": "Three-Five",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Three-Five, also known as 35, was a clone trooper who fought in the Grand Army of the Republic during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. In 22 BBY, during the Battle of Geonosis, Three-Five and 17 were defending the rear approach to a barricade that was being defended by other troopers against Separatist B1-Series battle droids. Clone commando RC-1138—also known as \"Boss\"—encountered the two clones shortly before the droids blew through a wall. Boss, Three-Five, and the other surviving clones held off the assaulting droids, pushing them back to a Separatist gun emplacement.\nThree-Five, also known as 35, was a Human clone of the Mandalorian bounty hunter Jango Fett, born on the water world of Kamino. He served as a clone trooper in the Grand Army of the Republic during the Clone Wars between the Republic and a separatist group known as the Confederacy of Independent Systems. When the Republic invaded the Separatist planet Geonosis in 22 BBY, Three-Five was part of the deployed forces.\nWhile on Geonosis, clone troopers Three-Five and 17 were guarding the rear entrance to a barricade that was being defended internally by other troopers against advancing battle droids when the clone commando RC-1138—known as \"Boss\"—approached the group. Trooper 17, noticing the commando, pointed out his presence to Three-Five. Seeing Boss, Three-Five expressed how commandos could win the war if they were as highly skilled as was rumored. As Boss reached the group, Separatist B1-Series battle droids blew through a wall to avoid the barricade, killing one of the clone troopers. Trooper Three-Five and the other surviving clones engaged the attacking droids, pushing them back to a Separatist gun emplacement.\nLike all clones of Jango Fett, Three-Five stood 1.83 meters tall. He held great respect for clone commandos, remarking that they were highly capable in battle upon sighting commando RC-1138 on Geonosis.\nThree-Five wore white Phase I clone trooper armor and was armed with a DC-15S, customary of Republic clone troopers at the beginning of the Clone Wars.\nClone trooper Three-Five appeared in the LucasArts first-person shooter Star Wars: Republic Commando, released for PC and Xbox on February 28, 2005. The character was voiced by Roger Jackson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/35_(Ando_Prime)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/17",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Clone_commando/Legends",
  "/wiki/RC-1138/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Death/Legends",
  "/wiki/Color/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/DC-15S",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Republic_Commando",
  "/wiki/Personal_computer",
  "/wiki/Xbox",
  "/wiki/February_28",
  "/wiki/2005",
  "/wiki/Roger_Jackson",
  "/wiki/Star_Wars:_Republic_Commando:_Prima_Official_Game_Guide",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Databank_(original)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_New_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/Star_Wars:_Revenge_of_the_Sith:_The_Visual_Dictionary"
 ]
}