{
 "name": "Threkin_Horm",
 "display_name": "Threkin Horm",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "8 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish-brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Alderaanian Council"
     ]
    }
   ]
  }
 ],
 "content": "Threkin Horm was a Human male from the planet of Alderaan. Before the planet's destruction, his family controlled a spaceline that serviced Alderaan. Because he was grossly overweight, Horm often traveled in a repulsorlift chair in his later years.\nDuring 8 ABY, Horm served as President of the Alderaanian Council. After the First Battle of New Alderaan, the Council was dealing with the problem of resettling the refugees of New Alderaan, who were previously refugees from Alderaan. When Prince Isolder asked fellow Alderaanian Leia Organa to marry him, Horm believed that her acceptance of the offer could solve the refugee problem. As Queen Mother of the Hapes Consortium, Leia could find a suitable planet for the refugees to settle within the star cluster.\nAs Horm pressured Leia to accept the offer he earned the lasting enmity of Han Solo, who was also courting her. Thus, Horm arranged for Solo to take a Star Destroyer to the Roche system, sending him far away from Coruscant so that Leia would forget about him, but Solo kidnapped the Princess in response. This eventually indirectly resulted in the revelation that Horm's mother was the illegitimate daughter of Dalla Suul, a notorious pirate-which, assuming Han Solo was Suul's grandson, would make them half-cousins.\nHorm later attempted to illegally sell Killik Twilight at an auction on Tatooine . Han and Leia, who had come to the planet to purchase the painting discovered that he was the person who was auctioning it off—with Imperials being among the other prospective buyers. Han and Leia blackmailed Horm into not selling the moss-painting but this decision resulted in a melee. During the fight, Horm was hit by a number of toxic darts, which carried a fast-acting neurotoxin that killed him.\nKevin J. Anderson originally intended to include Threkin Horm in his books Dark Apprentice and Champions of the Force, but a typographical error was committed, resulting in the creation of the character known as Hrekin Thorm. This may serve as a sort of out-of-universe explanation as to why Thorm's character was in favor of the execution of Kyp Durron for the destruction of Carida. The later-released novel Tatooine Ghost depicts the death of Horm, chronologically prior to Thorm's first appearance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Alderaanian_Council",
  "/wiki/Planet/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/Power_chair",
  "/wiki/Standard_year/Legends",
  "/wiki/President/Legends",
  "/wiki/Battle_of_New_Alderaan_(Hunt_for_Zsinj)",
  "/wiki/New_Alderaan/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Isolder",
  "/wiki/Alderaanian/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Queen_Mother",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Roche_system",
  "/wiki/Dalla_Solo",
  "/wiki/Pirate/Legends",
  "/wiki/Killik_Twilight",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/Hrekin_Thorm",
  "/wiki/Kyp_Durron",
  "/wiki/Carida/Legends",
  "/wiki/Tatooine_Ghost",
  "/wiki/The_Courtship_of_Princess_Leia",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Trouble_with_Squibs",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}