{
 "name": "Thurg",
 "display_name": "Thurg",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Thurg was a Gamorrean bodyguard who worked for Sheb Valaad, a Koorivar merchant based on Otor's Hub, during the Clone Wars. Sheb was a black-market dealer who specialized in selling the ill-gotten jewels, arts, paintings, and objects of people who had met \"unpleasant fates.\" When the undercover Jedi Quinlan Vos and Akar-Deshu  invaded Sheb's business, Thurg was knocked unconscious by the diminutive Desh.\nThurg was a Gamorrean bodyguard who worked for the Koorivar black market merchant Sheb Valaad during the Clone Wars. Sheb was an unscrupulous businessman who specialized in trading the artworks and personal effects of people who had met \"unpleasant fates.\" Due to his big build, Sheb used Thurg to guard his shop and to search visitors for weapons. On one occasion, Thurg searched the Kiffar patron Master Tal for weapons. Unknown to Thurg and Sheb, Tal was actually a pseudonym for the undercover Jedi Master Quinlan Vos, who was investigating Sheb's criminal dealings. When Tal protested, Sheb reminded him to follow the rules. After patting Tal down and ascertaining that he was unarmed Thurg allowed the Kiffar to proceed into Sheb's office.\nWhile Sheb was hosting Tal, Thurg had to deal with an interloper: the Mahran Akar-Deshu , a Jedi Knight and friend of Master Vos. Using his big size, Thurg forcibly grabbed Desh's arms and led him into the store. Desh had been sent by the Jedi High Council to bring Tal home for a new assignment. When Tal recognized Desh, the Jedi Master used his Force powers to levitate Sheb in mid-air. Recognizing the signal, Desh then twisted and raised his hands. Despite his diminutive size, the Mahran was able to flip Thurg over, knocking him the ground. During the fight, Thurg assisted his master's bodyguards against the Jedi intruders and was knocked out by Tal, who slammed the butt of his lightsaber into his temple. Thurg remained unconscious for the duration of the fight and was arrested along with his master by Jedi reinforcements.\nThurg was a burly Gamorrean who guarded Sheb Valaad's store which specialized in selling black market goods that had been obtained from deceased individuals. He used his big size to intimidate unruly patrons. Despite his big size and strength, he was no match for the Force powers of the diminutive Mahran Jedi Knight Desh and his companion Quinlan Vos. Thurg had an unpleasant habit of picking his teeth and porcine nose; two things which annoyed Sheb's protocol droid Blue. Thurg spoke in a guttural form of Galactic Basic Standard.\nThurg first appeared as a minor antagonist in Christie Golden's 2015 novel Dark Disciple, which was based on eight unproduced screenplays from the canceled Cartoon Network TV series Star Wars: The Clone Wars. Dark Disciple is part of the Canon The Clone Wars Legacy, an ongoing multimedia project using material from the canceled TV series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Gamorrean",
  "/wiki/Gender",
  "/wiki/Quinlan_Vos",
  "/wiki/Sheb_Valaad",
  "/wiki/Koorivar",
  "/wiki/Otor%27s_Hub",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Akar-Deshu",
  "/wiki/Black_market",
  "/wiki/Kiffar",
  "/wiki/Jedi_Master",
  "/wiki/Mahran",
  "/wiki/Jedi_Knight",
  "/wiki/Limb",
  "/wiki/Jedi_High_Council",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/The_Force",
  "/wiki/Force_power",
  "/wiki/Telekinesis",
  "/wiki/Lightsaber",
  "/wiki/Death",
  "/wiki/Protocol_droid",
  "/wiki/Blue_(protocol_droid)",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Christie_Golden",
  "/wiki/2015",
  "/wiki/Dark_Disciple",
  "/wiki/Cartoon_Network",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars_Legacy",
  "/wiki/Dark_Disciple_(audiobook)"
 ]
}