{
 "name": "Thweek",
 "display_name": "Thweek",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kubaz"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Thweek was a male Kubaz spy and henchman employed by Teemo the Hutt to oversee the shadier aspects of his business enterprises.\nThweek had a deep hatred of insectoid species and once killed a Geonosian named Sivor after he had been forced to fight in a gladiatorial match for Teemo the Hutt's amusement. Thweek owned a customized G1-M4-C Dunelizard fighter which he piloted when Teemo sent him to intercept the Krayt Fang on its way to Ryloth. He also owned a StarViper Mk. II. He wore laminate armor and carried a heavy blaster pistol.\nBelonging to an insectivorous species, Thweek had an ingrained disdain for any insect species, and held particular hatred for Geonosians. He was known to be greedy, devious and brutal in his dealings. Thweek was a competent pilot, able to use his piloting skill to adapt to a wide array of situations.\nThweek was designed by Dave Allen and Daniel Lovat Clark for The Long Arm of the Hutt, a supplement to Star Wars: Edge of the Empire that was published by Fantasy Flight Games in 2012. In it, his name was spelled Thwheek. His name was changed to Thweek on his card for the Guns for Hire Expansion Pack, part of the X-Wing Miniatures Game. The retconned spelling was confirmed to be the same character in the preview for the expansion pack on the FFG website.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kubaz/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Anatta",
  "/wiki/The_Long_Arm_of_the_Hutt",
  "/wiki/Spy/Legends",
  "/wiki/Teemo",
  "/wiki/Hutt/Legends",
  "/wiki/Insectoid/Legends",
  "/wiki/Geonosian/Legends",
  "/wiki/Sivor",
  "/wiki/G1-M4-C_Dunelizard_fighter",
  "/wiki/Pilot/Legends",
  "/wiki/Krayt_Fang",
  "/wiki/Ryloth/Legends",
  "/wiki/StarViper_Mk._II",
  "/wiki/Armor/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Dave_Allen",
  "/wiki/Daniel_Lovat_Clark",
  "/wiki/Star_Wars:_Edge_of_the_Empire",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/2012",
  "/wiki/Guns_for_Hire_Expansion_Pack",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game"
 ]
}