{
 "name": "Tia_(pilot)",
 "display_name": "Tia  (pilot)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bestine IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rebel Alliance",
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "The Humans Tia and her twin sister Ghia were born on Bestine IV and joined the Rebellion to fight the Galactic Empire.\nThey were both extremely skilled pilots, and they were a great acquisition to the Rebellion. Around 2 ABY, she and Ghia met the newly joined smuggler Han Solo and they both fell in love with the charming ace. Therefore, they were devastated when they heard that Solo was captured by the Empire and delivered to Jabba the Hutt by Boba Fett. Determined to rescue Solo, they stole a snowspeeder and abandoned the Rebellion to rescue him from Jabba, but were instead captured almost as soon as they arrived and enslaved. During their enslavement they were forced to wear dancing-girl costumes and were also forced to feed and massage him. When Jabba found out that she and her sister were Rebel pilots, he let them fight in his \"Demolition\" games. Now that they were fighting for the Hutt, Jabba appointed Oola as his personal masseuse.\nAlthough records are scarce on their performance due to the collapse of Jabba Desilijic Tiure's criminal empire, the twins managed to survive the tournament but were soon forced back into Jabba's service. To their surprise however, they encountered their commanding officer, Princess Leia Organa, disguised as the bounty hunter Boushh. The Princess freed them from Jabba and took them to the Palace entrance, where the Rebellion had a GR-75 medium transport waiting to extract the twins. The twins then returned to the Rebellion, where they continued their fight against the Empire.\nTia was a young, tan-skinned human woman nearly identical to her twin sister Ghia in appearance, with the exception of more prominent cheekbones and dark blue hair as opposed to her sister's dark green hair. She also had bright green eyes and had distinct markings on her face, which also seperated her from her sister in appearance.\nTia appeared to be extremely close with her sister Ghia, to the point were they would even speak in unison at times. They were also similar in personality as well. She was brash and confident in their piloting skills, and would even mock their opponents after a victory, a trait also shared by her sister. Tia and her sister held no love for the Empire, and often used the mantra \"Remember Alderaan\" before battle to remind themselves why they were fighting. They were also both prone to flights of fancy, having fallen in love with Han Solo over his looks and charming personality, even though he was attracted to Princess Leia. Also, both she and her sister were extremely reckless and impulsive: when they heard Solo had been captured and delivered to Jabba the Hutt, they immediately stole a Snowspeeder and abandoned the Rebellion to rescue him, showing that they valued Captain Solo over the Rebellion, and gave no thought to the consequences of desertion. This would ultimately prove disadvantageous, as their impulsivity lead to them attempting a direct rescue from Jabba's Palace with no plan beforehand, resulting in their capture by Jabba's forces. Despite this impulsivity, they were capable of following orders, as shown by their willingness to follow Princess Leia during their rescue from Jabba's Palace.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tia",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Tia_(pilot)",
  "/wiki/Bestine_IV/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tan",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire/Legends",
  "/wiki/Ghia",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Jabba%27s_demolition_games",
  "/wiki/Hutt/Legends",
  "/wiki/Oola/Legends",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boushh/Legends",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Star_Wars:_Demolition",
  "/wiki/Demolition:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}