{
 "name": "Tiaan_Jerjerrod",
 "display_name": "Tiaan Jerjerrod",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tinnel IV"
     ]
    },
    {
     "name": "Born",
     "values": [
      "35 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "DS-2 Death Star II Mobile Battle Station",
      "Endor system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.73 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "75 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Taung \u0026 Zhell Society",
      "Corellian Engineering Corporation",
      "Emperor's Boosters",
      "Keep the Core Secure",
      "Galactic Empire",
      "Imperial Navy",
      "Joint Chiefs",
      "Commission for the Preservation of the New Order",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Joint Chiefs",
      "Commission for the Preservation of the New Order",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Tiaan Jerjerrod was a human male who served as an Imperial Moff the Galactic Empire during the Galactic Civil War. Initially an architect and a starship designer, Jerjerrod was eventually granted the rank of Moff. Prior to and during the Battle of Endor, he was made commander of the DS-2 Death Star II Mobile Battle Station, partly owing to his previous work on the original Death Star.\nTasked with overseeing the space station's difficult final stages of construction, Jerjerrod faced the wrath of both the Sith Lord Darth Vader and Emperor Sheev Palpatine when the massive construction effort fell behind schedule. Despite warnings from Vader that the Emperor would not tolerate any further setbacks, the Emperor paid little attention to Jerjerrod when he visited the Death Star, though he did authorize the commander to operate the station's superlaser against the starships of the Rebel fleet when the Alliance to Restore the Republic launched its attack on the Death Star—a battle that culminated in the station's destruction and the death of all its occupants, including Jerjerrod.\nA human male from the Core World of Tinnel IV, Tiaan Jerjerrod was born in 35 BBY. He hailed from a wealthy family. In his youth, he was a diligent student at an engineering academy until his high grades earned him a job drafting plans for warehouses. Later, his plans for a freight depot on Ord Mantell drew the attention of the Corellian Engineering Corporation, and he was hired as a starship designer. Eventually, his designs for an interstellar trash hauler saw him recruited by the Galactic Empire.\nJerjerrod thrived in the ordered world of the Imperial Navy, and by 14 BBY, he held the rank of Rear Admiral, and was a member of the Joint Chiefs. He helped build the first Death Star, a moon-sized battle station that used kyber crystals to generate a planet-destroying superlaser. Jerjerrod told himself that such a weapon would provide a defense for the Empire simply by existing, deterring attacks without ever being used. However, the Empire did use the megaweapon, blowing up the planet of Alderaan. Although extremely powerful, the station was finally destroyed when Luke Skywalker of the Alliance to Restore the Republic, fired two proton torpedoes into an unprotected thermal exhaust port. The torpedoes sparked a chain reaction within the reactor core that lead to its explosive demise.\nShortly after the battle of Hoth, and following Darth Vader's failed attempt to turn his son, Luke Skywalker, to the dark side of the Forceduring their duel on Cloud City, Vader returned to the Executor, his personal flagship, where Jerjerrod was one of several officers present at the hangar bay to greet the Sith Lord.\nEventually, Jerjerrod became one of the twenty Imperial Moffs. Despite the fiasco of the original superweapon, the Emperor ordered the construction of a second Death Star above the Forest Moon of Endor. Jerjerrod was assigned to supervise the difficult endeavor of completing that superweapon, and was given the cover title of Director of Imperial Energy Systems due to the project's secrecy. In order to fulfill his difficult mandate, Jerjerrod exhausted himself day after day, slaving over the plans and filing endless paperwork. The Moff notably made sure that all the exhaust ports of the new station were heavily armored, thus fixing the fatal flaw of the original Death Star. However, the architect faced a number of problems, ranging from budget cuts and supply chain breakdowns to the shortage of construction workers.\nEventually, the glaring lack of progress on the Death Star prompted Lord Vader, the personal enforcer of Emperor Palpatine, to travel to the station to rectify the situation. Upon learning that Vader's transport had touched down inside one of the Death Star's hangar bays, Jerjerrod ventured to the hangar to greet the Emperor's emissary as he disembarked from his shuttle. Feeling secure enough in his position, Jerjerrod planned to show Vader his detailed daily reports, hoping that the emissary might take his side and realize the Emperor was asking for the impossible. However, after brushing aside Jerjerrod's formal greeting, Vader bluntly informed the commander of the purpose behind his impromptu visit—the Emperor had become displeased with the Death Star's slowing construction, and Vader would see to it that the station was completed on schedule. At first, Jerjerrod protested that the task was understaffed and nearly impossible given the circumstances, but when the Sith Lord announced that the Emperor was to personally oversee the station's final stage of completion, the Moff pledged himself and his crew to a renewed doubled effort, heeding Vader's mocking warning that the Emperor would not tolerate failure and how the Dark Lord of the Sith was not as forgiving as his apprentice was.\nDriven by the fear of the Emperor's arrival, the Moff exhausted himself and his workers for several weeks. In spite of his best effort, the Moff was unable to finish the station before Palpatine's arrival, and one whole hemisphere was still covered in scaffolding and girders. When Palpatine finally arrived aboard the Death Star with great fanfare, Jerjerrod joined Vader and a group of Imperial officers to welcome their ruler and his retinue. The Moff had hoped that he would be rewarded for his hard work. but, despite Vader's earlier warnings, the Emperor ignored Jerjerrod and the other officers as he conversed with Vader about their grand plan to destroy the Rebel Alliance, with which the Empire had been at war for four years Jerjerrod soon realized that not having displeased his master was enough of a reward.\nInside of the Emperor's throne room, located on a spire high above the surface of the Death Star, Jerjerrod, Sim Aloo, and Janus Greejatus looked on as the Emperor tasked Vader with setting the trap for the rebel fleet at Endor. After ordering his apprentice to return to his command ship, Vader and Jejerrod exited the throne room.\nThe Rebel Alliance unknowingly took the Emperor's bait, launching a two-pronged, all-out assault on the Death Star's construction site at Endor, in which a strike team infiltrated onto the forest moon's surface would disable the deflector shield protecting the space station while Rebel starfighters, supported by the capital ships of the Alliance fleet, would fly into the Death Star's superstructure and take out its reactor, thereby destroying the weapon before it could be completed. Palpatine had prepared for this, however, and once the Rebel fleet arrived and found itself trapped between the Imperial Navy and a shielded Death Star, he contacted Jerjerrod in the station's command center and authorized him to target and destroy the Rebel starships with the Death Star's superlaser. Under his command, the Death Star atomized a number of Rebel cruisers as the battle progressed.\nNevertheless, despite the odds, the Alliance soon gained the upper hand, and the battle concluded with the Emperor's death and the destruction of the Death Star with all hands lost, Jerjerrod included.\nWhile Tiaan perished over Endor, his descendants joined the First Order, the Imperial successor regime to the fallen Galactic Empire. His grandson, Jothan Tiaan Jerjerrod, the son of First Order officers Jax Jerjerrod and Jul Jerjerrod, defected from the First Order and joined the Resistance.\nUnlike most officers, Jerjerrod showed petty spitefulness and a lack of ambition as he rose through the Imperial ranks—qualities which were considered admirable for a Moff. A technocrat with a chilly personality, Jerjerrod served as the commander of the second Death Star as it neared completion, a position of which he was proud, yet one he found concerning given the complicated nature of the station's construction. Though he claimed the men under his supervision were working as fast as possible to complete the station, the threat of personally facing the Emperor's displeasure at the lagging construction effort—a threat which made him visibly nervous—compelled him to reevaluate the speed with which the work was proceeding. When in the Emperor's presence, Jerjerrod was respectful, kneeling upon greeting him and bowing before departing. Aside from the Emperor, Jerjerrod was afraid of Vader, not wanting to have his name added to Vader's list of kills as there wasn't a single Imperial soldier who hadn't heard about the Sith Lord's predilection for strangling those who'd failed to carry out his orders.\nTiaan Jerjerrod was portrayed by Michael Pennington in Star Wars: Episode VI Return of the Jedi. English actor Alan Rickman originally auditioned for Jerjerrod's role, whom he wanted to play with a \"Big, slow, low voice,\" but lost out to Pennington. He is never identified by name in the movie and only addressed as \"Commander,\" though both his name and proper rank are provided in the film's closing credits. Jerjerrod serves as a minor antagonist with relatively little screen time or dialogue in the finished film, though in earlier drafts his role was substantially larger. The Moff is also featured in a number of scenes filmed for Return of the Jedi that were ultimately cut from the finished product; some of these, comprising a subplot in which Jerjerrod is ordered by the Emperor to destroy Endor once the battle turns against the Empire's favor , were included in the Star Wars: The Complete Saga Blu-ray set. As a result of a props \"blooper\" during production, Jerjerrod and all other Imperial officers wear the wrong rank badge in the film.\nJerjerrod's role was expanded and contracted greatly during the script development of Return of the Jedi, with the distinction of been a tall Grand Moff and confident technocrat rather than a simply Moff in earlier drafts. In these drafts, Jerjerrod served as Emperor Palpatine's \"secret agent,\" overseeing the transformation of the Green Moon of Had Abbadon into a paradise for its citizens while operating behind Darth Vader's back. While aboard Jerjerrod's shuttle, upon being informed, Jerjerrod denies the Rebel presence on the moon that Vader had sensed seeing it as an insult to his work, even as a stolen Imperial transport piloted by Leia Organa and two other Rebels nearly collides with the shuttle. Upon arriving on Had Abbadon, Vader and Jerjerrod descend to the Emperor's Throne Room. Once Vader departs, reprimanded for not capturing Luke Skywalker, the Emperor tasks Jerjerrod with keeping an eye on Vader as he planned to replace him with Skywalker, also revealing that the Rebels were launching an attack on the Death Star. Jerjerrod later butts heads with General Veers, who took Skywalker prisoner to the Executor instead. Furious, Jerjerrod stormed out to meet with the Sith Lord and demanded to know why Skywalker was not delivered to the Emperor, leading Vader to snap Jerjerrod's neck and kill him.\nIn Lawrence Kasdan's revised rough draft, Jerjerrod's shuttle nearly intercepts Leia's captured transport when it was moving to help a panicked Wedge Antilles flying a captured TIE Fighter during the strike team's infiltration without a clearance code. However, after Leia's craft was given clearance, Vader complains to Jerjerrod that the Emperor had not been in contact with him. Though Jerjerrod attempts to avoid an argument, he is forced to reveal that the Emperor, has reassigned Vader to oversee the construction of the two new Death Stars for not capturing Skywalker. Jerjerrod also doubted that Vader would be able to seduce Skywalker to the dark side of the Force unlike the Emperor. Jerjerrod too reveals that the Emperor knows of the impending Rebel attack, and that Skywalker would be soon captured at Tatooine. After conversing with the Emperor via hologram at the private communications chamber of the Executor, Jerjerrod takes the responsability to deliver Luke without Vader's knowledge by using coded transmission and siable all surveillance equipment, concluding that the Rebel attack was a distraction for Vader. Upon learning of this, Jerjerrod was killed by Vader.\nFor the Special Edition of Star Wars: Episode V The Empire Strikes Back, archival footage of Darth Vader's arrival aboard the Death Star at the beginning of Return of the Jedi was recycled to depict Vader returning to the Executor following his duel with Luke Skywalker on Cloud City. While the scene itself is presented from a different angle than the source scene in Return of the Jedi, Michael Pennington is still visible in the shot.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tiaan_Jerjerrod",
  "/wiki/Tiaan_Jerjerrod/Legends",
  "/wiki/Galactic_Empire",
  "/wiki/Moff",
  "/wiki/Jothan_Tiaan_Jerjerrod",
  "/wiki/Resistance",
  "/wiki/Tarkin_(novel)",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Star_Wars_(2020)_27",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Imperial_Officers_and_Agents",
  "/wiki/Tinnel_IV",
  "/wiki/35_BBY",
  "/wiki/4_ABY",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Endor_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Taung_%26_Zhell_Society",
  "/wiki/Corellian_Engineering_Corporation",
  "/wiki/Emperor%27s_Boosters",
  "/wiki/Keep_the_Core_Secure",
  "/wiki/Imperial_Navy",
  "/wiki/Joint_Chiefs",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/File:WeShallDoubleOurEfforts.ogg",
  "/wiki/Galactic_Civil_War",
  "/wiki/Architect",
  "/wiki/Starship",
  "/wiki/Battle_of_Endor",
  "/wiki/Commander",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Space_station",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Superlaser",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Death",
  "/wiki/Core_Worlds",
  "/wiki/Jerjerrod_family",
  "/wiki/Ord_Mantell",
  "/wiki/Interstellar_trash_hauler",
  "/wiki/14_BBY",
  "/wiki/Rear_Admiral",
  "/wiki/Moon",
  "/wiki/Battle_station",
  "/wiki/Kyber_crystal",
  "/wiki/Planet",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Battle_of_Yavin",
  "/wiki/Luke_Skywalker",
  "/wiki/Proton_torpedo",
  "/wiki/Thermal_exhaust_port",
  "/wiki/Battle_of_Hoth",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Cloud_City",
  "/wiki/Executor",
  "/wiki/File:ImHereToPutYouBackOnSchedule.ogg",
  "/wiki/Forest",
  "/wiki/Endor",
  "/wiki/Director_of_Imperial_Energy_Systems",
  "/wiki/ST_321",
  "/wiki/Hangar",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Imperial_officer",
  "/wiki/Emperor%27s_Throne_Room",
  "/wiki/Sim_Aloo",
  "/wiki/Janus_Greejatus",
  "/wiki/Deflector_shield",
  "/wiki/Starfighter",
  "/wiki/Capital_ship",
  "/wiki/Reactor",
  "/wiki/Cruiser",
  "/wiki/First_Order",
  "/wiki/First_Order_officer",
  "/wiki/Jax_Jerjerrod",
  "/wiki/Jul_Jerjerrod",
  "/wiki/Michael_Pennington",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(novel)",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Grand_Moff",
  "/wiki/Had_Abbadon/Legends",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Lawrence_Kasdan",
  "/wiki/Wedge_Antilles",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Habitation_sphere",
  "/wiki/Tatooine",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Lost_Stars",
  "/wiki/Lost_Stars_(audiobook)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/An_Incident_Report",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Star_Wars_(2020)_28",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Join_the_Resistance:_Attack_on_Starkiller_Base",
  "/wiki/Category:Audio_files_of_Tiaan_Jerjerrod",
  "/wiki/Category:Images_of_Tiaan_Jerjerrod",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_29",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Galactic_Empire_Conversion_Kit",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Imperial_Troops",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_2",
  "/wiki/Star_Wars_Universe",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Inside_Intel:_Darth_Vader%27s_Suit",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Star_Wars_Inside_Intel:_The_Death_Star",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Time",
  "/wiki/Reproduction",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Join_the_Resistance",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Ultimate_Return_of_the_Jedi_Insider%27s_Guide",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/25_Years_of_Return_of_the_Jedi!",
  "/wiki/Star_Wars_Insider_105"
 ]
}