{
 "name": "Tiber_Saxon",
 "display_name": "Tiber Saxon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 1 BBY",
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "House Vizsla",
      "Clan Saxon",
      "Clan Saxon"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Super Commando",
      "Imperial Super Commando"
     ]
    }
   ]
  }
 ],
 "content": "Tiber Saxon was a Mandalorian male who served as the governor of Mandalore following the death of his brother, Viceroy Gar Saxon. During the Mandalorian Civil War against Clan Wren and House Kryze, Saxon deployed \"the Duchess,\" mounted on a modified AT-DP. The weapon, originally designed by the Mandalorian Sabine Wren, was designed to lock on to Mandalorian armor and vaporize the wearer. Saxon perished when Wren and her comrades infiltrated Saxon's Star Destroyer, based in Sundari, to destroy the weapon, eventually succeeding and destroying Saxon's vessel in the process, with Saxon still aboard.\nUpon Gar Saxon's death at the hands of Clan Wren, Tiber succeeded his late brother as the governor of Mandalore, in service to the Galactic Empire. Desiring a way to gain power over the rebellious clan, and those who had sided with them in the civil war, Tiber had the Arc Pulse Generator, a superweapon that Sabine Wren had built during her days as a cadet at the Imperial Academy of Mandalore that was also known as the Duchess, rebuilt. The weapon was designed to kill Mandalorian warriors by targeting the beskar alloy in their armor and superheating it, disintegrating the wearer. Sabine had erased the plans and sabotaged the prototype before defecting, out of horror that the Empire had turned her creation on her own people. Tiber himself, due to eschewing Mandalorian armor in favor of Imperial Jumptrooper armor, made of plastoid, wasn't bothered by the ramifications.\nLater, Tiber learned that Sabine had returned to Mandalore to gain support for the growing rebellion and to search for her father, Alrich Wren, who had been taken hostage by the Empire to ensure his family's compliance. Tiber had Alrich moved from the capital of Sundari to a remote prison to isolate him from his contacts in the capital. When he found out that Sabine and her forces were planning to attack the prison, Tiber secretly had Alrich placed on a convoy back to Sundari, intending to lay a trap for the rebels at the prison.\nHowever, Sabine's attack succeeded, with the assistance of reinforcements from Bo-Katan Kryze. Sabine's mother, Countess Ursa Wren, had discovered Alrich's true whereabouts, but was unable to warn her daughter earlier due to Imperial jamming. The Imperial convoy transporting Alrich was ambushed by the rebels, and Tiber told his men to stay put, as reinforcements would be arriving. The Imperial Troop Transport carrying Alrich and its two escorts diverted off into a canyon, where they were attacked by Sabine, Kryze, Fenn Rau, Ezra Bridger, Kanan Jarrus, and Chopper, who successfully freed Alrich. Tiber unleashed \"the Duchess\" against the Clan Wren warriors at the original battle site, killing many of them. The attack failed to kill Ursa and Tristan Wren, who had narrowly avoided the weapon's area of effect thanks to a warning from Sabine, who had recognized the weapon's sound over the comms.\nOn his own Star Destroyer, Tiber showed the results of the test of the Duchess to Grand Admiral Thrawn. The Grand Admiral was impressed with its power, but knew that Tiber had been trying to hide its flaws, namely that the weapon only had a very short range. Thrawn suggested that Tiber capture Sabine so she could improve it, which he agreed to. Captain Hark continued to protest the use of the Duchess, concerned that it was only a matter of time before the Empire turned it against all Mandalorians, both those loyal to the Empire and those who were not. Tiber set a trap, knowing that the rebels could not ignore such a dangerous weapon.\nHis trap worked, as a rebel strike team led by Sabine arrived in the hopes of destroying the Duchess. Tiber confronted Sabine and Kryze, demanding Sabine re-calibrate the weapon so that he could bring Mandalore under his rule. Hark continued to protest, suspecting that the Empire would use it on them when they had no need of them, so Tiber had the machine zap him in response. After Tiber threatened to kill Kryze, Sabine eventually agreed to re-calibrate the Duchess, so he temporarily shut the weapon down. Knowing that Tiber would not hold his word, Sabine secretly reset the Duchess to target Imperial armor instead. When Sabine was finished, Tiber attempted to electrocute the three Mandalorians, but when he turned the weapon on again he was shocked to find himself being zapped by the Duchess. The weapon was reactivated at a high enough strength to incapacitate all of the Imperial soldiers on the Star Destroyer. Sabine considered killing Saxon with the weapon, but Kryze talked her down, reminding her that doing so was fighting like the Empire, in a cowardly fashion. Hark used the opportunity to flee. Sabine instead used the Darksaber to breach the weapon's core, and the strike team fled before the Star Destroyer blew up, killing Tiber.\nTiber Saxon, like his late brother Gar, had sworn loyalty to the Empire in exchange for power. Tibor Saxon was very ruthless, and wanting to earn the respect of the Emperor. Unlike Gar, however, Tiber was willing to throw away all vestiges of his Mandalorian heritage, stating that the culture had to \"evolve\" to fit in with the times. As a sign of this, he wore Jumptrooper armor, made of plastoid, instead of the Imperial Super Commando armor his brother wore, made of the traditional beskar alloy. He wanted all of his people to kneel before him, and was willing to use the Duchess to kill untold numbers to do it. Tiber's adherence to Imperial ways came about, in part, because, according to him, Emperor Palpatine had shown him the path to true power. He was overall ruthless and would attempt to defeat anyone in his way, including Captain Hark, one of his own men.\nTiber Saxon was voiced by Tobias Menzies in Star Wars Rebels: Heroes of Mandalore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Tiber_Saxon",
  "/wiki/Mandalore",
  "/wiki/1_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_Vizsla",
  "/wiki/Clan_Saxon",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Super_Commando",
  "/wiki/Mandalorian",
  "/wiki/Governor",
  "/wiki/Death",
  "/wiki/Viceroy",
  "/wiki/Gar_Saxon",
  "/wiki/Mandalorian_Civil_War_(Imperial_Era)",
  "/wiki/Clan_Wren",
  "/wiki/House_Kryze",
  "/wiki/Arc_Pulse_Generator",
  "/wiki/AT-DP_Arc_Cannon_Prototype",
  "/wiki/Sabine_Wren",
  "/wiki/Mandalorian_armor",
  "/wiki/Mission_to_Mandalore",
  "/wiki/Tiber_Saxon%27s_Star_Destroyer",
  "/wiki/Star_Destroyer",
  "/wiki/Sundari",
  "/wiki/Starship",
  "/wiki/Skirmish_on_Krownest",
  "/wiki/Mandalorian_clan",
  "/wiki/Superweapon",
  "/wiki/Standard_day",
  "/wiki/Imperial_cadet",
  "/wiki/Imperial_Academy_of_Mandalore",
  "/wiki/Beskar",
  "/wiki/Armor",
  "/wiki/Jumptrooper",
  "/wiki/Plastoid",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Parent",
  "/wiki/Alrich_Wren",
  "/wiki/Capital",
  "/wiki/Mandalore_prison_outpost",
  "/wiki/Prison",
  "/wiki/Convoy",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Count",
  "/wiki/Ursa_Wren",
  "/wiki/Transport",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Fenn_Rau",
  "/wiki/Ezra_Bridger",
  "/wiki/Kanan_Jarrus",
  "/wiki/C1-10P",
  "/wiki/Tristan_Wren",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Admiral",
  "/wiki/Captain",
  "/wiki/Hark",
  "/wiki/Time",
  "/wiki/Stormtrooper",
  "/wiki/Darksaber",
  "/wiki/Star",
  "/wiki/Imperial_Super_Commando_armor",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Tobias_Menzies",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Databank_A-Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/The_Lawless",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Legacy_of_Mandalore"
 ]
}