{
 "name": "Tierce_Martano",
 "display_name": "Tierce Martano",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Tierce Martano was a Human male gambler who lived during the time of the Galactic Civil War.\nTierce Martano was a wealthy and influential man. During the Galactic Civil War, he was well respected by both the Galactic Empire and the Rebel Alliance. He owned a luxurious vacation estate on Naboo's moon of Rori.\nIn 1 ABY, a smuggler by the name Cal Handro, an old sabacc friend of Tierce Martano, was attacked in the Naboo system and crash-landed on Rori. The man was shipping a new kind of spice for the Rebels when his transport was shot down. Handro survived to the crash but was attacked by Black Sun henchmen who wanted to steal the spice. The smuggler successfully escaped the Black Sun and, after a long walk in the wilderness, eventually arrived at Martano's vacation estate. Tierce Martano accepted to hide the pilot in a safe house nearby.\nThe Black Sun later discovered that Cal Handro took shelter at the Martano estate. The criminals did not attack directly Martano but besieged the building. In order to get rid of the Black Sun, Martano contacted both the Empire and the Rebel Alliance, namely Officers M'Kae and Wolff Kalos, to negotiate information about the pilot's location. However, before he could get an answer, a fight erupted between the Black Sun henchmen and a group of spacer who were also searching for the missing pilot. Martano was rescued by the spacers who eliminated all Black Sun forces. As the gambler wished to get rid of Handro as soon as possible, he eagerly accepted to give the location of Handro to the spacers. Tierce Martano also gave to the spacers the names and locations of Officers M'Kae and Kalos so the spacers could choose to hand over the smuggler to either the Empire or the Rebellion.\nTierce Martano was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. Tierce Martano was added to the game with the fourth chapter of the \"Secrets of the Syren\" quest line, released with the \"Publish 21\", on August 4, 2005. The \"Secrets of the Syren\" story arc was removed from the game with the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Officer/Legends",
  "/wiki/M%27Kae/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Gambling/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Jevan_Monsul",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Martano_estate",
  "/wiki/Naboo/Legends",
  "/wiki/Rori/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Cal_Handro",
  "/wiki/Sabacc/Legends",
  "/wiki/Naboo_system/Legends",
  "/wiki/Syren_spice",
  "/wiki/Transport/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Wolff_Kalos",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/August_4",
  "/wiki/2005",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Battle_of_Restuss",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/Template:SWGTCG",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed"
 ]
}