{
 "name": "Tigris",
 "display_name": "Tigris",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Firrerre"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 1 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Firrerreo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black and silver striped"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire Reborn"
     ]
    }
   ]
  }
 ],
 "content": "Tigris was a male Firrerreo who is the son of Hethrir and Rillao.\nWhen Tigris was conceived, the Sith Lord Darth Vader had high hopes for turning him to the dark side. Rillao, however, had other ideas, and spirited herself and Tigris  away. Hethrir eventually caught up with them and tortured Rillao, keeping Tigris as his servant.\nHethrir — whom had become the Procurator of Justice — fled to his own homemade planet, a Worldcraft, with his followers including Tigris. Hethrir sought to become the new Emperor in his Empire Reborn movement; to do this, he had to consult Waru, a hideous, extradimentional, Force-sensitive mass of flesh that claimed to be a healer  and resided on Crseih Station.\nThough relegated to the lowly position of a nursemaid, he still remained loyal to Hethrir serving him as well as he could. He was also taught by Hethrir that his mother Rillao was a traitor who stole any Force potential Tigris may have had. Unlike Hethrir's other followers, including the Helpers and Proctors, he was kinder in the treatment of the children held captive on the Worldcraft. Tigris was also small for his age due to malnutrition.\nIn 14 ABY, at about the age of twelve or thirteen, Hethrir kidnapped the children of the New Republic Chief of State Leia Organa Solo and Han Solo. While, the Solo twins Jacen and Jaina were placed into groups with other kids and put under the control of older children known as Proctors, their younger sibling Anakin was to be sacrificed to Waru in exchange for helping Hethrir.\nDuring this time, Tigris was placed in charge of Anakin. Empathizing with the then-three year old boy who had been torn from his family, Tigris grew quite fond of Anakin and went out of his way to feed and care for him. When Hethrir left for Crseih Station to sacrifice Anakin to Waru, Tigris accompanied his master. Later, at a park on Crseih Station, he and Hethrir encountered C-3PO, who attempted to retrieve Anakin. However, the droid was stopped by Hethrir who disabled the droid.\nLater, Hethrir was about to sacrifice Anakin to Waru. With a change of heart, Tigris betrayed his master and rescued Anakin from Waru moments before the sacrifice could be completed. In anger Hethrir sought to punish Tigris, but he was stopped by the arrival of Leia, Han, Jedi Master Luke Skywalker and Rillao, who had befriended Leia. In the end, Waru pulled Hethrir back into his energy field, having given up all hope of ever creating the portal to return to his galaxy, thus destroying them both. Mother and son were soon reunited and, Tigris accepting the truth that he never had any Force potential, they decided to reacquaint themselves with each other.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Tigris",
  "/wiki/Firrerre/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Firrerreo/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Empire_Reborn",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Darth_Caedus",
  "/wiki/Rillao",
  "/wiki/Worldcraft",
  "/wiki/The_Crystal_Star",
  "/wiki/Hethrir",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Procurator_of_Justice",
  "/wiki/Waru",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Crseih_Station",
  "/wiki/Helpers",
  "/wiki/Proctor_(Empire_Reborn)",
  "/wiki/14_ABY/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Han_Solo/Legends",
  "/wiki/Solo_twins",
  "/wiki/Anakin_Solo",
  "/wiki/C-3PO/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}