{
 "name": "Tigran_Jamiro",
 "display_name": "Tigran Jamiro",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Military",
      "Alliance Military"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Tigran Jamiro was a human male who served as a senior logistics officer and deck officer in the Alliance to Restore the Republic during the Galactic Civil War. In 3 ABY, he was stationed in Echo Base on the planet Hoth when the Jedi Luke Skywalker failed to return to the base after going to investigate what the latter believed to be a meteor.\nHe informed Skywalker's companion, Han Solo, that the Jedi had not returned, then unsuccessfully attempted to dissuade Solo from leaving the base on a tauntaun to search for his missing friend. After the Galactic Empire arrived in the Hoth system, Jamiro informed a group of scientists and mechanics about their arrival and gave a tearful farewell to the group. He then participated in the Battle of Hoth, in which the Imperials attacked Echo Base and forced the Alliance to evacuate.\nTigran Jamiro was a human male who served as a senior logistics officer with the rank of lieutenant in the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. In 3 ABY, he was among the Alliance Military forces stationed in Echo Base, the Alliance's secret headquarters on the planet Hoth. The naturalist Kell Tolkani was amongst the base staff that served under Tigran's command. At one point, Jamiro spoke with Princess Leia Organa in one of the hangars of the base concerning the fact that the planet's dropping temperatures had caused the engines of all the Alliance's speeders to ice over. She gave the order to Jamiro that all snowspeeders would remain grounded until the issue was fixed.\nWhen the Jedi Luke Skywalker failed to return to the base after going to investigate what he believed to be a meteor, Jamiro was working as deck officer. The officer and his assistant then rushed into the tauntaun chamber near the base's north entrance, where Jamiro approached Skywalker's companion, Han Solo. The officer reported that Skywalker had not returned through the base's south entrance, but speculated that he may simply have forgotten to check in. Solo dismissed this idea and asked Jamiro about the readiness of the base's speeders, but when the officer reported that the vehicles had not yet been adapted to the cold, Solo prepared to ride out on a tauntaun before anyone could protest. An assistant officer then stated he would cover sector twelve and set communication control to screen alpha.\nUpon seeing Solo prepare to ride out, Tolkani warned Tigran that Solo would need to monitor his tauntaun's vitals carefully if the pair were to survive, as temperatures were rapidly dropping while night fell, meaning the creature would freeze. Hoping to maintain some control of the situation, Jamiro called after Solo and loudly repeated an abbreviated version of Tolkani's warning, stating that his tauntaun would never survive outside the base. Solo disregarded the warning and rode out alone. Neither Solo or Skywalker returned to the base that night, but both were discovered alive and rescued the following morning.\nShortly after their return, the Empire arrived in the Hoth system and began attacking Echo Base. Jamiro informed a group of the base's scientists and mechanics, including Tolkani, of the Empire's arrival, letting them know that their evacuation slots had been assigned. He reassured them that they would likely survive the evacuation, but advised them to write any final messages they wanted to send before leaving, which would then be encrypted and sent throughout the entire fleet to ensure their delivery if anyone managed to escape Hoth. Before finishing, he informed the group that it had been a pleasure to serve with them and hoped that the Force was with each of them no matter where they ended up. Tolkani chose to remain on Hoth to continue studying the native wildlife and mentioned Jamiro in a message that was intended to be sent to the naturalist's parents, explaining the decision. Jamiro was then among the personnel that took part in the battle, and although the Alliance was defeated by Imperial forces, the rebels managed to successfully evacuate much of the base.\nJamiro was aghast at Solo's plan to ride out on a tauntaun and considered it pure madness. When informing the scientists and mechanics that the Empire had arrived, Jamiro's voice was resigned and not as strong as Kolkani believed he probably would have liked. When saying farewell to the group, Jamiro's eyes filmed with tears, but his voice showed no sign of them. He had fair skin, brown hair, and blue eyes.\nJamiro wore a set of rebel snow gear that included a brown sleeveless jacket over a white uniform, as well as white command gauntlets and a white insulated watch cap with a com set, a brown face wrap, and white cap warmers.\nTigran Jamiro was portrayed by Ray Hassett in the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back. His scene was filmed between March 29 and April 4, 1979. Hassett was only credited as one of several \"Other officers\" in the film.\nThe character's name was first established in the new Star Wars canon in the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon. The name Tigran Jamiro originates in the Star Wars Legends continuity, where it first appeared on a card released in the 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game.\nIn Force Collection, the image used on Jamiro's card is actually one of fellow rebel officer Bren Derlin. The Empire Strikes Back: So You Want to Be a Jedi?, a 2015 novelization of The Empire Strikes Back by Adam Gidwitz, alters Jamiro's scene in the film to have Leia Organa and the droids C-3PO and R2-D2 present. The 2017 junior novelization of the film by Ryder Windham only slightly alters some of Jamiro's dialogue.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tigran_Jamiro",
  "/wiki/Tigran_Jamiro/Legends",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Darth_Tigran",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_Military",
  "/wiki/File:Jamiro-Hell.ogg",
  "/wiki/Lieutenant",
  "/wiki/Logistics_officer",
  "/wiki/Deck_officer",
  "/wiki/Galactic_Civil_War",
  "/wiki/3_ABY",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/XJ9-CS14",
  "/wiki/Han_Solo",
  "/wiki/Tauntaun",
  "/wiki/Galactic_Empire",
  "/wiki/Hoth_system",
  "/wiki/Scientist",
  "/wiki/Technician",
  "/wiki/Battle_of_Hoth",
  "/wiki/File:Jamiro-Solo-SouthEntrance.ogg",
  "/wiki/Military_rank",
  "/wiki/Biologist",
  "/wiki/Kell_Tolkani",
  "/wiki/Commander",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Hangar",
  "/wiki/Temperature",
  "/wiki/Engine",
  "/wiki/Speeder",
  "/wiki/Water",
  "/wiki/Snowspeeder",
  "/wiki/Alliance_officer",
  "/wiki/Tigran_Jamiro%27s_assistant",
  "/wiki/Officer",
  "/wiki/Murra_(tauntaun)",
  "/wiki/Aide",
  "/wiki/File:Solo-Jamiro-Tauntauns.ogg",
  "/wiki/Standard_day",
  "/wiki/Hypothermia",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/The_Force",
  "/wiki/Parent",
  "/wiki/Imperial_Military",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Alliance_military_uniform",
  "/wiki/Jacket",
  "/wiki/Clothing",
  "/wiki/Command_gauntlet",
  "/wiki/Insulated_watch_cap",
  "/wiki/Comlink",
  "/wiki/Hat",
  "/wiki/Ray_Hassett",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/March_29",
  "/wiki/April_4",
  "/wiki/1979",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars_Legends",
  "/wiki/1996",
  "/wiki/Hoth_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Bren_Derlin",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/2015",
  "/wiki/Adam_Gidwitz",
  "/wiki/Droid",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/2017",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Ryder_Windham",
  "/wiki/Category:Audio_files_of_Tigran_Jamiro",
  "/wiki/Category:Images_of_Tigran_Jamiro",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Leia",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/She_Will_Keep_Them_Warm",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/A_Naturalist_on_Hoth",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Making_of_The_Empire_Strikes_Back",
  "/wiki/StarWars.com",
  "/wiki/File:Leland_Chee_Force_Collection.png",
  "/wiki/In-universe",
  "/wiki/Databank_(website)"
 ]
}