{
 "name": "Tila_Mong",
 "display_name": "Tila Mong",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dorin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Baran Do"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tistura Paan"
     ]
    }
   ]
  }
 ],
 "content": "Tila Mong was a Force-sensitive Kel Dor female, and a member and leader of the Baran Do Sages on Dorin as of Luke Skywalker's visit in 43.5 ABY.\nAround 34 ABY, Tila Mong served as a Baran Do Sage under Master of the Order Koro Ziil, residing within the Baran Do temple in Dor'shan. Around this time, Jedi Knight Jacen Solo visited Dorin with hopes of learning the Force techniques specific to the sages of the Baran Do. Feeling that Solo was a good man, Master Ziil did not hesitate to train him in the art of hassat-durr and its sub-techniques. Mastering it within three days, Solo was thankful to the Masters and departed.\nIn 43.5 ABY when Luke Skywalker and his son Ben appeared at the Temple, she had ascended to the rank of Mistress of the Baran Do. She was sympathetic to Skywalker's exile from the Jedi Order and their Temple on Coruscant and was willing to teach the former Grand Master the techniques her predecessor had taught Jedi Solo. With Ben promised to neutralize his father should Luke contract the same ideas that caused Jacen Solo to turn to the dark side of the Force, Mong brought the former Grand Master to her chambers to begin the training. Devoid of learning rituals, Mong began with the ayna-seff technique, the dead-brain technique of scrambling brain scans. Using a small durasteel sphere and a flat metal plate with an electrical lead embedded within, she set the plate in front of Skywalker and placed the ball in a depression on top of it. Handing the Jedi the electrical cord leading into the plate, Luke cycled through the different mind-states used in applying the Force, searching for one that would activate the electromagnetic energy that would lift the ball. Deciding upon the state-of-mind that enabled the Force-flash, Luke was able to lift the ball and after another day, cause it to stop the ball from spinning. The techniques took Luke two days to master, as opposed to Jacen's three.\nDuring the training, Luke noted that Mong guarded her thoughts more closely when she discussed the death of Master Ziil. When Charsae Saal publicly \"died\" at his passing ceremony at the Temple, Luke knew that the sages were lying; that Saal had not died at all. He confronted Mong and discovered that he was right—and not only Saal was still alive, but Ziil was still alive as well. They had joined a secret sect of the sages known as the Hidden Ones, who were in hiding below the surface of Dorin. In an underground chamber, Mong, Saal, and two other sages permitted the two Skywalkers to descend into the Caverns of the Hidden One.\nAfter the Skywalkers dealt with Ziil, they made an unprecedented return to the surface and departed Dorin, leaving Mong to lead the Sages on the surface.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dorin/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Baran_Do/Legends",
  "/wiki/Tistura_Paan",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Master_of_the_Order_(Baran_Do)",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/43_ABY",
  "/wiki/34_ABY/Legends",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Koro_Ziil",
  "/wiki/Baran_Do_temple",
  "/wiki/Dor%27shan",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Force_power/Legends",
  "/wiki/Hassat-durr",
  "/wiki/Ben_Skywalker",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Ayna-seff",
  "/wiki/Durasteel/Legends",
  "/wiki/Force-flash",
  "/wiki/Chara",
  "/wiki/Dying_ceremony",
  "/wiki/Hidden_Ones",
  "/wiki/Caverns_of_the_Hidden_One",
  "/wiki/Confrontation_in_the_Caverns_of_the_Hidden_One",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Tila_Mong",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)"
 ]
}