{
 "name": "Tildnis",
 "display_name": "Tildnis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Around 18 BBY",
      "Hammer",
      "Sunrise system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kilji"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kilji Illumine",
      "Crofyp's task force",
      "Crofyp's task force"
     ]
    }
   ]
  }
 ],
 "content": "Tildnis was a Kilji male who served as a colonel in the Kilji government of the Kilji Illumine, commanding the picket cruiser Hammer. Around 18 BBY, the Hammer and Illumine General Crofyp's war cruiser Anvil, the flagship of Crofyp's task force, traveled to the Unknown Regions Rapacc system, where Crofyp ordered the colonel to move the Hammer past the starboard of the Paccosh–commandeered Nikardun blockade frigate Aelos after a confrontation with the frigate's captain.\nAfter the Chiss heavy cruiser Springhawk arrived and destroyed the Anvil, the Hammer was spared and fled to the Sunrise system, where it was boarded by the Aelos's crew. After obtaining data on the Kilji battle fleet of the Illumine Kilhorde, and killing Tildnis and his forces, the boarders fled the Hammer aboard the Aelos while a Grysk warship destroyed the Hammer.\nColonel Tildnis was a male Kilji who served the Kilji species' Kilji Illumine nation, commanding the Kilji picket cruiser Hammer as part of Illumine General Crofyp's task force. Around 18 BBY, the task force, which also included Crofyp's Kilji war cruiser Anvil, was sent to the Unknown Regions Rapacc system to capture a group of refugees by the Grysk Jixtus, an ally of the Illumine's leader, Generalirius Nakirre. While traveling to the star system, the Hammer was delayed in its journey, prompting the Anvil's navigator, Pathfinder Qilori, to stop the war cruiser to wait for the picket cruiser. Upon Qilori's explanation of their stop to General Crofyp, the general claimed that Tildnis remained in hyperspace and would pass them. The navigator denied that, and stated that the colonel's ship would appear near the Anvil's position in four minutes, which proved true. The task force arrived at their destination shortly after, and the Kilji cruisers were verbally confronted by the Paccosh–commandeered Nikardun blockade frigate Aelos. Crofyp demanded the Aelos to move aside and let his warships continue to the planet of Rapacc; however, the frigate's captain, who unbeknownst to the Kiljis was Paccosh Commander Uingali foar Marocsaa, refused to do so.\nThe general, preparing an attack on the frigate, positioned the Anvil past the Aelos's portside while Vassal Four—a Kilji vassal, a follower of the Kilji beliefs serving Crofyp—signaled Tildnis to move his Hammer past the Nikardun frigate along its starboard and continue to Rapacc; however, when the picket cruiser and the war cruiser were in position, the Chiss heavy cruiser Springhawk, led by Chiss Senior Captain Mitth'raw'nuruodo core name \"Thrawn,\" arrived, deactivating Crofyp's flagship after confronting the Kilji through comm. Shortly after, Qilori theorized that Crofyp was having a loud conversation with Tildnis through comm while the navigator fled Crofyp's war cruiser in a escape pod and the Anvil was destroyed. The senior captain then let the Hammer, which had not suffered any damage, to flee to the Unknown Regions' Sunrise system. Thrawn also captured Qilori and tasked him with using his ability to track other Pathfinders through hyperspace to locate Tildnis.\nThe colonel then kept station with one of Jixtus's vessels over the planet Sunrise, where the Aelos—crewed by Marocsaa, Thrawn, and a team of Paccian commandos—arrived days after the attack on Rapacc and talked about Tildnis with a Grysk serving aboard the Grysk starship. Marocsaa claimed that Qilori, who Thrawn had captured, had told him that the Kilji captain spoke secrets he should not have, and that he did not appreciate Tildnis's retreat, as he had left the Anvil alone. The Grysk then allowed the Paccosh—who posed as a Nikardun—to dock with the Kilji picket cruiser; however, instead of helping the Grysk–Kilji force as he had promised, the Paccosh and Thrawn boarded the Hammer and killed everyone aboard, including Tildnis. Qilori, who participated in the attack, saw the colonel's corpse and was glad that he would not face any \"awkward\" questions from the Kilji regarding why he was with Thrawn.\nShortly after, the Chiss senior captain forced the Hammer's Pathfinder, Sarsh, to give him a Kilji data rectangle in Tildnis's ship's bridge before commandeering the vessel to attack the Grysks, which retaliated by destroying the Hammer after the Aelos's crew's escape. Eventually, the data from Tildnis's ship was shared with the Paataatus species, which used it to exterminate the Illumine Kilhorde Kilji battle fleet near the Paataatus Hiveborn government's borders.\nThe Kilji named Tildnis was enlightened to the Kilji Illumine's Kilji way of order and enlightenment religious beliefs.\nTildnis appeared in the 2021 novel Thrawn Ascendancy: Lesser Evil, the final volume in the Star Wars: The Ascendancy Trilogy written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/18_BBY",
  "/wiki/Hammer_(Kilji_picket_cruiser)",
  "/wiki/Sunrise_system",
  "/wiki/Kilji",
  "/wiki/Gender",
  "/wiki/Kilji_Illumine",
  "/wiki/Crofyp%27s_task_force",
  "/wiki/File:Tildnis.ogg",
  "/wiki/Colonel",
  "/wiki/Commanding_officer",
  "/wiki/Kilji_picket_cruiser",
  "/wiki/General",
  "/wiki/Crofyp",
  "/wiki/Kilji_war_cruiser",
  "/wiki/Anvil",
  "/wiki/Flagship",
  "/wiki/Unknown_Regions",
  "/wiki/Rapacc_system",
  "/wiki/Paccosh",
  "/wiki/Thief",
  "/wiki/Nikardun_blockade_frigate",
  "/wiki/Aelos",
  "/wiki/Attack_on_Rapacc",
  "/wiki/Blockade_frigate",
  "/wiki/Uingali_foar_Marocsaa",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Springhawk",
  "/wiki/Sunrise_incident",
  "/wiki/Kilji_data_rectangle",
  "/wiki/Fleet",
  "/wiki/Illumine_Kilhorde",
  "/wiki/Death",
  "/wiki/Grysk",
  "/wiki/Warship",
  "/wiki/File:Hammerlag.ogg",
  "/wiki/Species",
  "/wiki/Task_force",
  "/wiki/The_Magys%27s_people",
  "/wiki/Jixtus",
  "/wiki/Generalirius",
  "/wiki/Nakirre",
  "/wiki/Star_system",
  "/wiki/Navigator",
  "/wiki/Pathfinders_(Navigators%27_Guild)",
  "/wiki/Qilori",
  "/wiki/Picket_cruiser",
  "/wiki/Standard_minute",
  "/wiki/Comm_unit",
  "/wiki/Planet",
  "/wiki/Rapacc",
  "/wiki/Commander",
  "/wiki/Vassal_Four_(Anvil)",
  "/wiki/Kilji_vassal",
  "/wiki/Nikardun",
  "/wiki/Frigate",
  "/wiki/Chiss",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Core_name",
  "/wiki/Kilji_escape_pod",
  "/wiki/Captain",
  "/wiki/Bogey_One_(Sunrise)",
  "/wiki/Sunrise",
  "/wiki/Paccian_commando",
  "/wiki/Unidentified_Grysk_(Sunrise)",
  "/wiki/Hangar",
  "/wiki/Sarsh",
  "/wiki/Bridge_(starship)",
  "/wiki/Paataatus",
  "/wiki/Paataatus%E2%80%93Kilji_conflict",
  "/wiki/Paataatus_Hiveborn",
  "/wiki/Kilji_way_of_order_and_enlightenment",
  "/wiki/Religion",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Template:LesserEvilDate"
 ]
}