{
 "name": "Tili_Qua",
 "display_name": "Tili Qua",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Tili Qua was a female Chadra-Fan Jedi Master and member of the Jedi High Council at the Hidden Temple, following the destruction of half of the Jedi Order at the hands of the One Sith order and the Fel Empire.\nMaster Qua was present at the Hidden Temple, upon the arrival of Cade Skywalker, where he requested the aid of the Jedi Council in assassinating Darth Krayt. Master Qua was also present to hear the message of Roan Fel, through a contingent of his Imperial Knights, including his daughter Princess Marasiah Fel. Fel's Knights revealed that the Emperor wished to form an alliance between the New Jedi Order and the Empire-in-exile, with the objective of overthrowing Darth Krayt's Galactic Empire; Master Qua held some reservations about the Jedi allying themselves with the Imperial Knights after Roan Fel willingly, if reluctantly, warred with the Jedi and sided with the Sith, an act which resulted in the devastation of the Order.\nMaster Qua later agreed, along with the rest of the Jedi Council, to allow the reborn Darth Krayt's forces to attack the Hidden Temple, in order to allow Admiral Gar Stazi's fleet and Fel's fleet to ambush the Sith-Imperial fleet and deal a devastating blow to the Sith Empire. When Darth Krayt's Dragon ships began devastating the allied fleets, Master Qua evacuated the Hidden Temple in a vessel holding the Jedi younglings, encouraging them to draw strength from the Force to combat their fear.\nAfter the remaining ships of the allied fleet arrived at Bastion, Master Qua went down to the surface of the planet and viewed the autopsy of one of Darth Krayt's new Sith troopers that had been captured by Cade Skywalker. Before he died, the trooper claimed that there were millions like him, causing Masters Qua and K'Kruhk to agree to an attack on Coruscant to try to defeat Krayt before he could assert control over the entire galaxy.\nCade Skywalker slew Darth Krayt during the battle, but Roan Fel was killed as well when he attempted to purge all life on the planet in an attempt to win it, and his Imperial Knights were forced to stop him. Nevertheless, Tili Qua among other Jedi attended the late Emperor's funeral, while K'Kruhk was chosen to represent the Jedi as a Triumvir in the newly formed Galactic Federation Triumvirate.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Chadra-Fan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Hidden_Temple",
  "/wiki/One_Sith",
  "/wiki/Fel_Empire",
  "/wiki/Cade_Skywalker",
  "/wiki/Darth_Krayt",
  "/wiki/Roan_Fel",
  "/wiki/Imperial_Knight",
  "/wiki/Prince/Legends",
  "/wiki/Marasiah_Fel",
  "/wiki/Emperor/Legends",
  "/wiki/Empire-in-exile",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Sith/Legends",
  "/wiki/Attack_on_the_Hidden_Temple",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Dragon_ship",
  "/wiki/Youngling/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Bastion/Legends",
  "/wiki/Unidentified_Sith_trooper_(Taivas)",
  "/wiki/Darth_Krayt%27s_Sith_trooper",
  "/wiki/Battle_of_Coruscant_(Sith%E2%80%93Imperial_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Omega_Red",
  "/wiki/Funeral_of_Roan_Fel",
  "/wiki/Galactic_Federation_Triumvirate",
  "/wiki/Star_Wars:_Legacy:_The_Hidden_Temple",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Legacy%E2%80%94War_4",
  "/wiki/Legacy%E2%80%94War_5",
  "/wiki/Legacy%E2%80%94War_6",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Dark_Horse_Comics",
  "/wiki/John_Ostrander",
  "/wiki/Legacy_(2006)_25",
  "/wiki/137_ABY",
  "/wiki/K%27Kruhk",
  "/wiki/T%27ra_Saa"
 ]
}