{
 "name": "Time_Grappler",
 "display_name": "Time Grappler",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "The Time Grappler was a human male who resided on Ferrix. It was his duty to ring in the beginning and end of each day by striking a beskar anvil atop a bell tower on Rix Road. The Time Grappler handled this task with reverence, adopting rhythmic poses before each hammer strike. He wore a set of earmuffs to protect his hearing from the anvil's clangs.\nIn 5 BBY, like any other day, the Time Grappler woke the people of Ferrix on the morning that a number of Pre-Mor Enforcement Corpos came to the planet in search of Cassian Andor. The off-worlders found themselves unwelcome; their arrival sent the locals off on ringing a series of metal fixtures throughout the population center, much like the Time Grappler would strike his own anvil. These tensions culminated in an explosive encounter on Rix Road that saw Andor escape the planet.\nThe Time Grappler appeared in \"That Would Be Me,\" the second episode of the 2022 Disney+ television series Andor, where he was portrayed by Neil Bell. He was first seen in the show's teaser trailer, which revealed the character's title in the closed captions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Ferrix",
  "/wiki/Standard_day",
  "/wiki/Beskar",
  "/wiki/Rix_Road",
  "/wiki/Hammer_(tool)",
  "/wiki/5_BBY",
  "/wiki/Pre-Mor_Enforcement",
  "/wiki/Corpo",
  "/wiki/Planet",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/That_Would_Be_Me",
  "/wiki/2022",
  "/wiki/Disney%2B",
  "/wiki/Andor_(television_series)",
  "/wiki/Star_Wars",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/StarWars.com",
  "/wiki/Kassa_(episode)"
 ]
}