{
 "name": "Timmy",
 "display_name": "Timmy",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Timmy was a human male that worked as a bartender at the Rimmer's Rest cantina on the moon Nar Shaddaa during the year 5 ABY. During that year, the Rimmer's Rest became a meeting spot for the droid infochant 8t88 and the occasional Rebel Alliance agent Kyle Katarn, which eventually heightened into a shootout between Katarn and 8t88's hired guns. After the violence subsided, leaving the bar littered with bodies, the bartender ordered Katarn out of the Rimmer's Rest. Katarn did leave, but not before taking the Timmy's blaster rifle and spare ammunition.\nTimmy was a human male that served the Rimmer's Rest cantina, a well-stocked establishment that catered to various alien species on the moon Nar Shaddaa, as a bartender during the year 5 ABY. Timmy at some point became acquainted with Kyle Katarn, an occasional agent for the Rebel Alliance. A previous patron, the bartender eventually reached the belief that Katarn was a troublemaker.\nOne day during 5 ABY, the Rimmer's Rest was patronized by Katarn and the droid information broker 8t88, who had arranged a meeting at the cantina. Meanwhile, the bar's bouncer gave Timmy Katarn's drink order, Novanian grog. Katarn's and 8t88's conversation quickly turned sour, however, and 8t88 left a little while later after ordering a number of hired bounty hunters to kill Katarn in the bar.\nDespite being outgunned, Katarn dealt with the attackers and, in short order, knocked out a Tusken grave robber and killed two Gran. After the last aggressor in the bar fell, Timmy sternly ordered Katarn to leave, vaguely recalling a past disturbance Katarn had caused.\nBefore leaving, though, Katarn first jumped behind the bar to grab Timmy's hidden E-11 blaster rifle and the spare ammunition on a shelf, in addition to taking any energy shield belts lying in the establishment.\nAfter Katarn shot up the Rimmer's Rest, Timmy adopted a gruff demeanor as he ordered Katarn out. Any attempt by Katarn to further communicate with the bartender was met with impatient dismissal.\nA surly individual, Timmy had black hair, brown eyes, and was fair-skinned.\nTimmy kept an E-11 blaster rifle behind the bar counter and kept spare energy cells on a shelf alongside glassware. All of these items were later taken by Katarn before he left the Rimmer's Rest.\nHe wore blue, gray, brown, and black clothing on the day of Katarn's and 8t88's meeting.\nTimmy first appeared as an unnamed non-player character in the video game Star Wars: Jedi Knight: Dark Forces II, where he shared a character model with other male NPCs that appeared throughout the game, with his lines of unique dialogue setting him apart from the others.\nAlthough the character did not appear in the 1997 novella Dark Forces: Rebel Agent, he nonetheless received a mention in the novella's audio adaption, which also served as the first source to supply the character with a name. However, as his name is only delivered in shouted dialogue, the exact pronunciation and spelling of his name is unknown and conjectural, respectively.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:NarShad_Bartender_Always_Cause_Trouble.ogg",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II",
  "/wiki/Bartender/Legends",
  "/wiki/Rimmer%27s_Rest/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/8t88/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Lightfight",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Energy_cell/Legends",
  "/wiki/File:NarShaddBouncer_Timmy_Grog_Table_Four.ogg",
  "/wiki/Dark_Forces:_Rebel_Agent_audio_drama",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(5_ABY)",
  "/wiki/Unidentified_bouncer",
  "/wiki/Novanian_grog/Legends",
  "/wiki/Death/Legends",
  "/wiki/Canon",
  "/wiki/Grave_Tuskens",
  "/wiki/Unidentified_bounty_hunter_(Rimmer%27s_Rest)",
  "/wiki/Unidentified_Gran_(Rimmer%27s_Rest)",
  "/wiki/Gran/Legends",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Personal_energy_shield/Legends",
  "/wiki/File:NarShad_Bartender_Knows_Nothing.ogg",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Video_game",
  "/wiki/1997",
  "/wiki/Dark_Forces:_Rebel_Agent",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II:_The_Official_Strategy_Guide",
  "/wiki/The_New_Essential_Chronology"
 ]
}