{
 "name": "Tion_Medon",
 "display_name": "Tion Medon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Utapau"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pau'an"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.06 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Utapaun Committee",
      "Utapaun Security Forces",
      "Utapaun Security Forces",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tion Medon was a male Pau'an who served as the Port Administrator of Pau City on the planet Utapau during the Clone Wars, a pan-galactic conflict between the Galactic Republic and the Confederacy of Independent Systems. In the final weeks of the war, the precariously neutral Utapau was used as a temporary base by Confederate Head of State Grievous. Medon and his people were held hostage, and the port administrator requested the help of Jedi General Obi-Wan Kenobi to liberate Utapau from the occupation. Though Utapau was freed following the Battle of Utapau, the sudden and chaotic end of the war left the planet occupied by the Galactic Empire, and Medon was arrested alongside the Utapaun resistance.\nTion Medon was a Pau'an born on the planet Utapau, the homeworld of the Pau'an and Utai species. Medon was a descendant of Timon Medon, who unified Utapau's city-states. With the establishment of the Utapaun Committee, an organization led by a Chairman of Utapau who was assisted by local Port Administrators, planetary politics and interplanetary relations could be easily regulated by a single government.\nBy the time of the Clone Wars, an intergalactic conflict between the Galactic Republic and its separatist state, the Confederacy of Independent Systems, Tion Medon served as the master of Port Administration in Pau City, the capital of Utapau and the headquarters of the Utapaun Committee. As the Port Administrator, he typically welcomed guests to the sinkhole spaceport and offered them his services. The Utapaun Committee had managed to keep Utapau isolated and neutral for much of the war, as they had successfully done for centuries, but after an attempted illicit arms deal made between the Separatists and Sugi arms merchants on the planet, maintaining neutrality became difficult. Confederate elements became ensconced in Utapau's civic leadership in this time, despite the failure of the arms deal.\nIn the final weeks of the war, following the disastrous Battle of Coruscant, a costly battle that devastated Confederate General Grievous' fleet and resulted in the death of Confederate leader Count Dooku, Grievous fled to Utapau with an occupying force. Now the Confederacy's new Head of State, Grievous quickly established Utapau and Pau City as a temporary sanctuary for himself and the Executive Separatist Council. Upon arrival to Pau City, Grievous had his MagnaGuards kill Medon's committee members, then set up his base of operations on the city's tenth level. Medon and the rest of Pau City's populace were effectively held hostage and were watched over closely by Grievous's battle droid forces. Seeing the danger he and his people were in, Medon helped secretly galvanize the Utapaun Security Forces into a resistance force. Because Grievous was the Republic's priority target after Dooku's death, Republic intelligence units discovered that the general was in hiding on Utapau. Jedi General Obi-Wan Kenobi was sent to investigate this discovery and landed at Pau City to follow up on Grievous's trail.\nPort Administrator Medon and his entourage welcomed Kenobi to Pau City after he landed his Eta-2 Actis-class light interceptor. Medon greeted Kenobi and asked what had brought him to Utapau. Kenobi replied that the war had brought him there, but Medon feigned ignorance and assured the Jedi that there was no war on Utapau and wouldn't be unless he brought it with him. Kenobi requested to have his ship refueled and asked for Medon's permission to use Pau City as a base while he searched nearby systems for Grievous. Medon called on a group of Utai nearby to refuel Kenobi's ship. While the Utai refueled the Jedi's starfighter, Medon leaned close to Kenobi and whispered that Grievous was indeed on Utapau and that they were being watched. Kenobi told Medon that he understood, and the administrator divulged that Grievous and his armies were on the tenth level of Pau City. Kenobi advised Medon to tell his people to take shelter and, offering a secret in kind, informed him that it was now time to prepare Utapau's resistance.\nMedon steadied himself with his cane and bowed before Kenobi. As the Jedi boarded his ship, Medon was asked by one of his associates if Kenobi was bringing any additional warriors. Medon informed his confidant that Kenobi hadn't mentioned if he would, then turned to the general in a conspiratorial fashion once more. Medon told Kenobi that Grievous was a force to be reckoned with and asked if he would be bringing additional troops. Kenobi assured Medon that he would make the necessary arrangements and that Grievous would be dealt with if they planned accordingly. The Jedi then sent his straighter on an automated decoy voyage off the planet while he surreptitiously continued his search for Grievous in Pau City.\nMedon immediately conveyed Kenobi's message to the local Utapaun forces and anxiously awaited a signal from the Republic. Elsewhere, thanks to the information given to him by Medon, Kenobi located Grievous and engaged the general in a duel. Their duel soon broke out into a battle as the Republic's 7th Sky Corps arrived at Pau City to combat the Separatist occupational forces, providing Medon with the signal he had been waiting for. The Utapaun resistance bolstered the Republic clone troopers in the ways they could, and soon Grievous was killed as he attempted to flee the battle. With Grievous dead, Kenobi led his forces in an offensive to rout the now-leaderless droid armies.\nKenobi, however, would become a target of Order 66, and his clone troopers turned on him mid-battle when he and Jedi across the galaxy were marked traitors of the Republic. The Republic forces on Utapau destroyed the remaining battle droids, but Utapau's liberation was short-lived. In one of the most bitter reversals of the war, the Republic army seized control of Pau City and began rounding up and arresting the Utapaun resistance, including Medon and his fellow administrators. Kenobi, meanwhile, survived the betrayal and fled Utapau aboard Grievous's starfighter as a fugitive.\nSometime after the Clone Wars, Tion Medon's staff fell into the possession of the merchant Sconto, the son of a clone who kept the walking cane in his junk shop in Pau City. Sconto knew that the staff belonged to Medon due to the name engraved into its side but wasn't sure who he was until he did some research and discovered that Tion Medon had been the Port Administrator of Pau City during the Clone Wars. Though he believed it to have belonged to Medon, Sconto had no way of authenticating it and could not charge the high price he wanted for the artifact, given that Medon was a relatively common name on Utapau.\nBetween 31 and 32 ABY, Sconto's pawnshop was visited by Karr Nuq Sin, RZ-7, and Maize Raynshi, who were traveling the galaxy to learn more about the long-dead Jedi and their history. The trio was rebuffed inside the store by Sconto, who held personal disdain for the Jedi and the Clone Wars. Sin and Raynshi fooled Sconto into believing they were students investigating the fall of the Republic on Utapau and other backwater worlds, and the merchant began laying out pieces he had lying around for them. Karr noticed Tion Medon's cane and was reminded of one he had in his personal collection back home. Sconto excitedly picked up Medon's cane and told Nuq Sin that it came with authenticity, showing him Medon's name engraved into its side. Nuq Sin asked who Medon was, and Sconto explained that he hadn't known either until he had researched it.\nWhen Sconto told Karr who Medon was, the young boy was excited by the possibility that the port administrator had seen some action during the Clone Wars. Sconto lamented that he couldn't be completely sure if the cane belonged to Medon. Nuq Sin, who had the power of psychometry, asked to handle Medon's staff, which Sconto allowed. While touching the fragile artifact, Farr experienced a vision of Port Administrator Medon's meeting with General Kenobi before the Battle of Utapau. Nuq Sin was unnerved by the vision and almost couldn't maintain it upon seeing Medon's bloodred eyes. By watching Medon and Kenobi's conversation, Nuq Sin not only saw a Jedi for the first time but was able to authenticate Medon's staff. The vision faded out once Medon and Kenobi parted, and Karr fainted from the experience. Once Nuq Sin got his bearings, he told Sconto that the cane belonged to Medon, and recommended he price it accordingly.\nTion Medon was a lanky Pau'an male with a bony frame who stood at 2.06 meters, or 6 feet and 10 inches tall. As a Pau'an, Medon had jagged teeth and gray skin, which was furrowed due to the lack of sunlight in Utapau's sinkholes. The skin around his black eyes was red, which gave him the illusion that his eyes were bleeding. Despite his startling appearance, Medon was nonetheless a welcoming and gracious individual. Though he was accommodating, however, he was also a clear-thinker who not only recognized the danger he and his people were in during the Separatist invasion but was brave enough to do something about it. Medon was willing to risk his safety to discreetly warn General Kenobi about General Grievous' presence on Utapau. Initially feigning ignorance, Medon successfully managed to pass along all the information Kenobi needed to complete his search for Grievous.\nAs the Port Administrator of Pau City, Medon owned a walking cane typical to port masters. The staff was embellished with an engraving of Medon's surname on its side. By the time Karr Nuq Sin discovered it in Sconto's pawn shop, the artifact was fragile and had to be handled carefully. Towards the end of the Clone Wars, Medon wore a set of crimson floor-length robes, which at the time were considered a recent fashion on Utapau. Because of his tall, thin frame, Medon wore a wide belt to support his body.\nTion Medon was portrayed by Bruce Spence in the 2005 film Star Wars: Episode III Revenge of the Sith, the third and final installment of the Star Wars prequel trilogy.\nInitially, it was undecided how Medon was to be realized onscreen–whether a practical makeup effect or a computer-generated character. The Utapauns were ultimately created using both methods, but Medon was designed to be a flesh-and-blood performer wearing makeup, with Spence playing him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tion_Medon",
  "/wiki/Tion_Medon/Legends",
  "/wiki/Star_Wars_Helmet_Collection_25",
  "/wiki/Tion_(disambiguation)",
  "/wiki/Utapau",
  "/wiki/Pau%27an",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Utapaun_Committee",
  "/wiki/Utapaun_Security_Forces",
  "/wiki/Galactic_Republic",
  "/wiki/Port_Administrator",
  "/wiki/Pau_City",
  "/wiki/Planet",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Head_of_State",
  "/wiki/Grievous",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Battle_of_Utapau",
  "/wiki/Galactic_Empire",
  "/wiki/Homeworld",
  "/wiki/Utai",
  "/wiki/Timon_Medon",
  "/wiki/Port_Administration",
  "/wiki/Mission_to_Utapau",
  "/wiki/Sugi",
  "/wiki/Endente%27s_arms_dealing_group",
  "/wiki/Battle_of_Coruscant",
  "/wiki/General",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Executive_Separatist_Council",
  "/wiki/MagnaGuard",
  "/wiki/Death",
  "/wiki/Level_10",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Eta-2_Actis-class_light_interceptor",
  "/wiki/Port_master%27s_walking_cane",
  "/wiki/7th_Sky_Corps",
  "/wiki/Clone_trooper",
  "/wiki/Order_66",
  "/wiki/Soulless_One",
  "/wiki/Sconto",
  "/wiki/Sconto%27s_junk_shop",
  "/wiki/Karr_Nuq_Sin",
  "/wiki/RZ-7",
  "/wiki/Maize_Raynshi",
  "/wiki/Psychometry",
  "/wiki/Force_vision",
  "/wiki/Tooth",
  "/wiki/Eye",
  "/wiki/Bruce_Spence",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Revenge_of_the_Sith_Read-Along_Storybook_and_CD",
  "/wiki/Force_Collector",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Journey_Through_Space_(2015)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_30",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/31_ABY",
  "/wiki/32_ABY",
  "/wiki/Dok-Ondar",
  "/wiki/Limb",
  "/wiki/C-3PO",
  "/wiki/Mission_to_Taul",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Poe_Dameron",
  "/wiki/Resistance",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Time",
  "/wiki/Taul",
  "/wiki/November_19",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Databank_(original)"
 ]
}