{
 "name": "Tiona_Madee",
 "display_name": "Tiona Madee",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Smuggler"
     ]
    }
   ]
  }
 ],
 "content": "Tiona Madee was a female Mirialan who had green skin, red hair and brown eyes. With a background in technical systems and preferring to attack through stealth, she had an unusually cheerful disposition. Madee enthusiastically provided her allies with data and information, and was also skilled at disabling security systems and recovering crystals. She was known to wear survivalist gear and her weapon of choice was a vibroblade. The Mirialan was known to be active in the Anoat sector of the galaxy during the time of the Iron Blockade, when the Galactic Empire put the region in lock-down shortly after the death of Galactic Emperor Palpatine.\n\nMadee was an associate of a smuggler who opposed the Empire, sending her on assorted missions.Tiona Madee made an appearance in the 2015 mobile game Star Wars: Uprising, by entertainment company Kabam. She is initially a 2-star Tier-I crew member, upgrading to a maximum 4-star level. Her background is technical, preference is stealth and has the jeweler ability, making her strong in crystal finder runs.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mirialan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/The_Smuggler",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Technician",
  "/wiki/Crystal",
  "/wiki/Vibroblade",
  "/wiki/Anoat_sector",
  "/wiki/The_galaxy",
  "/wiki/Iron_Blockade",
  "/wiki/Galactic_Empire",
  "/wiki/Death",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/2015",
  "/wiki/Video_game",
  "/wiki/Kabam"
 ]
}