{
 "name": "Tionne_Solusar",
 "display_name": "Tionne Solusar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rindao"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pearly white"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "At least one Prosthetic arm and leg"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order",
      "New Republic",
      "Galactic Federation of Free Alliances"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Luke Skywalker"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Mander Zuma",
      "Octa Ramis"
     ]
    }
   ]
  }
 ],
 "content": "Tionne Solusar was a Near-Human female from the planet Rindao and a Jedi Master. A scholar of Jedi history, Tionne was one of the first students of Luke Skywalker's New Jedi Order and was almost entirely responsible for regathering the lost knowledge of the Old Jedi Order. She was involved in many important events to face the order, including the Yuuzhan Vong War, and often acted as a protector for the generation of younger Jedi Knights.\nEventually, Tionne found love with another of Luke Skywalker's students, Kam Solusar, whom she later married. After attaining the rank of Jedi Master, Tionne served on both the Masters' Council and the more formal Jedi High Council that succeeded it. In addition, Master Solusar acted as the head of the Ossus Jedi Academy, along with her husband.\nTionne grew up with the Jedi lore her grandmother related to her. Eventually, Imperial stormtroopers executed Tionne's grandmother for spreading those tales of the Jedi. Tionne fled Rindao, taking her grandmother's double viol with her. She made her living by working at cantinas where she could perform her music, and she would in turn ask patrons to share any knowledge they had of the Jedi Order.\nWhile at a spaceport on Ord Mantell, Tionne received a tip about the location of the ancient Jedi city of Exis Station. Unable to pay her informant, she told him to share the information with Luke Skywalker, who was reforming the Jedi Order and would be willing to pay for the information.\nSkywalker later met up with Tionne at Exis Station, and the two made an escape from the collapsing station. Luke sensed that Tionne was not very strong in the Force, but nevertheless possessed some potential. He invited her to join his budding Jedi academy on Yavin 4.\nDespite the fact that her powers were limited, Tionne worked hard and attained the rank of Jedi Knight. She spent nearly a year searching for the spiral mist-horn and crystal-pearl that she used to construct her lightsaber.\nTionne's role at the Jedi Praxeum was that of Jedi historian, and she would often teach the trainees stories of ancient Jedi through singing while accompanying herself with her grandmother's viol. She wrote a number of original ballads, such as the Ballad of Master Vodo-Siosk Baas, the Ballad of the Jedi Mechanic, and the Ballad of Nomi Sunrider.\nIn addition to teaching at the academy, Tionne undertook research trips every few months, seeking whatever knowledge she could find about the history of the Jedi. She often returned with stories, songs, Twi'lek story-chains, tapestries, and other artifacts. Tionne's methods contrasted with other Jedi, some of whom stole artifacts, believing the Order had the rightful claim to any discoveries. This brought the Order into disrepute within archaeological circles, as evidenced by the suspicion of Dr. Anki Pace and her team on Bimmiel. Tionne, however, never adopted this arrogant attitude. Indeed, one of her most valuable acquisitions was Arca Jeth's holocron, a gift from archaeologists on Arkania.\nTionne's knowledge also extended to Sith artifacts. She researched the Leviathan on Corbos to aid the Jedi mission there, and later investigated the Hssiss on Vjun.\nDuring Captain Gilad Pellaeon's raid on the Yavin Academy, Tionne aided in the fighting by informing the other Jedi as to the number of enemy capital ships and their class. In addition, she monitored the Academy communication stations and was the one to discover the Imperial jamming. Tionne also aided Luke by using the Force to hurl a tree into an Imperial Flying Fortress, destroying it.\nDuring the New Jedi Order's conflict with the Cult of Ragnos, Tionne contributed her knowledge of Sith lore to research into the Scepter of Ragnos. She later assisted her fellow Jedi in tracking the movements of Tavion Axmis.\nIn 14 ABY, During the Disciples of Ragnos crisis, Tionne was dispatched with Streen to investigate locations, from which the Disciples may have siphoned Force energy.\nTionne learned through a holocron of a hidden planet, Yalara. She found that the ancient Jedi Master Broden Kel Verdox had installed a cloaking device to keep the planet hidden from civilization, due to the fact that the indigenous population was too primitive for contact with the wider galaxy. Jaden Korr, apprentice to Kyle Katarn, acted on this information to sabotage Imperial activities on Yalara.\nWhile the Galactic Civil War slowed down in its later years, Tionne would also preside over the newly restored Jedi Archives on Coruscant. Here, she compiled a history of the Rebel Alliance for the records and researched the relatively low-key history of the Renegade Squadron.\nIn 22 ABY, Tionne acquired a Jemlaat-class yacht from a Randoni trader during one of her frequent research trips to Borgo Prime, literally for the price of a song about the first Randoni merchants and where they hid their treasures. She christened the yacht Lore Seeker and made it her personal transport. She often took young Jedi trainees with her on these trips, using it as an opportunity to provide them with practical experience.\nLater that year, Tionne discovered that Darth Vader had saved Obi-Wan Kenobi's lightsaber after their duel on the First Death Star in 0 BBY and kept the captured artifact at Bast Castle on Vjun. Since an information broker had sold this information to her, she rightly feared that treasure-hunters would attempt to snatch the lightsaber first and quickly alerted Luke. Thinking it was just a simple trip and time for training, Tionne allowed Human Jedi trainees Anakin Solo, Tahiri Veila, Uldir Lochett and the ancient Kushiban Jedi Master Ikrit to accompany her to Vjun on the Lore Seeker.\nHaving arrived on Vjun, they discovered another vessel and feared another group had reached it first. Having survived Bast Castle's automated defense systems, they discovered the lightsaber in a protected alcove. Unfortunately, a group of mercenaries and pirates under a cloaked man named Orloc arrived. Orloc claimed to be a mage who possessed great powers and his henchmen also stole Kenobi's lightsaber.\nIn response, the Jedi pursued Orloc and his henchmen on a chase through Bast Castle. During a confrontation, Orloc easily defeated Ikrit in lightsaber combat since the Kushiban had no lightsaber at all. He also deceived Uldir by claiming to train him in all the Force skills he desired. However, the other Jedi managed to rescue Uldir and escape Bast Castle, along with Kenobi's lightsaber and the holocron of the ancient Jedi Master Asli Krimsan.\nHaving returned to the Academy, Tionne began researching the holocron. Unfortunately for Uldir, he had become obsessed with what Orloc said during their encounter. Since no one at the Academy had been able to awaken his powers, Uldir stole the two Jedi artifacts along with Ikrit's personal transport Sunrider and then went to find Orloc, believing he could help. He found Orloc at Exis Station, who then recruited the young man and promised to train him as a Jedi. In reality, Orloc had no Force powers and had used technology to deceive others with demonstrations of Force power. However, Uldir did not realize this.\nLater, Tionne, Anakin, Tahiri and Ikrit discovered Exis Station and fought Orloc. During the battle, Tionne was injured by Orloc. However, Ikrit, employing Kenobi's lightsaber, joined in the fight. Worse for Orloc, Uldir realized that he had been deceived and aided his Jedi comrades to defeat Orloc. Following that, the Jedi left Exis Station with the two Jedi artifacts, having removed a threat to the New Jedi Order.\nDuring her years on Yavin 4, Tionne found love with another of Luke Skywalker's students, Kam Solusar. The two got married in 18 ABY.\nDuring the invasion of the Yuuzhan Vong, Tionne and Kam were in charge of looking after the younglings when the Academy on Yavin 4 was attacked by the Peace Brigade in 26 ABY, first placing the young ones aboard the Errant Venture, then moving them to the Maw Installation. Tionne and Kam also searched the Deep Core for locations for a Jedi base, eventually finding what would become Eclipse.\nTionne survived the Yuuzhan Vong invasion, attained the rank of Jedi Master, and became part of the New Jedi Order Masters' Council.\nDuring the Second Galactic Civil War, Kam and Tionne were the caretakers of the Academy on Ossus. Following the murder of Mara Jade Skywalker, Tionne wrote and published a comprehensive tome about the history of the Force and the Jedi Order, in the hope that her students would study and make use of the information contained within. It would eventually be recovered by Ellu Viss 90 years later. Jacen Solo, who by this time had assumed the Sith title of Darth Caedus and seized control of the Galactic Alliance, sent members of the Galactic Alliance Guard ostensibly to protect the Academy from terrorists but in reality to keep the Jedi in check by threatening the Padawan learners.\nJaina Solo, Zekk and Jagged Fel were pursuing the insane Twi'lek Jedi, Alema Rar who had made her way to Ossus when they found that the Academy was under the control of the GAG. Zekk was ordered to remain with the ships while Jaina and Jag tried to make sense of the situation, were captured and held prisoner.\nThe GAG received orders to kill all the Jedi which they attempted to do so first by using coma gas on the sleeping Jedi and then shooting them as they slept. Fortunately Jaina's danger sense alerted her to the attempted massacre and she was able to escape, alerting her fellow Jedi to the trap. A battle ensued between the GAG and the unarmed Jedi and nearly all the Padawans fell in combat, reminiscent of the raid on the Jedi Temple during Darth Vader's assault almost sixty years previously.\nAlthough the Jedi attempted to clear out the Academy, Tionne confronted GAG major called Salle Serpa in an attempt to protect captured Jedi students, however, he surprised her and proceeded to shoot her limbs off with his blaster so that he could incite the Jedi enough to draw them out of hiding. Many Jedi including Kam came out of hiding in an attempt to save Tionne but their attempts were in vain for the Jedi were shot by snipers before they could reach Tionne. By the time Jaina Solo managed to kill all the snipers and arrive, the major had already blasted away Tionne's arm and leg. To incite Jaina further, the major further shortened the remainder of Tionne's arm. The Jedi managed to retake the Academy, and she and her husband survived their injuries and later had prosthetic limbs replace those they had lost. Their injuries were so well healed that it was nearly impossible to tell that they had suffered serious wounds and continued to serve as Masters on the Jedi Council.\nTionne Solusar was voiced by Montego Glover, uncredited, in the video game Star Wars Battlefront: Renegade Squadron.\nTionne's exact species is unclear, as there are multiple conflicting sources. Initially said to be humanoid rather than Human in the Junior Jedi Knights series, she was described as alien in the novel Young Jedi Knights: Jedi Under Siege. In Young Jedi Knights: Jedi Bounty, Tionne undertakes a mission to uncover information about the operations of the anti-Human Diversity Alliance because she is \"not entirely human.\" Additionally, her entry in The Complete Star Wars Encyclopedia states that she is near-Human. Despite these indications that Tionne is at least partially non-Human, several other sources and appearances give her species simply as Human.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Tionne_Solusar",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Tionne_Solusar",
  "/wiki/Rindao",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Cybernetics/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Mander_Zuma",
  "/wiki/Octa_Ramis",
  "/wiki/Jedi_Academy:_Leviathan_1",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Kam_Solusar",
  "/wiki/Masters%27_Council",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Jedi/Legends",
  "/wiki/Tionne_Solusar%27s_grandmother",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Double_viol",
  "/wiki/Cantina/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/City/Legends",
  "/wiki/Exis_Station/Legends",
  "/wiki/Fonterrat",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Yavin_4/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Spiral_mist-horn",
  "/wiki/Lightsaber_crystal",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Jedi_historian",
  "/wiki/The_Ballad_of_Master_Vodo-Siosk_Baas",
  "/wiki/The_Ballad_of_the_Jedi_Mechanic",
  "/wiki/The_Ballad_of_Nomi_Sunrider",
  "/wiki/Twi%27lek_story-chain",
  "/wiki/Anki_Pace",
  "/wiki/Bimmiel/Legends",
  "/wiki/Arca_Jeth%27s_holocron",
  "/wiki/Arkania/Legends",
  "/wiki/Leviathan_(creature)",
  "/wiki/Corbos",
  "/wiki/Hssiss",
  "/wiki/Vjun/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/HAVr_A9_Floating_Fortress/Legends",
  "/wiki/Disciples_of_Ragnos",
  "/wiki/Scepter_of_Ragnos",
  "/wiki/Tavion_Axmis",
  "/wiki/14_ABY/Legends",
  "/wiki/Disciples_of_Ragnos_crisis",
  "/wiki/Streen",
  "/wiki/Force_energy",
  "/wiki/Yalara",
  "/wiki/Broden_Kel_Verdox",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Jaden_Korr",
  "/wiki/Kyle_Katarn",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Renegade_Squadron/Legends",
  "/wiki/22_ABY/Legends",
  "/wiki/Jemlaat-class_in-system_sail_yacht",
  "/wiki/Randoni",
  "/wiki/Borgo_Prime/Legends",
  "/wiki/Lore_Seeker",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Bast_Castle",
  "/wiki/Mission_to_Bast_Castle",
  "/wiki/Human/Legends",
  "/wiki/Anakin_Solo",
  "/wiki/Tahiri_Veila",
  "/wiki/Uldir_Lochett",
  "/wiki/Kushiban",
  "/wiki/Ikrit",
  "/wiki/Orloc",
  "/wiki/Holocron/Legends",
  "/wiki/Asli_Krimsan",
  "/wiki/Sunrider_(starship)",
  "/wiki/Mission_to_Exis_Station",
  "/wiki/18_ABY/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Youngling/Legends",
  "/wiki/Invasion_of_Yavin_4",
  "/wiki/Peace_Brigade",
  "/wiki/26_ABY",
  "/wiki/Errant_Venture/Legends",
  "/wiki/Maw_Installation",
  "/wiki/Eclipse_(planet)",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force",
  "/wiki/Ellu_Viss",
  "/wiki/130_ABY",
  "/wiki/Darth_Caedus",
  "/wiki/Sith/Legends",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Padawan/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Zekk",
  "/wiki/Jagged_Fel",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Alema_Rar",
  "/wiki/Coma_gas",
  "/wiki/Battle_of_Ossus_(Second_Galactic_Civil_War)",
  "/wiki/Operation:_Knightfall",
  "/wiki/Salle_Serpa",
  "/wiki/Montego_Glover",
  "/wiki/Star_Wars_Battlefront:_Renegade_Squadron",
  "/wiki/Species/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Star_Wars:_Junior_Jedi_Knights",
  "/wiki/Alien/Legends",
  "/wiki/Young_Jedi_Knights:_Jedi_Under_Siege",
  "/wiki/Young_Jedi_Knights:_Jedi_Bounty",
  "/wiki/Anti-Humanism",
  "/wiki/Diversity_Alliance",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Firestorm_(short_story)",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Champions_of_the_Force",
  "/wiki/I,_Jedi",
  "/wiki/Simple_Tricks",
  "/wiki/Tales_from_the_New_Republic",
  "/wiki/Wizards.com",
  "/wiki/Rebel_Jedi",
  "/wiki/Darksaber_(novel)",
  "/wiki/Jedi_Academy:_Leviathan",
  "/wiki/Planet_of_Twilight",
  "/wiki/Star_Wars:_Jedi_Knight:_Jedi_Academy",
  "/wiki/Before_the_Storm",
  "/wiki/Star_Wars:_Union",
  "/wiki/Scourge_(novel)",
  "/wiki/Junior_Jedi_Knights:_The_Golden_Globe",
  "/wiki/Junior_Jedi_Knights:_Lyric%27s_World",
  "/wiki/Junior_Jedi_Knights:_Promises",
  "/wiki/Junior_Jedi_Knights:_Anakin%27s_Quest",
  "/wiki/Junior_Jedi_Knights:_Vader%27s_Fortress",
  "/wiki/Junior_Jedi_Knights:_Kenobi%27s_Blade",
  "/wiki/Young_Jedi_Knights:_Heirs_of_the_Force",
  "/wiki/Young_Jedi_Knights:_Lightsabers",
  "/wiki/Young_Jedi_Knights:_Darkest_Knight",
  "/wiki/Young_Jedi_Knights:_Delusions_of_Grandeur",
  "/wiki/Young_Jedi_Knights:_Crisis_at_Crystal_Reef",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Crystal",
  "/wiki/Star_Wars_Gamer_5",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_I:_Conquest",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_Apprentice_(short_story)",
  "/wiki/Star_Wars_Gamer_8",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Legacy_of_the_Force:_Fury",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/The_Women_Of_Star_Wars",
  "/wiki/Star_Wars_Galaxy_Magazine_12",
  "/wiki/The_Jedi",
  "/wiki/Star_Wars_Galaxy_Magazine_13",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Playing_A_Major_Role",
  "/wiki/Star_Wars_Galaxy_Collector_1",
  "/wiki/The_Essential_Guide_to_Alien_Species_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_the_New_Jedi_Order",
  "/wiki/Star_Wars_Insider_57",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_125",
  "/wiki/The_Official_Star_Wars_Fact_File_135",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Databank_(original)",
  "/wiki/Jedi_Search",
  "/wiki/Brakiss",
  "/wiki/Corran_Horn",
  "/wiki/Gantoris",
  "/wiki/Dorsk_81",
  "/wiki/Kirana_Ti",
  "/wiki/Kyp_Durron",
  "/wiki/43_ABY",
  "/wiki/44_ABY",
  "/wiki/Barratk%27l",
  "/wiki/Cilghal",
  "/wiki/Kenth_Hamner",
  "/wiki/Saba_Sebatyne",
  "/wiki/Chief_Librarian/Legends",
  "/wiki/Jocasta_Nu/Legends",
  "/wiki/35_ABY/Legends",
  "/wiki/Markre_Medjev"
 ]
}