{
 "name": "Tip",
 "display_name": "Tip",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bonbrak"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Tip was a Bonbrak who worked with the Jedi Padawan Ram Jomaram in a garage within the Jedi living quarters on the planet Valo. Out of Jomaram's Bonbrak crew, Tip was both the youngest and surliest. Shortly prior to the Republic Fair, held within Valo's Lonisa City, when Jomaram and his droid, V-18, went to investigate the seemingly faulty communications tower outside the city, Tip and another Bonbrak, Breebak, stowed away. After Jomaram discovered that the tower had been sabotaged by Nihil raiders, who damaged V-18, the two Bonbraks revealed themselves, fixing the droid. By the time that the group returned to Lonisa City to warn the Jedi and the Galactic Republic, the Fair had begun, and they were arrested for trespassing by the Valo Security Force. The Nihil subsequently attacked Valo, causing immense devastation during the fair. Tip and Breebak continued to accompany Jomaram and V-18, joined by the Padawan Lula Talisola and young Force-sensitive Zeen Mrala. Together, the group restored communications across Valo, allowing the Jedi and security forces to coordinate a response to the attack.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bonbrak",
  "/wiki/Color",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ram_Jomaram",
  "/wiki/Planet",
  "/wiki/Valo",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Lonisa_City",
  "/wiki/Gender",
  "/wiki/Droid",
  "/wiki/V-18",
  "/wiki/Crashpoint_Tower",
  "/wiki/City",
  "/wiki/Breebak",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Time",
  "/wiki/Galactic_Republic",
  "/wiki/Attack_on_Valo",
  "/wiki/Lula_Talisola",
  "/wiki/Force-sensitive",
  "/wiki/Zeen_Mrala",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Tip",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic_Adventures_Free_Comic_Book_Day_2021",
  "/wiki/The_High_Republic_Adventures:_Galactic_Bake-Off_Spectacular",
  "/wiki/The_High_Republic:_Midnight_Horizon"
 ]
}