{
 "name": "Tir%27uh",
 "display_name": "Tir'uh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Noe'ha'on"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Noehon"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mytaranor Slaving Council"
     ]
    }
   ]
  }
 ],
 "content": "Tir'uh was a Noehon female criminal and a high-ranking member of the Mytaranor Slaving Council. A successful slaver, Tir'uh was considered a threat by the Task Force on Alliance Security, who mistakenly believed her to be the leader of the Council.\nTir'uh was a female Noehon who earned a living as a slaver — something infrequent among female Noehons, who were mostly considered slaves in their native planet. For decades during the Galactic Empire, Tir'uh worked in criminal affairs, usually related to slavery. She traveled from Kessel to Bnar VII, and was said to know all of the locales selling slaves among those two planets.\nTir'uh joined the Mytaranor Slaving Council and was so important that the Task Force on Alliance Security thought for a long time that Tir'uh was the leader. The discovery of a different leader, Talas Piran, led the Task Force to reevaluate Tir'uh's responsibilities; they eventually decided that she was serving as \"elder statesbeing\", providing insight and advice. She was nonetheless clearly identified as a high-ranking member of the Council\nTir'uh and Piran hooked up with a failed Krish smuggler by the name of Karalan. Kalaran managed to get their sympathies and they hired him as a part of the Vanquisher security team.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Noe%27ha%27on/Legends",
  "/wiki/Noehon",
  "/wiki/Gender/Legends",
  "/wiki/Mytaranor_Slaving_Council",
  "/wiki/Slavery/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Bnar_VII",
  "/wiki/Talas_Piran",
  "/wiki/Krish_(species)/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Karalan",
  "/wiki/Vanquisher_(Kiltirin-class)",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies"
 ]
}