{
 "name": "Tirgee_Benyalle",
 "display_name": "Tirgee Benyalle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kaal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kaal"
     ]
    }
   ]
  }
 ],
 "content": "Tirgee Benyalle was a Human female who was worked as a crime boss on Kaal and used her control of the illegal gambling operations on the planet to take control of Kaal in the wake of the Galactic Empire's withdrawal.\nTirgee Benyalle was a crime boss on Kaal who exercised control of the planet's illegal gambling and entertainment industry. After the Galactic Empire's defeat in the Battle of Endor, Imperial forces withdrew from Kaal. Benyalle used her wealth and influence to move into the power vacuum, becoming Kaal's ruler and keeping the planet independent.\nShe used her funds to build Kaal's aquaculture industry until, in 6 ABY, she realized that she needed outside investment to expand it any further. She solicited outside powers to come to Kaal and negotiate for Kaal's aquacultural exports, and received Admiral Kermen, representing the Empire; Utoxx Prentioch, a nearby warlord; Talon Karrde, posing as Syndic Pandis Hart of the Sif-Uwana Council; and a New Republic delegation.\nBenyalle received the group at her Grand Imperial hotel and casino, hosting a high-stakes sabacc game for the negotiators the night before the talks began. The next morning, she took the parties on a tour of a harvester factory and then began accepting bids aboard her luxury sail barge. Kermen, however, revealed a plan to retake Kaal by force, and he, his stormtrooper bodyguards, and the agents with which he had surreptitiously replaced most of the barge's crew attacked Benyalle. She was defended by Karrde, the New Republic delegation, and loyal crew members, but Kermen had bribed her bodyguard Sendir to betray her. The New Republic agents saved her from Sendir's attack, and escaped with her onto a submersible summoned by Karrde.\nKarrde explained that he had only been interested in the wreck of Emperor Palpatine's personal yacht, Emperor's Shadow, which he had destroyed to cover their getaway. Benyalle was thus left to make her export deal with the New Republic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kaal/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Uther_Kermen",
  "/wiki/Utoxx_Prentioch",
  "/wiki/Warlord/Legends",
  "/wiki/Talon_Karrde",
  "/wiki/Syndic/Legends",
  "/wiki/Sif-Uwana_Council",
  "/wiki/New_Republic/Legends",
  "/wiki/Grand_Imperial",
  "/wiki/Sabacc/Legends",
  "/wiki/Sail_barge/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Sendir",
  "/wiki/Submersible",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Emperor%27s_Shadow_(shuttle)",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Kaal_Connection",
  "/wiki/Star_Wars_Adventure_Journal_7",
  "/wiki/Recon_%26_Report:_The_Journey_to_Coruscant",
  "/wiki/Star_Wars_Adventure_Journal_2",
  "/wiki/West_End_Games",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4",
  "/wiki/Classic_Adventures:_Volume_Four_-_The_Best_of_the_Journal"
 ]
}