{
 "name": "Tirranna",
 "display_name": "Tirranna",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kashyyyk"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Task Force on Alliance Security",
      "Alliance Special Forces",
      "Eclipse Team",
      "Task Force on Alliance Security",
      "Alliance Special Forces",
      "Eclipse Team",
      "Eclipse Team"
     ]
    }
   ]
  }
 ],
 "content": "Tirranna was a female Wookiee and a member of the Rebel Alliance Task Force.\nRespected because of her contacts and her knowledge of the underworld, she was chosen for the Rebel Alliance Intelligence. She was eager to join the team, because she wanted a chance to manage military forces to liberate her native Kashyyyk.\nTirranna crossed paths twice with pirates Dorin and Denuab Venithon. Each time, they escaped \"like a scur from the jaws of a nightdweller\". She respected the team, although she noticed that they fought without any honor.\nIn 1 BBY, Tirranna was captured by the Galactic Empire in Pa'hir'al City, and interrogated by High Inquisitor Mox Slosin. She survived the interrogation, but she would keep physical and psychological scars for the rest of her life, as well as an important hatred towards Slosin.\nA partner of fellow Rebel officers Alton Lochner and Adazian Liebke, she was having drinks with them on the Brawl and Grill establishment, in Trader's Quarter, Ord Mantell. Suddenly, assassin Callandri entered the bar shooting, trying to kill Lochner. As Tirranna and Liebke were unaware of a good reason for Lochner to die, they worked together saving Lochner's life. Tirranna's actions were essential in the rescue.\nTirranna was later consulted by Vanden Willard, who wanted to write a report on Callandri. Tirranna wrote of her respect to Callandri's skills, comparing her to a Katarn. However, she also specified that she hated Callandri and wanted a chance to kill her or her cousin and associate Zayl Braith.\nAs a member of the Task Force on Alliance Security, Tirranna wrote reports on potential threats to the Rebel Alliance, including former enemies Venithon Twins and Mox Slosin. She also wrote about the Mytaranor Slaving Council: As a Wookiee, she despised all of the slavers and wanted to kill hundreds of them with her bare hands.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Eclipse_Team",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Dorin_Venithon",
  "/wiki/Denuab_Venithon",
  "/wiki/Scur",
  "/wiki/Nightdweller",
  "/wiki/1_BBY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Pa%27hir%27al_City",
  "/wiki/High_Inquisitor",
  "/wiki/Mox_Slosin",
  "/wiki/Alton_Lochner",
  "/wiki/Adazian_Liebke",
  "/wiki/Brawl_and_Grill",
  "/wiki/Trader%27s_Quarter",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Callandri",
  "/wiki/Vanden_Willard/Legends",
  "/wiki/Katarn/Legends",
  "/wiki/Zayl_Braith",
  "/wiki/Mytaranor_Slaving_Council",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Wanted_by_Cracken_(Star_Wars_Adventure_Journal)",
  "/wiki/Star_Wars_Adventure_Journal_4",
  "/wiki/Star_Wars_Adventure_Journal_10"
 ]
}