{
 "name": "Titan_Three_(Flight_Baron)",
 "display_name": "Titan Three  (Flight Baron)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Helix Squadron",
      "Titan Squadron",
      "Helix Squadron",
      "Titan Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A human served as a pilot in the Galactic Empire's Helix Squadron as part of the Imperial Starfighter Corps during the Galactic Civil War between the Empire and the Alliance to Restore the Republic, then later as part of Titan Squadron fighting the New Republic following the Battle of Endor.\nA human individual gained skill in piloting and eventually joined the Galactic Empire and served as a TIE fighter pilot in the Galactic Empire's Helix Squadron.\nShortly after the destruction of Alderaan, this individual served as a TIE fighter pilot in the Galactic Empire's Helix Squadron. On orders from Commodore Rae Sloane, Helix Squadron were sent on a mission to lure out and destroy an Alderaanian refugee convoy that was heading to Fostar Haven. A skirmish broke out after the station activated their defense turrets, followed by a squadron of X-wings that were deployed. After destroying all threats, the refugee convoy was found, but Captain Lindon Javes betrayed Helix Squadron and defected to the rebels. This individual was then reassigned in disgrace to the Outer Rim Territories.\nFollowing the Battle of Endor, the individual was an Imperial officer and was then transferred to Titan Squadron by Captain Terisa Kerrill, also a former Helix member, and assumed the callsign Titan Three. As a member of Titan Squadron, Titan Three was at the forefront of Imperial operations to locate and disrupt the New Republic's Project Starhawk during the final year of the war. At the battle of Galitan, Titan Three personally destroyed the Starhawk's tractor beam core, terminally damaging it, and defeated Lindon Javes. The destruction of the Starhawk proved to be a symbolic victory for the Empire that quelled rebellious sentiment in twelve Imperial systems. In recognition of Titan Three's accomplishments, the pilot was promoted to Flight Baron. Afterwards, rumors spread that Admiral Rae Sloane planned to reward Titan Squadron with a mission in the Unknown Regions.\nThe pilot appears in the campaign of the 2020 video game Star Wars: Squadrons as the player character of the Galactic Empire story. Their features are fully customizable, including their appearance, gender, and name. In the gameplay reveal trailer for the game, the name of the pilot was \"Case Kassandora.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Titan_Three_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/Helix_Squadron",
  "/wiki/Titan_Squadron",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/Battle_of_Endor",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Commodore",
  "/wiki/Rae_Sloane",
  "/wiki/Battle_at_Fostar_Haven",
  "/wiki/Alderaanian_refugee_convoy",
  "/wiki/Fostar_Haven",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Captain",
  "/wiki/Lindon_Javes",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Imperial_officer",
  "/wiki/Terisa_Kerrill",
  "/wiki/Titan_Three",
  "/wiki/Project_Starhawk",
  "/wiki/Battle_of_Galitan",
  "/wiki/Starhawk",
  "/wiki/Baron_of_the_Empire",
  "/wiki/Admiral",
  "/wiki/Unknown_Regions",
  "/wiki/2020",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Pilot",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars",
  "/wiki/File:Squadrons-announcement.png"
 ]
}