{
 "name": "Titan_Three_(Var-Shaa)",
 "display_name": "Titan Three  (Var-Shaa)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 4 ABY",
      "Var-Shaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Titan Squadron",
      "Titan Squadron"
     ]
    }
   ]
  }
 ],
 "content": "\"Titan Three\" was a human female TIE fighter pilot in the Galactic Empire's Titan Squadron under the callsign Titan Three. During a New Republic strike on the Var-Shaa dockyard, this pilot was unable to retreat to the Star Destroyer Overseer due to New Republic pilots pursuing her, but was saved by Titan Leader Varko Grey. However, as Titan Three moved to return to the hangar, she was shot down and killed by a New Republic pilot.\nThe TIE fighter pilot designated Titan Three joined the Galactic Empire, serving in Titan Squadron under Titan Leader Varko Grey during the Galactic Civil War. Sometime following the Battle of Endor in 4 ABY, Titan Squadron and the Imperial II-class Star Destroyer Overseer defended the Imperial dockyard at the planet Var-Shaa, which fell under a surprise attack by the New Republic.\nThe Empire's attempt to defend the dockyard was in vain, as the space station was destroyed under New Republic fire. With the station lost, the squadron's commanding officer, Terisa Kerrill, ordered Grey to call for a retreat. As her squadron mates returned to the Overseer, Titan Three became pinned down by enemy starfighters. Despite Kerrill's insistence that the Overseer would depart, Grey turned back to assist Titan Three, destroying the RZ-1 A-wing interceptors pursuing her. Titan Three and Grey made for the Overseer, but a New Republic pilot shot down Titan Three's TIE/sa bomber, killing her. After the Battle of Var-Shaa, Titan Three's callsign was taken by a pilot transferred into the squadron by Kerrill.\nA human female, the pilot designated Titan Three was thankful to Grey for saving her at Var-Shaa, having believed she would not survive.\nThis pilot flew a TIE/sa bomber during the New Republic strike on the Var-Shaa dockyard.\nTitan Three appeared in the short \"Hunted,\" created to promote the upcoming video game Star Wars: Squadrons and released on September 14, 2020. The Imperial player character in Star Wars: Squadrons takes on Titan Three's callsign.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Titan_Three_(disambiguation)",
  "/wiki/4_ABY",
  "/wiki/Var-Shaa",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Titan_Squadron",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Titan_Three",
  "/wiki/New_Republic",
  "/wiki/Battle_of_Var-Shaa",
  "/wiki/Var-Shaa_dockyard",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Overseer_(Imperial_II-class_Star_Destroyer)",
  "/wiki/New_Republic_pilot",
  "/wiki/Titan_Leader",
  "/wiki/Varko_Grey",
  "/wiki/Hangar",
  "/wiki/Death",
  "/wiki/Unidentified_New_Republic_pilot_(Var-Shaa)",
  "/wiki/Callsign",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Endor",
  "/wiki/Planet",
  "/wiki/Shipyard",
  "/wiki/Space_station",
  "/wiki/Squadron",
  "/wiki/Commanding_officer",
  "/wiki/Terisa_Kerrill",
  "/wiki/Starfighter",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/TIE/sa_bomber",
  "/wiki/Titan_Three_(Flight_Baron)",
  "/wiki/Pilot",
  "/wiki/Hunted",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/September_14",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Databank_(website)"
 ]
}