{
 "name": "Titch",
 "display_name": "Titch",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free AlliancesGalactic Alliance Intelligence Service",
      "Galactic Alliance Intelligence Service"
     ]
    }
   ]
  }
 ],
 "content": "Titch, a member of Galactic Alliance Intelligence Service, was a Human male in his mid-twenties as of 40 ABY. He was dark-haired, broad-shouldered, and had the appearance of a wrestler.\nAlong with Captain Elsen Barthis, Titch tried to convince Wedge Antilles to give information to the Galactic Alliance on Rogue Squadron just prior to the start of the Second Galactic Civil War. This however turned out to be a ploy to get Antilles to Coruscant where he was to be held captive for the duration of the crisis. Before exiting, however, Titch went out of his way to express his dislike for Wedge, and indeed all of the Rebellion-era pilots who, he believed, flaunted their reputations. Titch also added that he didn't care whether or not the Rebels or the Empire were in control, and stated that he would have been perfectly content if the latter hadn't been overthrown. As a parting threat, he told Wedge that, should he attempt to escape, Titch always kept his blaster set on \"burn\" rather than \"stun.\" Wedge, unfazed by these threats, told Titch that as soon as he broke out of his prison, the security guard would be demoted to \"refresher duty\".\nEventually, Wedge used a clever plan and was able to electrocute Titch using his rations of water and a power cable connected to a computer, enabling his escape. Before he left his cell, however, he reminded Titch of his promise that the lieutenant would be reduced to cleaning the refreshers after Antilles' escape.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Intelligence_Service",
  "/wiki/40_ABY",
  "/wiki/Captain/Legends",
  "/wiki/Elsen_Barthis",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Legacy_of_the_Force:_Betrayal"
 ]
}