{
 "name": "Titus_Klev",
 "display_name": "Titus Klev",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alsakan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "10 ABY",
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Dark Empire"
     ]
    }
   ]
  }
 ],
 "content": "Titus Klev was a Human male officer of the Imperial Navy. An active member of the Sub-Adult Group, he was accepted into CompForce despite his young age and later became the thirty-seventh generation of Klevs to enter the Imperial Naval Academy after being rejected once. Following the Imperial defeat at Endor, Klev was assigned to Battle Station Operations. While aboard a Dedicated Siege Platform in the Siege of Wann Tsir, he discovered a Rebel agent attempting to sabotage the platform. Klev was commended for his discovery and received a promotion, with many believing that he was on his way to becoming a Moff.\nIn 10 ABY, Klev, a general, was a member of the resurrected Emperor Palpatine's forces. He commanded the World Devastator strike force from the Silencer-7 in an assault on Mon Calamari, in which his force inflicted heavy damage on the Mon Calamari homeworld. His path to the title of Moff ended in the oceans of Dac, where he died when the World Devastators were sabotaged by the astromech droid R2-D2 into colliding with each other.\nTitus Klev was a Human male born on the planet Alsakan into privilege, his father being a high-ranking veteran of the Clone Wars and his mother being the wealthy heiress of a trading company. In his early years, Titus Klev was an active participant in the Sub-Adult Group, the largest branch of the Galactic Empire's Commission for the Preservation of the New Order. He was one of the first enrolled in the SAGroup; while a member, he proved to be skilled in the competitive sport known as Wegsphere, in which two teams playing in a low gravity well attempted to place a ball into the opponent's goal. At age 13, Klev was sent to a special training camp on the planet Ibanjji and, after saving an instructor from a pack of wild varns, was accepted into CompForce despite being four years underage.\nThough Klev volunteered for CompForce Assault, his parents arranged for him to go into Observation, where he became Chief Ideological Monitor. Wanting some excitement, he applied to enter the Imperial Naval Academy, though he was rejected once for insufficient grades. However, a fellow SAGroup member bent the rules to allow him in. As a result, Titus Klev became the 37th generation of Klevs to enter the Academy. While there, he was noted as being the kind of Human that was usually featured in Imperial propaganda, and he graduated first in his class.\nKlev never got the chance to serve aboard the Death Star II battlestation, but in the aftermath of the Imperial defeat at Endor, he was assigned to Battle Station Operations, serving aboard Dedicated Siege Platforms. Klev participated in the siege of Wann Tsir aboard such a platform, and during the battle he discovered a Rebel agent attempting to sabotage his vessel's shields. The discovery of the infiltrator earned Klev a commendation and a promotion, and his peers thought that he would eventually reach the rank of Moff.\nBy the time of Palpatine's resurgence in 10 ABY, Klev had been promoted to general and was placed in charge of the World Devastator Silencer-7 as he led the Imperial forces during the assault of Mon Calamari, reporting to Jedi Knight-turned-Imperial Supreme Commander Luke Skywalker. Over the course of the battle, Klev sent a wave of TIE/D automated starfighters to attack the New Republic Imperial II-class Star Destroyer Emancipator and ordered the destruction of the Star Destroyer's escape pods as its crew attempted to flee the dying ship. Skywalker, however, had not truly defected to the Empire—he had remained loyal to the New Republic which he had served. As a result, he tasked his astromech droid, R2-D2, with transmitting the command to shut down the World Devastators through the master control computer on the Imperial throneworld of Byss. When the crew aboard the Silencer-7 discovered this sabotage, Klev ordered that all systems be put on override; however, the control signal prevented any such occurrence. Unable to operate, the superweapons plummeted into the oceans below. Klev was one of the casualties.\nAs an adolescent, Titus Klev was rather skilled, excelling in the sport of Wegsphere. His exceptional abilities, combined with his saving of an instructor from varns on Ibanjji, gained him access to CompForce though underage. His grades originally prevented him from entrance into the Naval Academy, but after he was admitted, he graduated at the top of his class. He was known to be a good commander, having knowledge in both ship-to-ship combat and planetary assault tactics.\nKlev's participation in the siege of Wann Tsir earned him respect in the eyes of his peers, and along with this respect came promotions. Many presumed that Klev would ultimately rise to the rank of Moff. A step on that path was the command of the Silencer-7 during the battle of Mon Calamari. His tactics were ruthless against the New Republic opposition, and he went so far as to order the destruction of defenseless escape pods during the battle. During the attempted subjugation of the planet, he was overconfident, believing the armada of World Devastators to be unstoppable, and that the New Republic X-wings could do him no damage. In the end, however, his overconfidence proved to be fatally wrong.\nTitus Klev made his first appearance in the third and fourth issues of 1992's Star Wars: Dark Empire comic book series, written by Tom Veitch and illustrated by Cam Kennedy. He was voiced by Nick Jameson in the 1994 audio adaptation of Dark Empire. Klev would later appear in 1998's Star Wars: Rebellion, where he was one of the Imperial NPCs that could be recruited to the player's forces. His biography was supplied in West End Games Dark Empire Sourcebook, published in 1993. Summaries of biography have appeared in numerous encyclopedic sources over the years, including the second and third editions of A Guide to the Star Wars Universe, the Star Wars Encyclopedia, and The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Klev",
  "/wiki/Klev_(assistant)",
  "/wiki/Alsakan/Legends",
  "/wiki/10_ABY/Legends",
  "/wiki/Dac",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Sub-Adult_Group/Legends",
  "/wiki/CompForce/Legends",
  "/wiki/Klev_family",
  "/wiki/Imperial_Naval_Academy",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Battle_Station_Operations/Legends",
  "/wiki/Dedicated_Siege_Platform",
  "/wiki/Siege_of_Wann_Tsir",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Moff/Legends",
  "/wiki/General/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/World_Devastator",
  "/wiki/Silencer-7",
  "/wiki/Battle_of_Calamari",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Death/Legends",
  "/wiki/R2-series_astromech_droid",
  "/wiki/R2-D2/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Wegsphere",
  "/wiki/Ibanjji",
  "/wiki/Varn_(creature)",
  "/wiki/Chief_Ideological_Monitor",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battlestation",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/TIE/D_automated_starfighter",
  "/wiki/New_Republic/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Emancipator",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Master_Control_Computer",
  "/wiki/Byss/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Wann_Tsir",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Dark_Empire_3",
  "/wiki/Dark_Empire_4",
  "/wiki/1992",
  "/wiki/Star_Wars:_Dark_Empire",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tom_Veitch",
  "/wiki/Cam_Kennedy",
  "/wiki/Nick_Jameson",
  "/wiki/1994",
  "/wiki/Dark_Empire_(audio)",
  "/wiki/1998",
  "/wiki/Star_Wars:_Rebellion_(video_game)",
  "/wiki/West_End_Games",
  "/wiki/Dark_Empire_Sourcebook",
  "/wiki/1993",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Second_Edition,_Revised_and_Expanded",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/A_Guide_to_the_Star_Wars_Universe",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Rebellion:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Essential_Atlas",
  "/wiki/Dark_Empire_5"
 ]
}