{
 "name": "Tiver",
 "display_name": "Tiver",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Sometime before the plot to assassinate Senator Amidala",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Tiver was a female Chadra-Fan bounty hunter who worked with the Gand Rinn. Along with the Rodian Neelda and the human Jango Fett, the pair was hired to capture a runaway Twi'lek who was trying to flee her father with her lover, Griph. After capturing the girl, Tiver and Rinn betrayed Fett and his son, Boba. Boba, however, gunned down the pair, killing them both.\nAt some point, Tiver became a bounty hunter and partnered with the Gand Rinn. The pair took various jobs, some alongside the Rodian Neelda. Sometime before the plot to assassinate Senator Amidala, the three of them were hired by a man to return his runaway daughter. They met on Telerath, where they were joined by the esteemed bounty hunter, Jango Fett, who would also join them on the mission. They were surprised to find that he had brought his child, Boba Fett, with him. Nevertheless, they were forced to accept Boba's company.\nTiver and the other bounty hunters traveled to the planet Ord Mantell to intercept their target. While Fett promised to cover the skies, the rest of them were with Boba in a cantina, waiting for the Twi'lek girl to arrive. Soon enough, she entered the bar to meet her lover, Griph. While the pair conversed on the balcony, Tiver and the other three cornered them. Griph abandoned the girl when Neelda told him to leave and the Twi'lek attempted to jump off the ledge. Fett, however, caught her in time and stunned her. After putting the girl into Fett's ship, the bounty hunters followed him while he talked to Boba. Though Tiver and Rinn had different plans. Tiver tackled Boba to the ground while Rinn stole the boy's blaster and held Fett at gunpoint, demanding he hand over the bounty for their taking. Boba then revealed another blaster in his possession and killed Tiver. After gunning down the confused Rinn, Boba let Neelda run away to tell others of what had happened.\nTiver was a female Chadra-Fan with brown hair and brown eyes. She and Rinn aspired to take Fett's bounty for their own sharing. Tiver looked down on jobs with little value like her fateful job on Ord Mantell where she underestimated Boba's expertise. This led to her sudden demise.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Ord_Mantell",
  "/wiki/Chadra-Fan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Gand",
  "/wiki/Rinn_(Gand)",
  "/wiki/Rodian",
  "/wiki/Neelda",
  "/wiki/Human",
  "/wiki/Jango_Fett",
  "/wiki/Mission_to_Ord_Mantell_(Jango_Fett)",
  "/wiki/Unidentified_Twi%27lek_(Ord_Mantell)",
  "/wiki/Unidentified_Twi%27lek%27s_father",
  "/wiki/Griph",
  "/wiki/Boba_Fett",
  "/wiki/Death",
  "/wiki/Telerath",
  "/wiki/Bounty",
  "/wiki/Planet",
  "/wiki/Cantina",
  "/wiki/Twi%27lek",
  "/wiki/Stun",
  "/wiki/Slave_I",
  "/wiki/Blaster",
  "/wiki/Age_of_Republic_-_Jango_Fett_1",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}