{
 "name": "Tivvy",
 "display_name": "Tivvy",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Tivvy was a Sullustan smuggler who lived on the planet Sullust. Shortly after the Battle of Yavin, Tivvy led Princess Leia Organa of the Alliance to Restore the Republic, the rebel pilot Evaan Verlaine, and the astromech droid R2-D2 to Sullust's Alderaan Enclave. As the rebels approached the enclave, a squad of its residents ambushed them but were defeated, after which Organa and her companions entered the enclave without Tivvy.\nThe Sullustan male smuggler Tivvy lived on the planet Sullust during the war between the Galactic Empire and the Alliance to Restore the Republic. In 0 ABY, shortly after the Battle of Yavin, Princess Leia Organa of the Rebel Alliance traveled to Sullust as part of a mission to rescue survivors from her homeworld, the planet Alderaan, which had been destroyed by the Empire. Organa, the rebel pilot Evaan Verlaine, and the astromech droid R2-D2 engaged Tivvy to show them to Sullust's Alderaan Enclave.\nTivvy informed the rebel group on the way that he believed the inhabitants of the enclave to have gone insane, as they had shut off communication with the outside world. Organa then questioned Tivvy as to how the Alderaanians had acquired the land that the enclave was built on, but the rebels were suddenly ambushed by a squad of soldiers from the enclave. The soldiers demanded that the rebels hand over their weapons, but Organa and her companions were able to disarm them. She then made her way into the enclave without Tivvy, eventually persuading the enclave's members to join her in her mission.\nTivvy had black eyes and light skin. He spoke a language other than Galactic Basic Standard, requiring Evaan Verlaine to translate, and he tried to be polite in his phrasing when claiming that the local Alderaanians on Sullust were insane.\nTivvy appeared in Princess Leia 3, a canon comic book written by Mark Waid, illustrated by Terry Dodson and released on April 29, 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sullust",
  "/wiki/Sullustan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Smuggler",
  "/wiki/Planet",
  "/wiki/Battle_of_Yavin",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rebel_pilot",
  "/wiki/Evaan_Verlaine",
  "/wiki/R2_series_astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Alderaan_Enclave",
  "/wiki/Squad",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/0_ABY",
  "/wiki/Mission_to_rescue_the_survivors_of_Alderaan",
  "/wiki/Homeworld",
  "/wiki/Alderaan",
  "/wiki/The_Disaster",
  "/wiki/Soldier",
  "/wiki/Eye",
  "/wiki/Language",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Princess_Leia_3",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Mark_Waid",
  "/wiki/Terry_Dodson",
  "/wiki/April_29",
  "/wiki/2015",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Princess_Leia",
  "/wiki/Marvel_Comics"
 ]
}