{
 "name": "TK-3338",
 "display_name": "TK-3338",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "501st Legion",
      "501st Legion"
     ]
    }
   ]
  }
 ],
 "content": "TK-3338 was the designation of a stormtrooper who served the Galactic Empire as part of the 501st Legion. They were part of the forces that boarded the rebel corvette Tantive IV in 0 BBY in search of the Death Star plans that had been stolen by the rebels. TK-3338 was ordered to search the starship for passengers with Stormtrooper Commander TK-9091 and fellow troopers TK-4601 and TK-4247. When the four discovered Princess Leia Organa on board, she killed TK-9091 before being stunned. TK-3338 and TK-4601 were then part of the escort that brought Organa before their commanding officer, Darth Vader.\nTK-3338 was the designation of a human who served as a stormtrooper in the Galactic Empire's 501st Legion under the command of the Sith Lord Darth Vader. In 0 BBY, TK-3338 was stationed on board Vader's flagship, the Imperial I-class Star Destroyer Devastator when it chased down the Alliance to Restore the Republic CR90 corvette Tantive IV following its escape from the Battle of Scarif. Imperial forces then deployed from the Devastator and boarded the corvette in search of the plans for the Empire's Death Star superweapon, which had been stolen on Scarif.\nAfter the Imperials had successfully captured the rebel vessel but failed to find the plans, Vader ordered that Stormtrooper Commander TK-9091 lead TK-3338, TK-4601 and TK-4247 in a search of the ship to find any remaining passengers. The four troopers set about searching corridors, closets and other out-of-the-way places, with TK-9091 in the lead, followed by TK-4601, then TK-3338 and finally TK-4247 bringing up the rear. As they searched, TK-3338 questioned what they would do if they found Princess Leia Organa, a senator and known rebel sympathiser who was believed to be somewhere on the corvette. TK-9091 responded that they would stun her and bring her to Vader.\nAs they continued, TK-9091 spotted Organa in the corridor ahead of them and ordered his men to set their blasters to stun. Before the commander had a chance to fire, the senator shot and killed him before being hit by a stun blast from TK-4601. TK-4247 checked on TK-9091 and confirmed that he had been killed while TK-4601, who was now the ranking member of the squad, checked to see that Organa had survived. Once the rebel awoke, TK-4601 dragged her to her feet and TK-3338 pressed his blaster into her back to prevent her escaping.\"\nTK-4601 then reported that they had Organa in custody and requested that two more troopers be sent to assist in transporting her to Vader. He also asked to be transfer off active duty, which was granted. Once the two additional troopers—TK-7624 and TK-8332—arrived, TK-4061 left while TK-3338 and the other three remaining troopers marched Organa to Vader. The Sith demanded to know where the Death Star plans were but the senator feigned ignorance and so he ordered TK-3338 and the others to take her away.\nTK-3338 wore stormtrooper armor and carried an E-11 medium blaster rifle.\nTK-3338 first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. The character was then first identified in the short story \"The Bucket\", which was written by Christie Golden and published as part of the From a Certain Point of View anthology in 2017.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/501st_Legion",
  "/wiki/Operating_number",
  "/wiki/Stormtrooper",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Corvette",
  "/wiki/Tantive_IV",
  "/wiki/0_BBY",
  "/wiki/Death_Star_plans",
  "/wiki/Starship",
  "/wiki/Stormtrooper_Commander",
  "/wiki/TK-9091",
  "/wiki/Trooper",
  "/wiki/Tarvyn_Lareka",
  "/wiki/TK-4247",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Death",
  "/wiki/Stun",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sith_Lord",
  "/wiki/Flagship",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/CR90_corvette",
  "/wiki/Battle_of_Scarif",
  "/wiki/Imperial_Military",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Scarif",
  "/wiki/Senator",
  "/wiki/Gender",
  "/wiki/Blaster",
  "/wiki/Commander",
  "/wiki/Squad",
  "/wiki/Limb",
  "/wiki/TK-7624",
  "/wiki/TK-8332",
  "/wiki/Sith",
  "/wiki/Death_Star",
  "/wiki/Stormtrooper_armor",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_Bucket",
  "/wiki/Christie_Golden",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/2017",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Princess_Leia_vs._Darth_Vader_-_A_Fearless_Leader",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Rogue_One:_A_Star_Wars_Story"
 ]
}