{
 "name": "TK-363",
 "display_name": "TK-363",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "TK-363 was a male Human stormtrooper of the Galactic Empire who lived during the Galactic Civil War.\nSometime after the Battle of Yavin, TK-363 was stationed on Tansarii Point Station, a space station in orbit around the planet Ord Mantell. He guarded Storage room 02 in the lower section of the station.\nIn 1 ABY, a Force-sensitive spacer who was following the training of the Jedi-in-exile Nos'lyn fell to the dark side of the Force. The fallen Jedi apprentice later came under the tutelage of a mysterious Dark Jedi. As a test of faith in the dark side, the darksider ordered the spacer to use a mind trick to convince TK-363 to sabotage Tansarii Point Station. The apprentice successfully persuaded the strormtrooper to destroy the station by going down to the engine room and overloading the reactors. The spacer instructed him to wait until they had left the station before completing his duty. Nos'lyn admonished the spacer for doing this and not considering the consequences of their actions.\nAround the same time, TK-363 met a smuggler working for Jake Felan in the lower section of Tansarii Point Station. The smuggler needed to dump a crate of sliced weapons from Station Gamma to the Storage room 02. However, the smuggler was not allowed to access the room. Instead of just shooting the stormtrooper, the smuggler lured the soldier and managed to convince him to let him access to the room. The spacer dumped the weapons as planned and was paid 500 credit by Felan for the successful work.\nTK-363 appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. TK-363 was added to the game as part of the \"New Player Tutorial\", introduced with the release of the \"Publish 25\", a.k.a. the \"New Game Enhancements\", on November 15, 2005.\nThe events mentioned above only occurred if the player took a dark sided approach to one of the first quests they received as the \"Jedi\" profession. Nos'lyn contacted the player later in the game from Tansarii Point Station, making it apparent that the mind trick was only temporary.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Comprehensive_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Tansarii_Point_Station/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/1_ABY/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Nos%27lyn",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Reactor/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Jake_Felan",
  "/wiki/Station_Gamma",
  "/wiki/Credit",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}