{
 "name": "TK-421",
 "display_name": "TK-421",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star",
      "Alderaan system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.847 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "TK-421 was the designation of a human male Imperial stormtrooper who served on Lasan before he was stationed on the Death Star battle station. In 0 BBY, he worked in the Sector AA-345 Maintenance Unit alongside the MSE-6 series repair droid MSE-6-G735Y, but he hoped to secure a transfer to Coruscant to enter the droid on the racing circuit.\nTK-421 caught the attention of Grand Moff Wilhuff Tarkin through an accidental holorecording of himself without his helmet that was displayed due to MSE-6-G735Y crashing into Tarkin and malfunctioning. When Tarkin sent a message back for TK-421 to report to his officer's quarters to repair his aqualeisure unit, TK-421 understood Tarkin's implied intentions and saw an opportunity for himself and his droid to advance. Tarkin and TK-421 began a clandestine intimate relationship that progressed quickly. TK-421 was promoted to station security, a position that Tarkin believed would be safe, and the stormtrooper hoped he and his droid would soon be relocated to Tarkin's penthouse on Coruscant.\nAlongside TK-710, TK-421's first security assignment was to guard the Millennium Falcon in Docking Bay 327 after the Death Star captured it. The stormtroopers were tricked by Captain Han Solo into the boarding the light freighter and were killed. TK-421's stormtrooper armor became a disguise used by Luke Skywalker to rescue Princess Leia Organa. Tarkin vowed to MSE-6-G735Y that he would avenge the droid's master by eliminating the Rebel Alliance, but shortly afterward, the Death Star was destroyed.\nTK-421 was the operating number of a human male who was an Imperial stormtrooper during the Galactic Civil War. After a posting on Lasan, a planet that was besieged by the Empire, he was stationed on the Death Star battle station and worked in the Maintenance Unit of Sector AA-345. The MSE-6 series repair droid MSE-6-G735Y, which he called \"G7,\" assisted him by delivering supplies and equipment to different sectors of the station. TK-421 considered G7 the fastest mouse droid in the Imperial fleet and promised G7 that if his transfer was approved, they would go together and enter the racing circuit on Coruscant, the galactic capital planet and seat of the Empire. Although he appreciated the aesthetic aspects of the Death Star, he felt trapped there by the rigorous routines, the lack of downtime, and his armor, especially his helmet.\nOn one occasion in 0 BBY, he complained to the droid about the helmet's effects on his complexion, such as giving him a pimple on his chin that he compared in size to a Kowakian monkey-lizard. When he told G7 to look at his skin, he inadvertently issued an order to activate its holorecorder. The droid thus recorded the stormtrooper with his helmet off and face on display, which was against regulations.\nNot long afterward, TK-421 sent MSE-6-G735Y to deliver a HypnoHypodermal Injector Needle C-7R to an IT-O interrogator droid in Detention Block AA-23; after being prepared by an Imperial officer, Lieutenant Blagg, the interrogator droid would be used by the Sith Lord Darth Vader in his torture of the imprisoned Princess Leia Organa. The commander of the Death Star, Grand Moff Wilhuff Tarkin, was en route to review Blagg's preparations when G7 made the delivery, and Tarkin's impending arrival caused Blagg to panic and order the droid to depart. In G7's haste to leave, it collided with Tarkin, whom the droid recognized as having security level Alpha One but could not identify by name. The collision injured Tarkin and damaged G7's holorecorder matrix, causing it to inadvertently display the holorecording of TK-421. After admiring the stormtrooper's appearance, Tarkin told G7 to play back the entire message, which the droid was obliged to obey as an Alpha-One-level clearance superseded all of its known commands and subroutines. However, G7's damage rendered it unable to comply and in need of maintenance. Tarkin told Blagg that he would personally deal with the trooper responsible for the droid and then ordered G7 to report to his officer's quarters in Sector GM1-A and enter into sleep mode.\nAfter Tarkin repaired G7, he sent the MSE-6 unit back to TK-421 with a holomessage that indicated his interest in the stormtrooper as well as an invitation to visit his quarters to repair his aqualeisure unit. TK-421 felt flattered that he had caught someone's eye, telling G7 that, if he played the situation right, he could get them a transfer to Coruscant or anything else they wanted. Recognizing he was dealing with an officer who had Imperial Academy experience, TK-421 affected naivete and a backwater accent as he recorded his response, saying he would report to Tarkin's quarters after he showered with the antibacterial nanofoam Tarkin had sent him. He sent G7 ahead to deliver his message.\nUpon arriving at Tarkin's quarters, TK-421 thanked him for repairing G7. Tarkin invited him inside but required him to first remove his armor to avoid tracking grease or other residue on the new carpet, which TK-421 recognized as Coruscant fiberweave and complimented. Tarkin pointed out a chair made with veermok hide; he had extensive experience hunting veermoks on his homeworld, Eriadu. He then told TK-421 to go about his business in the aqualeisure unit while he prepared for a meeting with the Joint Chiefs, and reminded G7 to execute Imperial Protocol Alpha One to delete all records regarding the encounter.\nSeveral cycles later, the Death Star remained in the Alderaan system after Tarkin had ordered the destruction of the Rebel Alliance–affiliated planet Alderaan, Princess Organa's homeworld, as a display of the Empire's power. During that cycle, TK-421 awakened G7 and told the droid not to worry about its memory gaps. He confided in the droid that they needed to maintain secrecy because everything occurring on the battle station relied upon Tarkin, whom he described as having an icy exterior with other people that was dropped when they were alone together. TK-421 said he made Tarkin laugh when they were together and that G7 was better off not witnessing certain events or keeping them in its memory. With his security level raised from Lambda to Beta and his transfer to a comfortable position in station security on the 300 level, TK-421 had hopes that he and G7 would continue their advancement to an assignment in Tarkin's personal detail; after that, they would move to Coruscant, where G7 would enter the droid racing circuit and TK-421 would live in Tarkin's penthouse overlooking the Imperial Palace.\nTK-421 was stopped from speaking further when he received a transmission via his helmet's built-in comlink ordering him to guard a captured light freighter, the YT-1300 light freighter known as the Millennium Falcon, which had been captured with a tractor beam when it arrived in the star system. He sent G7 to Tarkin's quarters while he reported for his first assignment on guard duty in Docking Bay 327.\nTK-421 was ordered to guard the starship while a scanning crew determined if anyone was aboard. He stood to the left of the entry ramp while fellow stormtrooper TK-710 was on its right. Shortly after the scanning crew entered the ship, there was a thump from inside that only drew a brief turn of the stormtroopers' heads before they again faced away from the ship; the sound was not surprising to the stormtroopers since they had noticed the crew's difficulty with maneuvering the equipment. Han Solo, the captain of the ship, pretended to be one of the crew members by calling out for aid. TK-421 moved to the foot of the ramp and peered up it before nodding for TK-710 to follow behind him. As soon as they reached the top of the ramp, they had little time to react as Solo downed them with two blaster shots.\nOne of Solo's passengers, Luke Skywalker, joined Solo in removing the troopers' sets of armor to use as disguises. Skywalker wore TK-421's armor as they infiltrated the station with the Wookiee co-pilot Chewbacca and Jedi Master Obi-Wan Kenobi, initially to deactivate the tractor beam trapping them and subsequently to rescue Princess Leia Organa. Lieutenant Treidum, who was stationed in the docking bay control room, noticed that TK-421 was missing. When Treidum attempted to contact the stormtrooper and asked why he was not at his post, Skywalker emerged from the ship in TK-421's armor and pretended the helmet had a malfunction that interfered with the transmission.\nAt some point before leaving the Death Star, the rebels placed TK-421's dead body in a crawl space, where it was later found. After learning of TK-421's death, the stormtrooper TD-110 privately observed that, while they had not known each other well, TK-421 had been strong and had not deserved that fate.\nG7 was awakened from sleep mode by Tarkin after the Battle of Yavin had commenced and was informed by Tarkin that TK-421 had been murdered by rebels. Tarkin admitted that he had envisioned plans for them together and vowed that he would soon avenge TK-421 by annihilating the last of the Rebellion with the battle station's destructive power. He invited G7 to join him on the command bridge to witness the imminent destruction of the Rebel Alliance's base on the moon Yavin 4, but the droid did not arrive due to being caught in an explosion. Seconds afterward, the entire Death Star was blown up by Luke Skywalker, killing Tarkin and destroying MSE-6-G735Y.\nTK-421 was a human male who was 1.847 meters in height. According to stormtrooper TK-450, it was obvious that TK-421 had personally programmed MSE-6-G735Y because the droid stopped recording TK-450 while he was still talking, a behavior that TK-450 compared to TK-421 ignoring what he did not want to hear. TK-450 also thought the other trooper spent more time talking to droids than other beings. TK-421 was indeed fond of G7 and frequently confided in it about his feelings and his wishes for a future where he would paint racing stripes on the droid and enter it into a racing circuit. Though he was not eloquent, he talked at length to the droid. In his discussions with G7, he spoke of them as a pair advancing together. TK-450 mistakenly believed that TK-421 would be unable to stand up to the intimidating attention of someone like Major General Cassio Tagge, Darth Vader, or Grand Moff Wilhuff Tarkin.\nTK-421 appreciated the aesthetics and engineering of the Death Star, particularly its distinctive lighting that was installed in the walls rather than overhead. He preferred the Death Star to his previous station on Lasan, where the overhead lighting made everything look depressingly sallow. One of his plans for life on Coruscant involved installing lighting of the same style as the Death Star's. His recognition of the craftmanship of Tarkin's Coruscant fiberweave carpeting caused him to temporarily drop his feigned accent.\nTarkin described TK-421 as beautiful. According to Luke Skywalker, TK-421's uniform smelled like the Death Star had served a spicy lunch that day. TK-421's aesthetic concerns included his personal appearance and the image he projected of himself. After receiving his short-lived promotion to station security, TK-421 told G7 that the benefits included ordering people around and carrying a blaster rifle. He described it as \"very butch,\" a characteristic that he thought he did not possess but should display when he responded to Tarkin's initial holomessage. Although TK-421 pretended to be less experienced and knowledgeable in their encounters, Tarkin considered it a game between them and noticed TK-421's cleverness. They were each envisioning a future together before their deaths.\nBased on a single holomessage, TK-421 successfully calculated behaviors that would appeal to Tarkin in order to secure advancements in his station that the Grand Moff had the power to grant. That included adopting a persona characterized by TK-421 as a \"backwater, rough-around-the-edges military grunt\" along with an associated style of speech; his natural voice lacked that accent and had a higher pitch.\nTK-421 wore white plastoid stormtrooper armor over a black body glove and carried an E-11 medium blaster rifle while on duty in Docking Bay 327, a weapon that was not ordinarily assigned to him. He hated how the requirement to always wear his helmet had negatively affected his complexion. Although he did not carry a thermal detonator on his utility belt, he was equipped with a tool kit, blaster power cell containers, and a grappling hook attached to a fibercord reel, the latter of which proved useful to Skywalker when he and Organa needed to swing across a chasm.\nTK-421 first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. Although not credited in the film itself, some stormtrooper extras such as Stephen Bayley have since been acknowledged, with Bayley attending fan conventions as TK-421's performer.\nThe idea of using a stormtrooper's armor as a disguise in the Death Star began with the draft character Annikin Starkiller in The Star Wars: Rough Draft, which George Lucas completed in May 1974. In the third draft from August 1975, The Star Wars: From The Adventures of Luke Starkiller, Han Solo and Luke Skywalker both wear the disguises. In A New Hope, TK-421 goes off-camera when he enters the Millennium Falcon, with his fate implied by sound effects. The sounds were originally scripted as a \"quick round of gunfire\" in the fourth draft, changed to a \"large crashing sound\" in the revised fourth draft, and became two blaster shots in the film.\nDuring the production of A New Hope, then called simply Star Wars, the Death Star hangar set was built on sound stage 3 of Elstree Studios in Borehamwood, England. The scene that TK-421 appeared in, scene number 81, was filmed sometime between May 19 and June 1, 1976. According to Bayley, he was selected on the day of filming when extras were needed to portray the two stormtroopers guarding the Millennium Falcon.\nThe stormtrooper whose armor Luke wore had the designation \"TX-four-one-two\" in the fourth draft dated January 15, 1976, and \"TX-421\" in the revised fourth draft shooting script dated March 15. The stormtrooper's designation changed again to \"THX 1138\" in the November 12 novelization by Alan Dean Foster as a reference to George Lucas and Walter Murch's 1971 film, THX 1138. In the French dub of A New Hope and the September 9, 2015 junior novelization A New Hope - The Film Novel by Lucile Galliot, his designation is instead T.K.F. 821.\nThe \"TK-421\" designation inspired the naming conventions used by the 501st Legion fan costuming organization that was founded in April 1997. Artist Chris Trevas painted \"The Folly of TK-421,\" which was featured and sold as a print at Celebration Anaheim, an official Star Wars convention held on April 16–19, 2015. It depicts Solo pressing his blaster to TK-421's unarmored armpit aboard the Millennium Falcon while Chewbacca disarms and grapples with TK-710 and Skywalker and Obi-Wan Kenobi observe the scene. Trevas said of his painting, \"It's a scene we only hear but never see in A New Hope. Luckily for Luke, TK-421 was well prepared with a belt comlink and grappling hook.\"\nAlthough two blaster shots are heard in the film, the precise events surrounding TK-421's fall vary across adaptations and descriptive materials. The canon continuity junior novelization A New Hope: The Princess, the Scoundrel, and the Farm Boy, written by Alexandra Bracken and published on September 22, 2015, describes Solo setting his blaster to stun before firing upon the scanning crew, then outdrawing the stormtroopers' attempts to draw their own blasters. Other canon young-readers books state or imply that TK-421 was knocked unconscious and omit Solo's blaster.\nIn 2017, the Star Wars: A New Hope junior novelization, which was written by Ryder Windham and published on May 4, the stormtroopers \"never knew what hit them\" when Solo shot them; it does not indicate their condition afterward. The short stories \"Of MSE-6 and Men\" by Glen Weldon and \"Bump\" by Ben Acker and Ben Blacker, which were published on October 3 in the anthology From a Certain Point of View, describe TK-421 as dead prior to the Death Star's destruction.\nStar Wars: Stormtroopers: Beyond the Armor, a reference book co-written by Ryder Windham and Adam Bray and published on October 24, 2017, states that the image \"The Folly of TK-421\" depicts \"the offscreen moment that Han Solo and Chewbacca kill the inept storm-troopers\" and that it \"restores a little of the 'scoundrel' persona in Han Solo.\" The stormtroopers were rendered unconscious by \"three muffled shots\" rather than two in The Odyssey of Star Wars: An Epic Poem, published September 28, 2021 and written by Jack Mitchell. This article has given precedence to A New Hope and materials that are consistent with its depiction of two blaster shots.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/TK-421",
  "/wiki/TK-421/Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/TK-421",
  "/wiki/0_BBY",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Alderaan_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Operating_number",
  "/wiki/Stormtrooper",
  "/wiki/Lasan",
  "/wiki/Battle_station",
  "/wiki/Sector_AA-345",
  "/wiki/Maintenance_Unit",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/MSE-6-G735Y",
  "/wiki/Coruscant",
  "/wiki/Droid",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Holorecorder",
  "/wiki/Helmet",
  "/wiki/Imperial_officer",
  "/wiki/Aqualeisure_unit",
  "/wiki/Wilhuff_Tarkin%27s_penthouse",
  "/wiki/TK-710",
  "/wiki/Millennium_Falcon",
  "/wiki/Docking_Bay_327",
  "/wiki/Death_Star",
  "/wiki/Captain",
  "/wiki/Han_Solo",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Death",
  "/wiki/Stormtrooper_armor",
  "/wiki/Luke_Skywalker",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Yavin",
  "/wiki/File:Of_MSE-6_That_Was_Quick_G7.ogg",
  "/wiki/Galactic_Civil_War",
  "/wiki/Planet",
  "/wiki/Siege_of_Lasan",
  "/wiki/Space_station",
  "/wiki/Imperial_Navy",
  "/wiki/The_galaxy",
  "/wiki/Capital",
  "/wiki/Kowakian_monkey-lizard",
  "/wiki/HypnoHypodermal_Injector_Needle_C-7R",
  "/wiki/IT-O_Interrogation_Unit",
  "/wiki/Interrogator_droid",
  "/wiki/Detention_Block_AA-23",
  "/wiki/Lieutenant",
  "/wiki/Blagg",
  "/wiki/Torture",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Prisoner",
  "/wiki/Battle_Station_Command",
  "/wiki/Alpha_One",
  "/wiki/Hologram",
  "/wiki/Officer",
  "/wiki/Sector_GM1-A",
  "/wiki/Imperial_Academy",
  "/wiki/Antibacterial_nanofoam",
  "/wiki/File:Of_MSE-6_Carpets_Matches_Quote.ogg",
  "/wiki/Armor",
  "/wiki/Coruscant_fiberweave",
  "/wiki/Veermok",
  "/wiki/Leather",
  "/wiki/Hunting",
  "/wiki/Homeworld",
  "/wiki/Eriadu",
  "/wiki/Joint_Chiefs",
  "/wiki/Imperial_Protocol_Alpha_One",
  "/wiki/Cycle",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Lambda_(security_level)",
  "/wiki/Beta_(security_level)",
  "/wiki/300_level",
  "/wiki/Imperial_Palace",
  "/wiki/Comlink",
  "/wiki/Light_freighter",
  "/wiki/Tractor_beam",
  "/wiki/Star_system",
  "/wiki/File:Solo-Hey_Down_There.ogg",
  "/wiki/Freighter",
  "/wiki/Scanning_crew_BT-445",
  "/wiki/Entry_ramp",
  "/wiki/Scanning_crew",
  "/wiki/Starship",
  "/wiki/Wookiee",
  "/wiki/Pilot",
  "/wiki/Chewbacca",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Pol_Treidum",
  "/wiki/Control_Room_327",
  "/wiki/Wanten",
  "/wiki/Superlaser",
  "/wiki/Overbridge",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Second",
  "/wiki/TK-450",
  "/wiki/Major_General",
  "/wiki/Cassio_Tagge",
  "/wiki/Standard_day",
  "/wiki/Blaster_rifle",
  "/wiki/Infantry",
  "/wiki/Color",
  "/wiki/Plastoid",
  "/wiki/Body_glove",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Thermal_detonator",
  "/wiki/Utility_belt",
  "/wiki/Tool_kit",
  "/wiki/Power_pack",
  "/wiki/Grappling_hook",
  "/wiki/Fibercord",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Stephen_Bayley",
  "/wiki/Annikin_Starkiller",
  "/wiki/The_Star_Wars:_Rough_Draft",
  "/wiki/George_Lucas",
  "/wiki/May",
  "/wiki/1974",
  "/wiki/August",
  "/wiki/1975",
  "/wiki/The_Star_Wars:_From_The_Adventures_of_Luke_Starkiller",
  "/wiki/Elstree_Studios",
  "/wiki/May_19",
  "/wiki/June_1",
  "/wiki/1976",
  "/wiki/January_15",
  "/wiki/March_15",
  "/wiki/November_12",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Alan_Dean_Foster",
  "/wiki/Walter_Murch",
  "/wiki/1971",
  "/wiki/September_9",
  "/wiki/2015",
  "/wiki/A_New_Hope_-_The_Film_Novel",
  "/wiki/Lucile_Galliot",
  "/wiki/501st_Legion_(fan_organization)",
  "/wiki/April",
  "/wiki/1997",
  "/wiki/Chris_Trevas",
  "/wiki/File:TheFollyOfTK421.jpg",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/April_16",
  "/wiki/April_19",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/Alexandra_Bracken",
  "/wiki/September_22",
  "/wiki/Stun",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/May_4",
  "/wiki/Of_MSE-6_and_Men",
  "/wiki/Glen_Weldon",
  "/wiki/Bump",
  "/wiki/Ben_Acker",
  "/wiki/Ben_Blacker",
  "/wiki/October_3",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars:_Stormtroopers:_Beyond_the_Armor",
  "/wiki/Ryder_Windham",
  "/wiki/Adam_Bray",
  "/wiki/October_24",
  "/wiki/2017",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/September_28",
  "/wiki/2021",
  "/wiki/Jack_Mitchell",
  "/wiki/Category:Audio_files_of_TK-421",
  "/wiki/Category:Images_of_TK-421",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Episode_IV:_A_New_Hope_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(Studio_Fun_International)",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/The_Rise_of_a_Hero",
  "/wiki/Star_Wars:_A_New_Hope_Cinestory_Comic",
  "/wiki/Trapped_in_the_Death_Star",
  "/wiki/5-Minute_Star_Wars_Stories_Strike_Back",
  "/wiki/5-Minute_Star_Wars_Stories_2",
  "/wiki/Star_Wars:_A_New_Hope_Graphic_Novel_Adaptation",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/William_Shakespeare%27s_Star_Wars:_Verily,_A_New_Hope",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Made_Easy",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/YT-1300_Millennium_Falcon_Owners%27_Workshop_Manual",
  "/wiki/Star_Wars_Insider:_The_Original_Trilogy",
  "/wiki/Star_Wars:_Who%27s_Who_in_the_Galaxy:_Character_Storybook",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/The_Rise_of_the_Rebellion_and_the_Battle_of_Yavin",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Centimeter",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Legends_of_the_Lasat",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Tarkin_(novel)",
  "/wiki/StarWars.com",
  "/wiki/June_30",
  "/wiki/2016",
  "/wiki/August_3",
  "/wiki/July_25",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/The_Art_of_Star_Wars_Episode_IV:_A_New_Hope",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/HarperCollins_Publishers",
  "/wiki/Abrams_Books"
 ]
}