{
 "name": "TK-5331",
 "display_name": "TK-5331",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Squad Five",
      "Squad Five"
     ]
    }
   ]
  }
 ],
 "content": "TK-5331 was the designation of a male stormtrooper stationed on the planet Lothal.\nFive years before the Battle of Yavin, TK-5331 served on the Outer Rim world of Lothal. Ranking as a stormtrooper, he served under Lieutenant Jenkes and was responsible for the operations of Squad Five. When the Trandoshan bounty hunter Bossk arrived on Lothal to collect the bounty on Gronson Takkaro at Ake's Tavern, Jenkes ordered TK-5331 to dispatch Squad Five to keep an eye on the bounty hunter. Jenkes, who had secretly hired bounty hunters to kill Bossk, ordered TK-5331 to use remotes to record the encounter. After Bossk defeated the bounty hunters and evaded Imperial capture with the help of Lothalite Ezra Bridger, Jenkes commanded TK-5331 to exterminate the pair for crimes against the Empire.\nTrained as a stormtrooper of the Galactic Empire, TK-5331 expressed obedience to Jenkes, never questioning his orders. When Squad Five failed to apprehend Bossk and Bridger, TK-5331 responded sheepishly to Jenkes's displeasure, but then confidently stated that the fugitives wouldn't be able to leave the spaceport.\nTK-5331 first appeared in Ezra's Gamble, a canon junior novel published in 2014 and written by Ryder Windham. In the novel, TK-5331 only appears in holographic form.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Squad_Five_(Lothal)",
  "/wiki/Operating_number",
  "/wiki/Stormtrooper",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Lieutenant",
  "/wiki/Jenkes",
  "/wiki/Trandoshan",
  "/wiki/Bounty_hunter",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Bounty",
  "/wiki/Gronson_Takkaro",
  "/wiki/Ake%27s_Tavern",
  "/wiki/Eye",
  "/wiki/Death",
  "/wiki/Remote",
  "/wiki/Ezra_Bridger",
  "/wiki/Spaceport",
  "/wiki/Ezra%27s_Gamble",
  "/wiki/2014",
  "/wiki/Ryder_Windham",
  "/wiki/Hologram",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded"
 ]
}