{
 "name": "TK-555",
 "display_name": "TK-555",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireStormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "TK-555 was a stormtrooper.\nTK-555 was personally responsible for counting and packaging Order 66 Cookies for Empire Day in 1 ABY. He was also visibly overweight, most likely as a result of abusing this position. At some point before Life Day in 1 ABY, he earned a favor from Watto, a junk dealer in Mos Espa.\nJust before the Life Day festivities in 1 ABY, a shipment of Life Day candy was stolen by Jawas while being transported to Saun Dann. TK-555 then took this candy from the Jawas, who believed him to be some sort of ghost, presumably due to his white armor, and transported it to the Mos Espa Podracer Cantina where he consumed large quantities of it.\nAn unidentified spacer, on an assignment from Saun Dann to track the candy, confronted TK-555 in the Mos Espa cantina. TK-555 was remorseful for having appropriated candy originally destined for poor children. In exchange for the spacer's agreement not to report the stormtrooper to his superiors, TK-555 offered to call in the favor he was owed by Watto to sell the spacer a Single Trooper Aerial Platform for a discounted price. The spacer took the deal, but also demanded that TK-555 donate 10,000 credits to the Mos Espa orphanage.\nDuring another Life Day event, a similar situation occurred to the prior event. That time, however, a spacer  decided against telling him off and instead told Saun Dann about what happened.\nFollowing this incident, TK-555 captivated the interest of the public, having a bobble head toy designed after him.\nTK-555 originally appeared as a non-interactive Non-Player Character  in the Empire Day celebration in Star Wars Galaxies in 2008. At that time, the game was understood to take place entirely in 1 ABY, therefore placing TK-555's Empire Day appearance in that timeframe. For the 2008 Life Day event, the developers decided to bring him back as he was popular with players. He made an appearance in following Life Day events, and was even added as a \"storyteller\" character for the 2010 event. This allowed players to include TK-555 in their player-made events for the duration of the Life Day festivities.\nHe also made appearances in successive Empire Day celebrations. During the Empire Day celebration in 2009, the developers introduced a bobblehead TK-555 for players who partake in the Star Wars Galaxies \"E-Mail Collection.\" The description alludes to both this and the status as a bobblehead doll by jokingly saying that TK-555's popularity had \"gone to his head.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Order_66_Cookie",
  "/wiki/Empire_Day/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Life_Day/Legends",
  "/wiki/Watto/Legends",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Saun_Dann",
  "/wiki/Force_ghost",
  "/wiki/Mos_Espa_Podracer_Cantina",
  "/wiki/Spacer/Legends",
  "/wiki/Single_Trooper_Aerial_Platform/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Mos_Espa_orphanage",
  "/wiki/2008",
  "/wiki/2010",
  "/wiki/2009",
  "/wiki/Sony"
 ]
}