{
 "name": "TK-710",
 "display_name": "TK-710",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "TK-710 was the designation of a human male stormtrooper who served the Galactic Empire during the Galactic Civil War. In the year 0 BBY, he was stationed aboard the first Death Star battle station when the YT-1300 light freighter Millennium Falcon was pulled in by the station's tractor beams. TK-710 and fellow stormtrooper TK-421 were posted to guard the ship's entrance in Docking Bay 327 while a scanning crew checked the interior of the vessel. The Falcon's crew ambushed the scanning crew and then impersonated them in order to lure TK-710 and TK-421 inside, incapacitating the stormtroopers and taking their armor.\nTK-710 was the designation of an Imperial stormtrooper during the Galactic Civil War. In the year 0 BBY, TK-710 served aboard the Empire's first Death Star battle station with a security level of zeta while it was in the Alderaan system to destroy the rebel-affiliated planet Alderaan as a display of Imperial might. Shortly after the planet's destruction, the YT-1300 light freighter known as the Millennium Falcon was pulled into Docking Bay 327 aboard the Death Star by tractor beams. After the freighter was searched by stormtroopers, Captain Edmos Khurgee, commander of the hangar, pulled back the remaining search teams and left TK-710 and TK-421 as a minimal guard at the entry ramp.\nA scanning crew was then sent aboard to scan the entire vessel for lifeforms; however, before they could begin, they were ambushed by the Falcon's captain, Han Solo, and his Wookiee co-pilot, Chewbacca. Solo then impersonated one of the crew and called down to TK-710 and TK-421, asking for them to help with some of the equipment. Having heard the scanning crew's bulky equipment drop to the ground when they were stunned, the two troopers were unsurprised by the call for aid and made their way up the freighter's boarding ramp. Upon seeing Solo and Chewbacca they quickly drew their weapons, but the Falcon's crew was faster, and the two troopers never knew what hit them. Chewbacca clasped TK-710 around the throat from behind while Solo managed to grab TK-421's arm and divert the trooper's shots above his head, simultaneously shooting the trooper at point-blank range through a joint in his armor.\nWith the two troopers knocked out, Solo then took TK-710's stormtrooper armor while his ally Luke Skywalker took TK-421's. Their disguises allowed the pair to sneak through the Death Star in a successful effort to rescue the imprisoned Princess Leia Organa of the Rebel Alliance.\nThe repair droid MSE-6-G735Y encountered the disguised pair during their journey through the Death Star and recognized the two troopers' armor, noting to itself that someone other than TK-421 was wearing his armor, but Chewbacca scared the droid away before it could act on the discovery. The Empire later became aware of what had happened to TK-710 and TK-421 after TK-421's corpse was discovered hidden in a crawl space.\nTK-710 was a human male. Han Solo was impressed by how quickly TK-710 reached for his gun on board the Millennium Falcon, although the trooper was still not fast enough to save himself. Upon donning TK-710's armor, Solo discovered that the helmet had an odor of bad breath, and he complained that it smelled as though the trooper had slept in it.\nTK-710 wore stormtrooper armor and carried an E-11 medium blaster rifle and an N-20 Baradium-core thermal detonator.\nTK-710 first appeared in the 1977 original trilogy film, Star Wars: Episode IV A New Hope. The character was played by an uncredited extra in a scene filmed at some point between May 19 and June 1, 1976 on sound stage 3 at Elstree Studios in Borehamwood, England. Stephen Bayley, who played TK-421, has said that he never knew the name of the extra playing TK-710 but described him as an older gentleman whom he suspected had passed away by 2016.\nThe stormtrooper's canon designation was revealed as TK-710 by the short story \"Of MSE-6 and Men,\" which was written by Glen Weldon as part of the anthology book From a Certain Point of View, published on October 3, 2017. In the 2015 Star Wars LINE Webtoon, written by Hong Jac Ga, TK-710 is referred to as \"TX-4120\"; however, LucasBooks executive editor Jennifer Heddle has stated that the comic series is ambiguously canon, so this article assumes that the designation used in From a Certain Point of View is correct. The Adventures of Luke Skywalker, Jedi Knight, a 2014 adaptation of A New Hope written by Tony DiTerlizzi, errorneously states that the stormtroopers knocked out by Skywalker and Solo had remained on the Millennium Falcon after it was searched rather then being called up by Solo as they are in the film.\nFor Star Wars Legends, the character first appeared in the 1976 novelization of A New Hope by Alan Dean Foster. The stormtrooper eventually received the designation TK-422 in Legends as part of the 1998 Special Edition Limited expansion set of the Star Wars Customizable Card Game. This designation was also used in canon in the English release of \"The Rise of the Rebellion and the Battle of Yavin,\" an entry in De Agostini's Star Wars Encyclopedia series that was originally released in Spanish on March 9, 2021. This article treats the narrative source \"Of MSE-6 and Men\" as accurate over the non-narrative \"The Rise of the Rebellion and the Battle of Yavin.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/TK-710",
  "/wiki/TK-422",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/File:Solo-Smelly_armor.ogg",
  "/wiki/Operating_number",
  "/wiki/Stormtrooper",
  "/wiki/Galactic_Civil_War",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Tractor_beam",
  "/wiki/TK-421",
  "/wiki/Light_freighter",
  "/wiki/Entry_ramp",
  "/wiki/Docking_Bay_327",
  "/wiki/Scanning_crew",
  "/wiki/Freighter",
  "/wiki/Stormtrooper_armor",
  "/wiki/File:Solo-Hey_Down_There.ogg",
  "/wiki/Alderaan_system",
  "/wiki/The_Disaster",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/Death_Star",
  "/wiki/Captain",
  "/wiki/Edmos_Khurgee",
  "/wiki/Commanding_officer",
  "/wiki/Han_Solo",
  "/wiki/Wookiee",
  "/wiki/Pilot",
  "/wiki/Chewbacca",
  "/wiki/Blaster",
  "/wiki/Limb",
  "/wiki/Armor",
  "/wiki/Luke_Skywalker",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Prisoner",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/MSE-6-G735Y",
  "/wiki/Repair_droid",
  "/wiki/Helmet",
  "/wiki/Sleep",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/N-20_Baradium-core_thermal_detonator",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/May_19",
  "/wiki/June_1",
  "/wiki/1976",
  "/wiki/Elstree_Studios",
  "/wiki/Stephen_Bayley",
  "/wiki/2016",
  "/wiki/Of_MSE-6_and_Men",
  "/wiki/Glen_Weldon",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/October_3",
  "/wiki/2017",
  "/wiki/2015",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Hong_Jac_Ga",
  "/wiki/LucasBooks",
  "/wiki/Jennifer_Heddle",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/2014",
  "/wiki/Tony_DiTerlizzi",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Alan_Dean_Foster",
  "/wiki/1998",
  "/wiki/Special_Edition_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/The_Rise_of_the_Rebellion_and_the_Battle_of_Yavin",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/March_9",
  "/wiki/2021",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/A_New_Hope_-_The_Film_Novel",
  "/wiki/Star_Wars:_A_New_Hope_Cinestory_Comic",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/The_Rise_of_a_Hero",
  "/wiki/Star_Wars:_A_New_Hope_(Disney_Die-Cut_Classics)",
  "/wiki/Episode_IV:_A_New_Hope_Read-Along_Storybook_and_CD",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Trapped_in_the_Death_Star",
  "/wiki/5-Minute_Star_Wars_Stories_Strike_Back",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Mission_to_Mos_Eisley_(episode)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Made_Easy",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/YT-1300_Millennium_Falcon_Owners%27_Workshop_Manual",
  "/wiki/Star_Wars:_Who%27s_Who_in_the_Galaxy:_Character_Storybook",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/Imperial_Troops",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Chris_Trevas",
  "/wiki/March_24",
  "/wiki/File:Chris_Trevas_Folly_of_TK-421.png",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/StarWars.com",
  "/wiki/File:LINE_Webtoon_Tweet.png"
 ]
}