{
 "name": "TK329",
 "display_name": "TK329",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 BBY",
      "Vector"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireStormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "TK329 was a male stormtrooper in the service of the Galactic Empire during the year 1 BBY. TK329 was being very open about his experiences with the Empire while he was perpetuating Imperial propaganda.\nTK329 was stationed on board the Star Destroyer Vector. At one point in his career, he was under the command of Commander Tallos, but sometimes joined Commander Gorrister and his squad during training activities. TK329 has a wife named Mera and a son named Gareth. When TK329 trained at the Academy of Carida, he finished at the top of his class. During his time at the academy, he became friends with a man named Davin. TK329 first encountered the Rebel Alliance when a group of them ambushed his squad on a peacekeeping mission to the planet Ryloth.\nDuring TK329's service aboard the Vector, he and the rest of the crew had some R\u0026R while a small team was deployed planetside on Meglumine. After their stop, TK329 started hearing rumors that a group of troops had mishandled special cargo and some of it got contaminated. After that they had problems with the engines. The crew had to switch to backup power twice in three days to keep the engines going. The engines eventually stalled and the communications malfunctioned. Suddenly, a lot more men than usual were checking in to the sickbays. The infection started to show as the training sessions were canceled because there were not enough participants. TK329 got checked out at the infirmary and saw that the earliest victims of the illness did not make it. The death toll numbered in the hundreds. The effects of the illness were horrific. The Vector lost all power and had to rely on the back-up generators for the most minimal of life support. The troopers that hadn't been infected were talking about making an escape. The halls were stained with blood, and decay filled the air. TK329 sent a message to his wife and child, telling them he was sorry and he loved them. Commander Gorrister and his team planned an escape, and TK329 decided to go with them. He finally started to feel the death coursing through his body. He knew his time would come sooner or later. As TK329 died, he sent a final message implying that he was witnessing a reanimation caused by the virus, but was unable to finish the message before succumbing to his sickness.\nTK329 thought that the BlasTech E-11 blaster rifle was one of the best weapons on the market. TK329 thought that the Vector was a marvel of engineering and that one did not know the size of a vessel until one was forced to run the length of the halls for morning drills. He also thought that stormtroopers were better than clones because they had to fight and train their whole lives for the opportunity to serve. TK329 believed that the Rebel way was one of cowardice and selfishness and that they would not rest until the galaxy was torn apart in civil unrest. TK329 said that to be in the 501st Legion, you should think yourself lucky. TK329 eventually wished to finish his service and become one of the Emperor's Royal Guards. He also wished that his son would follow in his footsteps. TK329 expressed that even the weak could be of use to the Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Vector_(Star_Destroyer)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Tallos",
  "/wiki/Gorrister",
  "/wiki/Mera",
  "/wiki/Gareth_(TK329%27s_son)",
  "/wiki/Academy_of_Carida",
  "/wiki/Davin_(Human)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Meglumine",
  "/wiki/Life_support/Legends",
  "/wiki/BlasTech_Industries/Legends",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Stormtrooper_TK_329_(TK329)_on_Twitter",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}