{
 "name": "Tlinetha",
 "display_name": "Tlinetha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Balosar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Lavender"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Lavender"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Oyu'baat"
     ]
    }
   ]
  }
 ],
 "content": "Tlinetha was a female Balosar who worked as a barmaid in the Oyu'baat tapcafe in the city Keldabe on the planet Mandalore during the early years of the Galactic Empire. Tlinetha was also an associate of Tyno Fabris, an Arkanian Black Sun lieutenant. In about 18 BBY, Tlinetha acted as a go-between while the Jedi Knight Jax Pavan engaged in dealings with Fabris to obtain details of the location of the captured resistance leader Thi Xon Yimmon. Tlinetha took a liking to Pavan and she attempted to flirt with him on a number of occasions, but he rejected her advances.\nA female Balosar, Tlinetha lived during the early years of the Galactic Empire's reign. She made a living working as a waitress in the Oyu'baat tapcaf, the oldest cantina on the Outer Rim world of Mandalore, located in the planet's capital city of Keldabe. Tlinetha became an associate of Tyno Fabris, an Arkanian lieutenant in service to the Black Sun Vigo Xizor, who frequented the Oyu'baat. Around 18 BBY, she was commissioned as a paid intermediate between Fabris and the undercover Jedi Knight-in-hiding Jax Pavan, while the later dealt with the Black Sun lieutenant in search of information on the location of the captured Whiplash resistance leader, Thi Xon Yimmon. During this time, Tlinetha attempted to flirt with Pavan, but her efforts were rebuked.\nTlinetha was a slender Balosar female, with lavender-colored eyes and hair, the latter of which was intricately braided. She was taller than average for a Balosar, possessed of pale skin and a sultry, velvety voice. Tlinetha was kind to her customers, and openly flirtatious; she took a liking to the Jedi Jax Pavan during his first visit to the Oyu'baat and attempted to flirt with him on a number of occasions, but her advances were repeatedly turned down.\nTlinetha first appeared in Star Wars canon in the novel The Last Jedi, co-written by authors Michael Reaves and Maya Kaathryn Bohnhoff, and published February 26, 2013.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Balosar_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Oyu%27baat",
  "/wiki/Waiter/Legends",
  "/wiki/Tapcafe/Legends",
  "/wiki/City/Legends",
  "/wiki/Keldabe/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Tyno_Fabris",
  "/wiki/Arkanian/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jax_Pavan",
  "/wiki/Thi_Xon_Yimmon",
  "/wiki/Cantina/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Vigo/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star/Legends",
  "/wiki/Whiplash",
  "/wiki/Time/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/The_Last_Jedi_(novel)",
  "/wiki/Author/Legends",
  "/wiki/Michael_Reaves",
  "/wiki/Maya_Kaathryn_Bohnhoff",
  "/wiki/February_26",
  "/wiki/2013",
  "/wiki/Imperial_Commando:_501st",
  "/wiki/The_Essential_Atlas"
 ]
}