{
 "name": "To-yel",
 "display_name": "To-yel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey fur"
     ]
    }
   ]
  }
 ],
 "content": "To-yel was a Gotal male who lived on the TransGalMeg Industries, Incorporated-owned planet Narg in the Rayter sector. Unlike most non-Humans on Narg, he was content with his lot. He was a regular at the Free Access Grill in Grig City, where he spent most of his time carving wooden figurines. To-yel was in Grig City during the Rebel mission to rescue the kidnapped Shashay musician Crying Dawn Singer.\nUnlike most young Gotals, To-yel had difficulty learning to sort through the wealth of sensations flooding his energy-sensitive head cones. Unable to tune out extraneous energy emissions, he felt constantly overwhelmed with useless information about his environment.\nOnce he found his way to the planet Narg, he discovered that the relatively undeveloped planet had the lowest electromagnetic noise levels of any other planet he had visited. He settled on Narg permanently, considering it a peaceful, quiet paradise. The cheerful Gotal became a regular customer at the Free Access Grill in Grig City, the only restaurant on the planet which catered to non-Human customers. To-yel spent much of his time sitting at a table in the restaurant and carving wooden figurines. His contented attitude contrasted with most of the other non-Humans in the Free Access Grill and elsewhere on Narg, who suffered under the pro-Human, anti-\"alien\" biases of the TransGalMeg corporate administration which ran Narg.\nTo-yel was in Grig City when a group of Rebel operatives, including Maytoc Kollene, arrived to rescue the kidnapped Shashay musician Crying Dawn Singer from TransGalMeg executive Braig Farool.\nWhile on Narg, To-yel was a cheerful individual who managed to appear friendly despite his heavy brows and protruding head cones. He rarely spoke, and when he did he delivered only a few words in the flat monotone typical of Gotals. He dressed simply, wearing only a gray kilt.\nLike all Gotals, To-yel's electromagnetically-sensitive head cones gave him quick reactions, the ability to sense the emotional state of other beings, and enhanced tracking skills. Indeed, To-yel was perceptive and sensitive even by Gotal standards, with particular skill at gambling, bargaining in the marketplace, and moving about unnoticed. To-yel was also a fairly talented woodcarver, and had some rudimentary skill with a blaster.\nTo-yel is a non-player character appearing in The Abduction, a 1992 Star Wars: The Roleplaying Game adventure written by Chuck Truett and published by West End Games. To-yel is one of several characters the players, in their role as Rebel operatives investigating the abduction of Crying Dawn Singer, may encounter if they visit the Free Access Grill. No specific information on how To-yel may help or hinder the Rebels in their mission is given.\nThe name \"To-yel\" is given as an example of a typical Gotal name in Ultimate Alien Anthology, a supplement for the Star Wars Roleplaying Game published in 2003 by Wizards of the Coast.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/TransGalMeg_Industries,_Incorporated",
  "/wiki/Planet/Legends",
  "/wiki/Narg",
  "/wiki/Rayter_sector/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Human/Legends",
  "/wiki/Free_Access_Grill",
  "/wiki/Grig",
  "/wiki/City/Legends",
  "/wiki/Wood/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Shashay",
  "/wiki/Musician/Legends",
  "/wiki/Crying_Dawn_Singer",
  "/wiki/Maytoc_Kollene",
  "/wiki/Braig_Farool",
  "/wiki/Gambling/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/The_Abduction",
  "/wiki/1992",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Chuck_Truett",
  "/wiki/West_End_Games",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/2003",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Classic_Adventures",
  "/wiki/Galaxy_Guide_4:_Alien_Races_(Second_Edition)"
 ]
}