{
 "name": "Tobar_Ka-Teen",
 "display_name": "Tobar Ka-Teen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tobar Ka-Teen was an Ithorian male Jedi Master who served the Jedi Order and the Galactic Republic during the Clone Wars. Shortly after being named a Jedi Master, Ka-Teen was captured by the Black Sun bounty hunter Kallyx the Piner, and was tortured for weeks. During that time, Master Ka-Teen created a complex web of deception and successfully lied, something Ka-Teen thought he would not ever do. Eventually, Ka-Teen was rescued by his Jedi companions, and became reclusive.\nDuring his time in the Jedi Temple on Coruscant, Master Ka-Teen became interested in the Crown of Verity, an artifact that could detect any lie and conversely force its user to always tell the truth. While the crown was in his possession during the Clone Wars, Ka-Teen felt a vergence on the planet Auratera. Although Ka-Teen was not a Jedi General, several squads of clone troopers accompanied him. At that time, Order 66 was implemented against the Jedi Order, and Ka-Teen was presumed killed, with no reason that he survived. Despite this, the clone troopers that accompanied him never returned.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tobar_Ka-Teen",
  "/wiki/Tobar_Ka-Teen/Legends",
  "/wiki/Ithorian",
  "/wiki/Gender",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Black_Sun",
  "/wiki/Bounty_hunter",
  "/wiki/Standard_week",
  "/wiki/Time",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Cloning",
  "/wiki/Vergence",
  "/wiki/Planet",
  "/wiki/Auratera",
  "/wiki/Jedi_General",
  "/wiki/Squad",
  "/wiki/Clone_trooper",
  "/wiki/Order_66",
  "/wiki/Death",
  "/wiki/Trooper",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Tobar_Ka-Teen",
  "/wiki/Nexus_of_Power"
 ]
}