{
 "name": "Tobias_Beckett",
 "display_name": "Tobias Beckett",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Glee Anselm"
     ]
    },
    {
     "name": "Died",
     "values": [
      "10 BBY",
      "Savareen"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.78 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Crimson Dawn",
      "Beckett's gang",
      "Beckett's gang"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Han Solo"
     ]
    }
   ]
  }
 ],
 "content": "Tobias Beckett was a human male professional thief and gunslinger who worked for the Crimson Dawn crime syndicate during the early reign of the Galactic Empire. A native of Glee Anselm, Beckett organized a crew to help with his heist missions. Although he became a mentor to Han Solo, a young mudtrooper who joined Beckett's group, Beckett was a survivor who quietly worked out angles that enabled him to come out ahead. He made use of many blasters, including the RSKF-44 heavy blaster and DG-29 heavy blaster pistol. He also owned a DL-44 heavy blaster pistol before he gave it to Solo.\nTobias Beckett was born on the planet Glee Anselm. At some point before 10 BBY, he met the bounty hunter Aurra Sing and pushed her to her death. Sing's death was later recalled by Beckett while talking with Lando Calrissian, though Beckett claimed that he just pushed Sing and that it was the fall that killed her.\nVal found the logbook that would become known as the Smuggler's Guide previously owned by Qi'ra in the crate the gang stole from the freight platform in Zarra on Cato Neimoidia. After spending a brief time investigating on the planet Cato Neimoidia, Beckett and his gang formulated a plan to rob a Railcrawler conveyex suspected of carrying Crimson Dawn cargo. The plan involved intercepting the conveyex before it reached Tarko-se.\nBeckett and his gang went to Hovun IV on a mission for Crimson Dawn. There, Beckett, posing as a death priest, pretended to Force choke Rio Durant in order to scare several sabacc players away from Durant's game. After the players left, Beckett congratulated Durant on pulling off the trick. Beckett asked Val if she placed the tracker on Dvorad, and she said she did. Beckett and his gang went to the dock to find Dvorad in order to steal identichips. Beckett was able to jump onto Dvorad's speeder, punched him, and made it to Dvorad's ship.\nBeckett and his gang were held at gunpoint by Dvorad and his ship until a creature attacked. As his gang and Dvorad fought the creature, Beckett boarded the ship and fought his way past Dvorad's guards. Aboard, Beckett was able to find the the chips and make his way back to Val and Durant in order to make their escape before the creature pulled Dvorad's ship into the depths. As they left, Beckett shot down Durant's idea about keeping some of the chips for themselves instead of giving all of them to Crimson Dawn's leader, Dryden Vos. Beckett then summoned the Rampart and left Hovun IV.\nAs the Rampart made its way to Munt Ontdal, Beckett tried to think of a way to leave Crimson Dawn. After landing on Munt Ontdal, Beckett took his speeder to meet with Vos. However, he came under attack by several knife-wielding thieves. Beckett, seeing it as as a setup, tried to escape but was knocked out by Enfys Nest, leader of the Cloud-Riders. Despite knowing Vos would arrive shortly, Beckett was told by Val that Nest faked the mission. Beckett, to prevent Nest from getting the chips, blew them and the Rampart up. Despite wanting to finish Nest off, Beckett was convinced to let them go for the day. As Beckett and his gang were confronted by several stormtroopers, he lied to them by saying that the explosion was caused by black market radioactive fuel. Beckett, Val, and Durant then decided to resume their death priest scheme.\nSometime later, Beckett, Durant, and his lover Val, traveled to Mimban, where the Galactic Empire was engaged in a campaign with the Mimbanese Liberation Army. Beckett disguised himself as a captain of the Imperial Army while the others disguised themselves as troopers. At some point during a battle, Beckett asked who was in charge, since their commanding officer had recently perished. Han Solo, a mudtrooper with the 224th Imperial Armored Division, informed Beckett that he was in fact the ranking officer, which amused his cohorts. Beckett led the Imperials successfully through the battle.\nLater, while observing an AT-hauler, he was approached by the young Solo, who wanted to join their crew. However, when Solo pressed the point by threatening to expose Beckett as an impostor, Beckett used his phony rank to have Solo locked up for desertion. Solo was put in a chamber, where he was to be fed to the Wookiee Chewbacca. Solo ultimately was able to escape with Chewbacca. Beckett left with his crew, stealing the AT-hauler they observed earlier, but while in mid-takeoff they found Solo and Chewbacca running towards them, waving for them to let them onto the ship. Beckett ordered Durant to lower the hauler to let Solo and Chewbacca board.\nBeckett was instructed to retrieve a crate of coaxium from a 20-T Railcrawler conveyex transport on the planet Vandor; he went on this mission with Val, Durant, Solo and Chewbacca.\nUpon arriving at Vandor, the crew ate dinner over a campfire and had a brief conversation about Solo's and Chewbacca's motivation for participating in the mission. Solo simply stated that there was someone he left on Corellia and that he wanted to return there to free her from her horrible life there. Val stated that everyone needed someone, even Beckett. Beckett began deconstructing one of his blasters and chucked it to Solo.\nIn the morning, Beckett, Val and Solo observed the transport carrying the coaxium as well as some patrolling viper droids, while discussing the plan for the heist. The conveyex was moving towards a bridge over a ravine. The plan was for Val to place explosives on the supports of the bridge. The other members of the crew were to board the conveyex and attach cables from the carriage which contained the coaxium to their ship. Then, as the conveyex neared the bridge, Val was to destroy the bridge while the crew disconnected the coaxium carriage from the rest of the conveyex, allowing the ship to lift the target carriage away while the rest of the conveyex fell to the bottom of the ravine. Val noted that if the viper droids were alerted, the heist would become much more difficult, prompting Solo to also survey the viper droids.\nSoon the heist began. Val went further up the track to place thermal detonators, Durant flew their ship over the transport, and Beckett, Solo and Chewbacca leapt aboard the transport. They opened up a hatch and gazed upon the coaxium inside, enough to power a whole fleet. A fight ensued with range troopers aboard the transport, but Chewbacca disconnected the troopers' portion of the conveyex, leaving them behind as the rest of the conveyex moved onwards. The crew then connected four cables from their ship to the last carriage of the conveyex in order to lift it.\nThe heist did not proceed smoothly, however, as Val spotted the Cloud-Riders, led by Nest, moving towards the conveyex. One Cloud-Rider boarded the crew's ship and had a brief firefight with Durant, who was gravely injured, diminishing his ability to pilot the ship. Val was surrounded by a swarm of viper droids. She told Beckett over the comm how much she loved him, and detonated the explosives while still near them. Solo took Durant's place as pilot and tried carrying the shipment with only one cable attached to the carriage. Nest and the Cloud-Riders had cut off the other three and replaced them with their own. Shortly, Durant perished too.\nChewbacca uncoupled the carriage from the others so that they could lift the shipment off the tracks. Solo and the Cloud-Riders had to eventually lift the shipment, for they were running out of track. Both tried to take the shipment with them but failed as they were both pulling opposite directions. As both Solo and the Cloud-Riders neared a mountain, Solo detached the shipment of coaxium, fearing a crash. The Cloud-Riders did so as well. The coaxium was lost. After they landed, Beckett made tombstones in remembrance of his fallen comrades.\nHe reported to Vos and was able to avoid execution by promising to retrieve unrefined coaxium from Kessel. Beckett had to make room for Qi'ra on his crew in accordance with Vos' wishes.\nTaken to Kessel by Calrissian and L3-37 on the Millennium Falcon, Beckett, posing as a guard named Tuul, successfully obtained the necessary amount of coaxium and traveled with his accomplices to Savareen so the unstable material could be refined and they could rendezvous with Vos. During the mission, Beckett posed as a guard for Qi'ra, directing the fake captives, Solo and Chewie, out of the Falcon. He later followed Qi'ra, L3, Quay Tolsite, a Pyke who administered the Pyke Syndicate's operations on Kessel, and his guards. While Qi'ra went into another room to negotiate with Tolsite, Beckett took out the guards, then watched Qi'ra fight Tolsite.\nAfter a moment of unnerving silence from the room, he opened the door, only to be astonished to see Tolsite lying on the floor with Qi'ra walking out of the room telling him that Vos had taught her Teräs Käsi. Once they got to the consoles to help Solo get to the vault of coaxium, L3 freed some slave droids, who also freed the other slaves in the mine. The slaves rebelled against the guards, allowing Beckett and the others to escape aboard the Millennium Falcon.\nOn Savareen, Beckett showed his true colors to Solo, Qi'ra, and Chewbacca. After Solo had told Beckett their plan, Beckett reported to Vos. When they met Vos, Vos surprised the team by announcing that the coaxium was fake, which he knew because of his \"inside man,\" whom Solo assumed to be Qi'ra but was indeed Beckett. He had informed Vos of Solo's plan to sell the real shipment to the Cloud-Riders, a rebellion group led by Nest. Solo announced that he anticipated Beckett's deception—the coaxium they were holding was real.\nBeckett betrayed the three and abandoned Vos. He attempted to take the coaxium for himself, but as he explained his motives, he was shot by Solo. Before passing away, Beckett praised Solo for his actions in addition to revealing that he actually planned to return to Glee Anselm and learn to play the valachord.\nImmediately after Solo left the First Light, before he killed Beckett, Qi'ra reported Vos' death to Maul, the Zabrak former Sith Lord who led Crimson Dawn from behind the shadows, and blamed Beckett for Vos' death, unaware that Beckett had been killed by the man she loved. Enraged, before ordering her to go to Dathomir so they could work more closely, Maul promised that he would think what to do with the traitorous Beckett, unaware that Beckett was no longer alive.\nAfter reuniting with Calrissian and winning the Millennium Falcon as his own in a game of sabacc, Solo recalled Beckett having spoken about a job for a big-shot gangster on Tatooine. For the next several years, Solo and Chewbacca found themselves in the employ of that gangster, Jabba Desilijic Tiure of the Hutt Clan, though Solo never forgot the lessons and betrayals of his late mentor. Memories of their final encounter on Savareen in particular came back to Solo during a job on Corellia, when he encountered a man who claimed to be his father. Now knowing that trust was a valuable commodity, Solo remained wary of the man's intentions.\nTobias Beckett appears in the 2018 Star Wars Anthology film Solo: A Star Wars Story, portrayed by Woody Harrelson. Early fan speculation was that Harrelson would be playing Garris Shrike—Han Solo's mentor in the Star Wars Legends continuity who first appeared in A. C. Crispin's The Han Solo Trilogy book series—but this was disproved when Harrelson revealed Beckett's name on The Tonight Show Starring Jimmy Fallon.\nAccording to screenwriters Lawrence Kasdan and Jon Kasdan, Beckett is based on Long John Silver, the main antagonist of Robert Louis Stevenson's 1883 novel Treasure Island. Beckett's later betrayal was meant to rhyme the moment of 1977 original trilogy film Star Wars: Episode IV A New Hope in which Han Solo returns during the Battle of Yavin to aid Luke Skywalker in destroying the Death Star, as in both movies, the cynical and older character reluctantly departs and then suddenly returns, though in Beckett's case, it was for betrayal rather than for heroic nature.\nThroughout the production of Solo, Beckett's first name was Mattias, as reflected in early printings of The Art of Solo: A Star Wars Story. However, the character's name was changed to Tobias late in production; this was corrected for more recent printings of The Art of Solo: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Special:Upload",
  "/wiki/Glee_Anselm",
  "/wiki/10_BBY",
  "/wiki/Savareen",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Crimson_Dawn",
  "/wiki/Beckett%27s_gang",
  "/wiki/Han_Solo",
  "/wiki/Thief",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Homeworld",
  "/wiki/Swamp_trooper",
  "/wiki/RSKF-44_heavy_blaster",
  "/wiki/DG-29_heavy_blaster_pistol",
  "/wiki/DL-44_heavy_blaster_pistol",
  "/wiki/Han%27s_heavy_blaster_pistol",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Aurra_Sing",
  "/wiki/Death",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Val",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Qi%27ra",
  "/wiki/Zarra",
  "/wiki/Cato_Neimoidia",
  "/wiki/20-T_Railcrawler_conveyex_transport",
  "/wiki/Tarko-se",
  "/wiki/Hovun_IV",
  "/wiki/Death_priest",
  "/wiki/Force_choke",
  "/wiki/Rio_Durant",
  "/wiki/Sabacc",
  "/wiki/Dvorad",
  "/wiki/Heist_on_Hovun_IV",
  "/wiki/Identichip",
  "/wiki/Dvorad%27s_speeder",
  "/wiki/Dvorad%27s_ship",
  "/wiki/Starship",
  "/wiki/Unidentified_creature_(Hovun_IV)",
  "/wiki/Dryden_Vos",
  "/wiki/Rampart_(Tobias_Beckett)",
  "/wiki/Munt_Ontdal",
  "/wiki/Speeder",
  "/wiki/Knife",
  "/wiki/Enfys_Nest",
  "/wiki/Cloud-Riders",
  "/wiki/Standard_day",
  "/wiki/Stormtrooper",
  "/wiki/Black_market",
  "/wiki/Fuel",
  "/wiki/Priest",
  "/wiki/Mimban",
  "/wiki/Mimban_Campaign",
  "/wiki/Mimbanese_Liberation_Army",
  "/wiki/Captain",
  "/wiki/Imperial_Army",
  "/wiki/Staz",
  "/wiki/Commanding_officer",
  "/wiki/224th_Imperial_Armored_Division",
  "/wiki/Officer",
  "/wiki/Y-45_armored_transport_hauler",
  "/wiki/Prisoner",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Coaxium",
  "/wiki/Vandor",
  "/wiki/Heist_on_Vandor",
  "/wiki/Foodstuff",
  "/wiki/Corellia",
  "/wiki/Blaster",
  "/wiki/Transport",
  "/wiki/11-3K_viper_probe_droid",
  "/wiki/ICC-5537",
  "/wiki/Train",
  "/wiki/Viper_probe_droid",
  "/wiki/Probe_droid",
  "/wiki/Thermal_detonator",
  "/wiki/Fleet",
  "/wiki/Range_trooper",
  "/wiki/Trooper",
  "/wiki/Pilot",
  "/wiki/Mountain",
  "/wiki/Kessel",
  "/wiki/L3-37",
  "/wiki/Millennium_Falcon",
  "/wiki/Raid_on_Kessel",
  "/wiki/Quay_Tolsite",
  "/wiki/Pyke",
  "/wiki/Pyke_Syndicate",
  "/wiki/Spice_mines_of_Kessel",
  "/wiki/Ter%C3%A4s_K%C3%A4si",
  "/wiki/Slavery",
  "/wiki/Droid",
  "/wiki/Mining",
  "/wiki/Valachord",
  "/wiki/Maul",
  "/wiki/Zabrak",
  "/wiki/Sith_Lord",
  "/wiki/Dathomir",
  "/wiki/Tatooine",
  "/wiki/Standard_year",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt_Clan",
  "/wiki/Heist_on_Corellia",
  "/wiki/Ovan",
  "/wiki/Parent",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Woody_Harrelson",
  "/wiki/Garris_Shrike",
  "/wiki/Star_Wars_Legends",
  "/wiki/A._C._Crispin",
  "/wiki/The_Han_Solo_Trilogy",
  "/wiki/Lawrence_Kasdan",
  "/wiki/Jon_Kasdan",
  "/wiki/1800s#1883",
  "/wiki/1977",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Battle_of_Yavin",
  "/wiki/Luke_Skywalker",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_Credits",
  "/wiki/Star_Wars_Adventures_(2020)_4",
  "/wiki/Beckett_1",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Read-Along_Storybook_and_CD",
  "/wiki/Solo:_A_Star_Wars_Story:_Meet_the_Crew",
  "/wiki/Solo:_A_Star_Wars_Story:_Train_Heist",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_1",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_4",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_5",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/Han_Solo_%26_Chewbacca_2",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_3",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Tobias_Beckett",
  "/wiki/Category:Images_of_Tobias_Beckett",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Solo:_A_Star_Wars_Story:_Han_on_the_Run",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Lando%27s_Millennium_Falcon_Expansion_Pack",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/StarWarsKids.com",
  "/wiki/Gadgets_and_Gear",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_30",
  "/wiki/Starfighter_Aces",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2021",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Han_Solo_(Star_Wars_Encyclopedia)",
  "/wiki/Blasters_and_Ranged_Weapons",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Star_Wars:_The_Secrets_of_the_Bounty_Hunters",
  "/wiki/Databank_(website)",
  "/wiki/March_22",
  "/wiki/2017",
  "/wiki/February_16",
  "/wiki/2022",
  "/wiki/March_23",
  "/wiki/May_27",
  "/wiki/2020",
  "/wiki/February_9",
  "/wiki/Phil_Szostak"
 ]
}