{
 "name": "Tohna",
 "display_name": "Tohna",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "61st Mobile Infantry",
      "61st Mobile Infantry"
     ]
    }
   ]
  }
 ],
 "content": "Tohna was a male human who served as a commander in the Rebel Alliance's 61st Mobile Infantry, better known as Twilight Company, during the Galactic Civil War. His starship was the Braha'tok-class gunship Apailana's Promise, which escorted the company's CR90 corvette the Thunderstrike.\nIn 3 ABY, Tohna was transferred to the Thunderstrike following the deaths of their top officers in an infiltration of the corvette. Tohna and the crew of the Apailana's Promise devised the insertion of Twilight Company onto the planet Mardona III and the commander continued to serve on the Thunderstrike until it was shot down on the planet Sullust.\nAfter being rescued from the wreckage of the corvette, Tohna and the surviving bridge crew helped the company's soldiers as they defended the Inyusu Tor mineral processing facility from Imperial forces. Following the battle, the commander gave a eulogy for the Thunderstrike while one of its laser cannon plasma cells was drained and later played a game of Sabacc with soldiers of the company.\nA former helmsman, Tohna joined the Rebel Alliance against the Galactic Empire by the time of the Galactic Civil War. He served as a commander aboard the Apailana's Promise, a Braha'tok-class gunship serving the 61st Mobile Infantry, better known as Twilight Company, as escort to its CR90 corvette the Thunderstrike. In 3 ABY, Imperial spies infiltrated the Thunderstrike and killed the senior officers onboard. Due to the heavy losses of high ranking individuals in Twilight Company, First Sergeant Hazram Namir established himself as the tentative leader, replacing the late Captain Micha Evon, and Tohna was transferred to the Thunderstrike to take control of the bridge crew.\nTwilight Company soon began Operation Ringbreaker, a campaign devised by the Imperial defector Everi Chalis which sought to stoke redeployments from the Kuat Drive Yards, weakening its defenses for a projected attack by the company. Tohna and the crew of the Apailana's Promise planned the insertion onto Operation Ringbreakers first target, the warehouse planet Mardona III. This plan involved the Thunderstrike and Promise making a rapid descent towards the planet to deploy their dropships with the troops while under the beneath the planets satellites and out of the range of the continental cannons.\nDuring the descent towards Mardona III, Namir requested assurance from Tohna that the deployment was going to plan. The commander replied enthusiastically, comparing the descending vessels to seahawks diving for their prey. The attack on the warehouse world was ultimately successful and the and in the following weeks, Twilight Company attacked numerous more soft Imperial targets along the Rimma Trade Route, leaving only the planets Sullust and Malastare left before the Kuat Drive Yards.\nThe officers of Twilight Company could not agree on how to drop their troops on Sullust, only coming to terms with the fact that the defensive turrets were too formidable to take head on. Tohna, though, devised a plan for the Thunderstrike to jump in much closer to the planet and jump out once the dropships had gone down with the troops. Namir, considered by others to be the new captain, worried that a miscalculation would crash the Thunderstrike into Sullust at lightspeed and that the first wave of troops would not have time to take a beachhead on Sullust. The assumed captain approved it regardless, seeing no better options for Twilight Company. Tohna's plan was successful and the dropships delivered the troops down to take the Inyusu Tor mineral processing facility.\nPer Tohna's plan, Thunderstrike and Apailana's Promise jumped out of hyperspace half a million kilometers from Sullusts surface, almost being ripped apart by the clench of the planets gravity. After the company was deployed, Namir, who went with the ground troops, gave the company twenty-four hours to take the Inyusu Tor facility, of which they captured it in twelve. They spent the next twelve-hours patrolling the facility until the Thunderstrike and Promise returned.\nHowever, once the Thunderstrike and Apailana's Promise reached atmosphere, the TIE/IN interceptors of Vixus Squadron appeared from behind Sullust's moon and began attacking the two ships. Tohna had the corvette fly in low under the cover of the Promise and its X-wings. As the TIE presence became overwhelming, the crew of the Apailana's Promise reported that the two vessels had been ambushed, and Namir ordered the Thunderstrike to pull out. Despite this, the corvette crashed onto the surface of Sullust, with the Promise and its X-wings fleeing the system, leaving the Twilight Company troops stranded at the facility.\nTohna survived the crash, and Namir led a team to search the wreckage of the Thunderstrike to rescue the survivors. Namir pulled Tohna out of the wreckage and carried him back to the rest of Twilight Company at the Inyusu Tor facility. The company then prepared for an imminent assault from the massing Imperial forces down the valley. When the Imperial II-class Star Destroyer Herald arrived, the Imperial ground forces attacked the facility.\nDuring the battle, Tohna reorganized the bridge crew into runners to take supplies, like fresh water and blaster power packs, to the soldiers at the defensive lines, bearing boasts, jokes and challenges from team to team to create competition between soldiers where necessary. The Apailana's Promise soon returned and divert the Herald's firepower from targeting Namir's defenses. Chalis later fled Inyusu Tor during the battle, and allowed herself to be captured by the Herald. There, she detonated twenty ion bombs causing a power surge the Herald and forcing its withdrawal from Sullust.\nWith the Herald having retreated, the Imperial ground forces left to be defeated alone. After the battle, Tohna and many others scavenged the wreckage of the Thunderstrike and as Quartermaster Hober drained one of its laser cannon plasma cells, Tohna gave out a short eulogy for the vessel which prompted the soldiers to cheer. That evening the commander and three other Twilight Company soldiers, Gadren, Brand and Twitch, found a deck of cards and began a game of Sabacc. Tohna invited Namir to join them but the assumed captain declined, with Brand revealing that the man did not know how to play the card game.\nTohna was a human male who had a short and muscular impression on Hazram Namir. He was transferred to the Thunderstrike with high praise from his fellow officers aboard the Apailana's Promise. During the insertion of Twilight Company onto Mardona III, Tohna called over his comm when comparing the vessels to laughing seahawks diving for prey. Namir also heard his cheers through the comm during their arrival at Sullust. During the Siege of Inyusu Tor, Tohna organized the bridge crew into runners and bore jokes, boasts and challenges between teams to encourage ad hoc soldier to soldier competition. The commander remarked about the Thunderstrike to prompt cheers from the Twilight soldiers when one of the corvette's plasma cell was drained.\nTohna appeared in the 2015 canon novel Battlefront: Twilight Company, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Commander",
  "/wiki/Company",
  "/wiki/Galactic_Civil_War",
  "/wiki/Starship",
  "/wiki/Braha%27tok-class_gunship",
  "/wiki/Apailana%27s_Promise",
  "/wiki/CR90_corvette",
  "/wiki/Thunderstrike",
  "/wiki/3_ABY",
  "/wiki/Death",
  "/wiki/Infiltration_of_the_Thunderstrike",
  "/wiki/Corvette",
  "/wiki/Planet",
  "/wiki/Mardona_III",
  "/wiki/Sullust",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/Inyusu_Tor_mineral_processing_facility",
  "/wiki/Laser_cannon",
  "/wiki/Plasma_cell",
  "/wiki/Sabacc",
  "/wiki/Helm_officer",
  "/wiki/Galactic_Empire",
  "/wiki/Time",
  "/wiki/Spy",
  "/wiki/Officer",
  "/wiki/First_Sergeant",
  "/wiki/Hazram_Namir",
  "/wiki/Captain",
  "/wiki/Micha_Evon",
  "/wiki/Bridge_(starship)",
  "/wiki/Operation_Ringbreaker",
  "/wiki/Everi_Chalis",
  "/wiki/Kuat_Drive_Yards",
  "/wiki/Dropship",
  "/wiki/Troop",
  "/wiki/Satellite",
  "/wiki/Cannon",
  "/wiki/Attack_on_Mardona_III",
  "/wiki/Rimma_Trade_Route",
  "/wiki/Malastare",
  "/wiki/Kuat",
  "/wiki/Shipyard",
  "/wiki/Lightspeed",
  "/wiki/Hyperspace",
  "/wiki/Kilometer",
  "/wiki/Gravity",
  "/wiki/Standard_hour",
  "/wiki/Inyusu_Tor",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Vixus_Squadron",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Herald",
  "/wiki/Blaster_power_pack/Legends",
  "/wiki/Ion_bomb",
  "/wiki/Quartermaster",
  "/wiki/Hober",
  "/wiki/Gadren",
  "/wiki/Brand",
  "/wiki/Twitch",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Rebel_Files"
 ]
}