{
 "name": "Tohrm",
 "display_name": "Tohrm",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 44 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ryn"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Freedom Flight"
     ]
    }
   ]
  }
 ],
 "content": "Tohrm was a male Ryn member of Freedom Flight, an anti-slavery organization. Serving as a \"pilot\" in the organization—someone who assisted slaves in their escape and in starting new lives—he came into contact with the slave Kitaya Shuul and fellow Freedom Flight members Blink and Ackmena. In approximately 44 ABY, Tohrm was killed by an organization opposed to Freedom Flight. Following his death, Blink took over his shipment of escaped slaves.\nThe male Ryn Tohrm was an active member of the galaxy-wide anti-slavery organization known as Freedom Flight around the time following the Second Galactic Civil War. Within Freedom Flight, Tohrm served as a \"pilot\"—the codename for someone who helped enslaved individuals escape from their servitude and establish new lives with new identities elsewhere in the galaxy. He was a contact of the slave and aspiring Freedom Flight member Kitaya Shuul on the planet Tatooine, as well as at least two other Freedom Flight members, including a Bothan nicknamed Blink and the bartender Ackmena.\nSometime around 44 ABY, Tohrm was killed by an organization opposing Freedom Flight. When he did not make his usual stops at Tatooine, both Shuul and Ackmena became worried; Shuul assumed that visits for Tohrm had become too risky and he was being forced to lie low. However, Blink soon arrived on Tatooine and reported Tohrm's death to Ackmena in Chalmun's Cantina, adding that he had taken over Tohrm's shipment of escaped slaves. Shuul overheard the conversation and was saddened by the news of Tohrm's death.\nTohrm was opposed to slavery, joining the Freedom Flight as a \"pilot\" and becoming an active member of the organization, ferrying slaves to safety. Ackmena believed that Tohrm was very careful with his shipments of escaped slaves.\nTohrm was first mentioned in the fifth installment of the nine-part Fate of the Jedi series, Fate of the Jedi: Allies, written by Christie Golden and released on May 25, 2010.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/44_ABY",
  "/wiki/Ryn/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Freedom_Flight",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Slavery/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Kitaya_Shuul",
  "/wiki/Blink",
  "/wiki/Ackmena/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Bartender/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Christie_Golden",
  "/wiki/May_25",
  "/wiki/2010",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)"
 ]
}