{
 "name": "Tokra_Hazz",
 "display_name": "Tokra Hazz",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dorin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Baran Do",
      "Hidden Ones",
      "Hidden Ones"
     ]
    }
   ]
  }
 ],
 "content": "Tokra Hazz, later known as the Hidden One, was a Force-sensitive Kel Dor male and a member of the Baran Do Sages, a Force-based organization on the planet Dorin. In 19 BBY, the Jedi Order was almost completely wiped out during Order 66 and the subsequent Great Jedi Purge, causing Hazz to fear that the new Galactic Empire would eventually destroy the Baran Do as well. To avoid that fate, Hazz decided to found the Hidden Ones, a secret sect of the Baran Do that he tasked with preserving the Order's knowledge. He then became the sect's first leader, taking on the title of the Hidden One.\nTokra Hazz was a male Force-sensitive Kel Dor born on the planet of Dorin. There, he joined the Baran Do, a Force-based organization on his homeworld, and became a leading member of the Sages. He was a Baran Do Master by 19 BBY, when the Clone Wars came to a sudden end with Order 66 and the Great Jedi Purge, which nearly eliminated the Jedi. With the new Empire in control of the galaxy, Hazz feared that the Baran Do might suffer the same fate as the Jedi Order, and he decided to create a secret sect of the Baran Do dedicated to preserving the order's knowledge; if the Baran Do ever were eradicated, the sect would be able to reinstate the order.\nHazz traveled deep beneath the surface of Dorin, where he discovered and expanded a system of caverns. The new sect, which was named the Hidden Ones, was established down in the caverns, and Hazz became their first leader, taking the title of the Hidden One. Hazz decided that in order to protect the Hidden Ones' secrecy, no one could ever be allowed to leave the caverns. As such, new members would have to accept that they were dead to the outside galaxy. The Baran Do tradition of the dying ceremony—a ceremony in which a Sage pretended to die, and then secretly traveled down to the Caverns of the Hidden One to join the sect—was established as a way for the Sages to join Hazz's new sect. Hazz also decided to come up with a telepathic technique for communicating with the Baran Do on the surface, as a way for reinstating the Sages if they were ever destroyed. By 43 ABY, Hazz was no longer the leader of the Hidden Ones.\nIn 43.5 ABY, Jedi Grand Master Luke Skywalker—recently exiled for failing to prevent former Jedi Knight Jacen Solo's fall to the dark side of the Force—and his son, Jedi Knight Ben Skywalker, traveled to Dorin to find out more about Solo's fall to the dark side. However, Koro Ziil, the Master of the Baran Do who had previously trained Solo, was no longer present with the Sages at their temple. The Skywalkers eventually discovered the Hidden Ones, following senior combat instructor Charsae Saal to the caverns, where they met with Ziil, who had recently become the sect's leader. Ziil would hold true to Hazz's rule of letting no one leave the caverns, but Luke eventually confronted Ziil and defeated him. Afterward, the Hidden Ones were disbanded, and the sect's members returned to the surface.\nTokra Hazz was concerned first and foremost with the progression of the powers and philosophy of the Baran Do, and was thus more interested in the safe-keeping of knowledge than the well-being of individual lives. He believed deeply in his cause, and after the destruction of the Jedi Order, he became paranoid that the Baran Do awaited a similar fate; he feared that all of their hard-earned wisdom in the ways of the Force would be lost. Since knowledge meant more to Hazz than life, he decided to form the Hidden Ones, foresaking life in favor of protecting the powers of the Baran Do.\nTokra Hazz was created by author Aaron Allston as the founder of the Hidden Ones in his first novel of the nine-part Fate of the Jedi series, Fate of the Jedi: Outcast. Hazz was only mentioned throughout the course of the novel, never making a direct appearance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Dorin/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Baran_Do/Legends",
  "/wiki/Hidden_Ones",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/The_Hidden_One",
  "/wiki/Homeworld/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Caverns_of_the_Hidden_One",
  "/wiki/Death/Legends",
  "/wiki/Dying_ceremony",
  "/wiki/Telepathy/Legends",
  "/wiki/43_ABY",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Koro_Ziil",
  "/wiki/Master_of_the_Order_(Baran_Do)",
  "/wiki/Baran_Do_temple",
  "/wiki/Senior_combat_instructor",
  "/wiki/Chara",
  "/wiki/Confrontation_in_the_Caverns_of_the_Hidden_One",
  "/wiki/Aaron_Allston",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)"
 ]
}