{
 "name": "Tol_Braga",
 "display_name": "Tol Braga",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange-yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi OrderJedi High CouncilJedi strike team",
      "Jedi High Council",
      "Jedi strike team",
      "Galactic Republic",
      "Sith Empire"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Sajar",
      "Warren Sedoru"
     ]
    }
   ]
  }
 ],
 "content": "Tol Braga was a male Kel Dor Jedi Master of the Jedi Order and a firm believer in the peace process.\nRespectfully referred to as \"the conscience of the Jedi Order,\" Master Tol Braga was a thoughtful scholar, a wise strategist and an avowed pacifist. His greatest achievement as a Jedi to date was when he dueled the Sith Lord Darth Sajar, a member of the Empire's Dark Council to a draw—and then convinced his enemy to abandon the path of darkness and train as a Jedi. He then took Sajar as his padawan.\nAlthough most Padawans assumed Master Braga developed his opposition to warfare during the Great Galactic War, it began much earlier. His first mission as a young Jedi was to intervene in a violent civil conflict on the planet Duro. Braga saw firsthand the horrors that could occur when people took up arms against their own kind, and it forever changed his outlook.\nDuring the Cold War, Braga was offworld when Satele summoned the Council on Tython, as Padawan Kira Carsen had confessed to have been born a Sith, a Child of the Emperor no less. Though Master Jaric Kaedan labeled Carsen a threat and wanted to imprison her, Braga, communicating with Tython via hologram, argued that they should give her a chance to prove herself as a Jedi, reminding of how redeeming Sajar revealed the existence of the Children. His case was backed by Carsen's Master, the future Hero of Tython, and so Carsen was allowed to continue operating as a Jedi.\nFollowing Darth Angral's failed attack on Tython, Braga instigated a plan to capture the Sith Emperor, bring him back to Tython and redeem him to the light side—a mission which was insane at best. A member of his team, Jedi Knight Jomar Chul, was shot down on Tatooine after scouting the Dromund Kaas system. Chul later contacted Braga, informing him that the Hero of Tython had rescued him. This intrigued the Kel Dor, who took it as a sign from the Force that their mission would succeed. He instructed Chul to hand over his sensor recordings to the Hero to bring back to Tython while he awaited a medical transport.\nUpon meeting with the Hero for the first time, Braga explained to the Jedi Knight his plan and sent the Hero to Balmorra to assist Warren Sedoru in acquiring an alien cloaking device, similar to the one hiding the Emperor's fortress. Afterwards, he sent the Hero to Quesh, as Sajar had dropped out of contact. The Hero later reported to have saved a Republic base, but sadly, Sajar had committed war crimes against prisoners-of-war and had subsequently turned himself into the Jedi Council. Braga was appalled to hear that his Padawan had lost his way and asked that the Hero show some discretion until the matter is fully investigated. The Hero then mentioned to having encounter the Emperor's Wrath, who seemed more interested in the Hero than Sajar.\nAfter the Hero and Jedi Knight Leeha Narezz located the schematics of the fortress on Hoth, Braga assembled his team on Tython to discuss their infiltration plan. He maintained confidence that their mission will succeed, given his previous success with Sajar, and dismissed the Emperor as \"just another Sith.\" But before they could proceed, they are interrupted by the Jedi Council and Chul. Chul reveals that while performing a healing meditation, he had a vision of the Hero falling to the dark side and joining the Sith and insisted he take the Hero's place on the mission. Braga dismissed his warning, stating that the future is always in motion and the Council does not pass judgment solely on visions. Masters Satele Shan and Bela Kiwiiks voiced their trust in the Hero's loyalty and thus, approved the mission. Chul stormed out, frustrated that they wouldn't heed his warning, while Master Jaric Kaedan pleaded with Braga to reconsider. However, the Kel Dor remained confident that his plan would succeed.\nBut upon infiltrating Emperor's fortress and confronting the supreme Sith, the Emperor, acknowledging Braga by name, mocked him for his arrogance. The Emperor then unleashed a lightning storm that subdued the Jedi, his dominating influence corrupting them to the dark side and his servants. Braga later managed to break free of the Emperor's control but then realized that he allowed pride to blind him to the Sith's true nature.\nBraga now willingly served the Sith Emperor, as his confrontation with that foe showed him the nature of true evil and revealed a powerful force he had grossly underestimated. Realizing that his pride had blinded him to the Emperor's power, Braga knowingly surrendered to the dark side as he believed it was the punishment he deserved. Master Braga's failure to redeem the Emperor broke his spirit, and with his pride and faith shattered he succumbed to nihilistic despair.\nA short time later, Tol Braga was sent by the Emperor on the planet Corellia, which had been attacked by Sith Empire. Onboard the Eclipse, Tol Braga encountered the Hero once again. The Jedi Knight tried to free him and prevent the fallen Jedi Master from killing thousands of innocent people on the planet. The Hero eventually confronted Braga aboard the Imperial battlecruiser above Capitol Square, where the Kel Dor had set his ship's reactors to overload which would have, at its present altitude, flatten the sector and scatter harmful radiation for hundreds of kilometers. The Hero pleaded with Braga to break free of the Emperor, but he declared that he had already done so and had seen the apparent corruption of the galaxy. Braga engaged the Hero and was defeated which freed him from the Emperor's power. The Hero then quickly prevented the reactors from overloading. As the Hero called General Var Suthra to confirm their success, Braga stated that the galaxy's suffering had only been prolonged and bemoaned that nothing the Hero did mattered. The Hero then finally understood him: he never faced failure until their mission to the Emperor's fortress. Braga admitted that while the Emperor's ritual might have been stopped, the Sith Lord would try again and again until he completed it. He willingly gave up the Emperor's coordinates and encouraged the Hero to face him and see how pointless their struggles have been before asking to be put out of his misery. The Knight implored him to let go of his past and become a better person, appealing to the good that's still inside him. Remembering the confidence that he once felt and allowing hope to swell in his heart, Braga accepted that perhaps the Emperor can be defeated and agreed to consider the offer and returned back to Tython to be redeemed.\nHowever, not long after Braga was presumed dead by agents of the Star Cabal.\nBraga was among the strongest and most resolute Jedi of his time. During his confrontation with the mighty Hero of Tython, Braga managed to throw the Jedi back during a mid-air leap with a Force-push at one point. Tol Braga then ripped a large console from its foundation and threw it towards his opponent right afterwards with his powers. He also demonstrated a staggering amount of endurance, being able to hold his own in a three day long duel against the Sith Lord Darth Sajar, a member of the Empire's Dark Council.\nDepending on the player's choices, Braga can either be spared , Force-persuaded to kill Sith  or killed .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3640_BBY",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_strike_team_(capture_of_the_Sith_Emperor)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sajar",
  "/wiki/Warren_Sedoru",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_Council",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Duro/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Kira_Carsen",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Jaric_Kaedan",
  "/wiki/Darth_Angral",
  "/wiki/Tenebrae",
  "/wiki/Tython/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jomar_Chul",
  "/wiki/Tatooine/Legends",
  "/wiki/Dromund_Kaas",
  "/wiki/Hero_of_Tython",
  "/wiki/Balmorra/Legends",
  "/wiki/Quesh",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Leeha_Narezz",
  "/wiki/Hoth/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Bela_Kiwiiks",
  "/wiki/Canon",
  "/wiki/Corellia/Legends",
  "/wiki/Eclipse_(Harrower-class)",
  "/wiki/Capitol_Square",
  "/wiki/Var_Suthra",
  "/wiki/Star_Cabal",
  "/wiki/Telekinesis/Legends#Force_Push",
  "/wiki/Sith_Lord",
  "/wiki/Category:Images_of_Tol_Braga",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Battle_of_Ilum",
  "/wiki/Standard_year/Legends"
 ]
}