{
 "name": "Tol_Getelles",
 "display_name": "Tol Getelles",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Remnant",
      "Fel Empire"
     ]
    }
   ]
  }
 ],
 "content": "Tol Getelles was a male Human Moff who was in control of the Antemeridian sector.\nGetelles received his promotion to Moff at a diplomatic reception on Coruscant, one of the last to be attended by Leia Organa during the reign of Emperor Palpatine. Shortly after his promotion to Moff, Getelles promoted his friend, Larm, to Admiral, over the heads of several other officers, and gave him command of military forces in Antemeridian sector.\nAfter the fall of the Galactic Empire, Getelles remained part of the Imperial Remnant and retained control of the sector. However, he lacked both the firepower and the confidence to mount a major attack on nearby New Republic controlled bases.\nIn 13 ABY, Getelles was contacted by Seti Ashgad who offered him an opportunity to take control of Meridian sector. Loronar Corporation would supply weapons to dissident groups throughout Meridian sector in an effort to promote uprisings which would divide the New Republic forces in the area. Meanwhile, Ashgad would release a plague which he promised would only affect New Republic personnel. Together, these events would weaken New Republic forces sufficiently for Admiral Larm's forces to take control of the sector.\nPart of the deal would allow Loronar Corporation to mine Spook crystals on Nam Chorios in Meridian sector to use as CCIR control crystals in synthdroids and Needle fighters. Ashgad would get a share of the profits, while Getelles would get access to the Needles.\nGetelles' grab for power failed when both Ashgad and Larm were killed after the intervention of Luke Skywalker, Leia Organa Solo and Han Solo. Larm's fleet, under attack from both Republic forces and those under Admiral Daala, retreated to Antemeridian sector and the New Republic was able to halt the spread of the plague.\nWith Antemeridian sector weakened after Larm's defeat at Nam Chorios, the New Republic pressed its advantage and dispatched two fleets into Antemeridian sector. Getelles proved unable to stop them, and Antemeridian sector, along with much neighboring space, was captured by the New Republic before Admiral Pellaeon stopped their advance.\nAfter the end of the Second Galactic Civil War, however, Getelles was still the Moff of the Antemeridian Sector, which was now part of the Imperial Remnant. Three years after the end of the war, Getelles was one of the rare Moffs who supported the Jedi coup that removed Daala, the Galactic Alliance's increasingly extremist Chief of State, from power.\nGetelles had also begun to perform experiments on Squibs using drochs so as to find a way to become young again. The consumption of drochs and the life force that they carried allowed the Squibs to turn young again. Unbeknownst to Getelles, the Squibs were spying for Jagged Fel, the Head of State of the Imperial Remnant. Getelles was also contacted by Admiral Daala who was gathering followers among the Moffs, as well as her Maw Irregular Fleet, to take over the Remnant and have revenge on those in the Galactic Alliance who removed her from power. Not wanting Daala to take over the Remnant, he faked assassination of Jagged Fel when meeting him on Fel's ship after he revealed he knew about his droch experiences on the Squibs. Although he told Daala he had killed Fel, he had only stunned him before revealing Daala's plan to him.\nGetelles gathered his troops and joined Daala and the other rebellious Moffs in the Exodo system. Fel then arrived with forces loyal to him and a fleet of ships from the Empire of the Hand and engaged Daala and the Moffs alongside Getelles' forces.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Tol_Getelles",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Fel_Empire",
  "/wiki/Moff/Legends",
  "/wiki/Antemeridian_sector",
  "/wiki/Coruscant/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Larm",
  "/wiki/Admiral/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/13_ABY/Legends",
  "/wiki/Seti_Ashgad/Legends",
  "/wiki/Meridian_sector/Legends",
  "/wiki/Loronar_Corporation/Legends",
  "/wiki/Death_Seed",
  "/wiki/Tsil",
  "/wiki/Nam_Chorios/Legends",
  "/wiki/Centrally_Controlled_Independent_Replicant",
  "/wiki/Synthdroid",
  "/wiki/Needle_fighter",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Battle_of_Nam_Chorios",
  "/wiki/Natasi_Daala",
  "/wiki/Invasion_of_the_Antemeridian_sector",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/44_ABY",
  "/wiki/New_Jedi_Order",
  "/wiki/Plan_Delta",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Squib/Legends",
  "/wiki/Droch",
  "/wiki/Jagged_Fel",
  "/wiki/Head_of_State/Legends",
  "/wiki/Maw_Irregular_Fleet",
  "/wiki/Gilad_Pellaeon_(starship)",
  "/wiki/Exodo_system",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Battle_over_Exodo_II",
  "/wiki/Planet_of_Twilight",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Calron",
  "/wiki/Garreter",
  "/wiki/Jowar",
  "/wiki/Drikl_Lecersen",
  "/wiki/Malvek",
  "/wiki/Poliff",
  "/wiki/Quillan_(Moff)",
  "/wiki/Trevin",
  "/wiki/Porrak_Vansyn",
  "/wiki/Wolbam"
 ]
}