{
 "name": "Tole_Warren",
 "display_name": "Tole Warren",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human/Morellian hybrid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Task Force on Alliance Security",
      "Task Force on Alliance Security"
     ]
    }
   ]
  }
 ],
 "content": "Tole Warren was a half-Human, half-Morellian officer of the Rebel Alliance.\nThe son of Morellian Barosa Warren and an unknown mother, Tole maintained his surname, although he eventually became estranged from his father. As Tole was a member of the Rebel Alliance, Barosa considered him an enemy.\nIn 3 BBY, Tole Warren became the communications officer on Suolriep sector for the Rebel Alliance. He also took an active role in field missions and spent the rest of his time on Delta Base command center as one of the top officers under Vanden Willard. He was also a member of the Rebel Alliance Task Force and a cryptographer, decoding important Imperial transmissions.\nIn 0 ABY, Warren was assigned to the Silent Water. It was then that the Alliance detected bounty hunter Kal-tan-shi in the Veron Minor system. The Alliance wanted to follow Kal-tan-shi, and they called Warren because they needed an organic agent fluent in Tiss'shar, since Kal-tan-shi was a droid-hater . Although Warren was unable to find Kal-tan-shi, he noticed that Kal-tan-shi's ship Accuser had a bug on its starboard thrust converter. Warren took note of this for his report about Kal-tan-shi for the Task Force.\nWarren was sent to the safeworld of Stronghold in 1 ABY. He was one of the few survivors of the Battle of Stronghold.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Morellian",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Kal-tan-shi",
  "/wiki/Lieutenant/Legends",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Barosa_Warren",
  "/wiki/3_BBY/Legends",
  "/wiki/Suolriep_sector/Legends",
  "/wiki/Delta_Base",
  "/wiki/Vanden_Willard/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Silent_Water",
  "/wiki/Veron_Minor_system",
  "/wiki/Tiss%27shar_(language)",
  "/wiki/Accuser_(Class_720_freighter)",
  "/wiki/Stronghold_(planet)",
  "/wiki/1_ABY/Legends",
  "/wiki/Battle_of_Stronghold"
 ]
}