{
 "name": "Toli",
 "display_name": "Toli",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "White Worms"
     ]
    }
   ]
  }
 ],
 "content": "\"Tunnel\" Toli was a human male who as a child served as a member of the White Worms gang on the planet Corellia. He earned his keep in the gang by slipping into utility wiring trunks and patching into power and data grids in order to keep the gang connected to the rest of the planet. In 13 BBY, he was present when the scrumrat Han escaped from Proxima in the Den of the White Worms.\nToli was human male known as \"Tunnel Toli\" who as a child served as a scrumrat in the White Worms gang of Coronet City on the planet Corellia. He earned his keep in the gang by slipping into wiring trunks and patching into power and data grids so that the gang was connected to the rest of the planet.\nIn the year 13 BBY, Toli was present in the den when the fellow scrumrat Han was brought before Lady Proxima, leader of the gang. Han, who had returned from a trade with no goods for Proxima, used a rock to break a shutter behind the gang leader and bathe her in light, which burned her skin. Using the distraction, Han then pushed through the other scrumrats and escaped.\nToli had tan skin, black hair, and brown eyes.\nToli wore a gray brine-stained shirt with a red light-filter headband. He carried valuable wires with him.\nToli first appeared in the 2018 film Solo: A Star Wars Story. The character was first identified in the accompanying reference book Solo: A Star Wars Story The Official Guide, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Corellia",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/White_Worms",
  "/wiki/Planet",
  "/wiki/13_BBY",
  "/wiki/Scrumrat",
  "/wiki/Han_Solo",
  "/wiki/Den_of_the_White_Worms",
  "/wiki/Coronet_City",
  "/wiki/Standard_year",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Salt",
  "/wiki/Clothing",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}