{
 "name": "Toll_Apkar",
 "display_name": "Toll Apkar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Copper"
     ]
    }
   ]
  }
 ],
 "content": "Toll Apkar was a Rodian male gambler who lived during the Jedi Civil War between the Galactic Republic and the Sith Empire. In 3956 BBY, he was present in the settlement of Dreshdae on the Sith world of Korriban. He spent his time playing the card game pazaak in The Drunk Side, a cantina in the settlement.\nToll Apkar lived on the Outer Rim Sith-controlled planet of Korriban during the Jedi Civil War between the Galactic Republic and the Sith Empire. The Rodian resided in Dreshdae, a major colony on the planet and the location of a Sith Academy. He spent his time playing the gambling card game pazaak in The Drunk Side, a cantina located in the settlement, becoming proficient in the game.\nIn 3956 BBY, during his search for the Star Maps, the amnesiac Sith Lord–turned–Jedi Revan arrived in Dreshdae and approached Apkar in the cantina. Apkar introduced himself and offered a game of pazaak, being upfront about his skill. Revan wanted to ask him questions, but the gambler declined, directing him to the other citizens of Dreshdae. Apkar made it clear that if Revan did not intend to play a round, he wished to be alone, but Revan agreed to play a match and won. The Rodian claimed it was simply a lucky draw and challenged Revan to more games. After being beaten several times and losing many credits, Apkar admitted that the Jedi was superior. Thoroughly defeated, the Rodian refused to play any more pazaak with Revan and sought out a less challenging pastime.\nToll Apkar was a Rodian male with copper-colored skin and black eyes. He was very proficient at pazaak and took great pride in his skill, often mentioning it to others. He viewed winning as a vindication of this skill. The Rodian was quite bored and welcomed any opportunity to play, as few citizens of Korriban enjoyed the game. However, if someone did not intend to engage in a round with him, he would prefer they leave him alone. Apkar knew when he was outmatched by Revan and refused to play more, knowing he would only lose credits.\nApkar wore a green and teal suit with a brown harness and bronze-colored boots. He had a brown and mauve utility belt with a holster on the right and a small pouch on the left.\nToll Apkar appeared as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic, developed by BioWare. Interactions with him are optional and do not affect any plot or quest, nor do they change alignment. If the player loses to Apkar, he will comment on his own skill and apologize to Revan. If the player wins several times in a row, Apkar will admit Revan's superiority and refuse to play more pazaak games.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/3956_BBY",
  "/wiki/Dreshdae",
  "/wiki/Sith/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/Time/Legends",
  "/wiki/Pazaak/Legends",
  "/wiki/The_Drunk_Side",
  "/wiki/Cantina/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Amnesia/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Eye/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Harness",
  "/wiki/Boot/Legends",
  "/wiki/Utility_belt/Legends",
  "/wiki/Holster/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/The_Essential_Atlas"
 ]
}