{
 "name": "Toltek",
 "display_name": "Toltek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "31 ABY",
      "Ponemah Terminal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Toltek's band"
     ]
    }
   ]
  }
 ],
 "content": "Toltek, commonly referred to as Toltek the Devaronian, was a Devaronian male pirate who led a band of other Devaronians in an attempt to claim the Lost Treasure of Count Dooku from the crashed Separatist cruiser Obrexta III on the planet Ponemah Terminal. He and his men managed to avoid a number of other groups trying to claim the prize, but were all killed by the after effects of kinetic disruptor missile fired by the crew of the Crimson Corsair Sidon Ithano.\nToltek the Devaronian led a pirate band of other Devaronians fifty years after the Clone Wars ended. He and his crew were one of several groups that converged on the crashed Separatist cruiser Obrexta III when it began emitting a distress signal on the planet Ponemah Terminal, hoping that he could claim the legendary lost treasure of the Sith Lord Count Dooku stored inside. The Devaronians traveled to the ship's location in the Sea of Sand on a wind-powered sailer in order to try and loot it, avoiding a battle being fought by three other pirating groups—the crew of the Crimson Corsair Sidon Ithano, a gang of pirates led by the Weequay Scorza, and the Gray Gundarks biker gang—on his way to the vessel in the hopes of beating them to it.\nThe sailer was halted before it could reach the cruiser when the Ithano's crew used a kinetic disruptor missile to freeze an approaching sandstorm, depriving Toltek's vessel of wind. After an hour of waiting, the wind returned, and the Devaronians finally reached the Obrexta III, only to find that the Corsair had already entered. Knowing he had the rival pirate group outgunned, Toltek chose to wait for Ithano to emerge with the prize and then take it from him. The Devaronian's plan never came to fruition however, as while he and his crew waited, the after effects of the kinetic disruption caused all the affected particles of sand to begin releasing energy in blasts comparable to the detonation of a thermal detonator, obliterating Toltek and his men.\nToltek first appeared in \"The Crimson Corsair and the Lost Treasure of Count Dooku\", a short story written by Landry Q. Walker which was released as an eBook in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pirate",
  "/wiki/Tolteck",
  "/wiki/Starlag_XIX",
  "/wiki/31_ABY",
  "/wiki/Ponemah_Terminal",
  "/wiki/Devaronian",
  "/wiki/Gender",
  "/wiki/Toltek%27s_band",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Cruiser",
  "/wiki/Obrexta_III",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Kinetic_disruptor",
  "/wiki/Missile",
  "/wiki/Sidon_Ithano%27s_crew",
  "/wiki/Color",
  "/wiki/Sidon_Ithano",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Sith_Lord",
  "/wiki/Starship",
  "/wiki/Sea_of_Sand",
  "/wiki/Wind-powered_sailer",
  "/wiki/Scorza%27s_gang",
  "/wiki/Weequay",
  "/wiki/Scorza",
  "/wiki/Gray_Gundarks",
  "/wiki/Speeder_bike",
  "/wiki/Sandstorm",
  "/wiki/Standard_hour",
  "/wiki/Thermal_detonator",
  "/wiki/The_Crimson_Corsair_and_the_Lost_Treasure_of_Count_Dooku",
  "/wiki/Landry_Q._Walker",
  "/wiki/EBook",
  "/wiki/2015"
 ]
}