{
 "name": "Tommet_Sozach",
 "display_name": "Tommet Sozach",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ginmid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green-gray"
     ]
    }
   ]
  }
 ],
 "content": "Tommet Sozach was a Ginmid male who led an army of mercenaries. When the galaxy seemed to be at peace, Sozach left the army to operate on his own. He worked as a trick shooter until a demonstration went wrong and left him with a death sentence. By the time of the war between the First Order and the Resistance, Sozach worked as a personal defense instructor on Kijimi, where he spent time in the Spice Runners' Den shortly before the destruction of the world.\nTommet Sozach was a Ginmid male who at one point led a mercenary army of his species, but broke out on his own after predictions of a prolonged period of piece proved to be true. By the time that the war between the First Order and Resistance broke out, most of Sozach's best soldiers would have retired. Instead, he earned a living as a crowd-pleasing trick shooter until a performance went wrong and earned him a death sentence. Escaping to become and inhabitant of Kijimi City on the planet Kijimi, Sozach began working as a personal defence instructor.\nDuring the First Order occupation of Kijimi in 35 ABY, Sozach was stood with a human woman by the entrance to the bar of the Spice Runners' Den in Kijimi City when the Spice Runner Zorii Bliss led a group of Resistance agents through the room. Shortly after Sozach encountered the Resistance members, the First Order evacuated their forces from Kijimi and destroyed it.\nTommet Sozach had green skin. When war returned to the galaxy after its prolonged period of peace, he sometimes had to fight a pang of remorse for giving up his army-for-hire.\nSozach wore a cloned karabbac-pelt jacket and a brown fur hat with a pair of orange goggles and brown boots. He carried a blaster rifle.\nTommet Sozach was created for the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was identified simultaneously in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo, and a card in the 2019 Topps Star Wars: The Rise of Skywalker Series 1 trading card set by The Topps Company, Inc.. Concept art of Sozach titled \"Wizard 14 Version 1A\" was created for the film by costume concept artist Calum Alexander Watt. Tommet Sozach was performed by Phill Woodfine.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ginmid",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Army",
  "/wiki/Mercenary",
  "/wiki/The_galaxy",
  "/wiki/Death",
  "/wiki/Time",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Kijimi",
  "/wiki/Spice_Runners%27_Den",
  "/wiki/Destruction_of_Kijimi",
  "/wiki/Species",
  "/wiki/Soldier",
  "/wiki/Kijimi_City",
  "/wiki/Planet",
  "/wiki/35_ABY",
  "/wiki/Human",
  "/wiki/City",
  "/wiki/Spice_Runners_of_Kijimi",
  "/wiki/Zorii_Bliss",
  "/wiki/Protocol_13",
  "/wiki/First_Order_military",
  "/wiki/Karabbac",
  "/wiki/Jacket",
  "/wiki/Hair",
  "/wiki/Hat",
  "/wiki/Goggles",
  "/wiki/Boot",
  "/wiki/Blaster_rifle",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2019_Topps_Star_Wars:_The_Rise_of_Skywalker_Series_1",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Calum_Alexander_Watt",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY"
 ]
}