{
 "name": "Tona_Vaal",
 "display_name": "Tona Vaal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Neshtovar",
      "Keshiri resistance"
     ]
    }
   ]
  }
 ],
 "content": "Tona Vaal was a male Keshiri agent of a Keshiri resistance group active on the planet Kesh in the years after the Great Hyperspace War. Vaal was born the youngest son of geologist Adari Vaal and her husband, Zhari Vaal. In 5000 BBY, Tona Vaal's mother became a celebrated figure in Keshiri society after rescuing a group of crash-landed Sith stranded in the mountains—those Sith established the Lost Tribe of Sith, took control of the planet, and honored Adari Vaal greatly. However, after the death of her eldest son, Finn Vaal, who was killed in an accident while building a monument to the Sith, Tona Vaal's mother established a resistance group dedicated to fighting the Sith, which the young Keshiri joined when he came of age. Ostensibly, Vaal worked as a traveling stable master, but in actuality he was an undercover agent spying on Nida Korsin, the Human daughter of Lost Tribe Grand Lord Yaru Korsin, and her Skyborn Rangers uvak-riding club—however, in 4975 BBY he fell for his target. Vaal's attraction to Korsin led him to disclose the resistance's secret plans to her. As a result, the rebels were defeated, and his mother forced into exile.\nA Keshiri male, Tona Vaal was born on the remote, isolated Wild Space planet of Kesh. Vaal was the youngest son of geologist Adari Vaal and her husband, Zhari Vaal, a member of the planet's Neshtovar ruling council. When Tona Vaal was very young, his father died in an uvak-riding accident, and he was left to be raised by his now-single mother and his grandmother, Eulyn. While his mother rededicated herself to her geology work, Vaal and his older brother, Finn Vaal, were primarily cared for by Eulyn. By the time Tona Vaal was a toddler, his mother came into significant controversy amongst the Keshiri populace. After discovering evidence that the landmass of Kesh was formed naturally through volcanic flow rather than from the blood of the Skyborn gods—as was in accordance with the prevalent religious stories—the geologist began to teach her findings to her students and, in 5000 BBY, was accused of heresy by the Neshtovar. She was forced to defend herself in public hearings before the ruling council, and she became a pariah to the crowds of Keshiri, who angrily rained rocks upon the Vaal family home in the city of Tahv. Fearing for their safety, Adari sent her sons and Eulyn to seek refuge at her uncle's house when the attacks intensified.\nVaal's mother was eventually forced to flee into the mountains on uvak-back, where she discovered a group of crash-landed Sith encamped there. She led them back to civilization, where the Humans and pureblood Sith of the crew posed as the Skyborn returned to Kesh. The \"Skyborn\" and their savior, the heretic geologist, were received in a raucous celebration in Tahv's Circle Eternal plaza. No longer having to fear the wrath of angry townsfolk, the young Tona Vaal attended the ceremony in his mother's arms. Although his mother became an exalted figure in Keshiri society, her deliverance of the Sith had unforeseen consequences. Inspiring fanatical devotion in the Keshiri, the new Lost Tribe of Sith established dominion over their society. Thousands of Keshiri went to work building monuments and tributes to their rulers—in 4987 BBY, a labor accident claimed the life of Vaal's older brother, Finn. His death, and the failure of Lost Tribe Grand Lord Yaru Korsin to save him, prompted Vaal's mother to form a Keshiri resistance group dedicated to bringing down the Sith rule. By 4975 BBY, Tona Vaal had followed his father's footsteps in becoming a member of the Neshtovar, and was working covertly for the resistance. At the time, he was serving as the traveling stable master for the Skyborn Rangers, an uvak-riding club led by Grand Lord Korsin's daughter Nida. Named to the position by Grand Lord Korsin, Vaal ran his own stable in Tahv, in addition to working near the Kesh Sith Temple. Vaal forged a friendship with Nida—eventually falling for her—all the while serving as an undercover agent for his mother and her rebel group.\nThat year, Vaal's mother put the finishing touches on her final plan to overthrow the Sith. Although Vaal was kept out of the decision-making—much to his chagrin—he knew the details of the plot. Resistance agents would steal the Lost Tribe's uvak, crippling their ability to move across Kesh's vast landmass and leaving them vulnerable to an armed uprising. Vaal wanted to ride with the agents, but he reluctantly agreed to stay with Nida and the Skyborn Rangers. However, he was unable to keep their plans a secret, as he spilled all the details of the plan to Nida. Vaal's disclosure of the plot resulted in the foiling of the resistance's mission, as Nida was able to prevent many of the uvak from being stolen. Vaal's mother did not learn of her son's failure until quite some time afterward, when a rider from Tahv alerted her as she gathered with the other rebel agents. Despondent, the rebel leader turned away before she learned of her son's fate and resigned herself to a life in exile. In her later years, Vaal's mother made her way across the ocean to the previously unknown continent of Alanciar, where she became a heroic figure for her resilience and leadership. In the year 2975 BBY, Adari Vaal's personal memoirs were discovered in the city of Sus'mintri, and were found to have several regret-filled passages about Tona Vaal and the rest of his family.\nAs a young child, Tona Vaal was playful and curious, and his habit of grabbing his mother's hair compelled her to cut it very short. Like his brother Finn, Vaal took after his father, Zhari, and his mother saw him as no kinder or brighter than her departed husband had been. Although not particularly sharp, Vaal was an amiable fellow and a competent stable master. He was quite loyal to his mother and the Keshiri resistance, and he always wished to be more involved with the rebel group's work. However, in his duty as a covert agent he fell for one of the targets of his espionage, Nida Korsin, which proved to be his downfall—his attraction to Korsin won out over his loyalty to the resistance, prompting him to divulge their plans and leading to the group's destruction. Like most other Keshiri, Vaal had purple skin.\nThe character of Tona Vaal first appeared in John Jackson Miller's 2009 eBook Lost Tribe of the Sith: Skyborn, the second installment of his nine-part Lost Tribe of the Sith series. Vaal also appeared in the series' fourth installment, Savior, and was mentioned in the ninth, Pandemonium. In an email interview dated December 11 2013, John Jackson Miller confirmed that Tona Vaal was indeed the youngest son of Adari Vaal, as first mentioned in Skyborn. He acknowledged that the description of Tona as the eldest in Savior was an error.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Keshiri",
  "/wiki/Vaal_(disambiguation)",
  "/wiki/Kesh",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Neshtovar",
  "/wiki/Keshiri_resistance",
  "/wiki/Agent/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Geology",
  "/wiki/Adari_Vaal",
  "/wiki/Marriage/Legends",
  "/wiki/Zhari_Vaal",
  "/wiki/5000_BBY/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Takara_Mountains",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Death/Legends",
  "/wiki/Finn_Vaal",
  "/wiki/Spy/Legends",
  "/wiki/Nida_Korsin",
  "/wiki/Human/Legends",
  "/wiki/Grand_Lord",
  "/wiki/Yaru_Korsin",
  "/wiki/Skyborn_Rangers",
  "/wiki/Uvak",
  "/wiki/4975_BBY",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Eulyn",
  "/wiki/Time/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Volcano/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Skyborn",
  "/wiki/Deity/Legends",
  "/wiki/Keshiri_religion",
  "/wiki/Vaal_family_home",
  "/wiki/City/Legends",
  "/wiki/Tahv",
  "/wiki/Adari_Vaal%27s_uncle",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Circle_Eternal",
  "/wiki/Limb/Legends",
  "/wiki/4987_BBY",
  "/wiki/Lord/Legends",
  "/wiki/Kesh_Sith_Temple",
  "/wiki/Keshiri_uprising_in_Keshtah",
  "/wiki/Unidentified_Keshiri_rider",
  "/wiki/Western_Sea_(Kesh)",
  "/wiki/Alanciar",
  "/wiki/2975_BBY",
  "/wiki/Adari_Vaal%27s_personal_memoirs",
  "/wiki/Sus%27mintri",
  "/wiki/Hair/Legends",
  "/wiki/John_Jackson_Miller",
  "/wiki/2009",
  "/wiki/EBook",
  "/wiki/Lost_Tribe_of_the_Sith:_Skyborn",
  "/wiki/Star_Wars:_Lost_Tribe_of_the_Sith",
  "/wiki/Lost_Tribe_of_the_Sith:_Savior",
  "/wiki/Lost_Tribe_of_the_Sith:_Pandemonium",
  "/wiki/December_11",
  "/wiki/2013",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/File:Miller_interview_Dec_11_2013_001.jpg"
 ]
}