{
 "name": "Tonra",
 "display_name": "Tonra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Above 1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Royal Naboo Security Forces",
      "Royal Naboo Security Forces",
      "Naboo resistance",
      "Galactic Republic",
      "Hazard Squadron",
      "Hazard Squadron",
      "A cantina",
      "Amidalans"
     ]
    }
   ]
  }
 ],
 "content": "Tonra was a human male who served as a sergeant, and later a captain, in the Royal Naboo Security Forces. He fought during the Trade Federation's Invasion of Naboo. Often accompanying the handmaiden Sabé, he continued to assist Padmé Amidala, even after she transitioned from queen to senator of Naboo. Tonra accompanied Sabé to Tatooine where they attempted to free slaves. After Amidala's death, he and Sabé decided to find out how she had died, needing to change their identities to do so. Under Sabé's leadership, Tonra and other friends of Amidala became the Amidalans, a group dedicated to bringing justice to Amidala's killer.\nTonra was a human male from Naboo. At some point, Tonra learned the old comm code that many children on Naboo learned as a memory game.\nTonra served as a sergeant in the Royal Naboo Security Forces when the Trade Federation invaded Naboo. The Trade Federation Droid Army imprisoned Tonra in the prison camp in Theed's largest market square, where he stayed in a tent with the handmaidens Saché and Yané and fellow guard Mariek Panaka. The group quickly got to work organizing resistance against the Droid Army. Tonra wanted to learn about their captors' patrol patterns and defenses, but Mariek took charge and suggested they focus on people first. Together, the two guards came up with a duty schedule and began to collect intelligence from the others in the camp.\nTonra saw when a droid patrol took Saché in for questioning, and brought word to the others with such haste that he forgot to give the password. He got tackled to the ground by Mariek for his trouble. He also passed on reports from others in camp that the droids had built an interrogation room and that no one had been able to tell what machinery it was equipped with. He wanted to turn himself in to spare Saché torture; Mariek and Yané forestalled him. After Saché left the droids' custody, Tonra carried her the rest of the way to their tent and helped her take the last of the messages to the other tents.\nWhen Queen Amidala's ship landed back on Naboo and Quarsh Panaka started sneaking people towards the palace, Tonra, Mariek, Yané and Saché left the camp with him. Once the fighting began, Mariek and Tonra took control of one of the gun towers surrounding the market square and used it to destroy the other lookout points, signaling to those remaining in the camp that it was time to rise up against the droids.\nFollowing the completion of Amidala's two terms as Naboo's queen, Tonra, along with other members of the Royal Naboo Security Forces and Amidala's handmaidens, stayed with Amidala at Varykino Villa during the elections and was there to announce Saché election to the Naboo planetary legislative assembly and the re-election of Réillata as queen of Naboo. During this time Tonra kept exchanging glances with Amidala's handmaiden Sabé.\nAfter Réillata's second coronation she asked Amidala to succeed Senator Oshadam as the representative of the Chommell sector Senate. Amidala accepted but meant she had to abandon her plan to return to the Outer Rim planet of Tatooine to end the slavery there so she asked Tonra and Sabé to go in her place.\nAmidala had specifically asked for the rescue of Shmi Skywalker, whom she had met during her brief stay on Tatooine, but the pair were unable to locate her but finding a white sun engraved onto the door of her house. Tonra and Sabé had spent six weeks in Mos Espa as part of their cover to free slaves but they were unaware that their was already a movement on Tatooine opposed to slavery but by the time they learned it was too late as they didn't trust them as they had been trying to get in with local criminals.\nThe pair were forced to buy a hundred slaves in order to give them their freedom and took them to the planet Karlinus so that they could start a new life there. Sabé and Tonra then journeyed to Coruscant to help Amidala as she began her career as a senator and shortly after the two began a romantic relationship together.\nTonra and Sabé joined Amidala for her week long visit to the planet Alderaan, before returning to Naboo, where they stayed in guest suites at the royal palace.\nTonra flew as Hazard Two in Hazard Squadron, a starfighter squadron set up by the Galactic Republic to protect starship convoys transporting materials to Bromlarch as part of the Mid Rim Cooperation Motion. Following Bromlarch Sabé and Tonra spent more time apart than they did together with Sabé building her network and Tonra working more closely with Gregar Typho and Mariek Panaka protecting Amidala and them usually only meeting up for a specific operation that Amidala was running or because Sabé needed backup as well as them spending time with others.\nAfter Amidala's funeral, Tonra went to Sabé's home, where he found her troubled, certain that there was more to Amidala's death than they had been told. When he asked what she planned to do about it, she said that she would return to Coruscant to start looking for answers. He offered to come with her; she agreed, and told him that they would need to leave everything behind, including any previous identities. While they prepared to leave, Tonra accepted a call on Sabé's comlink, and told her that she would want to talk to the person on the other end; it was Bail Organa.\nEventually, Tonra and Sabé made their way to Coruscant as planned, still not in possession of the full story of Padmé's death. They broke into Amidala's apartment, and Sabé stole the security recordings and left a scout transmitter behind. When Darth Vader found the transmitter and tracked it back to Sabé, she claimed that they had hidden the recordings on Naboo.\nTonra was waiting with Captain Typho when Sabé and Vader arrived at Varykino. They began to shoot at Vader as he stepped into the house, but he anticipated the attack; he knocked Tonra down by throwing a large urn at him with the Force, and Force-choked Typho. Sabé talked him down, and asked why they had attacked, since she had sent an all-clear signal. Typho said that as soon as they saw her companion, he and Tonra assumed that she was under duress. When asked, Tonra said that he did not think he could kill Vader, but that he might give Sabé a chance to escape; Sabé replied that she did not want to be saved by him, but to sacrifice at his side. Vader wanted to kill Tonra and Typho for their attack, but the trio convinced him that because Sabé had given Tonra and Typho the recordings, and they in turn had hidden them, Vader would need the men to lead him to the data he wanted.\nThe trio led Vader beneath the house, where they boarded a bongo submarine and set off into the waters of Naboo. The group encountered a colo claw fish, and as it attacked, the submarine's hull was compromised and they were thrown out into the open ocean. After Vader had fended off the beast, Tonra pointed out a nearby hydrostatic bubble, and the group swam to safety. Once inside, Vader demanded that they hand over the security recordings. Tonra asked him to swear he would use them to avenge Amidala's death; Vader noted that the handmaidens and guards of Naboo were trained in diplomacy and deception, and refused to bargain with him.\nTonra backed down and produced a recording. Although the playback began in Amidala's apartment, it quickly transitioned into a new scene: a recording of the moment, many years before, when Sabé, Typho, Tonra, and other allies dubbed themselves Amidalans and swore to find whoever had murdered Amidala and kill them. The group revealed that, because the last time Typho saw Amidala she was on her way to Mustafar, and they had discovered that Mustafar was Vader's domain, they had come to the conclusion that Vader had killed both Amidala and her Jedi protector, Anakin Skywalker. As soon as Vader confirmed that he had, Typho signaled Tonra, who set off a beast caller.\nA massive sando aqua monster appeared after Tonra set off the beast-caller. While Vader was distracted by the beast, Typho and Tonra took the opportunity to shoot at him. Sabé noted that he could deflect direct shots, and targeted the promontory he stood on instead. It crumbled, throwing Vader out of the bubble and into the beast's mouth. After Vader both killed the sando aqua monster and broke through the Amidalan's defense of Amidala's tomb, he learned that Amidala had been treated at Polis Massa before her death. He instructed Sabé to meet him there with her friends. The Amidalans arrived at Polis Massa Base with a fleet of ships, and once more attempted to confront Vader. Their ships proved an obstacle as Vader attempted to reach the medical facility there, but he managed to distract them long enough for his death troopers to shoot down one of the ships. As Amidalans marched out of the fallen ship to confront Vader on the ground, Tonra was in the front rank. Vader fought his way through and ultimately escaped the Amidalans unscathed.\nTonra had a wide face and dark hair, and Saché thought that he had a nice voice. He also had gray eyes and pale skin. He was more than 1.83 meters tall.\nTonra first appeared in the 2019 novel Queen's Shadow, written by E. K. Johnston. After the release of the novel, Johnston stated that Tonra was intended to be Richard Armitage's character in the 1999 film Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy, though no canon source has currently made this connection.\nIn the original pitch for her 2016 novel Ahsoka, Johnston had Ahsoka Tano encounter Tonra and Sabé, having planned the characters' story ahead of their appearance in Queen's Shadow, but was ultimately told not to include them. Johnston has stated that in her mind, Tonra was bisexual; however, being more focused on Sabé, she did not get to cover it in the novel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Naboo_(people)",
  "/wiki/Captain",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Chiss_Defense_Force_Transport",
  "/wiki/Tomra",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Hope",
  "/wiki/Darth_Vader_(2020)_23",
  "/wiki/Naboo",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Royal_Naboo_Security_Forces",
  "/wiki/Naboo_resistance",
  "/wiki/Galactic_Republic",
  "/wiki/Hazard_Squadron",
  "/wiki/Amidalans",
  "/wiki/Sergeant",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Sab%C3%A9",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Senator",
  "/wiki/Tatooine",
  "/wiki/Slavery",
  "/wiki/Death",
  "/wiki/Trade_Federation_Droid_Army",
  "/wiki/Camp_Four",
  "/wiki/Theed_market_square",
  "/wiki/Tent",
  "/wiki/Sach%C3%A9",
  "/wiki/Yan%C3%A9",
  "/wiki/Mariek_Panaka",
  "/wiki/Droid",
  "/wiki/Torture",
  "/wiki/Naboo_Royal_Starship",
  "/wiki/Quarsh_Panaka",
  "/wiki/Theed_Royal_Palace",
  "/wiki/Varykino_Villa",
  "/wiki/Day_of_Ascendancy",
  "/wiki/Naboo_planetary_legislative_assembly",
  "/wiki/R%C3%A9illata",
  "/wiki/Second_coronation_of_R%C3%A9illata",
  "/wiki/Oshadam",
  "/wiki/Chommell_sector",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Shmi_Skywalker_Lars",
  "/wiki/White_Suns",
  "/wiki/Skywalker_home",
  "/wiki/Standard_week",
  "/wiki/Mos_Espa",
  "/wiki/Karlinus",
  "/wiki/Coruscant",
  "/wiki/Alderaan",
  "/wiki/Royal_Palace_of_Alderaan",
  "/wiki/Hazard_Two",
  "/wiki/Starfighter",
  "/wiki/Squadron",
  "/wiki/Convoy",
  "/wiki/Bromlarch",
  "/wiki/Mid_Rim_Cooperation_Motion",
  "/wiki/Gregar_Typho",
  "/wiki/Comlink",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Padm%C3%A9%27s_Apartment",
  "/wiki/Scout_transmitter",
  "/wiki/Darth",
  "/wiki/Anakin_Skywalker",
  "/wiki/Varykino",
  "/wiki/Telekinesis",
  "/wiki/The_Force",
  "/wiki/Force_choke",
  "/wiki/Gungan_bongo_submarine",
  "/wiki/Submarine",
  "/wiki/Ocean",
  "/wiki/Colo_claw_fish",
  "/wiki/Hydrostatic_bubble",
  "/wiki/Jedi",
  "/wiki/Beast_call",
  "/wiki/Sando_aqua_monster",
  "/wiki/Tomb_of_Padm%C3%A9_Amidala",
  "/wiki/Polis_Massa",
  "/wiki/Polis_Massa_Base",
  "/wiki/Medcenter",
  "/wiki/Death_trooper",
  "/wiki/2019",
  "/wiki/E._K._Johnston",
  "/wiki/Richard_Armitage",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/2016",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Ahsoka_Tano",
  "/wiki/Category:Images_of_Tonra",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Darth_Vader_(2020)_3",
  "/wiki/Darth_Vader_(2020)_4",
  "/wiki/Darth_Vader_(2020)_5",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Darth_Vader_(2020)_2",
  "/wiki/Darth_Vader_(2020)_1",
  "/wiki/October_29",
  "/wiki/File:TonraArmitage.png",
  "/wiki/August_23",
  "/wiki/2020",
  "/wiki/April_4",
  "/wiki/2021"
 ]
}