{
 "name": "Tooga_Jallissi_Gral",
 "display_name": "Tooga Jallissi Gral",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jallissi kajidic"
     ]
    }
   ]
  }
 ],
 "content": "Tooga Jallissi Gral was a Hutt who lived during the time after the Second Galactic Civil War. In 44 ABY, a group of Sith attacked the Fountain of the Hutt Ancients on Klatooine, which the Hutts had sworn by treaty to protect in return for the Klatooinians' servitude. The Hutts sent reinforcements as quickly as possible and the Sith were stopped, but not before they had taken samples of wintrium from the Fountain. Some Klatooinians viewed this as a failure on the Hutts' part to uphold the treaty, and businessman Lando Calrissian and Jedi Knight Jaina Solo were brought in to mediate the situation. They spoke with the Sith, led by Leeha Faal, who claimed falsely that Vyn Holpur and the crew of the ChaseMaster frigate Starstalker had acted of their own accord; with the Klatooinian Council of Elders; and with Gral, who was chosen as the Hutt representative.\nGral claimed that the Hutts had come to the Klatooinians' aid as fast as they could, and that, due to the great damages they had attained during the Yuuzhan Vong War, the Hutts numbers were too few. Gral went on to say that he believed no one could have stopped the attack. Calrissian and Solo then decided that Holpur and his crew were guilty, and that, since the Fountain was violated, Gral did not precisely obey the treaty. However, they went on to say that the Hutts' inability to protect the Fountain during the sudden attack was not a direct dereliction of duty, because the Hutts could not have reasonably been expected to have foreseen the attack. Despite this ruling, several uprisings began all over Klatooine, as the Klatooinians rebelled against their Hutt leadership.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jallissi",
  "/wiki/Kajidic/Legends",
  "/wiki/Darima_Kedari",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/44_ABY",
  "/wiki/Sith/Legends",
  "/wiki/Skirmish_at_the_Fountain_of_the_Ancients",
  "/wiki/Fountain_of_Ancients",
  "/wiki/Klatooine/Legends",
  "/wiki/Treaty_of_Vontor",
  "/wiki/Klatooinian/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Wintrium",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Leeha_Faal",
  "/wiki/Vyn_Holpur",
  "/wiki/ChaseMaster",
  "/wiki/Frigate/Legends",
  "/wiki/Starstalker",
  "/wiki/Council_of_Elders_(Klatooinian)",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Klatooinian_uprising",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)"
 ]
}