{
 "name": "Toomer",
 "display_name": "Toomer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "A clone trooper nicknamed \"Toomer\" served the Galactic Republic during the Clone Wars. Around 22 BBY, Toomer was a member of a Jedi-led Republic strike team that went to the planet Gwori in an attempt to pinpoint the location of local Confederate shipyards and target them for destruction for a Republic assault force. In order to bypass the droid blockade around the world, Toomer and the rest of the team were frozen in carbonite slabs. This helped to hide the presence of biological organisms from the droid radiation scanners while the infiltrators were transported aboard the freighter VX-391, piloted by the astromech droid R2-D2.\nThe team passed through the blockade, but, upon reaching the planet, the freighter was attacked by Vulture droid starfighters. R2-D2 safely ejected the slabs from the ship before its destruction, and the team reached the ground, but the controls on Toomer's carbonite block were damaged in the fall. As a result, he was unable to be unfrozen from his slab for the duration of the mission. He was later unfrozen on the galactic capital of Coruscant, after the mission had already been completed.\n\"Toomer\" was the nickname of one of the many clones of the Mandalorian bounty hunter Jango Fett bred on the planet of Kamino to serve in the Grand Army of the Republic. Toomer served the Galactic Republic as a clone trooper during the galaxy-spanning Clone Wars between the Republic and the Confederacy of Independent Systems. As the war escalated, it became apparent that the Confederacy had an advantage in the number of warships. Around 22 BBY, after a series of Republic defeats in the Mid Rim, Jedi Master Mace Windu proposed to strike at the InterGalactic Banking Clan shipyards on the planet Gwori. Because of the tight security on Gwori, the Jedi did not know where exactly on the planet the shipyards were located, and it was decided to send a small strike team there to pinpoint the shipyards' location to the Republic fleet. Toomer was among the clone troopers chosen for the mission.\nHowever, Gwori was a droid-only zone, meaning that only droid-piloted transports were allowed to reach the planet. Each transport passing through the Confederate blockade of the world was irradiated with deadly rays that killed all living organisms should any be found. To this end, Jedi Knight Anakin Skywalker proposed to infiltrate the planet by freezing the strike team in carbonite, which would hide them from the droid scanners. Inside carbonite-freeze plant CT-642 on the galactic capital of Coruscant, Toomer was subjected to the freezing procedure alongside Skywalker; his Padawan, Ahsoka Tano; Jedi Master Obi-Wan Kenobi; Clone Captain CT-7567; and two other clone troopers. The carbonite slabs containing the strike team were then loaded onto the freighter VX-391, and Skywalker's astromech droid, R2-D2, piloted it to Gwori by hijacking a B1-Series battle droid and controlling all his actions. Once they reached Gwori, the transport successfully passed the radiation check and headed toward the planet. However, when R2-D2 failed to land the ship at Platform A-61 as he had been instructed—since the astromech droid was unaware where it was located—the shipyards' overseer, Juhm, realized that VX-391 was not a Confederate vessel and ordered his forces to open fire at it.\nAs Vulture droid starfighters swarmed the ship, R2-D2 released the cargo locks, ejecting the carbonite blocks onto the ground before escaping himself. VX-391 was destroyed, and Juhm presumed that he had killed the enemy. R2-D2 helped unfreeze all members of the strike force, except Toomer, whose slab controls had been damaged in the fall. The Jedi moved Toomer to a safe location and continued on their mission, eventually reporting the shipyards' coordinates to the Republic. Later, as the Republic's Hunter Squadron led the attack on the shipyards, the three Jedi and CT-7567—the two other troopers having been killed in the course of the mission—attempted to escape from the planet on a commandeered Confederate Munificent-class star frigate. Before leaving Gwori, Skywalker activated the ship's tractor beam, bringing the still frozen Toomer aboard. The shipyards were destroyed, and Skywalker safely piloted the cruiser to Coruscant, where Toomer was successfully unfrozen. He was disappointed to discover that he had missed the entire mission, but CT-7567 told him that there were still many battles to be fought.\nToomer displayed considerable disappointment over the fact that he had missed all the action on Gwori. Like all clone troopers, Toomer had the same height as their genetic template Jango Fett, 1.83 meters. The trooper had black hair and brown eyes.\nToomer appeared in The Clone Wars: Shipyards of Doom, a 2008 graphic-novella written by Henry Gilroy and illustrated by the Fillbach Brothers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/The_Clone_Wars:_Shipyards_of_Doom",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Gwori",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Gwori_shipyards",
  "/wiki/Battle_of_Gwori",
  "/wiki/Droid/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Radiation/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/VX-391",
  "/wiki/Pilot/Legends",
  "/wiki/R2-series_astromech_droid",
  "/wiki/R2-D2/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Starship/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Carbon-freezing_chamber/Legends",
  "/wiki/CT-642",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Clone_trooper_captain",
  "/wiki/CT-7567/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Platform_A-61",
  "/wiki/Astromech_droid/Legends",
  "/wiki/Overseer_(CIS)",
  "/wiki/Juhm",
  "/wiki/Hunter_Squadron_(Galactic_Republic)",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/2008",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Henry_Gilroy",
  "/wiki/Fillbach_Brothers",
  "/wiki/Databank_(original)"
 ]
}