{
 "name": "Topi_Topi",
 "display_name": "Topi Topi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ardennia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wayuning"
     ]
    }
   ]
  }
 ],
 "content": "Topi Topi was a Wayuning from Ardennia. By 34 ABY, a bounty had been posted on Topi Topi for stealing a Kowakian monkey-lizard from the Creature Stall in Black Spire Outpost on the planet Batuu. While they were hiding out in the outpost, Topi Topi's location was reported to the Bounty Hunters' Guild. In 35 ABY, Topi Topi attended the Festival of the Ancestors on the planet Pasaana.\nTopi Topi was a Wayuning whose homeworld was Ardennia. During the First Order occupation of the planet Batuu in 34 ABY, there was an outstanding 14000 credit bounty on Topi Topi for having falsely impersonated a creature caretaker and stealing a Kowakian monkey-lizard from the Creature Stall in the market of Black Spire Outpost on Batuu.\nThe bounty also charged Topi Topi with having evaded arrest, and the Wayuning was hiding in one of the buildings of the outpost when the bounty was assigned by the Bounty Hunters' Guild to a individual visiting the outpost. Using a thermal scanner, the individual discovered Topi Topi's location and reported it back to the local Guildmaster's Hideout in order to claim the reward. In 35 ABY, Topi Topi attended the Festival of the Ancestors in the Forbidden Valley of the planet Pasaana. While walking between the various stalls set up for the festival, the Wayuning passed by a group of Resistance agents searching for a Sith wayfinder.\nTopi Topi wore a large brown woven hat and a red and black stripped robe.\nTopi Topi first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker. The character was identified as part of Star Wars: Batuu Bounty Hunters, an augmented reality video game launched at Walt Disney World on July 27, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ardennia",
  "/wiki/Wayuning",
  "/wiki/34_ABY",
  "/wiki/Bounty",
  "/wiki/Kowakian_monkey-lizard",
  "/wiki/Creature_Stall",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/35_ABY",
  "/wiki/Festival_of_the_Ancestors",
  "/wiki/Pasaana",
  "/wiki/Homeworld",
  "/wiki/First_Order",
  "/wiki/Battle_of_Batuu",
  "/wiki/Credit",
  "/wiki/Black_Spire_Outpost_Market",
  "/wiki/Thermal_scanner",
  "/wiki/Guildmaster%27s_Hideout",
  "/wiki/Forbidden_Valley",
  "/wiki/Resistance",
  "/wiki/Sith_wayfinder",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_Batuu_Bounty_Hunters",
  "/wiki/Video_game",
  "/wiki/July_27",
  "/wiki/2022",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/File:BatuuBountyHunters-TopiTopi.png",
  "/wiki/Category:Images_of_Topi_Topi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Rise_of_the_Resistance",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Battle_of_Yavin",
  "/wiki/Yavin_Prime"
 ]
}