{
 "name": "Tora",
 "display_name": "Tora",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Tora was a female Human engineer who played part in the war against Zakuul as part of the Alliance.\nBorn during the Cold War, Tora was an orphan who established herself as an engineering prodigy since childhood. Aged eleven, she built a miniature droid to help her cheat on the math exam and another to harass the classmate who ratted her out. For this, she was suspended and placed in counselling to treat her \"antisocial behavior.\" Tora reached adulthood during the Galactic War and became a swoop racer on Nar Shaddaa by the time of the Eternal Empire conquest. Her career was cut short when her attempt to cheat by repurposing thermal detonators into turbo boosters backfired, and the detonators exploded mid-race, destroying the race truck and injuring several racers. Tora survived by miraculously ejecting, but the racers put a bounty on her head as retribution. Tora was forced to flee the Hutt Space and offered her engineering services to captain Koth Vortena on the first ship leaving the smuggler's moon.\nVortena and his crew were themselves defectors from the Eternal Empire, willing to take a stand against Zakuul's new Emperor Arcann. Tora fit in with Vortena's crew, displaying her incredible talent for engineering and earning Vortena's admiration despite her short temper. In 3631 BBY Koth allied with Lana Beniko to rescue her associate from imprisonment in carbonite by Arcann. While making their escape from Zakuul, they came across the legendary vessel called the Gravestone, which they used to travel to Asylum, where Vortena's crew was based. There, Tora was making a supply run to the Free Zone black market, obtaining a pack of thermal detonators from Blast Crew gang run by Tanno Vik. Vik charged her 50,000 credits for one hundred detonators, which Tora found excessive and attempted to rob him instead. Vik's men caught her and Tora insulted Tanno Vik's mother, which angered the Weequay to the point where he was ready to kill her. However, they were interrupted by arrival of HK-55 and the Commander whom Beniko had rescued, send by Vortena to find and assist Tora after she had not returned in time. The bodyguard droid identified Tora as their target, and Vik acknowledged that the Outlander did him a favor by eliminating his old rival Oggo, but still refused to hand Tora over.\nThe Outlander managed to settle things peacefully, allowing Tora to return to Asylum docks and begin her work on the Gravestone, scolding her captain for taking poor care of the ship and for almost frying the power core. When the Eternal Fleet arrived at their position and started the battle of Asylum, the crew managed to escape on the Gravestone, with Tora noting how bad the Outlander looked following a duel with Arcann and asking if she could take their things upon the Outlander's death. Everyone then traveled to Odessen, where Beniko set up a formal Alliance to oppose the Eternal Empire, which Tora joined along with the rest of Vortena's crew. Tora celebrated with others by drinking in a cantina, where she mistook HK-51 series assassin droid for HK-55 and eventually passed out. During the Battle of Odessen she joined the defense of the Alliance base aboard the Gravestone, helping Theron Shan fix the ship's omnicannon.\nIn the battle, the Alliance managed to dethrone Arcann, only for his sister Vaylin to claim the Eternal Throne in his place, teaming up with SCORPIO. The two of them used subterfuge to launch a surprise assault on the Gravestone, boarding the vessel under the guise of a civilian freighter. Vortena himself managed to evade capture, but Tora, Len Parvek and the rest of the crew were held as Vaylin's prisoners on the ship's bridge. SCORPIO, who had ulterior motives, maneuvered Vaylin into leaving the bridge, allowing Koth and the Outlander to reach it and free Tora and the rest. Koth then revealed that he installed a quantum bomb on the ship and ordered Tora and others to the escape pods, where they managed to eject shortly before SCORPIO took control over the vessel and launched it into hyperspace. The Alliance eventually managed to defeat Vaylin and Tora joined the others in traveling to Zakuul on the Gravestone. There the Outlander claimed the Eternal Throne and proclaimed the age of the Eternal Alliance, unifying the military of Zakuul and the Eternal Fleet with the cause of the Alliance, which Tora continued to be a part of.\nTora is a character in Knights of the Fallen Empire and Knights of the Eternal Throne expansions of Star Wars: The Old Republic, first appearing in Chapter VI: Asylum. If the player makes several Dark Side choices and drives Koth Vortena to abandon the Alliance, Tora will have a more prominent role in the events, becoming the captain of the Gravestone and taking Koth's role in the events of the GEMINI trap and the Battle of Odessen.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eternal_Alliance",
  "/wiki/Koth_Vortena",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Engineer/Legends",
  "/wiki/War_against_Zakuul",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Engineer",
  "/wiki/Galactic_War",
  "/wiki/Swoop/Legends",
  "/wiki/Swoop_racing/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Thermal_detonator",
  "/wiki/Bounty/Legends",
  "/wiki/Hutt_Space/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Zakuul",
  "/wiki/Arcann",
  "/wiki/3631_BBY",
  "/wiki/Lana_Beniko",
  "/wiki/Rescue_of_the_Outlander",
  "/wiki/Alliance_Commander",
  "/wiki/Carbonite/Legends",
  "/wiki/Gravestone",
  "/wiki/Asylum",
  "/wiki/Free_Zone",
  "/wiki/Blast_Crew",
  "/wiki/Tanno_Vik",
  "/wiki/Tanno_Vik%27s_mother",
  "/wiki/Weequay/Legends",
  "/wiki/HK-55",
  "/wiki/Bodyguard_droid/Legends",
  "/wiki/Oggo",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Power_core/Legends",
  "/wiki/Eternal_Fleet",
  "/wiki/Battle_of_Asylum",
  "/wiki/Odessen",
  "/wiki/Cantina/Legends",
  "/wiki/HK-51_series_assassin_droid",
  "/wiki/Battle_of_Odessen",
  "/wiki/Alliance_base",
  "/wiki/Theron_Shan",
  "/wiki/Omnicannon",
  "/wiki/Vaylin",
  "/wiki/Eternal_Throne",
  "/wiki/SCORPIO",
  "/wiki/Assault_on_the_Gravestone",
  "/wiki/Len_Parvek",
  "/wiki/Quantum_bomb",
  "/wiki/Hyperspace/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/GEMINI_trap",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/HK-51",
  "/wiki/Kaliyo_Djannis",
  "/wiki/Spire_(Zakuul)",
  "/wiki/Sun_Generator",
  "/wiki/Ralo",
  "/wiki/GEMINI_Prime",
  "/wiki/T7-O1",
  "/wiki/Hylo_Visz"
 ]
}