{
 "name": "Torban_Buck",
 "display_name": "Torban Buck",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chagrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Torban Buck, nicknamed \"Buckets of Blood,\" was a Chagrian male Jedi Master who served the Jedi Order as a healer during the High Republic Era. Alongside Master Yoda, Buck was stationed aboard the Jedi Padawan academic cruiser Star Hopper when the cruiser and its passengers were forced to respond to fallout from the Great Hyperspace Disaster in the Trymant system. He and Yoda intended to handle the largest pieces of debris while the apprentices assisted the civilians. However, a battle broke out against a group of Nihil pirates present on Trymant IV, which led Buck and Yoda to leap to the rescue.\nTorban Buck was a male Chagrian who served as a Jedi Master of the Jedi Order during the High Republic Era. He also served as a Jedi healer. By around 232 BBY, Buck joined the crew of the Padawan Academic Cruiser Star Hopper as one of two Jedi Masters teaching a class of Padawans training onboard the starship, alongside Grand Master Yoda, who was taking a sabbatical from the Jedi High Council. Buck had joined the crew to teach Padawans the basics of first aid.\nAround this time, the Great Hyperspace Disaster occurred in the Hetzal system, when the freighter Legacy Run was destroyed in hyperspace. In its aftermath, Emergences of the debris began occurring across the Outer Rim Territories. When an Emergence occurred in the Trymant system, the Star Hopper was the only Jedi or Galactic Republic starship in range, and it was diverted to assist. With the class of apprentices assembled, Yoda had several of the students report what they had discovered on the situation, as hyperspace debris was hurtling towards Bralanak City, the most densely populated area of the planet Trymant IV. Buck told the class that he and Yoda would be handling the largest pieces of debris. He added that the Padawans' job was to help people on the ground to safety and deal with smaller chunks. The Padawans were then dispatched to their rescue speeders.\nWhile assisting civilians in the city, Padawan Lula Talisola and several of her friends attempted to commandeer a large Spider Cruiser which had arrived in the city so it could be used as an evacuation vehicle. However, the ship belonged to the Nihil pirates, who were disinclined to acquiesce to the request. As Talisola, her best friends Farzala Tarabal and Qort, and Force-sensitive civilian Zeen Mrala, who had stepped in to telekinetically hold off a large chunk of debris, were surrounded by the pirates, Buck and Yoda arrived before the pirates could attempt to execute them.\nAround 230 BBY, Buck was present with Qort, who had recently been knighted, aboard the space station Starlight Beacon when it was attacked by the Nihil. The pair attempted to get a group of younglings off of the station as they were hunted by strange creatures that had been brought aboard the station. Eventually the group encountered the Jedi investigator Emerick Caphtor and private investigator Sian Holt, who had made their way to the station to learn more about the creatures. Qort had the younglings taken aboard Holt's ship and then the Jedi attempted to find one of the creatures so Capthor could get the information he needed.\nCaphtor was unsuccessful in his attempt, but Holt was able to recover one of the creatures severed claws. The group then headed back to Holt's ship, where Buck insisted Caphtor leave the station with Qort and the younglings, and then inform the Jedi Council of his discoveries. Buck then explained to Caphtor that his job aboard the station was not done, and handed his robe, which was covered in blood of the creature, to Caphtor so that he could get a sample from it, adding that he no longer had need for them anyway. Now just in his underwear, Buck insisted that Caphtor go, and told the investigator that he and Qort had already said their goodbyes to each other. The Chagrian wished Caphtor \"May the Force be with you\" as he made his way into a corridor.\nTorban Buck was a male Chagrian with blue skin. Lula Talisola thought that Buck was capable of remaining genuinely calm and collected during a crisis, and that he was not hiding any insecurities the way she was. However, he also possessed a touch of bombast that led him to utilize the nickname \"Buckets of Blood\" when announcing himself in certain situations, such as charging into combat. This occasionally discomfited people. As he was primarily a healer, Buck was wary about being left to safeguard the Padawans by himself during battle.\nTorban Buck was skilled enough in the use of the Force that he had attained the rank of Jedi Master. A healer by trade, he was also an apt teacher and was stationed on the Star Hopper to teach its Padawan class basic first aid. As a result, although he was a capable fighter, he was not comfortable engaging in combat for the long term as it was not his specialty.\nTorban Buck wore brown Jedi robes and wielded a blue-bladed lightsaber.\nTorban Buck first appeared in the 2021 comic book The High Republic Adventures  1, written by Daniel José Older, illustrated by Harvey Tolibao, and published by IDW Publishing on February 3, 2021. Prior to the release of the comic, the character was revealed by Older during the live launch event for the Star Wars: The High Republic publishing initiative on January 4, 2021.\nOlder derived Buck's nickname from legends he heard during his time as a paramedic, in which another paramedic would call himself \"Buckets of Blood\" when responding to jobs over the radio. The plot summary released for The High Republic Adventures 1 named the Jedi Masters in charge of the Star Hopper as Yoda and \"Baro,\" with Older stating he thought it was a remnant from a rough draft.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chagrian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/Jedi_healer",
  "/wiki/High_Republic_Era",
  "/wiki/Yoda",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Cruiser",
  "/wiki/Star_Hopper",
  "/wiki/Trymant_IV_disaster",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Trymant_system",
  "/wiki/Attack_on_Trymant_IV",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Trymant_IV",
  "/wiki/232_BBY",
  "/wiki/Padawan_Academic_Cruiser",
  "/wiki/Starship",
  "/wiki/Grand_Master",
  "/wiki/Jedi_High_Council",
  "/wiki/Hetzal_system",
  "/wiki/Freighter",
  "/wiki/Legacy_Run",
  "/wiki/Hyperspace",
  "/wiki/Emergences",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Galactic_Republic",
  "/wiki/Bralanak_City",
  "/wiki/Planet",
  "/wiki/Rescue_speeder",
  "/wiki/City",
  "/wiki/Lula_Talisola",
  "/wiki/Spider_Cruiser",
  "/wiki/Farzala_Tarabal",
  "/wiki/Qort",
  "/wiki/Force-sensitive",
  "/wiki/Zeen_Mrala",
  "/wiki/Telekinesis",
  "/wiki/Death",
  "/wiki/230_BBY",
  "/wiki/Knighting_ceremony",
  "/wiki/Space_station",
  "/wiki/Starlight_Beacon",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Jedi_Initiate",
  "/wiki/Nameless",
  "/wiki/Jedi_investigator",
  "/wiki/Emerick_Caphtor",
  "/wiki/Sian_Holt",
  "/wiki/Youngling",
  "/wiki/Dismemberment",
  "/wiki/Claw",
  "/wiki/Jedi_robes",
  "/wiki/Blood",
  "/wiki/Medic",
  "/wiki/Torban%27s_lightsaber",
  "/wiki/2021",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_High_Republic_Adventures_(2021)_1",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/Harvey_Tolibao",
  "/wiki/IDW_Publishing",
  "/wiki/February_3",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/January_4",
  "/wiki/The_High_Republic_Adventures_(2021)_2",
  "/wiki/The_High_Republic_Adventures_(2021)_3",
  "/wiki/The_High_Republic_Adventures_(2021)_4",
  "/wiki/The_High_Republic_Adventures_(2021)_5",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_9",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic_Adventures:_Galactic_Bake-Off_Spectacular",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/The_High_Republic:_Trail_of_Shadows_5",
  "/wiki/Category:Images_of_Torban_Buck",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Accessories_and_Structures",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/StarWars.com",
  "/wiki/November_20",
  "/wiki/2020"
 ]
}