{
 "name": "Tord_Gamb",
 "display_name": "Tord Gamb",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Port Evokk"
     ]
    },
    {
     "name": "Born",
     "values": [
      "40 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    }
   ]
  }
 ],
 "content": "Tord Gamb was a con-artist and gambler who was born on Port Evokk. He was known to have engaged in confidence schemes in the Sluis Van, Bimmisaari, Maphus Tria, Algarra II, and Asmall systems. The New Republic placed a 25,000 credit bounty on his head. Airen Cracken was willing to negotiate with Gamb, offering a job within the Republic, in exchange for his information finding skills.\nTord Gamb was born on the planet Port Evokk in 40 BBY. A gambler and con artist with a history of frauds, cons and deceptions, Gamb was relatively quiet until the rise of the New Republic. Posing as a free-trader with supplies needed by the Sluis Van Shipyards, Gamb gained access to the installation and proceeded to con numerous individuals out of credits totaling several hundred thousand.\nGamb proceeded to pull similar operations on the planets Bimmisaari, Maphus Tria, and Algarra II. It was also believed that Gamb was in possession of detailed information regarding the New Republic's defense net around the manufacturing planet of Asmall. If the information were to reach the Galactic Empire, the world could have fallen. The New Republic posted a 25,000 credit reward for Gamb's capture on the charges of theft, larceny, fraud, espionage, and theft of computer data. Despite the danger Gamb's possession of the Asmall defense data posed to the New Republic, General Airen Cracken believed the gambler could be an asset due to his underworld contacts. Agents were authorized to approach Gamb and offer him a deal; in exchange for his services to the New Republic, all charges could be dropped.\nGamb was a Human male who was 1.8 meters tall. He as a consummate gambler and con man, with a skill for bargaining, persuading other individuals, and conducting investigations.\nTord Gamb was trained to use a blaster, although did not carry one. A thief and con artist, Gamb was also a skilled pick pocket. He was knowledgeable about alien species, cultures, languages, and planetary systems, and had an understanding of bureaucratic procedure and business practices. Gamb had valuable underworld contacts, and could determine the value of items.\nGamb was a skilled pilot, able to navigate space transports through hyperspace and realspace. He was also proficient with the weapon and deflector shield systems on small vessels, and was trained in their repair. Gamb's technical skills also included computer programming, droid programming and repair, and bypassing security systems. He could also operate repulsorlift vehicles, and ride domestic beasts. Gamb was also trained in stealth tactics, as well as demolition techniques.\nTord Gamb owned and operated a stock YT-1300 light freighter. He also had a pocket computer with three pre-programmed hyperspace jumps, and a datapad.\nTord Gamb was profiled in Wanted by Cracken, published in 1993 by West End Games for use with the Star Wars: The Roleplaying Game. The image was provided by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Port_Evokk",
  "/wiki/40_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Gambling/Legends",
  "/wiki/Sluis_Van/Legends",
  "/wiki/Bimmisaari/Legends",
  "/wiki/Maphus_Tria",
  "/wiki/Algarra_II",
  "/wiki/Asmall",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Bounty/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Gambler/Legends",
  "/wiki/Con_artist/Legends",
  "/wiki/Free-trader",
  "/wiki/Sluis_Van_Shipyards",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Computer/Legends",
  "/wiki/General/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Species/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Pocket_computer",
  "/wiki/Datapad/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Mike_Vilardi",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com"
 ]
}