{
 "name": "Torel_Vorne",
 "display_name": "Torel Vorne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Reuss VIII"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Reussi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Torel Vorne was a male Reussi. He was the most powerful crimelord on the planet Reuss VIII.\nTorel Vorne, a male Reussi, was the main crime lord of Reuss VIII in times of the Galactic Empire. He was influential enough to affect the custom regulations on his planet.\nAt some point, Vorne hired a kid by the name of Deral Reiko who eventually became Vorne's protegee and then his ruthless minion, expert in tracking information. Eventually Reiko began a career of his own, but even then, sometimes, Vorne hired him on a case-by-case basis.\nHis policy centered on transactions, caring little about the goods or services involved, but having a great interest in the economic profit. As he had to deal with several traders unable to pay him back, Vorne created an \"organ donation policy\" for these people: He could forget the debts in exchange for some of the debtor's internal organs, with the more important organs paying more credits. In highly-polluted Reuss VIII, organs were a valuable good. This was a dangerous choice because Vorne's surgeons were everything but careful but, as the alternative meant facing some of Vorne's thugs, many debtors opted to try cybernetic replacements.\nGunrunner Tiv \"Poke\" Pocarno, owner of the badly-maintained Suwantek Systems TL-1800 Transport Broken 'Spanner, asked Vorne for a loan he intended to return after a successful smuggling run off Rampa. Pocarno failed to comply and died because of Vorne's organ donation policy. Vorne then requisitioned and repaired Pocarno's ship, although the 'Spanner still required expensive maintenance.\nTorel Vorne was short in height. He had water-blue eyes that never seemed to blink and black hair that was fading during the Rebellion era.\nVorne maintained he was not vain about his appearance, and indeed he did not use clothes of his size. He used a breath mask anytime he had to meet another person or to be outdoors, even if he was not in Reuss VIII.\nTorel Vorne was first mentioned in the 1993 book Galaxy Guide 9: Fragments from the Rim, a supplement to Star Wars: The Roleplaying Game published by West End Games, written by Simon Smith and Eric S. Trautmann, and edited by Bill Smith. He was mentioned again in 1997 in Stock Ships, another role-playing game from West End Games. His first appearance in a story was in Edward M. Erdelac's Hyperspace exclusive tale Fists of Ion (2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Reuss_VIII",
  "/wiki/Reussi",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Deral_Reiko",
  "/wiki/Cyborg/Legends",
  "/wiki/Tiv_Pocarno",
  "/wiki/Suwantek_Systems",
  "/wiki/TL-1800_Transport",
  "/wiki/Broken_%27Spanner",
  "/wiki/Rampa_II/Legends",
  "/wiki/Rebellion_era",
  "/wiki/Breath_mask/Legends",
  "/wiki/1993",
  "/wiki/Galaxy_Guide_9:_Fragments_from_the_Rim",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/Simon_Smith",
  "/wiki/Eric_S._Trautmann",
  "/wiki/Bill_Smith",
  "/wiki/1997",
  "/wiki/Stock_Ships",
  "/wiki/Edward_M._Erdelac",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Fists_of_Ion",
  "/wiki/2008",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Torel_Vorne",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds",
  "/wiki/Galaxy_Guide_11:_Criminal_Organizations",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy"
 ]
}