{
 "name": "Torius",
 "display_name": "Torius",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3640 BBY",
      "Voss"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireSphere of Expansion and Diplomacy",
      "Sphere of Expansion and Diplomacy"
     ]
    }
   ]
  }
 ],
 "content": "Lord Torius was a Sith pureblood male Sith Lord of the reconstituted Sith Empire during the Cold War.\nStationed on Voss, Lord Torius was a top Sith diplomat who fancied himself a clever schemer worthy of the title \"Darth\". He took great pleasure in flustering the Republic's representatives when they met with the Voss and seemed determined to secure the planet as an Imperial holding by any means necessary.\nThe death of a Republic negotiator several months ago, while officially attributed to a Gormak attack, was almost certainly a murder orchestrated by Torius. He maintained no close associates, seeking to prove his intellectual superiority without anyone else around to take the credit for it. He spent his private time on Voss alternating between long periods of deep thought and sudden bursts of text-entry into his encrypted datapad.\nDuring the Galactic War, Torius was involved in negotiations with the Voss to align with the Empire against Senator Evran. However, Torius had an ulterior motive for being on Voss. He secretly launched a plan to place a stolen Republic ZR-57 orbital strike bomb beneath the Voss capital of Voss-Ka and hold it hostage. This was out of many plans that were conceived and Torius was confident that the Voss could not foresee all of them. However, Havoc Squad discovered his plan and confronted him. Torius underestimated Havoc and died in the ensuring battle. The Voss then revealed themselves, the Mystic Ki-Ve having foreseen Torius' plan and that Havoc Squad would stop him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3640_BBY",
  "/wiki/Voss",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sphere_of_Expansion_and_Diplomacy",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Diplomat/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Voss_(species)",
  "/wiki/Planet/Legends",
  "/wiki/Gormak/Legends",
  "/wiki/Galactic_War",
  "/wiki/Evran",
  "/wiki/ZR-57_orbital_strike_bomb",
  "/wiki/Voss-Ka",
  "/wiki/Havoc_Squad",
  "/wiki/Ki-Ve",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}