{
 "name": "Torian_Cadera",
 "display_name": "Torian Cadera",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Geonosis"
     ]
    },
    {
     "name": "Born",
     "values": [
      "3660 BBY",
      "Geonosis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Cadera"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Eternal Alliance",
      "Galactic Republic",
      "Task Force Nova",
      "Task Force Nova"
     ]
    }
   ]
  }
 ],
 "content": "Torian Cadera was a male Human Mandalorian warrior and a son of Mandalore the Vindicated's rebellious opponent, Jicoln Cadera. Seeking to reclaim the honor of his clan, Torian teamed up with the Grand Champion of the Great Hunt to hunt his father on Taris, joining with the Hunter's crew after the deed was done. Torian traveled with the Hunter for years, being briefly kidnapped by GenoHaradan on Hoth. After the Champion disappeared early in the Eternal Empire conquest, Torian answered the call of the new Mandalore the Avenger and eventually became the chieftain of Clan Cadera as its numbers dwindled. Joining other Mandalorians under the wing of the new Mand'alor, Torian assisted the Commander of the Alliance opposing Zakuul in a raid on the Darvannis factory, formally joining the Alliance as Shae Vizla's representative afterwards. As part of the war against Zakuul Torian led a team of Mandalorian Commandos during the Invasion of Voss, helping to liberate the city of Voss-Ka. While reclaiming the Gravestone from the Eternal Empress Vaylin, Torian and other Alliance personnel were trapped by ARIES on the artificial world of Iokath and worked together to escape before the world was covered by a radiation pulse. When Vaylin launched an assault on Odessen where the Alliance base was located, Torian led a group of Mandalorian Commandos to assist Bey'wan Aygo, until their position was overrun, with Torian as the last one left standing. The Alliance Commander was forced to choose between rescuing either Torian or the Twi'lek escape artist Vette, with the second choice being captured and later killed by Vaylin.\nTorian was born on the Mandalorian stronghold world of Geonosis to Jicoln Cadera, leader of the Crusader's schism and an opponent of Mandalore the Vindicated. All his life, Torian dedicated himself to overcome the stigma of being the son of a traitor, but the shadow of his father always seemed to weigh on him in the eyes of the other Mandalorians. As a consequence of the constant reminder of his clan's shame among his peers, Torian adhered to the Mandalorian codes of honor and traditions with more devotion than many warriors twice his age. He always strove to prove his loyalty to Mandalore. During the Cold War, Torian fought and traveled with his people, fighting with Clan Ordo on Eriadu to destroy a weapon's factory, being forced to face snipers and mines on the way. Things become trouble once they discovered resistance fighters hiding among the workers. They were able to evacuate as many civilians as they could before destroying the factory with thermal detonators.\nIn 3642 BBY Torian traveled to the Imperial capital of Dromund Kaas to slay a deadly Sithspawn Akure alongside several other clans. At the same time, the latest Grand Champion of the Great Hunt was dispatched by Mandalore the Vindicated to slay the Sithspawn and succeeded in his task. Torian later found out that his traitorous father was in hiding on the planet Taris and, motivated to cleansing his clan of his father's dishonor, traveled to Taris where under the command of Vorten Fett he went on to search for and kill his father. While on his mission, Torian again ran into the Champion, who was also searching for Jicoln to claim his bounty on the Blacklist. Together, Torian and the Champion tracked down Jicoln to his hideout and eventually confronted him. Defeated, Jicoln shared a few words with his son before Torian killed him, reclaiming his clan's honor.\nTorian asked the Champion to join their crew, claiming another Blacklist bounty, before his new friend was put at the top of the Republic's Most Wanted list. With the entire galaxy gunning for them, Gault Rennow suggested working for the Hutts, an idea that Torian was firmly opposed to. Before they could come to blows, Gault arguing that he's been dodging poetic justice since before Torian was born, they received a summons from the Sith Lord Darth Tormen. Tormen offered the Champion to work for him, promising revenge against the Jedi Battlemaster Jun Seros and Supreme Chancellor Dorian Janarus for targeting them in return. While the Champion was chasing Zale Barrows on Belsavis, Torian was captured by the secretive assassination guild the GenoHaradan, being lured into a trap after receiving a meeting request from a friend. The Champion tracked the kidnappers to Hoth, defeated all of the captors, and freed Torian.\nDuring the Eternal Empire conquest in 3636 BBY, the Champion went missing. The Champion's crew attempted to find their boss, even infiltrating the Spire on Zakuul, but unable to locate their target they eventually went broke, with their goals. Eventually, everyone but Torian and the slicer Mako had left to pursue their own ends, leaving the two to resume bounty hunting by themselves, enduring the exile. When the new Mandalore the Avenger summoned all of the Mandalorian clans, Torian answered the call and left Mako on Carratos, confident she could care for herself. Torian would rise up to become one of the new Mandalore's top advisors alongside Khomo Fett, eventually became the chieftain of Clan Cadera even though its numbers dwindled.\nIn 3630 BBY Shae Vizla received an offer from the new Alliance opposing Zakuul to raid a weapons factory on Darvannis, giving the Mandalorians a chance to both strike back against the Eternal Empire and rearm themselves after a prolonged campaign. Torian scouted the factory's perimeter defenses, reporting to Mandalore and the Alliance Commander, whom he joined in capturing the perimeter guns and reprogramming them to target the factory. When Breyer Chorn reported that he and his men were being overrun by Skytroopers, Torian stated that there was no honor and being killed by machines and attempted to target Chorn's location for an artillery strikes, killing the warriors along the droids, before being stopped by the Alliance Commander. The next day, Torian again joined the Commander in neutralizing the enemy forces at the Zakuulan listening post in preparation for the main assault. In there, he overheard the Commander's advisor Lana Beniko suggesting that the Mandalorians were animalistic in nature and that rearming them could potentially prove dangerous in the future.\nWith the factory's power stations taken overs by Clan Beroya and Clan Fett warriors, Shae Vizla gathered the warriors to rally them before the final assault. The main Mandalorian force moved into the factory to claim as many weapons as possible, while Torian accompanied the Commander on a mission to secure the GEMINI Prime, the template for the GEMINI captains of the Eternal Fleet. Inside the factory, Torian revealed that he overheard the previous conversation between the Commander and Beniko and insisted that the Mandalorians were not animals, but warriors with a sense of honor. The Commander was successful in retrieving the PRIME and in the aftermath of the battle Torian requested the Mandalore to join the Alliance as her representative, which Shae Vizla granted. Torian traveled to the Alliance base on Odessen and later was involved in its defense during the battle of Odessen.\nDuring the battle of Odessen Eternal Emperor Arcann was dethroned and his sister Vaylin claimed the Eternal Throne. When she launched an invasion of Voss, Torian joined the Alliance's effort to liberate the planet led a team of Mandalorian Commandos against the enemy forces occupying the city of Voss-Ka. He also brought a Republic walker named Storm Rider that was used by the Commander and Theron Shan in traversing the path to the Shrine of Healing.\nTorian later joined a team assembled by Theron Shan to assist Lana Beniko and the Alliance Commander in retaking the Gravestone from Empress Vaylin and her forces. Theron's shuttle with Torian, Vette, Kaliyo Djannis and Aric Jorgan inside landed inside the hangar of Gravestone just before SCORPIO took control of the vessel and launched it into hyperspace on a locked course. The ship emerged from hyperspace in Iokath system, where Torian was the first to notice the entire Eternal Fleet around them. Vaylin and her remaining forces were found to be sabotaging the ship, with half the Alliance personnel spreading to stop the sabotage, while Torian remained with the other half to defend the ship's bridge. However, they were unable to stop Vaylin, who overpowered both Kaliyo Djannis and Aric Jorgan and took Torian and Vette hostage, but was unable to hurt them before a blinging white light engulfed the ship.\nTorian awoke on the surface of the artificial world Iokath, surrounded by hostile droids. Fighting his way through them, Torian reached the Selruvian biome where he met the Alliance Commander. The two witnessed the Iokath droids attacking the Knights of Zakuul, reasoning that both Alliance personnel and every person from aboard the Eternal Fleet were separated from each other and placed in scenarios that resembled combat simulations. Theron Shan managed contact the Commander and Torian, directing them to a structure called the Tributary, where the rest of Alliance forced had gathered. There, their position came under attack from the droids again, forcing the group to look for another way out. The Commander and Vette went ahead, while the rest eventually followed, meeting them at a disabled colossus droid. There, Theron realized that even though he was unable to locate the Gravestone, he could still use his implant to remotely pilot the Alliance shuttle that was left in its hangar. However, before they could leave on the shuttle, SCORPIO contacted the group and revealed that ARIES, the droid that controlled Iokath, raised an energy shield that would destroy any vessel attempting to leave. With ARIES re-charging the weapon that incapacitated them to begin with and promising to use it again on a lethal setting, the only way out was to stop ARIES. SCORPIO revealed that ARIES base was located in the southern hemisphere and Theron dropped off the Commander and Vette there to deal with ARIES, while the rest went to reclaim the Gravestone based on the shuttle's last known location. SCORPIO herself arrived to help the Commander defeat ARIES, however the capacitors on ARIES' weapon overloaded, threatening the cover the entire world with a pulse of deadly radiation, which the Gravestone just barely managed to escape to hyperspace to avoid.\nVaylin later launched an assault on Odessen, during which Torian led a group of Mandalorian Commandos to assist the forces of Admiral Bey'wan Aygo, but their position was eventually overrun, with Torian left as the last one left standing. Torian made a call to the Alliance Commander for help, but the Commander was forced to choose between rescuing either him or Vette, managing to assist only him, while vette was captured and later killed by Vaylin on the Alliance landing platform. If Torian is rescued, he tells the commander that he's dead weight and to go on without him for now.\nHaving spent most of his life trying redeem his clan's honor from his father's betrayal of Mandalore the Vindicated, Torian upheld the Mandalorian code and traditions more than most other younger Mandalorians. He embodied each of the Mandalorian ideals in hopes of striving the respect and honor of his fellow Mandalorians. Even when insulted by his fellow Mandalorians like Jogo, he didn't react and remained calm about it.\nTorian expressed a strong dislike towards slavery, calling it like hunting mice. He had shown also to be against the idea of working for the Hutt clans, seeing it as going against his honor. When on the pirate hideout world of Rishi, he was interested in the native people, the Rishii, saying they would make good Mandalorians for their natural hunting skills.\nWhen the Eternal Empire invaded the galaxy and the Grand Champion disappeared from the galaxy, Torian finally had his chance to prove his loyalty and duty to his people as he volunteered for the most dangerous of missions against the invaders, becoming very successful in these missions enough to earn the respect of Mandalore the Avenger. Like most Mandalorians, Torian Cadera was not afraid put his life on the line if it meant protecting his friends or completing a mission, having very little fear of death.\nTorian wore a lighter version of the TH-15B War Medic armor colored classic yellow and brown and a jetpack. His armor had a wrist mounted blade and a flamethrower, while his primary weapon was either a techblade or a small techstaff. He was also often seen armed with a Blaster pistol and/or a Sniper rifle. During the war against the Eternal Throne, Torian switched his armor to a unique set of dark blue Mandalorian armor and the sniper rifle became his primary weapon.\nTorian Cadera appears in Star Wars: The Old Republic as a companion character for the bounty hunter class, voiced by Johnny Yong Bosch. Female bounty hunters can romance, and eventually marry Torian. If not romanced in the base game, Torian may begin a romantic relationship with Mako, another of the Hunter's companions.\nTorian later becomes a companion for characters of all classed following the completion of Chapter XIV: Mandalore's Revenge in the Knights of the Fallen Empire expansion, where his weapon changes from a techstaff to a sniper rifle. Female bounty hunters can choose to continue their previous romance or break up with him. During Knights of the Eternal Throne Chapter VIII: End Times, the player has to choose between saving either Vette or Torian while letting the other one be killed by Vaylin, neither of which is a Light or Dark side choice.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Torian_Cadera",
  "/wiki/Geonosis/Legends",
  "/wiki/3660_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Clan_Cadera",
  "/wiki/Mandalorian/Legends",
  "/wiki/Eternal_Alliance",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Task_Force_Nova",
  "/wiki/Mandalore_the_Vindicated",
  "/wiki/Jicoln_Cadera",
  "/wiki/Grand_Champion_of_the_Great_Hunt",
  "/wiki/Taris/Legends",
  "/wiki/GenoHaradan",
  "/wiki/Hoth/Legends",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Mandalore_the_Avenger",
  "/wiki/Mand%27alor",
  "/wiki/Alliance_Commander",
  "/wiki/Zakuul",
  "/wiki/Raid_on_Darvannis",
  "/wiki/Darvannis_factory",
  "/wiki/War_against_Zakuul",
  "/wiki/Invasion_of_Voss",
  "/wiki/Voss-Ka",
  "/wiki/Gravestone",
  "/wiki/Vaylin",
  "/wiki/ARIES",
  "/wiki/Iokath",
  "/wiki/Assault_on_Odessen",
  "/wiki/Alliance_base",
  "/wiki/Bey%27wan_Aygo",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Vette",
  "/wiki/Crusader%27s_schism",
  "/wiki/Mandalore_(title)",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Clan_Ordo",
  "/wiki/Eriadu/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/3642_BBY",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dromund_Kaas",
  "/wiki/Sithspawn/Legends",
  "/wiki/Akure",
  "/wiki/Hunter_(individual)",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Vorten_Fett",
  "/wiki/Blacklist",
  "/wiki/Death/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Gault_Rennow",
  "/wiki/Hutt/Legends",
  "/wiki/Darth_Tormen",
  "/wiki/Jedi_Battlemaster",
  "/wiki/Jun_Seros_(Jedi)",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Dorian_Janarus",
  "/wiki/Zale_Barrows",
  "/wiki/Belsavis/Legends",
  "/wiki/3636_BBY",
  "/wiki/Spire_(Zakuul)",
  "/wiki/Mako_(slicer)",
  "/wiki/Carratos",
  "/wiki/Mandalore",
  "/wiki/Khomo_Fett",
  "/wiki/3630_BBY",
  "/wiki/Darvannis",
  "/wiki/Eternal_Empire",
  "/wiki/Breyer_Chorn",
  "/wiki/Skytrooper",
  "/wiki/Lana_Beniko",
  "/wiki/Clan_Beroya",
  "/wiki/Clan_Fett",
  "/wiki/GEMINI_Prime",
  "/wiki/GEMINI",
  "/wiki/Eternal_Fleet",
  "/wiki/Odessen",
  "/wiki/Battle_of_Odessen",
  "/wiki/Arcann",
  "/wiki/Eternal_Throne",
  "/wiki/Storm_Rider",
  "/wiki/Theron_Shan",
  "/wiki/Shrine_of_Healing",
  "/wiki/Kaliyo_Djannis",
  "/wiki/Aric_Jorgan",
  "/wiki/SCORPIO",
  "/wiki/Iokath_system",
  "/wiki/Selruvian_biome",
  "/wiki/Knights_of_Zakuul",
  "/wiki/Tributary",
  "/wiki/Colossus_droid",
  "/wiki/ARIES_base",
  "/wiki/Resol%27nare",
  "/wiki/Jogo",
  "/wiki/Rishi/Legends",
  "/wiki/Rishii/Legends",
  "/wiki/TH-15B_War_Medic",
  "/wiki/Jetpack/Legends",
  "/wiki/Flamethrower/Legends",
  "/wiki/Techblade",
  "/wiki/Techstaff",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Sniper_rifle/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Johnny_Yong_Bosch",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Eternal_Flagship",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/The_Holonet",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}