{
 "name": "Toria_Tell",
 "display_name": "Toria Tell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tebru"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Toria Tell was a Human female droid inventor, historian, and collector based on the Outer Rim world of Tebru. Her expansive home on that rocky world contained a workshop, an extensive research library, and a droid collection consisting of some of the oldest and rarest droids ever constructed. Her love of collecting, building, and learning about droids grew from her fascination with efficient machinery and how it interacted with its environment and organic beings, and from her trust in machinery to carry out a task without the annoying or dangerous quirks a living being might demonstrate.\nIn addition to tinkering in her home, Tell also traveled the galaxy in her personal stock light freighter, exploring new droid designs, acquiring new pieces for her collection, and chronicling her findings in \"Toria Tell's Droid Journal,\" a small, private scandoc distributed in a limited fashion around the galaxy. One release of this scandoc during the Galactic Civil War included information on the TelBrinTel Science Research Droid, the Lovolan Supreme-class servant droid, the Scavenger Series Labor and Recycling Droid, the Ulban Arms Class I Defense Droid, and the Publictechnic 850.AA Public Service Headquarters and Maintenance Droid. She also commented on entries for the S2R Science Droid and the 87-RM Scouting Droid in Version 4.7.110 of Cynabar's Droid Datalog, under the screen name \"Toria.\"\nHer exploits gave her a reputation as a persistent and resourceful troublemaker, and were funded through means not immediately apparent to others. Speculation held that she had inherited a substantial fortune, or that she was actually a well-paid spy. Officials within the Empire suspected she was a link in the growing chain of subversives and malcontents in the Rebel Alliance.\nWhile traveling, Tell kept with her her stock light freighter, a comlink, a portable computer, a tool kit, and a hold-out blaster.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tebru",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Historian/Legends",
  "/wiki/Collector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Library/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Light_freighter/Legends",
  "/wiki/Toria_Tell%27s_Droid_Journal_(scandoc)",
  "/wiki/Scandoc/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/TelBrinTel_Corporation",
  "/wiki/Science_Research_Droid",
  "/wiki/Lovolan",
  "/wiki/Supreme-class_servant_droid",
  "/wiki/Scavenger_Series_Labor_and_Recycling_Droid",
  "/wiki/Ulban_Arms",
  "/wiki/Class_I_Defense_Droid",
  "/wiki/Publictechnic",
  "/wiki/850.AA_Public_Service_Headquarters",
  "/wiki/S2R(A)_Science_Droid",
  "/wiki/87-RM_Scout_Collector",
  "/wiki/Cynabar%27s_Droid_Datalog",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Portable_computer",
  "/wiki/Tool_kit/Legends",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Toria_Tell%27s_Droid_Journal_(article)",
  "/wiki/Star_Wars_Adventure_Journal_10",
  "/wiki/Cynabar%27s_Fantastic_Technology:_Droids",
  "/wiki/Cynabar%27s_Droid_Datalog_(article_series)",
  "/wiki/Star_Wars_Adventure_Journal_13",
  "/wiki/Star_Wars_Adventure_Journal_14"
 ]
}