{
 "name": "Toro_Calican",
 "display_name": "Toro Calican",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Toro Calican was a human male bounty hunter during the time of the New Republic. Looking to get into the Bounty Hunters' Guild, Calican took a job to find the assassin Fennec Shand on Tatooine. He encountered the bounty hunter Din Djarin in the Mos Eisley Cantina, seeking assistance with the job. They managed to capture Shand, who informed Calican that the Mandalorian was a target of the Guild. Calican shot Shand, and instead sought to turn in the Mandalorian. Returning to the Mandalorian's starship, the Razor Crest, Calican captured Grogu, whom the Mandalorian had rescued from the Guild. The Mandalorian killed Calican and left Tatooine with Grogu, ending Calican's bounty hunting career before it had even begun.\nAt some point, Toro Calican became a bounty hunter with the hopes of joining the Bounty Hunters' Guild. He left the Mid Rim and traveled to Tatooine when he accepted a bounty placed on Fennec Shand, an assassin who worked for various crime syndicates. While residing in Chalmun's Spaceport Cantina, he encountered the Mandalorian bounty hunter Din Djarin, who was looking for jobs to earn credits. Calican introduced himself and displayed Shand's holopuck. He explained his mission and offered to team up with the Mandalorian to hunt her down. Djarin refused, claiming that they would fail as Shand was a highly skilled mercenary. As he was about to leave the cantina, Calican revealed that this was his first bounty and offered all of his credits, finally convincing the Mandalorian. Djarin asked for the tracking fob, but Calican destroyed it claiming he had her location memorized. The Mandalorian then told Calican to prepare two Zephyr-J speeder bikes outside of Hangar 3-5.\nCalican brought the speeder bikes as requested and greeted the mechanic Peli Motto outside the docking bay, taking notice of an infant in her arms. The two took off for the Dune Sea, but stopped on the way upon noticing a blockade of banthas and Tusken Raiders. As he used his binoculars to scan the horizon, he was startled by two Tusken Raiders. Djarin convinced them to pass through and gave them Calican's binoculars as payment, much to his dismay. Upon reaching Shand's location, they spotted a dewback dragging a dead bounty hunter. Calican waited as the Mandalorian made his way to the dewback to inspect the body. When Shand began attacking Djarin, Calican took cover as the Mandalorian ran back to his location, who decided that they wait until nighttime to make their move on Shand, with Calican taking first watch.\nWhen the suns set, Calican attempted to wake Djarin up, but found him asleep. He played with his blaster pistol, aiming it at his partner, but Djarin caught his act. A startled Calican then holstered his blaster, claiming he was only trying to wake him up. The two then got on their bikes and proceeded to reach Shand's position, alternating between flash charges to avoid her sniper bolts. While the Mandalorian's bike was shot down, Calican took the opportunity to sneak up behind the assassin. While holding her at gunpoint, Shand threw a blade and knocked the bounty hunter's hand off-balance, allowing her to close in and fight him in hand-to-hand combat. Calican attempted to subdue her, but Shand ultimately defeated him. While strangling him, Djarin arrived at their position and held her at gunpoint, freeing Calican in the process.\nAfter capturing Shand, the two brought her to the remaining speeder bike. Djarin instructed Calican to find the dewback they saw earlier, but he refused, stating that he would be leaving his bounty and ride behind. With Djarin gone, Calican and Shand slept until the next sunrise. After waking up, Shand offered him double the price of her bounty, but Calican refused stating that turning her in would allow him to join the Bounty Hunters' Guild.\nShe then explained that the Guild was hunting a far more valuable set of targets, the Mandalorian and the target that accompanied him, which was an infant. Calican realized that the infant was Grogu, who he saw at Mos Eisley earlier in the day. She coaxed the bounty hunter, revealing that the Mandalorian attacked the Guild while escaping Nevarro with the high value target in hand, and that turning them in would bolster his reputation greatly. She offered to help him capture the traitor. However, Calican shot Shand after he figured out she would kill him if he set her free. After leaving the assassin for dead, he got on his bike and made his way back to Bay three-five, taking Motto and Grogu as hostages.\nDjarin returned to the docking bay upon discovering Calican's treachery. While standing behind Motto with Grogu in hand on the Mandalorian's starship, the Razor Crest, Calican ordered Djarin to drop his blaster and raise his arms so that the mechanic could cuff him. He boasted that turning them in would make him a legendary bounty hunter. However, the Mandalorian activated a flash charge and blinded him, who then used the opportunity to move to his right side and shoot the bounty hunter dead. After securing Grogu, Djarin took the credits off Calican's body and paid Motto his starship's repair fees. As the bounty hunter left Tatooine, Motto ordered her pit droids to move his body out of the docking bay and into Beggar's Canyon.\nMotto kept Calican's speeder bike, though it began to rust over time. When Djarin and Grogu returned to Tatooine in search of a supposed Mandalorian, she loaned it to the bounty hunter for his journey to Mos Pelgo. The speeder later exploded after being crashed by a tripwire, destroying it permanently, though Djarin noted that there was still considerable value in the wreckage.\nCalican was 1.75 meters tall, with brown hair, green eyes and light skin. He was eager to enter the Bounty Hunters' Guild, going so far as to pay all of his credits to the Mandalorian in order to achieve his goal, and eventually betraying him with the hopes of achieving a high level of fame in the Guild. He was also inexperienced in various situations, such as dealing with Tusken Raiders or engaging in hand-to-hand combat with Fennec Shand, a skilled assassin. However, when Shand convinced Calican that betraying the Mandalorian would be more profitable that turning her in, he shot her, knowing that freeing her may lead to his death, demonstrating his cleverness. Calican had also grown a sense of complacency in his work, as he failed to assure a fatal wound at point blank range, and had never bothered to confirm Shand's demise.\nCalican wore a blue vest over a black shirt, gloves, pants, and boots. He carried a blaster pistol holstered on his hip and owned a brand new pair of quadnoculars. Calican drove a Aratech Repulsor Company 712-AvA speeder bike to trek across the Tatooine desert dunes.\nToro Calican appeared in Chapter 5 of Jon Favreau's 2019 Disney+ television series The Mandalorian, which aired on December 6, 2019. He was portrayed by Jake Cannavale, with Trevor Logan serving as a stunt double.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bounty_hunter",
  "/wiki/Torro_Sbazzle",
  "/wiki/Devaronian",
  "/wiki/Chef",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Hunt_for_Fennec_Shand",
  "/wiki/Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Din_Djarin",
  "/wiki/Mos_Eisley",
  "/wiki/Chalmun%27s_Spaceport_Cantina",
  "/wiki/Starship",
  "/wiki/Razor_Crest",
  "/wiki/Grogu",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Bounty",
  "/wiki/Mandalorian",
  "/wiki/Credit",
  "/wiki/Holopuck",
  "/wiki/Mercenary",
  "/wiki/Cantina",
  "/wiki/Tracking_fob",
  "/wiki/Zephyr-J",
  "/wiki/Speeder_bike",
  "/wiki/Hangar_3-5",
  "/wiki/Peli_Motto",
  "/wiki/Dune_Sea",
  "/wiki/Bantha",
  "/wiki/Tusken_Raider",
  "/wiki/Dewback",
  "/wiki/Blaster_pistol",
  "/wiki/Holster",
  "/wiki/Flash_charge",
  "/wiki/Sniper_rifle",
  "/wiki/Hand-to-hand_combat",
  "/wiki/File:CalicanGuild-TMS1C5.ogg",
  "/wiki/Standard_day",
  "/wiki/Incident_on_Nevarro",
  "/wiki/Nevarro",
  "/wiki/Stuncuffs",
  "/wiki/DUM-series_pit_droid",
  "/wiki/Beggar%27s_Canyon",
  "/wiki/Cobb_Vanth",
  "/wiki/Freetown",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Blaster",
  "/wiki/Quadnoculars",
  "/wiki/Aratech_Repulsor_Company",
  "/wiki/712-AvA_speeder_bike",
  "/wiki/Chapter_5:_The_Gunslinger",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/December_6",
  "/wiki/Jake_Cannavale",
  "/wiki/Trevor_Logan",
  "/wiki/Category:Images_of_Toro_Calican",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian_5",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Technology",
  "/wiki/Practical",
  "/wiki/Score",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Mandalorian:_Allies_%26_Enemies",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Star_Wars:_Exploring_Tatooine",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Chapter_9:_The_Marshal",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/Chapter_14:_The_Tragedy",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}