{
 "name": "Torve",
 "display_name": "Torve",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Republic Army",
      "Deadeyes",
      "Deadeyes"
     ]
    }
   ]
  }
 ],
 "content": "Torve was a human male lieutenant and CO of the Deadeyes, a Republic Army sniper squad. He was the former XO of Aric Jorgan.\nHavoc Squad's CO and Jorgan located Torve and two other Deadeyes in an Imperial labor camp on Tatooine. After Jorgan introduced his CO to Torve, he demanded to know how exactly he got captured. This confused Torve, who asked if Jorgan hadn't been briefed by Senior Agent Zane. Upon realizing he knew nothing of their mission, Torve refused to say anything, but relented when he was reminded that he required rescuing. Torve explained that the Deadeyes were implanted with trackers and intentionally allowed themselves to be captured to scout the Imperial penal system. They were told that SIS planned for the Imperials to send them to prisons containing POWs and after which SIS would then rescue them and their imprisoned comrades. However, they never anticipated that they would be split up and had been awaiting SIS extraction, which angered Jorgan since the SIS was failing to uphold their end. Torve rationalized that those imprisoned Republic troopers needed rescuing but his former CO pointed out that the Deadeyes risked being executed by the Imperials. Jorgan then called for a proper extraction.\nTorve later contacted Jorgan again to thank him for his rescue and told him he was beginning to see the danger the other Deadeyes were in. He told Jorgan that he was anxious for Havoc to find them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Torve_system",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Republic_Army",
  "/wiki/Deadeyes",
  "/wiki/Lieutenant/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Aric_Jorgan",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Tatooine/Legends",
  "/wiki/Zane_(SIS)",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}