{
 "name": "Tosan",
 "display_name": "Tosan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zygerrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tosan was a Zygerrian female Jedi Master who served the Jedi Order and the Galactic Republic following the Battle of Naboo. At some point, she informed Jedi Knight Obi-Wan Kenobi that the Jedi Council had a mission for him concerning a Jedi holocron discovered on the planet Dallenor. Tenacious by nature, Tosan used a yellow-colored double-bladed lightsaber.\nOnce a guardian Jedi Knight, Tosan attained the rank of Jedi Master while serving the Jedi Order and the Galactic Republic. Sometime after the Battle of Naboo in 32 BBY, Tosan met with Jedi Knight Obi-Wan Kenobi at the Jedi Temple on the planet Coruscant to inform him that the Jedi Council had assigned him a mission to the Mid Rim world of Dallenor.\nInterrupting Kenobi's training session with his Padawan, Anakin Skywalker, Tosan handed over a datapad to Kenobi containing the details of his assignment. He was to investigate the discovery of an ancient Jedi holocron, a Jedi artifact used to store information, by an archaeology team excavating on Dallenor.\nTosan was a Zygerrian female who had gold eyes, tan skin, and pink hair. She was considered to be a tenacious Jedi.\nJedi Master Tosan wielded a yellow-colored double-bladed lightsaber. She wore brown Jedi robes with a green overtunic and brown undertunic, a utility belt, and a pair of brown boots. Tosan also occasionally wore a pair of brown gloves.\nTosan was introduced as playable character \"Jedi Knight Guardian\" in the 2015 mobile game Star Wars: Galaxy of Heroes, which features characters from both the canon and Legends continuities. The character was later identified by name when she appeared in the canon comic Age of Republic - Obi-Wan Kenobi 1, which was written by Jody Houser, illustrated by Cory Smith, and released by Marvel Comics on January 2, 2019. Tosan's inclusion in the comic book was conceived by Houser, who is a fan of the mobile game.\n\"Jedi Knight Guardian\" was designed by artist Noah Soliday Bench for Star Wars: Galaxy of Heroes. In the game, a non-playable character, \"Apprentice Sentinel,\" has the same character model as Tosan. The former character also wields a double-bladed lightsaber, albeit it features orange-colored blades.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Zygerrian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/Battle_of_Naboo",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_High_Council",
  "/wiki/Mission_to_Dallenor",
  "/wiki/Jedi_holocron",
  "/wiki/Dallenor_Excavation",
  "/wiki/Planet",
  "/wiki/Dallenor",
  "/wiki/Double-bladed_lightsaber",
  "/wiki/32_BBY",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Jedi_training",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/Limb",
  "/wiki/Datapad",
  "/wiki/Jedi_artifact",
  "/wiki/Archaeology",
  "/wiki/Archaeologist",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Jedi",
  "/wiki/Clothing",
  "/wiki/Jedi_robes",
  "/wiki/Utility_belt",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/2015",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Age_of_Republic_-_Obi-Wan_Kenobi_1",
  "/wiki/Jody_Houser",
  "/wiki/Cory_Smith",
  "/wiki/Marvel_Comics",
  "/wiki/January_2",
  "/wiki/2019",
  "/wiki/Noah_Bench",
  "/wiki/Apprentice_Sentinel",
  "/wiki/Lightsaber",
  "/wiki/Category:Images_of_Tosan",
  "/wiki/Electronic_Arts",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/File:Tosan_GoH.png"
 ]
}