{
 "name": "Toshma_Jefkin",
 "display_name": "Toshma Jefkin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alderaanian consular security",
      "Alderaanian consular security"
     ]
    }
   ]
  }
 ],
 "content": "Toshma Jefkin was a human male who served as a soldier in the Rebel Alliance's military and as a guard in the Alderaanian consular security. He was serving aboard the Tantive IV as its second officer in 0 BBY.\nToshma Jefkin served in the Alderaanian consular security, a force responsible for guarding and escorting Alderaanian dignitaries. Because the royal family of Alderaan was secretly affiliated with the Rebel Alliance, Jefkin himself was involved in the war against the Galactic Empire as a soldier of the Rebel Military. By the year 0 BBY, Jefkin served as second officer on the Tantive IV, a CR90 corvette commanded by Captain Raymus Antilles and used by Princess Leia Organa as her consular ship. By then, Jefkin and the captain had served together for years, sharing many close encounters with Imperial forces.\nAfter it was damaged in a perilous mission, the Tantive IV was docked aboard the Rebel MC75 Star Cruiser flagship Profundity, where it underwent repairs. However, the Profundity was sent to Scarif, where a team of Rebels attempted to steal the plans of the Empire's Death Star battle station. After the Profundity intercepted the rebel transmission of the Death Star plans, the redoubtable Dark Lord of the Sith Darth Vader boarded the cruiser. Having copied the stolen plans on a datacard, some crewmembers of the Profundity attempted to board the Tantive IV in time. The bearer of the the datacard, however, could not enter the corvette because of a jammed security door. On the other side of the door, Jefkin managed to get ahold of the precious device through a slight opening. Once in possession of the plans, he charged through the corridors of the Profundity until he reached the cruiser's docking bay and the entry hatch to the Tantive IV. The moment Jefkin boarded the corvette, he ordered the ship's launch. Once the Tantive IV zoomed away, leaving the hangar behind, the security guard handed the datacard off to a woman who then took it to Captain Antilles.\nHis encounter with Vader, whose identity was unknown to him, left Jefkin deeply rattled. He recountered the incident shortly afterward in a meeting with the Tantive IV's senior officers and Organa as they tried to decide how to proceed with delivering the Death Star plans.\nA male human, Jefkin had light skin and brown eyes.\nAs a member of the Alderaanian consular security, Jefkin carried a DH-17 blaster pistol and wore the traditional uniform, which featured a service helmet with flash visor and integral comlink and a multi-pocketed spacer vest of Corellian cut.\nToshma Jefkin was portrayed by Christopher Patrick Nolan in the 2016 Star Wars Anthology film Rogue One: A Star Wars Story. His role was confirmed in the movie's credits. Nolan was at Pinewood Studios for four days, during additional photography and reshoots, and his part was filmed in three days.\nThe character's name was coined in Matt Forbeck's junior novelization of the movie. With the approval of Jennifer Heddle and the Lucasfilm Story Group, Forbeck named the character in tribute to his friend Jeff Mackintosh, who had died of brain cancer in the fall of 2016 and was a Star Wars fan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alderaanian_consular_security",
  "/wiki/Rebel_trooper",
  "/wiki/Alliance_Military",
  "/wiki/Security_guard",
  "/wiki/Tantive_IV",
  "/wiki/Second_officer",
  "/wiki/0_BBY",
  "/wiki/Law_enforcement_agency",
  "/wiki/Alderaanian",
  "/wiki/House_of_Organa",
  "/wiki/Alderaan",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Standard_year",
  "/wiki/CR90_corvette",
  "/wiki/Captain",
  "/wiki/Raymus_Antilles",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Consular_ship",
  "/wiki/Unidentified_fleet_trooper",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/Profundity",
  "/wiki/Scarif",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cruiser",
  "/wiki/Datacard",
  "/wiki/Officer",
  "/wiki/Eye",
  "/wiki/DH-17_blaster_pistol",
  "/wiki/Armor",
  "/wiki/Comlink",
  "/wiki/Spacer",
  "/wiki/Corellian",
  "/wiki/Christopher_Patrick_Nolan",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Pinewood_Studios",
  "/wiki/Matt_Forbeck",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Jennifer_Heddle",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Jeff_Mackintosh",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Raymus",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)"
 ]
}