{
 "name": "Tosta",
 "display_name": "Tosta",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bastatha security forces"
     ]
    }
   ]
  }
 ],
 "content": "Tosta was a male Nikto magistrate on the planet Bastatha in 28 ABY. Tosta worked with another magistrate, Xun. Tosta was in cahoots with elements of organized crime on Bastatha, and helped lead New Republic Senator Leia Organa into a kidnapping plot when she arrived on Bastatha to investigate Rinnrivin Di's criminal empire.\nTosta was a Nikto who served as a Magistrate on the planet Bastatha during the New Republic reign. In 28 ABY, he and his colleague Magistrate Xun greeted the visiting senators Leia Organa, Ransolm Casterfo, and their entourage; who had come to investigate the Nikto crime lord Rinnrivin Di's cartel, which had a presence on Bastatha. Tosta greeted senator Organa while Xun greeted Casterfo. The two Magistrates also plied their other guests including Leia's protocol droid C-3PO with flattery.\nTosta informed his guests that he had prepared a table at their grandest establishment, which turned out to be a casino. Xun added that they were trying to rebrand Bastatha as a sophisticated gambling destination. Tosta also offered Riosan mead for Casterfo, knowing that the senator came from the planet Riosa. Tosta also allowed Leia and her entourage to play sabacc after the meal with their other guests. During the banquet, Tosta and Xun informed the New Republic delegation about investors without identifying who they were. They also praised the New Republic in terms that were a flattering to the Populist Leia but insulting to the Centrist Casterfo. In secret, most of the revenue from Bastatha's gambling profits were flowing to Rinnrivin's cartel, which was secretly funding the First Order's fleet.\nFollowing the banquet, Tosta accompanied a delegation of Nikto \"businessmen\" to Leia's starship Mirrorbright. As they approached a hoversled, Tosta whispered something in his language. At that point, two more hoversleds turned up and surrounded Leia and Tosta; who apologized to his host that they were now surrounded. The riders on the hovercraft kidnapped Leia and then lowered Tosta and the \"businessmen\" onto a nearby crag and told them to walk to safety. However, Leia was rescued by Casterfo and the two managed to flee Rinnrivin's base in a hoversled.\nAs a Nikto, Tosta had a clawed hand and scaly skin. While he openly praised the New Republic, Tosta was secretly working in cahoots with organized crime elements like Rinnrivin Di and his cartel. As a Magistrate, he represented the local authorities on Bastatha.\nTosta first appeared as a minor supporting character in Claudia Gray's 2016 novel Bloodline. Most of his lines are told through the point of view of Leia Organa, the main protagonist.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nikto",
  "/wiki/Gender",
  "/wiki/Bastatha_security_forces",
  "/wiki/Magistrate",
  "/wiki/Planet",
  "/wiki/Bastatha",
  "/wiki/28_ABY",
  "/wiki/Xun",
  "/wiki/New_Republic",
  "/wiki/Senator",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mission_to_Bastatha",
  "/wiki/Rinnrivin_Di",
  "/wiki/Rinnrivin_Di%27s_cartel",
  "/wiki/Ransolm_Casterfo",
  "/wiki/Crime_lord",
  "/wiki/Rinnrivin%27s_headquarters",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Unidentified_casino",
  "/wiki/Casino",
  "/wiki/Gambling",
  "/wiki/Riosan_mead",
  "/wiki/Riosa",
  "/wiki/Sabacc",
  "/wiki/Populists",
  "/wiki/Centrists",
  "/wiki/First_Order",
  "/wiki/First_Order_Navy",
  "/wiki/Starship",
  "/wiki/Mirrorbright",
  "/wiki/Hoversled",
  "/wiki/Language",
  "/wiki/Claudia_Gray",
  "/wiki/2016",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Del_Rey",
  "/wiki/File:New_Republic_Bloodline_Twitter_Post.jpg",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY"
 ]
}