{
 "name": "Tover_Blackmoor",
 "display_name": "Tover Blackmoor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Tover Blackmoor was a Human male chemist who lived during the time of the Galactic Civil War.\nAfter the Battle of Yavin, Tover Blackmoor worked for the Black Sun, one of the most powerful criminal syndicate in the galaxy, and operated out of a Black Sun bunker on Naboo's moon of Rori. During that time, the Black Sun discovered that the Rebel Alliance was smuggling and hoarding a new kind of spice. In 1 ABY, the Black Sun acquired a sample of this new spice after the smuggler Cal Handro crash-landed on Rori while transporting it. Tover Blackmoor analyzed the spice and discovered that it was nothing like any other spice available on the marker. The Black Sun leaders therefore decided to obtain more spice but they attracted the attention of a group of spacers who were looking for Cal Handro, the missing pilot. The spacers attacked the Black Sun bunker and eventually forced Blackmoor to reveal everything he knew about the pilot and the new spice.\nTover Blackmoor was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. Tover Blackmoor was added to the game with the second chapter of the \"Secrets of the Syren\" quest line, released with the \"Publish 14.1\", on March 24, 2005. All the content of the \"Secrets of the Syren\" story arc was removed from the game with the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss.\nIn the game, Tover Blackmoor was spelled Tovar Blackmoor in the quest objectives. During each server reset, Tover Blackmoor's appearance was randomized, but he consistently appeared as a male Human under the template \"scientist_human_male\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Chemist",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Black_Sun_bunker",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Syren_spice",
  "/wiki/1_ABY/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Cal_Handro",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_24",
  "/wiki/2005",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Battle_of_Restuss",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}