{
 "name": "Toy_Dampner",
 "display_name": "Toy Dampner",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Toy Dampner's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Toy Dampner was a blue-skinned male alien Podracer pilot who competed in Podracing events during the year 32 BBY. Piloting a Turca 910 Special Podracer, Dampner became a favorite on the Executioner race course on the moon Oovo IV, which sped through the prison Desolation Alley and boasted several anti-gravity tunnels filled with chunks of ore. Dampner was also the track favorite for a race course on the planet Baroonda.\nToy Dampner was an accomplished Podracer pilot who competed during the year 32 BBY. He piloted a heavily customized black-and-white Turca 910 Special Podracer, which was renowned for its speed and traction.\nDampner was proficient on the aptly named Executioner course, a difficult raceway located in the Desolation Alley prison on the barren moon Oovo IV. The course contained zero-gravity tunnels that were filled with loose chunks of rock and ore, courtesy of prison warden Fenn Booda. The track favorite, Dampner held both the best single lap and three-lap race times, standing at 01:31.540 minutes and 04:42.310 minutes, respectively.\nAlthough Dampner was not an inmate in the prison like fellow Oovo IV race favorite Fud Sang, Dampner raced the prison's courses for the enjoyment of his incarcerated friends. Dampner was also the track favorite of a drag course on the jungle planet Baroonda. Dampner raced opponents on this course in a one-on-one fashion.\nA male member of a blue-skinned alien species, Toy Dampner was a skillful Podracer who preferred to focus on the race at hand without distractions. He immensely enjoyed showing off his 910 Special's capabilities, yet despite his seriousness about racing, Dampner was willing to challenge himself on Oovo IV for the viewing pleasure of his imprisoned friends in Desolation Alley. Dampner would make fun of a competitor's Podracer by referring to it as a cropduster. He regularly threw out insults during races upon passing or being passed by competitors.\nDampner was a tall individual and had long arms and short legs. He also exhibited slanted white eyes. He kept the red-colored hair on the top of his head in a ponytail, and he maintained a large, tapered beard and a mustache. His neck featured off-white fur. Dampner spoke Huttese.\nToy Dampner preferred to race in a speedy Turca 910 Special Podracer—also known as the Turca Special—which had been heavily customized to suit the courses on Oovo IV. The 910 Special was known for its traction, which allowed the Podracer to work well on otherwise slippery terrain. In addition, the Podracer had a powerful accelerator that allowed Dampner to reach his top speed quickly, although the Turca actually suffered from a low top speed. The vehicle also had notably poor handling. However, Dampner's Podracer was equipped with an onboard engine repair system, which allowed the Podracer pilot to repair his machine on the fly when racing on twistier and more damaging courses.\nThe 910 Special was also renowned for its thrusters, which could propel Dampner beyond his vessel's top speed. Although 910 Special Podracers were notorious for poor cooling systems, which caused the vehicles to overheat too quickly, Dampner acquired the best coolant pump he could find to remedy the fault. Dampner's 910 Special was white with black stripes, a color scheme that matched the design of the flag that Dampner used to represent himself in the sport. When racing, the only clothes Dampner wore were pants, shoulder pads, and a bandolier.\nToy Dampner was originally created for the 1999 film Star Wars: Episode I The Phantom Menace. At least two conceptual drawings of what eventually became Dampner were created during the film's pre-production stage in 1996: one by artist Terryl Whitlatch, which depicted Dampner as being covered in short, red fur, and another by Iain McCaig, which portrayed him as being completely blue. The character originally appeared in the film's revised rough draft, which mentioned that he hailed from the planet New Cov.\nDampner's Podracer made it as far as appearing in an animatic for the film's Podracing scene, but it was cut from the film's final version, as was the character itself. The scenes involving the pod were instead given to the Podracer character Clegg Holdfast.\nDespite Dampner not appearing in the film, McCaig's design for the character—with some differences, including a different hair color—was ultimately incorporated into the 1999 tie-in video game Star Wars Episode I: Racer. Dampner's voice was provided by Dave Fennoy in the game. Additionally, some of Dampner's backstory and information about his Podracer was expanded in Episode I Racer's two accompanying strategy guides.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_blue-skinned_short-legged_species",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/File:Toy_Dampner.ogg",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Turca",
  "/wiki/910_Special",
  "/wiki/Podracer/Legends",
  "/wiki/Executioner_(course)",
  "/wiki/Moon/Legends",
  "/wiki/Oovo_IV/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Desolation_Alley",
  "/wiki/Gravity/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Baroonda_drag_course_2",
  "/wiki/Planet/Legends",
  "/wiki/Baroonda",
  "/wiki/Fodesinbeed_Annodue/Legends",
  "/wiki/File:Fode-Toy_Dampner1.ogg",
  "/wiki/Warden/Legends",
  "/wiki/Fenn_Booda",
  "/wiki/Time/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Fud_Sang",
  "/wiki/Jungle/Legends",
  "/wiki/File:Toy_Dampner-Careful_punk.ogg",
  "/wiki/Alien/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Language/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/File:Fode-Toy_Dampner2.ogg",
  "/wiki/Engine/Legends",
  "/wiki/Coolant_pump/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Bandolier/Legends",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/1996",
  "/wiki/Terryl_Whitlatch",
  "/wiki/Iain_McCaig",
  "/wiki/New_Cov/Legends",
  "/wiki/Clegg_Holdfast/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Episode_I:_Racer",
  "/wiki/Dave_Fennoy",
  "/wiki/Star_Wars:_Episode_I:_Racer:_The_Official_Nintendo_Player%27s_Guide",
  "/wiki/Star_Wars:_Episode_I_Racer:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Category:Audio_files_of_Toy_Dampner",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Jar_Jar_Binks/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Game_Boy_Color",
  "/wiki/Star_Wars_home_video_releases",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com"
 ]
}