{
 "name": "Traavis",
 "display_name": "Traavis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skip 5",
      "Smuggler's Run"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Garqi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Traavis was a Human male Jedi Knight who served as a general during the Clone Wars. In 19 BBY, during the Galactic Republic's sieges in the Outer Rim, Traavis led a campaign for five months against the Cassandran Worlds of Monhudle, New Bakstre, and Biitu. Later in the year, he moved his troops to the Separatist world of Garqi. After securing the planet, Traavis ordered the clone commandos of Aiwha Squad to search for civilians and to take them to refugee camps. As he was inspecting the camps, the squad returned with an orphan named Evan, whose parents were killed during a skirmish between the Grand Army of the Republic's clones and the Confederacy's battle droids. Traavis met with the boy and congratulated the squad for completing their mission. As the Jedi was speaking to the other commandos, Aiwha Squad's leader, RC-1013, received Order 66 from Supreme Chancellor Palpatine, commanding all clone troopers to eliminate the Jedi. The clones immediately turned against Traavis and executed him.\nTraavis, a Human male, was born during the final decades of the Galactic Republic on the asteroid Skip 5, located in the Smuggler's Run. During the Clone Wars—the conflict between the Republic and the Confederacy of Independent Systems—Traavis served both the Jedi Order and the Republic as a Jedi Knight and general in the Grand Army of the Republic. In 19 BBY, during the Republic's Outer Rim Sieges, Traavis led a five-month campaign against the Cassandran Worlds of Monhudle, New Bakstre, and Biitu. Later in the year, Traavis' forces captured the planet Garqi, and the Jedi Knight began to inspect the planet's overcrowded refugee camps. He ordered the clone commandos of Aiwha Squad to search for civilians and to take them to the camps for protection. Traavis eventually received news that General Grievous, the Supreme Commander of the Separatist Droid Army, had been killed.\nWhile Traavis was inspecting a refugee camp, Aiwha Squad's leader, RC-1013, reported on the mission's success. The commando also introduced the Jedi to a boy named Evan, whose parents were killed during a skirmish between the Republic's clones and the Separatist's battle droids. Traavis told Evan that they would get the orphan a bed in the refugee camp and some food. He commended the squad on their successful mission and informed them that Grievous was dead, stating that the war was likely nearing completion. However, as Traavis conferred with the other clones, RC-1013 received Order 66 from Supreme Chancellor Palpatine, which commanded them to eliminate the Jedi Knights as enemies of the Republic. RC-1013 immediately ordered Aiwha Squad to execute Traavis. The Jedi attempted to reach for his lightsaber to defend himself, but he was killed by the squad's blaster fire.\nThe details of Traavis' death were filed in a report by RC-1013 shortly after Palpatine declared himself Emperor of the first Galactic Empire. The official records—which were modified by Imperial Advisor Sate Pestage from a compilation of various reports created by Moff Marcellin Wessel—stated that Traavis was killed in the act of stealing children in order to indoctrinate them in the Jedi ways.\nTraavis cared about the civilians who had been displaced on Garqi during the Clone Wars, inspecting the overcrowded refugee camps after capturing the planet. He was also willing to send the forces under his command to search for any surviving refugees. When he was introduced to Evan by RC-1013, Traavis tried to make sure the boy would be taken care of properly. After Aiwha Squad reported on the success of their mission, Traavis was pleased with their success and made sure that he congratulated the clones. He owned a lightsaber containing a green crystal.\nTraavis first appeared in the short story Orders, which was written by Ryan Kaufman and drawn by Rick Lacy. Orders was one of four stories compiled in the fourth volume of the Star Wars: Clone Wars Adventures trade paperback. He was also featured in the article Order 66: Destroy All Jedi, which was published in Star Wars Insider 87. In the article, an image of a live actor was provided for the character. Traavis later received an entry in The Complete Star Wars Encyclopedia. Kaufman named Traavis after the author Karen Traviss, who wrote the Star Wars: Republic Commando series of novels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Skip_5",
  "/wiki/Smuggler%27s_Run/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Garqi/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Orders_(comic)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Outer_Rim_Sieges/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Cassandran_sectors",
  "/wiki/Monhudle",
  "/wiki/New_Bakstre",
  "/wiki/Biitu",
  "/wiki/Standard_year/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Garqi_(Clone_Wars)",
  "/wiki/Clone_commando/Legends",
  "/wiki/Aiwha_Squad",
  "/wiki/Squad/Legends",
  "/wiki/Evan",
  "/wiki/Death/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/RC-1013",
  "/wiki/Order_66/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Time/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Supreme_Commander_of_the_Droid_Armies",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Advisor",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Casualty_Report:_Order_66",
  "/wiki/Moff/Legends",
  "/wiki/Marcellin_Wessel",
  "/wiki/Green_(disambiguation)",
  "/wiki/Lightsaber_crystal",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Rick_Lacy",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_4",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Order_66:_Destroy_All_Jedi",
  "/wiki/Star_Wars_Insider_87",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Karen_Traviss",
  "/wiki/Republic_Commando",
  "/wiki/Category:Images_of_Traavis",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Jedi_Council_Forums",
  "/wiki/October_19",
  "/wiki/2005",
  "/wiki/October_22",
  "/wiki/2013"
 ]
}