{
 "name": "Tracer",
 "display_name": "Tracer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 22 BBY",
      "over Gwori"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Hunter Squadron",
      "Hunter Squadron"
     ]
    }
   ]
  }
 ],
 "content": "\"Tracer\" was the nickname of a BTL-B Y-wing starfighter clone trooper pilot who served in the Republic Navy's Hunter Squadron during the Clone Wars. Around 22 BBY, Hunter Squadron was assigned to destroy the Banking Clan shipyards at Gwori. After a team of Jedi was smuggled to Gwori in order to obtain the exact coordinates of the shipyards, Jedi Generals Plo Koon and Saesee Tiin briefed Hunter Squadron on the upcoming mission. After successfully passing the enemy blockade, Tiin ordered Tracer and Hunter Squadron to destroy the shipyards. However, the squadron's bombs were insufficient to destroy all of the enemy vessels in the shipyards, and Koon ordered them to target the construction supports instead. En route, the Y-wing bombers were attacked by Vulture droids, and Tracer, serving as gunner on fellow clone pilot Warthog's fighter, managed to destroy several droids but was hit by a laser bolt in the chest. The squadron proceeded to destroy the shipyards and, after the destruction, jumped to hyperspace and retreated from their victory at Gwori. However, Tracer died from his wound shortly before the jump.\n\"Tracer\" was the nickname of one of the many clones bred from the Mandalorian bounty hunter Jango Fett on the planet Kamino to fight for the Galactic Republic during the Clone Wars. A clone trooper pilot, Tracer was part of the Republic Navy's Hunter Squadron of BTL-B Y-wing starfighters and was assigned to Jedi Master Plo Koon. Around 22 BBY, the Republic suffered a series of major defeats in space battles in the Mid Rim, largely due to the Separatists having four times as many ships as the Republic Navy. To combat this, the Republic decided to smuggle a team of Jedi and clone troopers to the Banking Clan shipyards at Gwori in order to obtain the exact coordinates of the shipyards and conduct an assault. After the team successfully landed, they captured a Separatist comm tower. From the tower, Jedi Padawan Ahsoka Tano reported the coordinates to the Republic task force under the command of Jedi Generals Koon and Saesee Tiin, and Admiral Wullf Yularen in the Moskk system, where Hunter Squadron had been stationed.\nWhile Tracer and fellow pilot Warthog made a bet about the outcome of the mission, Koon and Tiin began to brief Hunter Squadron about the upcoming attack aboard a Venator-class Star Destroyer, informing them that the shipyards were in a system of canyons on the planet and that they would have to destroy them with the proton cannons on their Y-wing bombers. At the behest of Tracer's captain, Tiin revealed that they would be making an exact hyperspace jump between the Separatist blockade of Gwori and the planet itself, and Koon further explained that the risk of the jump was worth it, because it would save the lives of countless clones and millions of beings. After the briefing, Warthog asked Tracer to rethink his bet. Shortly after, Hunter Squadron in their Y-wings, along with the Jedi Masters in their starfighters, prepared to jump, and Koon ordered them to make sure their navicomputers were all synchronized, since if they were slightly off, they would come out before the blockade or inside the planet. Once all was ready, Tracer, serving as the gunner of Warthog's bomber, and Hunter Squadron jumped to hyperspace.\nAfter successfully exiting hyperspace between the blockade and Gwori, Koon contacted the squadron and ordered them to focus on their objective. Approaching the canyons of Gwori, Tiin and Koon destroyed the anti-air turrets on the ground. Tracer and the squadron then bombed the shipyards, destroying numerous Munificent-class star frigates, though many more remained intact due to the squadron's lack of appropriate ammunition. Koon then ordered the squadron to assume Bantha formation and target the construction supports. On the way there, the squadron was attacked by Vulture droids, which Tracer opened fire on. Although he managed to destroy several droids, he was soon hit by a laser bolt in the chest. The squadron proceeded to bomb and destroy the construction supports, resulting in the destruction of the shipyards. Warthog informed the injured Tracer of the success, but Tracer responded that he would let him out of their bet and died shortly afterward. Hunter Squadron then jumped to hyperspace with their mission completed.\nTracer was a Human male clone with black hair, brown eyes, and tan skin. Like all clones of Jango Fett, Tracer stood 1.83 meters tall. As a clone pilot, Tracer was raised to be loyal to the Republic and his Jedi commanders. He was a good friend of fellow pilot Warthog and bet with him about the outcome of their mission to Gwori. Tracer was a skilled gunner, managing to shoot down several Vulture droid starfighters during the attack on Gwori. He was also a very confident clone, and even on the very dangerous mission to Gwori Tracer believed that he and Warthog would survive it \"without a scratch.\" However, while Warthog survived the battle, Tracer did not.\nDuring the assault on the Gwori shipyards, Tracer wore the pilot version of the white Phase I clone trooper armor.\nTracer first appeared in the graphic novella The Clone Wars: Shipyards of Doom, which was published by Dark Horse on September 24, 2009. The character was illustrated by the Fillbach Brothers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Gwori",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hunter_Squadron_(Galactic_Republic)",
  "/wiki/The_Clone_Wars:_Shipyards_of_Doom",
  "/wiki/BTL-B_Y-wing_starfighter",
  "/wiki/Clone_trooper_pilot/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/InterGalactic_Banking_Clan/Legends",
  "/wiki/Gwori_shipyards",
  "/wiki/Jedi/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Saesee_Tiin/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Battle_of_Gwori",
  "/wiki/Starship/Legends",
  "/wiki/Bomber/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Gunner/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Warthog/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Death/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Space_warfare",
  "/wiki/Mid_Rim",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Navy/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Wullf_Yularen/Legends",
  "/wiki/Moskk_system",
  "/wiki/Unidentified_Venator-class_Star_Destroyer_(Hunter_Squadron)",
  "/wiki/Proton_cannon/Legends",
  "/wiki/Unidentified_clone_trooper_captain_(Hunter_Squadron)",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Anti-aircraft_gun",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Bantha_formation/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Droid_starfighter/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dark_Horse_Comics",
  "/wiki/September_24",
  "/wiki/2009",
  "/wiki/Fillbach_Brothers",
  "/wiki/Category:Images_of_Tracer",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Databank_(original)"
 ]
}