{
 "name": "Tracton",
 "display_name": "Tracton",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Died",
     "values": [
      "30 BBY",
      "Cophrigin V"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tikkes"
     ]
    }
   ]
  }
 ],
 "content": "Tracton was a male Quarren who served as an assistant to Senator Tikkes of Mon Calamari during the waning years of the Galactic Republic.\nA scientist, Tracton had a great understanding of planetary ecosystems, meteorology, and mineralogy. Tikkes wanted Tracton to analyze the Dark Woman's residing world's minerals for financial worth. During this travel, Tikkes and Tracton were accompanied by three Jedi—Jedi Master Ki-Adi-Mundi, Adi Gallia, and Padawan A'Sharad Hett.\nWhen Tikkes's party arrived on the designated planet, Tracton analyzed the planet's environment using a sensor scan. Tracton started providing Tikkes with data on one of the planet's peculiar events—the annual meteor shower that devastated the planet—and how the planet could restore itself quickly from the destruction due to special nutrients.\nDuring his scans and gathering of data, Tracton noticed that there were other interesting minerals on this world. A'Sharad Hett managed to recognize one of the minerals as Quald Runium. Tracton was impressed by the Padawan, but expressed disrespect by calling Hett a \"savage\" and showing surprise that a Tusken Raider could be trained.\nWhen Aurra Sing attacked, Ki-Adi-Mundi instructed A'Sharad Hett to get Tikkes, Tracton, and the other Quarren on the ship and guard them. Unfortunately, the Dark Jedi managed to infiltrate Tikkes's ceremonial ship and attempted to kill all on board. Before any chance of reaction, Tracton and a Quarren soldier next to him were killed with one shot from behind by the assassin. Tracton was shot in the back of his head.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Tracton",
  "/wiki/Dac",
  "/wiki/30_BBY/Legends",
  "/wiki/Cophrigin_V",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tikkes/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/An%27ya_Kuro",
  "/wiki/Unidentified_jungle_world_(Kamdon_system)",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Hunt_for_Aurra_Sing",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Star_Wars_(1998)_30",
  "/wiki/Star_Wars_(1998)_31"
 ]
}