{
 "name": "Traest_Kre%27fey",
 "display_name": "Traest Kre'fey",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet with flecks of gold"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Galactic Federation of Free Alliances",
      "Confederation"
     ]
    }
   ]
  }
 ],
 "content": "Traest Kre'fey was a male Bothan admiral of the New Republic and Galactic Alliance who led forces at a number of engagements during the Yuuzhan Vong War and the Second Galactic Civil War.\nTraest Kre'fey was a grandson of Laryn Kre'fey, and as the Kre'fey's lost much of their power due to his grandfather's failure at Borleias, Kre'fey was sent to a small satellite training moon of the Bothan Martial Academy. There, he was instructed under a rather unorthodox Bothan teacher and developed unusual views of Bothan society. In particular, he held the view that Bothan society at its current form was less than perfect, and that they needed to change to better exist within the galaxy. Because of the string of resignations in the Bothan military over the Caamas Document Crisis, Kre'fey was quickly advanced to the rank of admiral.\nWhile he was a first cousin of Chief of State Borsk Fey'lya, he disagreed with his kinsman about the threat of the Yuuzhan Vong, and their relationship was rather combative, though for Bothans, that was rather typical. He recognized the threat of the Yuuzhan Vong early on and prior to the Battle of Ithor, threatened to take the military into the Unknown Regions or place Leia Organa Solo into power via a military coup d'état if Fey'lya would not act. Unlike other admirals, Kre'fey actively sought the help of the Jedi. When Kyp Durron came asking for help in destroying a gravitic superweapon the Yuuzhan Vong were growing in the remains of Sernpidal, he provided his flagship, the Ralroost to help.\nKre'fey was one of the commanders at the Fall of Coruscant, commanding Fleet Group One. He performed conservative actions during the battle, and most of his ships abandoned his orders and defected over to General Garm Bel Iblis. After the battle, he returned to Bothawui for the official period of mourning for Borsk Fey'lya, who was killed during the assault. While he was there, the Bothan Council officially declared a state of ar'krai. Kre'fey took to the declaration of total war wholeheartedly, making some of the Jedi under his command suspicious of his intentions. However, the High Council decided that if Kre'fey tried any \"illegal\" actions, the Force meld would prevent the soldiers under his command from doing so. With several squadrons of Jedi under his command, Kre'fey took the fight to the Yuuzhan Vong during the interlude between the election of Cal Omas and the Battle of Ebaq 9, raiding Yuuzhan Vong colonies and attacking the Peace Brigade on Ylesia. On the Ralroost's bulkhead, he inscribed two questions: \"What can I do to hurt the Vong today?\" and \"How can I help my own side grow stronger?\", to remind his crew to try to answer the threat of the Yuuzhan Vong.\nFrom his flagship Ralroost, Kre'fey participated at the final battle of the war in the space around Coruscant, and was present at the formal surrender of the Yuuzhan Vong. Following the surrender of the Yuuzhan Vong, Kre'fey became the Supreme Commander of the Galactic Alliance Defense Force and earned the title \"Liberator of Coruscant,\" becoming a hero to much of the galaxy. However, as the Bothans refused to cease the state of ar'krai, Kre'fey was forced to resign shortly thereafter.\nAfter the war, he was hailed as a liberator of Coruscant and went after the abdication of his position as commander in chief. Kre'fey returned to Bothawui, though by 40 ABY, as conflict broke out between Corellia and the Alliance, the Bothans soon became involved. Before long, Jacen Solo, now head of the Galactic Alliance Guard, began rounding up, interning and executing Bothans on Coruscant due to the support they demonstrated towards Corellia and the actions of the True Victory Party. When Bothawui joined Corellia militarily, Kre'fey became active in its ranks as an admiral, commanding an element of the Bothan fleet at the Battle of Kashyyyk under the command of Admiral Babo. During the battle, the Bothan forces had engaged the Galactic Alliance Fifth Fleet.\nFollowing his appearance in The New Jedi Order: The Unifying Force in 2003, the final novel in The New Jedi Order series, Kre'fey did not appear in any subsequent novels until the publication of Legacy of the Force: Inferno, the sixth installment in the Star Wars: Legacy of the Force series. In the novel's epilogue, a character named Kre'fey holding the rank of admiral is mentioned as having fought in the Battle of Kashyyyk. While the unseen character was not specifically identified as Traest Kre'fey, The Complete Star Wars Encyclopedia, released in 2008, confirmed that the two individuals were one and the same.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Traest_Kre%27fey",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Traest_Kre%27fey",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Confederation",
  "/wiki/Admiral/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Laryn_Kre%27fey",
  "/wiki/Kre%27fey_family",
  "/wiki/First_Battle_of_Borleias",
  "/wiki/Borleias/Legends",
  "/wiki/Bothan_Martial_Academy",
  "/wiki/The_galaxy/Legends",
  "/wiki/Caamas_Document_Crisis",
  "/wiki/Chief_of_State_(New_Republic)",
  "/wiki/Borsk_Fey%27lya",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Ithor",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Jedi/Legends",
  "/wiki/Kyp_Durron",
  "/wiki/Gravitic_superweapon",
  "/wiki/Sernpidal/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Ralroost",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/Fleet_Group_One",
  "/wiki/General/Legends",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Bothan_Council",
  "/wiki/Ar%27krai",
  "/wiki/High_Council_(Galactic_Alliance)",
  "/wiki/Force_meld",
  "/wiki/Cal_Omas",
  "/wiki/Battle_of_Ebaq",
  "/wiki/Peace_Brigade",
  "/wiki/Ylesia/Legends",
  "/wiki/Battle_of_Yuuzhan%27tar",
  "/wiki/Supreme_Commander_(Alliance/Republic)",
  "/wiki/Galactic_Alliance_Defense_Force",
  "/wiki/40_ABY",
  "/wiki/Corellia/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/True_Victory_Party",
  "/wiki/Battle_of_Kashyyyk_(Second_Galactic_Civil_War)",
  "/wiki/Babo",
  "/wiki/Galactic_Alliance_Fifth_Fleet",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/2003",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/Legacy_of_the_Force:_Inferno",
  "/wiki/Star_Wars:_Legacy_of_the_Force",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/2008",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_II:_Ruin",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_I:_Hero%27s_Trial",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/The_New_Jedi_Order:_Star_by_Star",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_Destiny%27s_Way",
  "/wiki/The_New_Jedi_Order:_Ylesia",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_I:_Remnant",
  "/wiki/The_New_Jedi_Order:_The_Final_Prophecy",
  "/wiki/Legacy_of_the_Force:_Tempest",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Databank_(original)",
  "/wiki/New_Republic_First_Fleet",
  "/wiki/Hiram_Drayson",
  "/wiki/25_ABY/Legends",
  "/wiki/28_ABY/Legends",
  "/wiki/Galactic_Alliance_First_Fleet",
  "/wiki/29_ABY/Legends",
  "/wiki/Nek_Bwua%27tu",
  "/wiki/Sien_Sovv",
  "/wiki/The_Thrawn_Trilogy_Sourcebook"
 ]
}