{
 "name": "Traga_un-Vhol",
 "display_name": "Traga un-Vhol",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unchained"
     ]
    }
   ]
  }
 ],
 "content": "Traga un-Vhol was a Human male rebel cultist who served as the leader of the Unchained during the Cold War. During a slave revolt on Dromund Kaas, Traga laughed at his fellow slaves' notions of freedom. Developing a twisted interpretation of the Sith code, Traga began killing his fellow slaves, believing the bloodshed would make him Sith. His ritualistic murders caught the attention of the Imperial Military, in which Ensign Corian Shye, who tasked an Imperial hero to investigate. The Imperial hero gained Traga's attention by lighting the signal fire he set up for his initiates. Recognizing an opportunity to ingratiate himself with the Sith Empire and asked the Imperial hero to pass on a datapad containing the Unchained's promise of allegiance.\nTraga un-Vhol is a non-player character in the Star Wars: The Old Republic video game, featured in the Dromund Kaas side mission, \"The Slave Killers\" for Empire players. He is voiced by Nolan North.\nWhile in conversation with Traga, the player can choose to either pass on his message to Ensign Corian Shye, earning dark side points, or make him doubt his own beliefs, earning light side points. For the latter option, afterwards the player can tell Traga to surrender to the Imperials, truly learn the Sith ways or decline to aid his crisis of faith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Unchained",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Dromund_Kaas",
  "/wiki/Code_of_the_Sith/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Corian_Shye",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Nolan_North",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Traga_un-Vhol"
 ]
}