{
 "name": "Trapper_Wolf",
 "display_name": "Trapper Wolf",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New Republic",
      "New Republic X-wing squadron",
      "New Republic X-wing squadron"
     ]
    }
   ]
  }
 ],
 "content": "Trapper Wolf was a human male pilot for the New Republic. He flew an T-65B X-wing starfighter as leader of an attack squadron with pilots Sash Ketter and Jib Dodger. Circa 9 ABY, the trio located the signal from a tracking beacon that had originally been activated during a mercenary attack on a New Republic Correctional Transport. Wolf and the other pilots detected the tracker's signal on board a space station managed by the criminal Ranzar Malk. After seeing a gunship preparing to launch from within the space station as they approached, the trio attacked the station in their starfighters.\nSometime later, Wolf and Captain Carson Teva approached the gunship Razor Crest during a patrol, which did not have an emitting transponder. After the starship's pilot, the Mandalorian Din Djarin, sent a ping to the pair, Wolf privately discussed with Teva, connecting the Mandalorian to a prisoner breakout. Djarin tried to flee from the New Republic pilots, eventually escaping their sights at canyons of the planet Maldo Kreis. The two pilots then checked records on the Crest, they learned of selfless actions Djarin had committed. The pair soon rescued the gunship from a horde of knobby white ice spiders and let the Mandalorian go.\nA veteran of the Alliance to Restore the Republic, Trapper Wolf eventually served as a pilot in the New Republic Starfighter Corps during the time of the New Republic, flying a T-65B X-wing starfighter. By circa 9 ABY, Wolf led a New Republic attack squadron that was tasked with patrolling the outer reaches of the galaxy with fellow pilots Jib Dodger and Sash Ketter. Their duties included locating certain active New Republic tracking beacons. One such beacon was activated aboard the Bothan-5, a New Republic Correctional Transport, during a raid by several mercenaries; however, before any attack squadron could reach the vessel, the beacon was transported off the starship on the gunship Razor Crest and moved to the Roost, a space station controlled by the criminal Ranzar Malk.\nPiloting T-65B X-wing starfighters, Wolf and his squadron exited hyperspace near the station. As they passed the Razor Crest, which had just left the station, Wolf confirmed that the beacon's signal was definitely coming from within the station. He then noted that there seemed to be another gunship preparing to launch from the station, which had been preparing to destroy the Razor Crest; however, the New Republic pilots took it as reason to attack. Opening fire with their laser cannons, the three pilots destroyed the gunship in the station's hangar and then proceeded to circle round and fire upon the exterior of the station itself.\nSometime later, Wolf and fellow pilot Captain Carson Teva were sweeping the Outer Rim's Arkanis sector for Imperial holdouts when they encountered Razor Crest, which had no emitting transponder, near the planet Maldo Kreis. The pair flanked either side of the gunship while Teva reached out to the vessel over a comm channel. The Crest's pilot, the Mandalorian bounty hunter Din Djarin, replied, and Teva questioned the absence of a transponder signal. After Djarin and the captain cleared up need to run a beacon, Teva asked the Mandalorian to send a ping, which the latter eventually did. Having received this, Wolf realized that Djarin's ship was connected with the raid aboard Bothan-Five, contacting Teva to discuss the matter on channel two.\nAfter talking about the Razor Crest's possible involvement in the Bothan-Five heist, the New Republic pilots unlocked their X-wing starfighter's s-foils and Teva asked Djarin if his ship had been in proximity with Bothan-Five. Djarin then attempted to flee the pair aboard the Crest towards Maldo Kreis. Wolf was the first to acknowledge this, with Teva moving in pursuit of the Mandalorian after. The two pursued Djarin through the planet's atmosphere, Wolf wondering where the Razor Crest was heading. The pair then followed the gunship through a canyon, but lost sight of Djarin's ship. Teva told Wolf to head north to cover more ground.\nWolf and Teva ran tabs on the Razor Crest, discovering that Djarin had an arrest warrant for his involvement in the raid on Bothan-Five. They also learned from Bothan-Five's security records that the Mandalorian had helped capture three other mercenaries involved, as well as attempting to preserve the life of Lieutenant Lant Davan of the New Republic Correctional Corps. The pair eventually discovered the Razor Crest damaged and being swarmed by knobby white ice spiders in a cave under the surface of Maldo Kreis. Wolf and Teva fired on the creatures with their X-wings before landing and firing on the smaller ones from their cockpits using A280 blaster rifles.\nDjarin exited his damaged gunship, and Teva explained what he and Wolf had learned about the Mandalorian, revealing that the pair were letting the bounty hunter go. When Djarin sought help repairing the Crest's hull, Wolf looked to the captain, who instead suggested the Mandalorian fix his transponder so the two New Republic pilots would not have to vaporize him during their next patrol. The pair reentered their cockpits, departing the cave on their X-wings.\nTrapper Wolf was a human male who had fair skin, black hair, and brown eyes. After learning of Din Djarin's selfless actions aboard Bothan-Five, he and Carson Teva chose to let the Mandalorian go. When Djarin asked for help fixing the Razor Crest's hull, Wolf looked to Teva for their answer to the Mandalorian.\nWolf wore an orange and white flight suit. During his squadron's attack on Ranzar Malk's space station, he wore a white K-22995 light flight helmet with blue and yellow markings and two New Republic roundels, but later adopted a gray helmet with black and yellow markings bearing the emblem of the Wolfpack during his pursuit of the Razor Crest. Wolf was also capable with an A280 blaster rifle.\nTrapper Wolf first appeared in \"Chapter 6: The Prisoner\" of Jon Favreau's Disney+ television series The Mandalorian, which was directed by Rick Famuyiwa and aired on December 13 2019. The pilot was portrayed by producer Dave Filoni, who made his cameo appearance alongside fellow series directors Famuyiwa and Deborah Chow, who portrayed the other two New Republic pilots. The character's name is shared with the real world animal, the wolf, of which Filoni himself is a fan. Filoni teased his role in the show prior to the episode's air date in an interview with Andi Gutierrez hosted on the official Star Wars YouTube channel.\nAs his debut acting role, Filoni portrayed Wolf at Favreau's suggestion, and had Famuyiwa and Chow portray the other pilots as Filoni did not feel comfortable acting alone. The idea, according to Filoni, had started as a joke which Favreau liked. The three directors continuously messaged each other about the shoot during the prior week, questioning their decisions to take part, but Favreau was reluctant to let the trio bail.\nBefore filming the \"X-wing pilot shoot,\" Filoni did second unit shooting for Famuyiwa's \"Chapter 2: The Child\" that same day filming the sequence at the mudhorn cave, where the prospect of filming as an X-wing pilot loomed over the producer. He considered using a scheduled flight he had as an excuse, but was convinced otherwise by Favreau and felt he could learn from having an acting role. When the shooting took place, Favreau gave Filoni the character's dialogue during filming, and told him to \"be boring\" and act disinterested in order to relate with the calm impressions given by pilots in the real world or in films like Apocolypse Now.\nIn filming the scene, Filoni and the other two directors were filmed inside the T-70 X-wing starfighter built for the Star Wars: Galaxy's Edge theme park in Orlando, USA. The life-size X-wing model was altered to allow the trio to sit inside for their shots. The X-wing was elevated on a platform to recreate the turbulence on the starfighter. The final cut of Filoni's shots were made to look like the scenes of the X-wing pilots in their cockpits in Star Wars: Episode IV A New Hope. When talking about the \"X-wing pilot shoot\" on Disney Gallery: The Mandalorian, Filoni acknowledged that he had indeed gained insight in preparing for and being filmed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/New_Republic",
  "/wiki/Unidentified_X-wing_squadron",
  "/wiki/New_Republic_pilot",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Squadron",
  "/wiki/Pilot",
  "/wiki/Sash_Ketter",
  "/wiki/Jib_Dodger",
  "/wiki/9_ABY",
  "/wiki/Homing_beacon",
  "/wiki/Mercenary",
  "/wiki/Rescue_of_Qin",
  "/wiki/New_Republic_Correctional_Transport",
  "/wiki/Roost",
  "/wiki/Ranzar_Malk",
  "/wiki/Gunship",
  "/wiki/Space_station",
  "/wiki/Starfighter",
  "/wiki/Captain",
  "/wiki/Carson_Teva",
  "/wiki/Razor_Crest",
  "/wiki/Transponder",
  "/wiki/Starship",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Planet",
  "/wiki/Maldo_Kreis",
  "/wiki/Knobby_white_ice_spider",
  "/wiki/New_Republic_Starfighter_Corps",
  "/wiki/New_Republic_Era",
  "/wiki/The_galaxy",
  "/wiki/Bothan-5",
  "/wiki/Hyperspace",
  "/wiki/Laser_cannon",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Arkanis_sector",
  "/wiki/Bounty_hunter",
  "/wiki/X-wing_starfighter",
  "/wiki/Atmosphere",
  "/wiki/Lieutenant",
  "/wiki/Lant_Davan",
  "/wiki/New_Republic_Correctional_Corps",
  "/wiki/Cave",
  "/wiki/A280_blaster_rifle",
  "/wiki/Hull",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Flight_suit",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Wolfpack",
  "/wiki/Blaster_rifle",
  "/wiki/Chapter_6:_The_Prisoner",
  "/wiki/Jon_Favreau",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Rick_Famuyiwa",
  "/wiki/December_13",
  "/wiki/2019",
  "/wiki/Dave_Filoni",
  "/wiki/Deborah_Chow",
  "/wiki/Andi_Gutierrez",
  "/wiki/Star_Wars",
  "/wiki/Chapter_2:_The_Child",
  "/wiki/Mudhorn_cave",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Category:Images_of_Trapper_Wolf",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_Two",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_205",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Trask",
  "/wiki/Kol_Iben_system",
  "/wiki/Peli_Motto",
  "/wiki/Kol_Iben",
  "/wiki/Star_system",
  "/wiki/Sector",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}