{
 "name": "Trask_Lucan",
 "display_name": "Trask Lucan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hyder"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Captain Trask Lucan was a Human male born on the planet Hyder. The son of a pilot, Lucan became a New Republic agent and scout during the Galactic Civil War. On the planet Glova, he was set up by the local governor Tegist Byrg and lost his ship, the Lucan's Nightmare. Unable to leave the planet, he stayed on Glova until he met a group of smugglers who were in a similar situation. With the aid of the New Republic ambassador Robet Makina, they attacked Byrg's headquarters in order to retrieve their ships.\nTrask Lucan was born on the planet Hyder. His father had been a pilot, and Lucan inherited his piloting skills. He flew his first solo flight at a very young age, and from that time onward he was always at the controls of a starship. When his father was shot down by the Galactic Empire after being suspected of smuggling, Lucan swore vengeance.\nAt some point in his life, Lucan became a New Republic agent and obtained a ship and named it the Lucan's Nightmare. Acting as an advance scout for the New Republic, he arrived on the neutral planet Glova, where he was set up by the planetary governor Tegist Byrg, who had been secretly working for the Empire and who confiscated his ship. Stranded on the planet, and with only his heavy blaster pistol and vacuum suit left, Lucan kept his connections with the New Republic secret and was often found in the local cantinas posing as a mere tramp freighter pilot. In Borke's Cantina, he met a group of smugglers while they were looking for a way to get their ship out of the impound. Lucan later assisted them along with soldiers under the command of New Republic ambassador Robet Makina in a raid on Byrg's headquarters to reclaim their ships after it was revealed that the governor had connections with the Empire.\nTrask Lucan stood 1.7 meters tall and was a strong, agile man with an athletic build, brown hair in a shaggy mop, and gray eyes. He usually dressed as a tramp freighter pilot. He was a gifted pilot, a skilled mechanic, and a knowledgeable person. He was especially fluent in astrography and the structure of space freighters. Lucan knew how to talk to people and sometimes was seen gambling.\nTrask was known for his optimism. He had a talent for acting, one that allowed him to play the part of a downtrodden ship captain, while in truth he was always quite happy with the way things had gone. Lucan was very brash and felt a strong enthusiasm for the New Republic, an enthusiasm matched only by his keenness for strong drink.\nLucan's first and only appearance in the Star Wars Legends continuity is in The Politics of Contraband, an adventure for Star Wars: The Roleplaying Game written by Bill Smith, published by West End Games in 1991, and anthologized in Classic Adventures: Volume 1. He serves as a non-player character who assists a party of players on their quest to reclaim their ship by capturing the planetary governor and who tries to get his own ship back as well. Since Tegist Byrg can either be captured or escape on Lucan's ship at the end of the adventure, Lucan can either get the Lucan's Nightmare back or let the players try to do so by following the governor. In the second option, however, the fate of the Nightmare remains uncertain, since the adventure ends as the players set off to find Byrg.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Trask_(disambiguation)",
  "/wiki/Hyder",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Glova",
  "/wiki/Governor/Legends",
  "/wiki/Tegist_Byrg",
  "/wiki/Starship/Legends",
  "/wiki/Lucan%27s_Nightmare",
  "/wiki/Smuggler/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Robet_Makina",
  "/wiki/Trask_Lucan%27s_father",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Enviro-suit",
  "/wiki/Cantina/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Borke%27s_Cantina",
  "/wiki/Soldier/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Astrography",
  "/wiki/Realspace/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/The_Politics_of_Contraband",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Bill_Smith",
  "/wiki/West_End_Games",
  "/wiki/1991",
  "/wiki/Classic_Adventures",
  "/wiki/The_Politics_of_Contraband_(adventure)"
 ]
}