{
 "name": "Travi_Pott",
 "display_name": "Travi Pott",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Two fingers"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Army",
      "Republic Army"
     ]
    }
   ]
  }
 ],
 "content": "Travi Pott was a Human female sergeant who served in the Republic Army during the Cold War between the Galactic Republic and the reconstituted Sith Empire. During the Separatist War between a Separatist Movement and the Republic-backed government on Ord Mantell, Pott was mistakenly assigned to the planet and was stationed on the island of Avilatan. By the year 3643 BBY, she had been assigned to lead her squad to destroy Separatist jamming beacons placed on Savrip Island, which was just off the coast of Avilatan. However, Pott and her squad were unsuccessful in taking out the beacons due to the numerous hazards on the island, with six members of the squad dying and half of the squad suffering severe burns. Pott eventually retreated and made use of discretionary funds to entice at least one Republic individual to brave the many dangers of the island and destroy the jamming beacons.\nA Human female, Travi Pott was a soldier who served in the Republic Army during the Cold War, a period of unrest between the Galactic Republic and the Sith Empire. By the year 3643 BBY, Pott had attained the rank of sergeant and had been mistakenly sent to fight in the Separatist War between a Separatist Movement and the Republic-backed government on the planet Ord Mantell.\nPott was eventually stationed on the island of Avilatan and tasked by her commanding officer with leading a squad to destroy several Separatist jamming beacons on Savrip Island, a smaller island just off Avilatan's coast. The beacons were jamming the navigation systems on Republic supply ships, which caused many of them to crash upon their approach to the island. Pott and her squad made several efforts to take out the beacons, but their attempts were unsuccessful due to the presence of mines, Separatist forces, and dangerous beasts known as Savrips. During the fighting, Pott's squad lost six members, while half of the squad received life-threatening burns, and Pott lost two fingers and a large amount of credits. In addition to the heavy losses suffered by her forces, Pott also had difficulties with her equipment, which was not waterproofed.\nAt some point during 3643 BBY, Pott gave up trying to use her squad to destroy the beacons due to the heavy casualties her unit had suffered. Instead, she took up position near a medical droid on the shore of Avilatan within sight of Savrip Island. By that time, she had become bitter and sarcastic about her situation and believed that her commanding officer was incompetent. However, Pott had gained access to some discretionary funds and decided that it would be better to hire someone to take out the beacons for her.\nEventually, after being on Ord Mantell for six months, Pott enticed at least one individual who was affiliated with the Republic to venture onto the island and take out the jamming beacons using data and maps that she supplied. With the beacons destroyed and the threat to the Republic supply ships ended, Pott expressed surprise at the successful completion of the assignment and distributed the promised rewards to the involved party. Following the destruction of the beacons, she decided to hold her position until the Republic gave her a new assignment.\nAt the time of the mission to destroy the jamming beacons, Travi Pott wore her red hair in a style that covered some of the left side of her face. She also had brown-colored eyes and fair skin. After she and her squad suffered many hardships, Pott became frustrated with her assignment and was willing to use discretionary funds to pay others to complete her mission. The sergeant's anger at the situation led her to be sarcastic and to criticize her commanding officer and her Republic military training.\nWhile serving on Avilatan, Sergeant Travi Pott wore the Republic Army's standard suit of armor with blue markings and carried a blaster pistol. After fighting on Ord Mantell for six months, she had lost two fingers, which she had replaced with cybernetics. When she was assigned to destroy the jamming beacons on Savrip Island, she lacked sufficient weaponry to complete the mission, and the equipment she did have was not waterproofed. Additionally, Pott had information on the location of the jamming beacons and maps of the area that surrounded the island.\nSergeant Travi Pott appears in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare and LucasArts. She is located with a Republic medical droid on Avilatan's coastline near Savrip Island on the planet Ord Mantell, the starting planet for players of the Smuggler and Trooper classes. There she gives Smuggler and Trooper players the quest \"Destroy the Beacons,\" which is designed for multiple players and can be repeated once per day. If an eligible player who does not have the quest approaches Pott, she will call the individual over, although the player still has the choice of whether or not to speak to her and can still refuse the quest after starting the conversation. If a player who is ineligible for the quest speaks to the sergeant, she will merely give a warning about the large number of Separatist forces in the area.\nTo complete the quest, the player must destroy four jamming beacons on Savrip Island and return to Pott, who will reward the player with 150 in-game credits, along with the player's choice of a pair of footwear appropriate for their class or three planetary commendations, which can be used to buy higher-quality gear in the game. The quest has no decisions that affect the light side or dark side alignment of the player. While the quest can be completed without a group of players and does not have to be finished to continue with the game, this article is written with the assumption of full game completion. In Pott's dialogue, she mentions that she lost two fingers while fighting on Ord Mantell, but the in-game model for the character has ten fingers. This article therefore assumes that she had her two missing fingers replaced by cybernetics.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Army",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sergeant/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Separatist_War",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Ord_Mantell_Central_Authority",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Avilatan",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Travi_Pott%27s_squad",
  "/wiki/Jammer",
  "/wiki/Savrip_Island",
  "/wiki/Squad/Legends",
  "/wiki/Death/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Military_rank/Legends",
  "/wiki/Unidentified_Republic_officer",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mine/Legends",
  "/wiki/Mantellian_Savrip/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Water/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Unit",
  "/wiki/Medical_droid/Legends",
  "/wiki/Time/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Canon",
  "/wiki/Standard_month/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Republic_officer/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/Droid/Legends",
  "/wiki/Voidhound",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Smuggler/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython"
 ]
}