{
 "name": "Tray%27Essek",
 "display_name": "Tray'Essek",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "Tray'Essek was a male Trandoshan criminal enforcer who was active during the early years of the Galactic Empire. At one point in his past, Tray'Essek was humiliated and betrayed by his fellow clansman Lar'omx. A follower of the Trandoshan religion, in line with Trandoshan traditional beliefs, Tray'Essek's jagannath points were zeroed out, leaving him without a place of honor in the afterlife. Tray'Essek subsequently sought to restore his position by taking the life of his betrayer, and he vowed to devote the rest of his life to tracking Lar'omx down and to ensuring that no-one else killed his rival first. After learning that Lar'omx was working for the criminal organization Black Sun, Tray'Essek joined the Pyke Syndicate, in hope that service to the Syndicate would provide him with an opportunity to encounter Lar'omx once again.\nAfter the Kadas'sa'Nikto bounty hunter Kaa'to Leeachos betrayed the Pykes, Tray'Essek was among a group of Pyke-affiliated operatives assigned to track the Nikto down, and the group subsequently traced Leeachos' movements through the undercity of the planet Coruscant. During the mission, Tray'Essek finally came face to face with Lar'omx again, in an encounter inside the Spyder, an underworld gambling establishment. The operatives later confronted Leeachos inside an abandoned wing of the NovaCORE kelerium processing plant, in The Works district.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pyke_Syndicate/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lar%27omx",
  "/wiki/Jagannath_point/Legends",
  "/wiki/Death/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Kadas%27sa%27Nikto/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Kaa%27to_Leeachos",
  "/wiki/Nikto/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Spyder",
  "/wiki/Gambling/Legends",
  "/wiki/NovaCORE_kelerium_processing_plant",
  "/wiki/Sector_943",
  "/wiki/Under_a_Black_Sun",
  "/wiki/Star_Wars:_Edge_of_the_Empire_Core_Rulebook"
 ]
}