{
 "name": "Trech_Molock",
 "display_name": "Trech Molock",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish-brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "General Trech Molock was a human male who served in the Galactic Empire Officer Corps. In 0 BBY, he attended a meeting of the Imperial Military's Joint Chiefs in a conference room on board the Death Star. At the meeting, Molock heard Grand Moff Wilhuff Tarkin announce the dissolution of the Imperial Senate and witnessed the Sith Lord Darth Vader use the Force to choke Admiral Conan Antonio Motti until Tarkin ordered the Sith to stop.\nTrech Molock was a human male who held the rank of general within the Officer Corps of the Galactic Empire. In 0 BBY, Molock attended a meeting of the Imperial Military's Joint Chiefs that was held in the main conference room on the officer's deck of the semi-operational Imperial Death Star battle station. The meeting was called by Grand Moff Wilhuff Tarkin, but Molock arrived before the Moff and sat with Chief Moradmin Bast, Colonel Wullf Yularen, Chief Siward Cass, General Hurst Romodi, Commander Cassio Tagge, and Admiral Conan Antonio Motti discussing the relative threats that each of their respective commands faced. This led to Tagge and Motti arguing about the threat posed to the station by the Alliance to Restore the Republic, but they were interrupted by the arrival of Tarkin and the Sith Lord Darth Vader, with Tarkin announcing that the Imperial Senate had been dissolved.\nMolock remained silent as Tagge and Tarkin discussed the dissolution and then the Alliance's recent theft of a set of plans for the Death Star that they could use to make an attack. Motti dismissed the possibility of a successful attack on the station, claiming it was by then the ultimate power in the galaxy, but Vader chastised him and stated that the Force was more powerful. The admiral then began to criticize Vader' devotion to the Force, but the Sith Lord cut him off by choking Motti from across the room using the Force. Molock and the others watched the admiral struggle until Tarkin ordered Vader to release Motti and stated that they would soon destroy the Alliance. The next day, Motti mentioned Molock in an incident report about Vader's actions at the meeting that he submitted to Imperial High Command.\nTrech Molock had light skin and reddish-brown hair.\nWhile in the meeting on the Death Star, Molock wore a gray Imperial officer's uniform with a rank insignia plaque that showed seven red squares.\nTrech Molock first appeared as an unnamed background character in the 1977 original Star Wars film Star Wars: Episode IV A New Hope, whom the fan website Aveleyman identifies as Charlie Gray, an actor listed as an Imperial Bureaucrat in Ann Skinner's continuity notes. He was given the name Trech Molock by the 2013 Star Wars Insider article The Death Star Coup. The name was brought back to canon by the short story \"An Incident Report\" of the 2017 anthology From a Certain Point of View.\nThe character shares his surname with Sate Molock, an unused character present in the second draft for the 1980 film Star Wars: Episode V The Empire Strikes Back, who ultimately evolved into Sate Pestage. Molock's given name was inspired by Chris Trevas's \"Star Wars name\" according to an Internet meme, which requires taking the first three letters of one's last name and the first two letters one's first name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Trech_Molock",
  "/wiki/Trech_Molock/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/General",
  "/wiki/0_BBY",
  "/wiki/Imperial_Military",
  "/wiki/Joint_Chiefs",
  "/wiki/Death_Star_conference_room",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Imperial_Senate",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Admiral",
  "/wiki/Conan_Antonio_Motti",
  "/wiki/Sith",
  "/wiki/Battle_station",
  "/wiki/Moff",
  "/wiki/Chief",
  "/wiki/Moradmin_Bast",
  "/wiki/Colonel",
  "/wiki/Wullf_Yularen",
  "/wiki/Siward_Cass",
  "/wiki/Hurst_Romodi",
  "/wiki/Commander",
  "/wiki/Cassio_Tagge",
  "/wiki/Space_station",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Death_Star",
  "/wiki/The_galaxy",
  "/wiki/Sith_Lord",
  "/wiki/Standard_day",
  "/wiki/Imperial_High_Command",
  "/wiki/Hair",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Rank_insignia_plaque",
  "/wiki/1977",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Charlie_Gray",
  "/wiki/Ann_Skinner",
  "/wiki/2013",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/An_Incident_Report",
  "/wiki/2017",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Sate_Molock",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Sate_Pestage",
  "/wiki/Chris_Trevas",
  "/wiki/Star_Wars:_A_New_Hope_Cinestory_Comic",
  "/wiki/Darth_Vader_(2015)_1",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_93",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Rise_of_the_Rebellion_and_the_Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battle_of_Yavin",
  "/wiki/March_7",
  "/wiki/2019",
  "/wiki/Star_Wars_Insider_Special_Edition_2014",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/October_30",
  "/wiki/File:TrechMolock-Facebook.png"
 ]
}