{
 "name": "Treesh",
 "display_name": "Treesh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Myyydril tribe"
     ]
    }
   ]
  }
 ],
 "content": "Treesh was a male Rodian working as a weaponsmith. He lived among the Myyydril tribe in the Myyydril Caverns in the Kkowir Forest of the Wookiee homeworld of Kashyyyk during the Galactic Civil War in 1.5 ABY. He was responsible for keeping the tribe's soldiers armed with the best weapons he could muster.\nIn 1.5 ABY, a spacer with the knowledge to craft weapons visited Treesh within the Myyydril Caverns and asked him to teach them what he knew. Treesh agreed to teach the spacer how to craft Nak'tra crystal knives. Unfortunately, Treesh had no crystals at the moment, so he set the spacer on the task of collecting fifteen of the crystals from the corpses of the Urnsor'is that infested the cavern. After the spacer had collected them, they brought them back to Treesh, who proceeded to teach the spacer how to make the knives.\nTreesh is a non-playable character in the massively-multiplayer online role-playing game Star Wars Galaxies: An Empire Divided. He was added to the game, along with the planet Kashyyyk, in the 2005 expansion pack, Rage of the Wookiees.\nTreesh's quest is only available to players of the Trader  profession within the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Myyydril",
  "/wiki/Myyydril_Caverns",
  "/wiki/Kkowir_Forest",
  "/wiki/Wookiee/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Nak%27tra_crystal",
  "/wiki/Urnsor%27is",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees"
 ]
}