{
 "name": "Treetower",
 "display_name": "Treetower",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugnaught"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Treetower was a male Ugnaught Jedi Master who served the Jedi Order and the Galactic Republic as a General in the Grand Army of the Republic during the Clone Wars.\nA Force-sensitive male Ugnaught, Treetower was trained in the ways of the Force by the Jedi Order. Eventually, Treetower obtained the rank of Jedi Master.\nBy 22 BBY, when the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Master Treetower was of advance age, with white hair. Like most Jedi, Treetower took up the rank of General in the Grand Army of the Republic, leading clone troopers against the Separatist Droid Army. During the war, the Jedi learned that a group of Ugnaughts—men, women and younglings—were being smuggled to the Trade Federation, destined to be slaves in Confederate factories. Treetower, despite never having faced such a dangerous mission before, demanded that he be allowed to undertake it by himself. Arriving on the gas giant of Yorn Skot, Treetower landed aboard a small platform but was met with resistance by two spider droids, and was forced to trigger a distress signal before being knocked from the platform. He was rendered unconscious and wound up hanging from the platform's underside by his cloaks.\nAboard a nearby Star Destroyer, the H.O.P.E. Squad—four specialized clone commandos—intercepted his signal and were rerouted from their previous mission by the Jedi Council. Ejecting from the starship aboard four individual escape pods, they descended into the atmosphere where the pods broke open, allowing them to slow their fall using combat umbrellas. The clones destroyed the spider droids from the air and landed on the platform, then used grappling hooks to rappel down to where Treetower hung. Suddenly, they were attacked by Separatist jump droids, and three of the clones were quickly killed. The squad leader managed, by way of skillful acrobatics and combat prowess, to overcome all the droids, as well as grab Treetower when his cloak ripped and he began to fall. The Jedi awoke as the squad leader caught him, then held on tight to his arm as the clone dealt with the final droid.\nClimbing atop the platform once more, Treetower raced forward and flung open the hatch on the platform, freeing the cargo the droids had fought so hard to possess. He revealed the slaves to the clone, then turned to him and smiled, both satisfied that their mission was a success.\nOf diminutive stature, Treetower dressed in traditional Jedi robes and wore his white hair tied back in a top-knot.\nThough Treetower did not appear to be a very able combatant, he was capable of utilizing the Force; while the clone trooper who saved him clambered atop the platform, Treetower nimbly jumped away and landed at the platform's center. He did not utilize a lightsaber during the mission to rescue the Ugnaught slaves.\nTreetower appeared in the the short comic \"The Drop\", published by Dark Horse Comics in 2003 in Star Wars: Clone Wars Adventures Volume 6. Designed by the comic's illustrator Stewart McKenny, who would receive his own Jedi costume based on the character in 2013 from the Rebel Legion Star Wars Costume Club's \"Hoth base\" branch, located in Victoria, Australia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Slavery/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Yorn_Skot",
  "/wiki/DSD1_dwarf_spider_droid/Legends",
  "/wiki/Distress_signal/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/High_Orbit_Precision_Entry_Squad",
  "/wiki/High_Orbit_Precision_Entry_trooper",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Combat_Umbrella",
  "/wiki/Grappling_hook/Legends",
  "/wiki/Jump_droid",
  "/wiki/Death/Legends",
  "/wiki/Unidentified_orange_commando",
  "/wiki/Droid/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Drop_(comic)",
  "/wiki/Dark_Horse_Comics",
  "/wiki/2003",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_6",
  "/wiki/Stewart_McKenny",
  "/wiki/2013",
  "/wiki/Rebel_Legion",
  "/wiki/Echo_Base/Legends",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/October_22",
  "/wiki/November_15",
  "/wiki/2021"
 ]
}