{
 "name": "Trench",
 "display_name": "Trench",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Secundus Ando"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Invulnerable",
      "Azure system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Harch"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.89 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Left side of head",
      "All three left arms",
      "One with electronet launcher",
      "One with electronet launcher"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corporate Alliance",
      "Corporate fleet",
      "Corporate fleet",
      "Confederacy of Independent Systems",
      "Confederacy of Independent Systems Navy",
      "Confederacy of Independent Systems Navy"
     ]
    }
   ]
  }
 ],
 "content": "Trench was a Harch admiral and naval commander who survived a number of presumed deaths throughout his career. Hailing from Secundus Ando, he acquitted himself in engagements with the Galactic Republic, all the while savoring the terror he struck in his enemies. Years after his purported death at the Battle of Malastare Narrows, he resurfaced during the Clone Wars, becoming a key officer in the navy of the Confederacy of Independent Systems. From the dreadnought Invincible he oversaw the Confederate blockade of Christophsis, which brought him into conflict with a Republic battle group led by Jedi Generals Obi-Wan Kenobi and Anakin Skywalker along with an old foe, Admiral Wullf Yularen. When Skywalker and Yularen attempted to use an experimental stealth ship to breach the blockade, Trench began a deadly game of cat and mouse with them. Though Skywalker outwitted him by redirecting a volley of tracking torpedoes at the Invincible, Trench managed to survive his flagship's demise.\nDuring the Battle of Ringo Vinda, Trench captured clone trooper Tup—who had mysteriously gunned down Jedi General Tiplar—and tried to send the clone to Separatist leader Count Dooku for examination, though a Republic team intervened and rescued Tup. In the Battle of Anaxes, Trench besieged the Republic shipyards at Anaxes for weeks on end, exploiting the Techno Union's secret access to a Republic strategy algorithm. Even as the tide of battle began to turn, Trench remained intent on annihilating the Jedi and their clone infantry. Though he activated a bomb beneath the assembly complex on Anaxes, Skywalker infiltrated Trench's flagship, the Invulnerable and forced the admiral to divulge the sequence to disarm the device. When Trench tried to retaliate, Skywalker drove his lightsaber through his chest, inflicting a death that even the hardened Harch could not escape.\nTrench was a male Harch who hailing from Secundus Ando, Trench served in multiple battles throughout his military career, mostly in cruiser–to–cruiser action. In some of these battles he would fight against forces utilizing cloaked starships, defeating them through the use of tracking torpedoes fixed on the vessels' magnetic signatures.\nTrench eventually rose to command a corporate fleet that blockaded the planet Malastare. Trench was able to hold his lines against a Republic fleet led by Admiral Wullf Yularen sent to break the blockade, tearing their ships apart. However, a Jedi-led taskforce commanded by Master Kep-She was able to defeat Trench, vaporizing his flagship and seemingly killing him in the process. However, Trench survived the battle with the help of his species' hardy biology as well as a damaged pressure suit.\nTrench, along with his tactical droid, TI-99, were later sent to Christophsis to assist General Loathsom and Count Dooku's assassin, Asajj Ventress in seizing the planet for the Confederacy, and blockading the planet to tighten their grip on the system. There, he commanded the blockade from his war-painted flagship, the Invincible, to prevent Senator Bail Organa of Alderaan and other republic relief forces from being resupplied and to cripple any attempts to penetrate the blockade. Trench then held his lines against Jedi General Anakin Skywalker's fleet. Trench then watched as the Republic fleet retreated by the moon and had his force recharge their cannons.\nWhile the Jedi retreated and regrouped, Trench felt that he had won the first round. His tactical droid was puzzled and asked Trench if they should pursue. The Admiral instead ordered his troops not to follow the enemy, as per the commands he was issued by higher authority; after which, Trench commanded his droids to recycle the ship's shields and allow the cannons to recharge to full power. The Admiral, satisfied with the proceedings, seated himself at the bridge and awaited for the return of the Republic ships.\nHowever, Trench's old adversary from Malastare Narrows, Admiral Wullf Yularen, was also present with Skywalker at the battle. After recognizing Trench's trademark insignia painted on his flagship, Yularen studied everything Republic Intelligence had provided on the Admiral's tactics, allowing him to plan a counter-attack. This came in the form of an experimental stealth ship, piloted by Anakin Skywalker himself and Admiral Yularen as an adviser. Unaware of the existence and capabilities of the cloaked ship, Trench then grew impatient with the Republic fleet and to put pressure on the Republic fleet to attack, Trench sent a squadron of Hyena bombers to attack Organa's refugee camp, particularly the command center as a plan to draw out the Republic on the surface who Trench viewed as \"cowards.\"\nWhen the Republic fleet did not attack, Trench understood that something odd was happening. Trench then spotted a cloaked ship moving to attack him. Trench and his crew were then able to raise the Invincible's thermal shields. Trench fired torpedoes at the stealth ship, but missed. Trench then ordered a volley of lasers to be fired at it, and since no shots landed, Trench was able to deduce that the pilot was a Jedi, not a clone.\nTrench sent a message to Skywalker, telling him that he had dealt with cloaked ships before. He also gloated that Christophsis' citizens and resources would join the Separatist Alliance. Trench also told Skywalker to retreat, for he was his doom. Trench prepared himself for the Jedi's inevitable second offensive. Eventually the cloaked vessel revealed itself, but this time, the crew had knowledge of Trench's tactics when dealing with cloaked ships.\nAfter Skywalker attacked, Trench was able to track the ship's magnetic signature using tracking torpedoes so he could follow and destroy them. At first, Trench's tactic worked. However, he would be forced to lower his shields to do so and the droid advised that such a maneuver would be unwise. In a moment of compulsive anger and against the droid's advice, Trench gave the order and the torpedoes were launched. After seemingly attempting to elude the missiles, Skywalker then flew the ship towards the Invincible's bridge. A horrified Trench then realized what Skywalker was intending and desperately ordered the shields up, to no avail as they were recharging. Trench accepted his fate, but was able to survive once again. However, he lost his left eye and all three of his left arms, which required cybernetic replacements.\nTrench, alongside the super tactical droid Kraken, later commanded the Separatist forces on the space station at Ringo Vinda against Jedi Generals Tiplee, Tiplar, Skywalker, and their clone forces. As the Republic came close to breaking his lines, Trench witnessed one of the clone troopers kill General Tiplar, causing the Republic to retreat. Trench then contacted Count Dooku and described his observations, telling him that the clone looked \"like he was in a trance of some kind\". Trench's observation for minor details proved vital as it allowed Dooku and his Sith Master, Darth Sidious, to create a cover-up before the Jedi Order could discover the existence of Protocol 66. Trench then had Kraken capture and deliver the clone to Dooku, despite the Republic's blockade. After successfully kidnapping the clone trooper \"Tup\", the Count applauded the Harch's success, Trench then tasked Kraken to personally escort the captured Clone to Dooku himself. However, the mission failed as the Republic recaptured Tup and Kraken was decapitated by Skywalker. Following the recapture of Tup, the Republic eventually withdrew its forces from Ringo Vinda.\nDuring the later phases of the Clone Wars, Trench, now on the offensive, commanded the Confederate forces during the Battle of Anaxes, fighting for the Republic's vital shipyards on Anaxes in a campaign which lasted for several weeks. Trench used his own tactical acumen, as well as using Clone Captain CT-7567's strategy algorithm against them using the Techno Union's test subject on Skako Minor, a captured ARC trooper named \"Echo\". Skywalker, Rex and Clone Force 99 rescued Echo from the Techno Union, but Trench was not made aware of this because of Wat Tambor's greed.\nWhen the Republic attacked Anaxes again, Trench had expected an easy rout by the Republic forces, only to be surprised when the entire force at the plant was disabled, so he went to his backup plan; a bomb in the plant that would rip the planet apart. Echo sensed this and attempted to decipher the sequence, but the jamming signal incapacitated him before he could decipher the last number for Mace Windu. Skywalker, having anticipated Echo would be unable to complete the job, forced his way to the dreadnought's bridge, where he cut down the super tactical droid and accompanying BX-series droid commandos. Skywalker then threatened Trench for the last number, but the Harch refused, claiming that Dooku would kill him if he lost Anaxes and assumed that Skywalker was noble, only to be proven wrong when he sliced off his left arms, prompting him to quickly give up the number. As Skywalker reiterated it to Windu, Trench attempted to electrocute him with his staff, but Skywalker resisted and plunged his lightsaber into his chest. Anakin then grabbed the dreadnought's self-destruct detonator and indifferently bid the admiral farewell as he dropped dead. The group then escaped and planted thermal detonators and activated them from a safe distance, instantly vaporizing his body and the surrounding ships.\nAlthough Trench's Christophsis flagship, Invincible, was destroyed by Anakin Skywalker in a cloaked stealth ship during the Battle of Christophsis, some of the flagship's modules were salvaged and used to modify a Separatist dreadnought owned by Berch Teller's rebel cell to attack the Empire's Sentinel Base in 14 BBY.\nTrench was a fearsome Harch admiral who was far larger than the average member of his species, as the arachnids seldom grew to such size due their exoskeletons not being able to bear the weight of the fur.\nTrench became a terror on the battlefield, as he held no mercy or remorse toward his opponents. He was a well-decorated military genius and his aggressive tactics and maneuvers in combat made him responsible for the destruction of many Republic fleets. His skill in hunting cloaked ships through the use of tracking magnetic signatures was also noted and recorded in the Republic Intelligence record, which was studied during the blockade of Christophsis by Admiral Yularen.\nTrench prided himself for having won many battles in the war as a result of his tactical acumen, resulting in him developing an overconfident personality and often boasting about outsmarting his opponents. Trench often viewed his battles like a game and would often cajole and taunt his enemies as he made his moves, before leading them into a vulnerable position where he could eliminate them. However, his overconfidence nearly led to his own demise at the hands of Anakin Skywalker when he made an uncharacteristic oversight which left himself vulnerable to incoming missiles. Even when his death appeared imminent, Trench did not panic or show distress; he simply accepted his fate.\nFollowing his defeat, Trench was immediately fitted with \"top-of-the-line\" cybernetics making up half of his limbs and face to ensure his quick return to service. Trench, learning from his mistakes of lowering his guard, carried an electrostaff-cane variant as well as one of his cybernetic arms being equipped with a stun net which he used against Skywalker prior to his demise.\nTrench's first flagship was part of a corporate fleet which was present at the Battle of Malastare Narrows where Trench blockaded the planet and engaged Wullf Yularen's republic fleet which was successful until a Jedi-led task force intervened and sabotaged his campaign. It was believed that he had gone down with his ship, but this was later proven false at the Battle of Christophsis in 22 BBY.\nThe Invincible served as the Harch commander's first command ship after his reemergence where it blockaded the planet of Christophsis, offering a great range of attacks, and it was said that the cruiser could blockade a planet on its own. Unlike the stock variant of a Separatist dreadnought; Trench's was well-equipped with heavy deflector and thermal shields which allowed for a powerful defense. However, Trench underestimated the opposing commander, General Anakin Skywalker, resulting in him losing the upper hand and Anakin taking advantage of the Admiral's temper by redirecting Trench's projectiles to the bridge of his ship.\nThe Invulnerable was the last flagship used by Admiral Trench, witnessing action during the Battle of Anaxes. Onboard, he received transmissions of a stolen Republic strategy algorithm from the planet Skako Minor, routed through a Cyber Center on the surface of Anaxes, and used it to counter the Republic's moves.\nAdmiral Trench was created for the Star Wars: The Clone Wars television series and made his first appearance in the second season of the series \"Cat and Mouse\" and voiced by Dee Bradley Baker also known for voicing the Clone troopers in the series.\nTrench was confirmed to have survived \"Cat and Mouse\" and made his return in the series in the sixth season episode \"The Unknown\", where Trench is alive with half his body consisting of cybernetics. Additionally, Clone Wars writer Brent Friedman confirmed on his Twitter account that he wrote a four-part episode arc that wasn't published that featured Trench. The episode arc, was screened at Celebration Anaheim Star Wars convention as story reel form apart of The Clone Wars Legacy project in 2015, which would have featured the return and death of Admiral Trench. The episodes were later released on StarWars.com. The unfinished episodes later aired as part of the revival.\nThe story reel version of \"On the Wings of Keeradaks\" contains a reference to Trench that was removed in the episode's final version.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Trench",
  "/wiki/Trench/Legends",
  "/wiki/Trench_(disambiguation)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Secundus_Ando",
  "/wiki/19_BBY",
  "/wiki/Invulnerable",
  "/wiki/Azure_system",
  "/wiki/Harch",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/Limb",
  "/wiki/Corporate_Alliance",
  "/wiki/Corporate_fleet_(Malastare)",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/File:ISmellFear-CaM.ogg",
  "/wiki/Admiral",
  "/wiki/Commander",
  "/wiki/Death",
  "/wiki/Galactic_Republic",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Malastare_Narrows",
  "/wiki/Clone_Wars",
  "/wiki/Officer",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Invincible",
  "/wiki/Blockade",
  "/wiki/Christophsis",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Fleet",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Wullf_Yularen",
  "/wiki/IPV-2C_Stealth_Corvette",
  "/wiki/Tracking_torpedo",
  "/wiki/Flagship",
  "/wiki/Battle_of_Ringo_Vinda",
  "/wiki/Clone_trooper",
  "/wiki/CT-5385",
  "/wiki/Jedi",
  "/wiki/General",
  "/wiki/Tiplar",
  "/wiki/Cloning",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Battle_of_Anaxes",
  "/wiki/Anaxes_shipyards",
  "/wiki/Anaxes",
  "/wiki/Standard_week",
  "/wiki/Techno_Union",
  "/wiki/Echo",
  "/wiki/Rex%27s_battle_strategy_algorithm",
  "/wiki/Anaxes_assembly_complex",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Homeworld",
  "/wiki/Cruiser",
  "/wiki/Cloaking_device",
  "/wiki/Starship",
  "/wiki/Planet",
  "/wiki/Malastare",
  "/wiki/Jedi_Master",
  "/wiki/Kep-She",
  "/wiki/File:AdmiralDoom-CaM.ogg",
  "/wiki/T-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/TI-99",
  "/wiki/Whorm_Loathsom",
  "/wiki/Assassin",
  "/wiki/Asajj_Ventress",
  "/wiki/Christophsis_blockade",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Alderaan",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Moon",
  "/wiki/Cannon",
  "/wiki/Republic_Intelligence",
  "/wiki/Hyena-class_Droid_Fighter/Bomber",
  "/wiki/Refugee",
  "/wiki/Thermal_shield",
  "/wiki/Laser",
  "/wiki/Pilot",
  "/wiki/Bridge_(starship)",
  "/wiki/ST-series_military_strategic_analysis_and_tactics_droid",
  "/wiki/Kraken",
  "/wiki/Confederacy_military",
  "/wiki/Ringo_Vinda_space_station",
  "/wiki/Ringo_Vinda",
  "/wiki/Tiplee",
  "/wiki/Sith_Master",
  "/wiki/Darth_Sidious",
  "/wiki/Order_66",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Clone_Force_99",
  "/wiki/Wat_Tambor",
  "/wiki/Mace_Windu",
  "/wiki/Unidentified_ST-series_military_strategic_analysis_and_tactics_droid_(Anaxes)",
  "/wiki/BX-series_droid_commando",
  "/wiki/Berch_Teller%27s_warship",
  "/wiki/Berch_Teller",
  "/wiki/Berch_Teller%27s_rebel_cell",
  "/wiki/Attack_on_Sentinel_Base",
  "/wiki/Galactic_Empire",
  "/wiki/Sentinel_Base",
  "/wiki/14_BBY",
  "/wiki/Skeleton",
  "/wiki/Hair",
  "/wiki/Cybernetics",
  "/wiki/Stun_net",
  "/wiki/22_BBY",
  "/wiki/Skako_Minor",
  "/wiki/Cyber_Center",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Cat_and_Mouse",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/The_Unknown",
  "/wiki/Brent_Friedman",
  "/wiki/The_Clone_Wars_Legacy#Bad_Batch",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/Star_Wars",
  "/wiki/The_Clone_Wars_Legacy",
  "/wiki/2015",
  "/wiki/StarWars.com",
  "/wiki/On_the_Wings_of_Keeradaks",
  "/wiki/The_Bad_Batch_(episode)",
  "/wiki/A_Distant_Echo",
  "/wiki/Unfinished_Business_(episode)",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Category:Audio_files_of_Trench",
  "/wiki/Category:Images_of_Trench",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_106",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_74",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_22",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Star_Wars_Helmet_Collection_35",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_56",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Invisible_Hand_Expansion_Pack",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Final_Countdown",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Clone_Wars_Begin",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/The_Separatists",
  "/wiki/Databank_(website)",
  "/wiki/Ahsoka_Tano",
  "/wiki/Oba_Diah",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Jedi_Order",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Gone_with_a_Trace",
  "/wiki/Deal_No_Deal",
  "/wiki/Dangerous_Debt",
  "/wiki/Together_Again",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/The_Hidden_Enemy"
 ]
}