{
 "name": "Treuten_Teradoc",
 "display_name": "Treuten Teradoc",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Er'Kit"
     ]
    },
    {
     "name": "Died",
     "values": [
      "12 ABY",
      "Tsoss Beacon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Greater Maldrood",
      "Federated Teradoc Union"
     ]
    }
   ]
  }
 ],
 "content": "Treuten Teradoc was a male human warlord that came to power after the Galactic Empire collapsed. Teradoc was officer of the Imperial Navy who established himself after the Battle of Endor. After Emperor Palpatine's death at Endor, the Empire became directionless, and with no orders coming from Coruscant. Teradoc claimed dominion over the Greater Maldrood, a region of territory surrounding his headquarters on Centares and the Maldrood sector where he had been stationed. The Er'Kit native Teradoc secured a number of key resource worlds around his new kingdom, but his proximity to the breakaway empire of Grand Moff Zsinj brought him into a rivalry with his fellow warlord. Border skirmishes with Zsinj and checks on expansion by the New Republic kept Teradoc occupied over the next several years, and the New Republic's expansion into the Empire left the warlord isolated. For a brief time, Teradoc provided assistance to the former steward of the Empire Ysanne Isard, following her downfall. Teradoc eventually combined his Mid Rim holdings with the Deep Core territory ruled by his brother Kosh into what they called the Federated Teradoc Union.\nWhen Zsinj was killed at the Battle of Dathomir, Teradoc moved to acquire his former worlds, but soon found himself caught in a war with Teren Rogriss of the Empire and Gial Ackbar of the New Republic. New Republic forces closed in on his territory and Teradoc was forced to flee into the Deep Core and reestablish himself there with his massive military. After ignoring the efforts of Grand Admiral Thrawn to reunite Imperial factions, Teradoc was drawn in by a new power rising on Byss—the reborn Emperor Palpatine, acting in secret. With Teradoc and his fellow warlords and Imperial factions, the reunited Empire under Palpatine waged an extremely successful war against the New Republic, lasting until Palpatine's final death and the destruction of Byss. Teradoc, in control of the largest military of the warlords, returned to his kingdom, and was able to recruit Vice Admiral Gilad Pellaeon to lead his Crimson Command. Teradoc was soon drawn into conflict with the Deep Core warlord Blitzer Harrsk, who was making moves to increase his own power. Teradoc and Harrsk's private war was brought to a halt by the maneuverings of Admiral Natasi Daala, who joined with Pellaeon to force the warlords to come to the negotiation table. Daala summoned Teradoc, Harrsk, and eleven other of the most powerful Deep Core warlords to a conference at Tsoss Beacon. When they were unable to come to an agreement, Daala had all thirteen warlords, including Teradoc, killed.\nBorn into a lower-class family on the planet Er'Kit, Treuten Teradoc had a rival almost from birth in his younger brother, Kosh. Although they rarely got along, the Teradoc brothers both always dreamed of action and adventure—to make these dreams a reality, they both signed up for the Imperial Navy. The Teradoc brothers both studied at the Imperial Academy at Corulag, where they distinguished themselves as naval theorists. Fiercely competing with one another at every turn, the Teradoc brothers both gained the rank of captain at about the same time, and were assigned to Crimson Command—a rapid-response taskforce active in the Quelii Oversector comprised of one hundred Victory-class Star Destroyers with distinctive red havod alloy hulls. The sibling rivalry soon took a different turn, however, when Treuten Teradoc was promoted to High Admiral over his brother Kosh, a development that Treuten never failed to rub in his brother's face.\nBy the time of the Battle of Endor in 4 ABY, Teradoc was stationed in the Maldrood sector. When Emperor Palpatine was killed in the battle, the Empire became rudderless, and immediately after, Admiral Blitzer Harrsk took his fleet into the Deep Core to establish an independent warlord kingdom. With no orders coming from Coruscant, Teradoc followed suit only days later. Teradoc set his sights on the Mid Rim, offering several Imperial worlds protection from his Crimson Command and adding their planetary militias to his growing forces. After placing Grand Moff Ambris Selit under house arrest, Teradoc carved out his own kingdom that he titled the Greater Maldrood, and established his headquarters and capital on the planet Centares. Styling himself High Admiral, Teradoc moved up and down the Perlemian Trade Route to secure more systems for himself, taking the shipyards at Abhean and Thanos, the industrial planets of Belderone, Charros IV, Metalorn, and Roche, the trade center of Bimmisaari, and the critical agriworld Balamak. With a wealth of resources under his control, Teradoc was able to keep his empire self-sufficient.\nTeradoc wasted no time getting comfortable, growing fat in his ship's galley and generally avoiding any kind of combat. Teradoc scored a major coup when he stole the immense treasure stockpile of Space Station Scardia—Teradoc soon began to style himself as a swashbuckling rogue, wielding a cutlass as he paced his flagship, the 13X. Though he remained nominally loyal to the Empire for the time being, Teradoc promised protection under his aegis to the wealthier citizens of the Empire, undermining the authority of the head of the Empire at the time, Sate Pestage. After Pestage's downfall, former Imperial Moff Leonia Tavira joined Teradoc, and from him obtained the Invidious, an Imperial-class Star Destroyer that had been with his fleet since Endor.\nWhile he was able to thrive within his own space, Teradoc was distracted by his hatred of the New Republic and the Hutts, whose territory lay bordering his own. Furthermore, he found himself in a rivalry with Grand Moff Zsinj, who had established his own warlord kingdom to the galactic north of the Maldrood. The two engaged in a number of border skirmishes over the years. Teradoc's border with Zsinj also fell prey to the Mon Calamari, who sought payback for Imperial treatment of their species. In 5 ABY, Teradoc's ambitions were checked when New Republic forces from Kashyyyk secured a costly victory for themselves at Togoria. By the next year, the New Republic had advanced far enough throughout Imperial space that Teradoc and his kingdom had become isolated. When the New Republic took Coruscant that year, Teradoc dropped his pretense of loyalty to the Empire.\nWith the fall of Coruscant, the steward of the Empire, Ysanne Isard, established herself as a warlord on the planet Thyferra, home of the Bacta Cartel. In exchange for bacta, Teradoc traded matériel to replace her losses in fighting the New Republic. Teradoc also leased the Interdictor cruiser Aggregator, part of his anti-Rebel task force, to Isard for a high cost. He did not have much faith in her, however, and to conserve his personnel Teradoc refused to let the Aggregator's TIE fighter complement be flown by his own people. Isard chose to use her own Thyferran Home Defense Corps instead, but they were unable to stand up to the New Republic's opposition, and the Aggregator was ambushed by Rogue Squadron in the Alderaan system and driven to retreat. To discourage Teradoc from loaning any more forces to Isard, the Rogues floated the rumor that they would capture the next ship he sent. Scornful at Isard for damaging his ship, Teradoc withdrew the Aggregator from her service.\nIn 8 ABY, Teradoc ran afoul of not only Zsinj, but of the New Republic. In serious trouble, Teradoc had to call to his brother Kosh, who had carved out his own empire in the Deep Core, for aid. Kosh came to Treuten's rescue, and together the two combined their holdings into what they called the Federated Teradoc Union. The two brothers generally got along under this arrangement, although they briefly came into conflict when Leonia Tavira played the two smitten brothers against one another. When Zsinj was killed in the Battle of Dathomir, Teradoc declared himself \"High Admiral of the Mid Rim\" and moved quickly across the Perlemian to secure the worlds of the Gordian Reach. However, he found himself in the middle of a war between Admirals Teren Rogriss of the Empire and Gial Ackbar of the New Republic. Teradoc beat Rogriss at Feriae Junction, winning him the allegiance of a number of Zsinj's ships, but Ackbar in turn soundly defeated Teradoc at Maridun and Thanos. Teradoc's hit and run attacks made him a nuisance to the other combatants, but with New Republic forces closing on his territory on all sides, he was forced to abandon the Maldrood and flee to the Deep Core world of Hakassi, where he used his massive fleet to establish himself as a power in the region.\nIn 9 ABY, Grand Admiral Thrawn united several factions of warlords behind him to wage war on the New Republic, but Teradoc and his fellow Deep Core warlords did not join the cause. In the wake of Thrawn's death, however, Teradoc was one of the first to be approached by agents of a new power broker on the Deep Core world of Byss—it was, in fact, Emperor Palpatine, resurrected into a new clone body and operating in secret. Teradoc answered the call of the Emperor, and the disparate factions of the Empire once more reunited under a common banner. Together they waged war on the New Republic, striking from the Deep Core to take Coruscant and other key Core Worlds. Teradoc fared poorly in this conflict, and at one point was ordered back to the Deep Core by his brother, who attempted to hold the Greater Maldrood himself. After Palpatine was defeated on Onderon, dying his final death, and Byss was destroyed, Vice Admiral Gilad Pellaeon, another who had fought alongside Palpatine, joined with Teradoc, and the warlord put him in charge of Crimson Command. In 12 ABY, former Emperor's Hand Roganda Ismaren attempted to use the superweapon ship Eye of Palpatine as leverage to gain influence with Teradoc and the other warlords. She was not successful, as the Eye was destroyed. At the same time, fellow warlord Blitzer Harrsk was attempting to gain a foothold in the Atravis sector; this power-grab brought Teradoc into open conflict with Harrsk.\nFrom his fortress, built into an asteroid in the ring system of a lavender-and-white gas giant, Teradoc sent a fleet of seventy-three Victories against Harrsk's stronghold. They destroyed Harrsk's flagship, the Shockwave, and crippled three more of his ships, but the attack provoked Harrsk to retaliate. Soon a counter-force headed by Admiral Natasi Daala arrived in Teradoc's own system. Though the speed of their return left Teradoc unprepared for attack, he had traps laid out in advance. As Daala and Harrsk's fleet moved into the rings, proximity mines planted by Teradoc in the larger asteroids detonated, destroying one of Harrsk's ships and crippling two others. As Harrsk's fleet came in sight of Teradoc's asteroid fortress, Teradoc scrambled his fleet of Victories under Pellaeon's command. Teradoc observed the battle from deep within his asteroid bunker, while his fortress sent a salvo of turbolaser fire against the intruders. However, Daala's vessel Firestorm did not engage his fleet, and soon she fired her ion cannon upon Harrsk's own Whirlwind, immobilizing him temporarily. Daala shortly sent a communication to all the mustered forces, denouncing Teradoc and Harrsk's war with each other. She then set her ship to self-destruct within fifteen minutes, promising that it would kill Harrsk unless he ceased all hostilities on his part.\nAboard his flagship 13X, Pellaeon issued a open-channel ceasefire for his own side. Teradoc contacted him in a rage, ordering Pellaeon to destroy Harrsk while he was vulnerable. Pellaeon refused, wanting to negotiate with Daala, and Teradoc denounced him as a traitor. Pellaeon met with Daala anyway, and Harrsk eventually gave the ceasefire order for his forces. The two commanders left the system to discuss matters, trusting that Teradoc would not open fire on Harrsk while they were gone. They eventually called a meeting of the warlords—Teradoc, Harrsk, and eleven more of the strongest rulers of the Deep Core—at Tsoss Beacon, a space station deep in the center of the galaxy. Daala allowed only the individual warlords to approach the station, insisting they leave their fleets outside the system; Teradoc and the warlords were loath to accept these terms, and the talks were delayed two days until they all finally agreed. Eventually, they met in a conference room within the station, Teradoc being the first to arrive.\nDaala spoke of Imperial unity, pleading the warlords to join together to fight their common enemy, which Teradoc dismissed as a platitude. Superior General Sander Delvardus took his contempt of the proceedings a step further, attempting to leave, at which point Daala sealed all the doors with a cyberlock that would not open for three hours. She gave the warlords that much time to choose a leader for themselves. For hours, they argued with little progress, until tensions built to the point that Harrsk leapt at Teradoc and began choking him. Pellaeon hauled the other warlord off Teradoc, but at this point Daala had had enough. She castigated the warlords for their failure to unite, and then, as she and Pellaeon put on breath masks, she flooded the room with nerve gas. Teradoc was the first to stand and attempt an escape, but it was fruitless. One by one the warlords succumbed to the gas and fell. Teradoc was the last to die, a fact which surprised Daala, given his obesity.\nFrom his youth, Treuten Teradoc was driven by his intense rivalry with his brother Kosh. Although the two had a rather cold relationship, as children they both idolized the legendary swashbuckler Piethet Brighteyes, whom Treuten later styled himself after as the warlord of the Greater Maldrood. The sibling rivalry pushed the Teradoc brothers to great heights in the Imperial Navy, and Treuten was always apt to rub in any advantage that he had over his younger brother. Teradoc was an obese man, often red-faced and sweaty and moving with difficulty. His strategic philosophy was to build up a fleet of smaller, yet more versatile ships, such as the Victory-class Star Destroyer. He preferred to command from a safe location deep within his fortress, while his ships formed a more disposable defense around him. Teradoc's own subordinate, Gilad Pellaeon, held the man in contempt for this, and considered him far beneath one of the officers he had served, Grand Admiral Thrawn. Nonetheless, Pellaeon learned the value of psychological warfare, including terror strikes, in part from Teradoc. For his own part, Teradoc—a firm believer in loyalty to one's commanding officer—considered Pellaeon a traitor after the man's alliance with Natasi Daala. Teradoc was diligent in his duty and extremely anti-Rebel; during Operation Shadow Hand he rallied to the Emperor's call, but after Palpatine's final death Teradoc dismissed any Imperial government outside himself and the warlord kingdoms. He considered notions of Imperial unity to be mere platitudes.\nWhile Teradoc made his first appearance in Kevin J. Anderson's Darksaber, he actually received brief mention in the novel set and published immediately before it, Children of the Jedi. Though Teradoc was established as being in the Deep Core there, the novel The Bacta War, set earlier, placed his operations in the galactic Rim, and later works like Isard's Revenge and Starfighters of Adumar indicated his involvement in actions near the Ciutric Hegemony and the domain of Zsinj, also in the outer reaches of the galaxy. The Essential Chronology continued to claim Teradoc's only holdings were in the Deep Core, not explaining the discrepancy; this was resolved at last in 2009's The Essential Atlas, which, in addition to finally giving Teradoc a first name, added to his backstory a time when his domain lay in the Mid Rim, with his time in the Deep Core pushed to the later part of his career. The 2013 StarWars.com blog post The Imperial Warlords: Despoilers of an Empire gave a large amount of information on Teradoc's backstory, including his homeworld and his rivalry with his brother Kosh.\nIn 2020, Leland Chee confirmed that the Teradoc that appeared in the fourth book of the  X-Wing novel series, X-Wing: The Bacta War, was in fact Kosh Teradoc, not Treuten.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Er%27Kit/Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Tsoss_Beacon/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Greater_Maldrood",
  "/wiki/Federated_Teradoc_Union",
  "/wiki/Darksaber_(novel)",
  "/wiki/Warlord/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Death/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Centares/Legends",
  "/wiki/Maldrood_sector",
  "/wiki/Planet/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Zsinj",
  "/wiki/New_Republic/Legends",
  "/wiki/Time/Legends",
  "/wiki/Ysanne_Isard",
  "/wiki/Deep_Core/Legends",
  "/wiki/Kosh_Teradoc",
  "/wiki/Battle_of_Dathomir_(Hunt_for_Zsinj)",
  "/wiki/Post%E2%80%93Zsinj_campaigns",
  "/wiki/Teren_Rogriss",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Byss/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Destruction_of_Byss",
  "/wiki/Vice_Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Crimson_Command",
  "/wiki/Blitzer_Harrsk",
  "/wiki/Natasi_Daala",
  "/wiki/Corulag_Academy",
  "/wiki/Corulag/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Quelii_Oversector",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Havod/Legends",
  "/wiki/Hull/Legends",
  "/wiki/High_Admiral",
  "/wiki/4_ABY/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Militia/Legends",
  "/wiki/Ambris_Selit",
  "/wiki/Perlemian_Trade_Route/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Shipyard/Legends",
  "/wiki/Abhean/Legends",
  "/wiki/Thanos",
  "/wiki/Belderone/Legends",
  "/wiki/Charros_IV/Legends",
  "/wiki/Metalorn/Legends",
  "/wiki/Roche_asteroid_field",
  "/wiki/Bimmisaari/Legends",
  "/wiki/Agriworld/Legends",
  "/wiki/Balamak/Legends",
  "/wiki/Scardia_Station",
  "/wiki/Cutlass",
  "/wiki/Flagship/Legends",
  "/wiki/13X",
  "/wiki/Sate_Pestage/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Leonia_Tavira",
  "/wiki/Invidious",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Hutt_Space/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Species/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Battle_of_Togoria_(Galactic_Civil_War)",
  "/wiki/Togoria/Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/Thyferra/Legends",
  "/wiki/Bacta_Cartel",
  "/wiki/Bacta/Legends",
  "/wiki/Immobilizer_418_cruiser/Legends",
  "/wiki/Aggregator",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Task_force/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Thyferran_Home_Defense_Corps",
  "/wiki/Second_ambush_in_the_Graveyard",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Alderaan_system/Legends",
  "/wiki/Starship/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Gordian_Reach/Legends",
  "/wiki/Battle_of_Junction",
  "/wiki/Feriae_Junction/Legends",
  "/wiki/Battle_of_Maridun_(8_ABY)",
  "/wiki/Maridun/Legends",
  "/wiki/Battle_of_Thanos",
  "/wiki/Hakassi/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Battle_of_Onderon_(Galactic_Civil_War)",
  "/wiki/Onderon/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Roganda_Ismaren/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Eye_of_Palpatine",
  "/wiki/Atravis_sector/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Shockwave_(Imperial-class)",
  "/wiki/Battle_of_Harrsk%27s_fortress",
  "/wiki/Admiral/Legends",
  "/wiki/Battle_of_Teradoc%27s_fortress",
  "/wiki/Proximity_mine/Legends",
  "/wiki/Turbolaser/Legends",
  "/wiki/Firestorm_(Imperial-class)",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Whirlwind_(Imperial-class)",
  "/wiki/Self-destruct_mechanism/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Superior_General",
  "/wiki/Sander_Delvardus",
  "/wiki/Cyberlock",
  "/wiki/Standard_hour/Legends",
  "/wiki/Breath_mask/Legends",
  "/wiki/Nerve_toxin/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/X-Wing:_Isard%27s_Revenge",
  "/wiki/X-Wing:_Starfighters_of_Adumar",
  "/wiki/Ciutric_Hegemony",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/2009",
  "/wiki/The_Essential_Atlas",
  "/wiki/2013",
  "/wiki/StarWars.com",
  "/wiki/The_Imperial_Warlords:_Despoilers_of_an_Empire",
  "/wiki/2020",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars:_X-Wing_(novel_series)",
  "/wiki/X-Wing_Rogue_Squadron_28",
  "/wiki/I,_Jedi",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_125",
  "/wiki/The_Official_Star_Wars_Fact_File_129",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/File:Leland_Chee_Teradocs.png"
 ]
}