{
 "name": "Trevik",
 "display_name": "Trevik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Quethold"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quesoth"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Midli",
      "Trevik's family"
     ]
    }
   ]
  }
 ],
 "content": "Trevik was a male Quesoth member of the Quesoth Midli caste of the planet Quethold's Red City, overseeing the Quesoth Workers. The Midli, who was born on Quethold, had a brother, Jirvin, who oversaw several Workers that handled equipment in the Red City. In 8 ABY, during an alliance between the warlord Nuso Esva and Quethold's ruler, the Queen of the Red, Trevik became the bowlcarrier of the Queen, carrying a bowl of nectar next to her litter and entourage.\nThe following days, Jirvin forced his brother to use Empire of the Hand Grand Admiral Thrawn's holocam to record Esva's artwork inside the Quesoth Dwelling of Guests building to prove that the Queen was not Esva's pawn. After doing so, the Red City was attacked by Thrawn's forces, and the Red monarch was slain by the \"Storm-hair\"—Trevik's nickname for Esva's species. The warlord sent the bowlcarrier to tell the attacking admiral that his forces would find him and kill him.\nTrevik of the Midli of the Seventh of the Red was a male Quesoth who was a member of the Quesoth Midli caste of the planet Quethold's Red City, overseeing the Quesoth Workers. The Midli had a brother, Jirvin, who oversaw a group of Workers handling equipment in the Red City. In 8 ABY, he became the bowlcarrier of the Queen of the Red, and was commanded by the governing Circling caste's Borosiv, who assisted the Queen, to straighten up, copy the Workers' stance, and rise the monarch's bowl higher, which Trevik did. The bowlcarrier then accompanied the Queen's litter and entourage to the Dwelling of Guests building, where the monarch's allies, the warlord Nuso Esva and his soldiers, the Chosen, stayed.\nThe Queen drank from Trevik's bowl, and spoke with Esva. At the darklight hour, the Midli returned to his home; however, a Circling intercepted him, bringing the new bowlcarrier to another Midli's home, where his brother greeted him. A group of Circlings and Jirvin informed Trevik that the Queen of the Red had become Esva's tool, and that to prove the contrary, the bowlcarrier would have to use a holocam to record the dwelling's artwork brought there by the warlord so Empire of the Hand Grand Admiral Thrawn could determine if Trevik was correct. He accepted, and did what he was told to do the next day, giving the recordings to his brother at the darkling hour after accompanying the Queen's entourage across the city to meet with Esva. That night, the bowlcarrier slept deeply in contrast to the previous one. The next morning, the Red City was attacked by Thrawn's forces, and Trevik joined the Queen and Esva at the Dwelling of Guests.\nAfter the Queen's loudspeakers were broken by the Imperial forces, the Quesoth Soldiers could not receive the monarch's orders in the Quesoth Soldier Speak language, and Esva ordered her to go to Thrawn's transports outside the Red City. Trevik objected, and Esva told the \"traitor—\" as he had recorded his artwork on Jirvin's orders, which in fact was the warlord's own ploy—to be quiet. The Queen then called her ally the true traitor, and she was killed by him along with Borosiv and her entourage shortly after. Esva then ordered Trevik to tell Thrawn that he may have won, but his warriors remained, and they would kill him. The alien's forces were defeated shortly after and the Imperial forces helped rebuild the Red City.\nA male Quesoth, Trevik was a loyal server of the Queen of the Red. The bowlcarrier was hesitant to betray the Queen when his brother told him to record Esva's artwork, but he was persuaded. The member of the Midli was member of a family. He considered Nuso Esva's multifaceted eyes proper.\nThe bowlcarrier was able to hold a bowl of nectar for the Queen, and spoke Quesoth Common Speak.\nTrevik wore a textured and patterned bowlcarrier vest and held a bowl of nectar for his Queen.\nTrevik appeared in the 2011 novella Crisis of Faith, written by Timothy Zahn and included in Heir to the Empire: The 20th Anniversary Edition.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Quethold",
  "/wiki/Quesoth",
  "/wiki/Gender/Legends",
  "/wiki/Midli",
  "/wiki/Trevik%27s_family",
  "/wiki/Planet/Legends",
  "/wiki/Red_City",
  "/wiki/Workers_(Quesoth)",
  "/wiki/Reproduction/Legends",
  "/wiki/Jirvin",
  "/wiki/Color/Legends",
  "/wiki/City/Legends",
  "/wiki/8_ABY/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Nuso_Esva",
  "/wiki/Queen_of_the_Red_(8_ABY)",
  "/wiki/Bowlcarrier",
  "/wiki/Queen_of_the_Red",
  "/wiki/Nectar/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Empire_of_the_Hand",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Holocamera",
  "/wiki/Dwelling_of_Guests",
  "/wiki/Battle_of_Quethold",
  "/wiki/Storm-hairs",
  "/wiki/Admiral/Legends",
  "/wiki/Chosen_(Nuso_Esva)",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Circling",
  "/wiki/Borosiv",
  "/wiki/Queen/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Trevik%27s_home",
  "/wiki/Unidentified_Circling",
  "/wiki/Quesoth_Soldiers",
  "/wiki/Quesoth_Soldier_Speak",
  "/wiki/Language/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Quesoth_Common_Speak",
  "/wiki/Bowlcarrier_vest",
  "/wiki/2011",
  "/wiki/Crisis_of_Faith",
  "/wiki/Timothy_Zahn",
  "/wiki/Heir_to_the_Empire:_The_20th_Anniversary_Edition",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}