{
 "name": "Treva_Horme",
 "display_name": "Treva Horme",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lutrillian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Outer Javin Company",
      "Planet Dreams",
      "Incorporated"
     ]
    }
   ]
  }
 ],
 "content": "Treva Horme was a Lutrillian Female and the primary saleswoman and executive planner for Planet Dreams, Incorporated. Her duties included accounting and the monitoring of production schedules.\nThe hard-working Horme was an equal partner in Planet Dreams, Incorporated along with the Snivvian Wiorkettle and Ozz the Ugnaught. Much of her notoriety came from her work with Outer Javin Company, where clients included TaggeCo and Lynciro Corporation. In approximately 2 ABY, the company's head offices were relocated to Bespin's Cloud City.\nThe three Planet Dreams executives were considering selling private hovering platforms in Bespin's Life Zone when Ozz revealed that someone was embezzling money and terraforming equipment from the company. Ozz vowed to investigate but was interrupted in 3 ABY when the Galactic Empire arrived and took control of the city. The partners decided to download all of their files and evacuate, but while Horme and Wiorkettle followed the plan, Ozz disappeared. The remaining partners moved back to the Oseon asteroid belt after fleeing Bespin.\nIn addition to Basic and her own native language, Horme was able to speak Rodian.\nTreva Horme was a background character played by actor Steve Meek in Star Wars: Episode V The Empire Strikes Back, but can barely be seen in the film beyond a blurred figure passing by. The character was most prominently seen in behind the scenes images and promotional photos for the film, in every case paired with another background character, Wiorkettle. Artwork from a 1980 coloring book based on the film is patterned after one of these promotional photos, while Horme appears in the foreground of a panel from Marvel Comics' adaptation of the film.\nHorme and Wiorkettle did not receive names until the second edition of West End Games' 1996 Galaxy Guide 3: The Empire Strikes Back. The names were retroactively applied to the film characters in the Cloud City Limited set of the Star Wars Customizable Card Game in 1997.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lutrillian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Outer_Javin_Company",
  "/wiki/Planet_Dreams,_Incorporated",
  "/wiki/Snivvian/Legends",
  "/wiki/Wiorkettle",
  "/wiki/Ozz",
  "/wiki/Ugnaught/Legends",
  "/wiki/Tagge_Company",
  "/wiki/Lynciro_Corporation",
  "/wiki/2_ABY/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Life_Zone/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Occupation_of_Bespin",
  "/wiki/Oseon_asteroid_belt",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Lutrillian_(language)",
  "/wiki/Rodian_(language)",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/1980",
  "/wiki/The_Empire_Strikes_Back_Coloring_Book_(1980)",
  "/wiki/Marvel_Comics",
  "/wiki/West_End_Games",
  "/wiki/1996",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Retcon",
  "/wiki/Cloud_City_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1997",
  "/wiki/Star_Wars_(1977)_43",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Last_Page",
  "/wiki/Star_Wars_Insider_48",
  "/wiki/Wizards.com",
  "/wiki/Rough_and_Tundra",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/October_25",
  "/wiki/2016"
 ]
}