{
 "name": "Trevim_Dadeferron",
 "display_name": "Trevim Dadeferron",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kail"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kail Ranges"
     ]
    }
   ]
  }
 ],
 "content": "Trevim Dadeferron was the first-born son of Dixon Dadeferron, a wealthy landowner from Kail. Like his father, Trevim was a critic of the Corporate Sector Authority, which was engaged in a dispute with their family over the issue of land-use rights. Unlike his younger brother, Torm, Trevim stood to inherit the Kail Ranges in the event of their father's death. However, Torm decided to change this state of affairs.\nAfter the death of Trevim and Torm's mother, the two brothers and their father visited the resort world of Maryo. Here, unbeknownst to his father and brother, Torm was contacted by agents of the Authority's Security Police and agreed to spy on Dixon and Trevim on their behalf. Shortly thereafter, Trevim, his father and several other relatives, who were critical of the Authority's interference in the use of their land, were kidnapped by the Authority and held in at the prison facility known as Stars' End.\nMeanwhile, Torm was given full control of the Kail Ranges and continued spying for the Authority. Citing the disappearances of Trevim and Dixon, Torm infiltrated the core leadership of a group headed by Rekkon, a scholar who was dedicated to finding individuals who had been kidnapped because of their opposition to the Authority. Though he eventually killed Rekkon, Torm's efforts to undermine the group were thwarted by Han Solo, who ejected him out of an airlock and then went on to free Trevim and Dixon—among several other prisoners—from Stars' End.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kail",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kail_Ranges",
  "/wiki/Dixon_Dadeferron",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Torm_Dadeferron",
  "/wiki/Death/Legends",
  "/wiki/Maryo",
  "/wiki/Security_Police",
  "/wiki/Spy/Legends",
  "/wiki/Stars%27_End/Legends",
  "/wiki/Rekkon",
  "/wiki/Han_Solo/Legends",
  "/wiki/Spacing",
  "/wiki/Han_Solo_at_Stars%27_End",
  "/wiki/Han_Solo_and_the_Corporate_Sector_Sourcebook"
 ]
}