{
 "name": "Trey_Courser",
 "display_name": "Trey Courser",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Trey Courser was a Human male machine and droid fabricator who served Wraith Squadron and was part of a team to serve in their investigation of General Stavin Thaal's guilt into the Lecersen Conspiracy. In 44 ABY, he played a special role in framing Thaal when he was disguised as the General via a neoglith masquer created by fellow Wraith Viull \"Scut\" Gorsat. In this disguise, he helped kidnap famed pop star Ledina Chott, who Thaal was planning to marry. The mission to determine Thaal's guilt was successful and he was arrested as Thadley Biolan under the assumption that Biolan was posing as Thaal and that the real Thaal was dead.\nTrey was Wraith Squadron's tech expert, Turman mentioned that he 'exercises constantly' and his muscular frame is mentioned throughout the story, so he is presumed to have above-average physical strength.\nBy Human standards, Trey was a fairly muscular and handsome man of fair complexion and brown hair that got lighter  when exposed to sunlight. He specialized in machine-tinkering for Wraith Squadron, and had a somewhat fun, lighthearted personality. He enjoyed flirting, as demonstrated with his interactions with the female members of the squad, most notably Jesmin Tainer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Droid/Legends",
  "/wiki/Wraith_Squadron",
  "/wiki/General/Legends",
  "/wiki/Stavin_Thaal",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/44_ABY",
  "/wiki/Cloaker#Masquers",
  "/wiki/Viull_Gorsat",
  "/wiki/Ledina_Chott",
  "/wiki/Thadley_Biolan",
  "/wiki/Jesmin_Tainer",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)",
  "/wiki/Wraith_Four",
  "/wiki/Tyria_Sarkin_Tainer",
  "/wiki/8_ABY/Legends",
  "/wiki/X-Wing:_Solo_Command"
 ]
}