{
 "name": "Trey_Callum",
 "display_name": "Trey Callum",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps",
      "Alliance to Restore the Republic",
      "Alliance Military",
      "Alliance Military"
     ]
    }
   ]
  }
 ],
 "content": "Trey Callum was a human male who served as a sergeant major the Rebel Alliance during the Battle of Hoth. He was formerly an Imperial officer who decided to join the Alliance, and served at Echo Base on the planet Hoth in 3 ABY. When the Galactic Empire invaded Hoth, Callum, in charge of Outpost Beta, reported the presence of Imperial All Terrain Armored Transports.\nAs the Imperial forces engaged the rebel defenders, Callum ordered his soldiers to focus fire on the walkers. When Imperial snowtroopers joined the fight, the sergeant major ordered his men to hold the line, and the snowtrooper force was decimated before the rebels began to retreat.\nTrey Callum was a human male who served as an Imperial officer in the Galactic Empire before choosing to join the Alliance to Restore the Republic in opposing them. By 3 ABY, Callum was an officer in the Alliance Military and was stationed at Echo Base on the planet Hoth. There, he commanded the soldiers of Outpost Beta, a series of artillery trenches dug between Hoth's Nev Ice Flow and South Ridge.\nWhen the Empire discovered and attacked Echo Base, they were forced to deploy ground forces due to the base's shield. This deployment included Blizzard Force, a group of All Terrain Armored Transports directed to destroy the deflector shield generator at Echo Base. As his men prepared their defenses, Callum spotted the walkers with a pair of macrobinoculars from Echo Station 3-T-8 and reported the vehicles' approach back to Echo Base. During the ensuing battle, Callum ordered his troopers at Outpost Beta to focus fire on the enemy walkers, which took no penetrating damage to their armor. He later ordered the soldiers Emon Kref and Andry Ked to take cover.\nThe soldiers cheered after the first AT-AT was destroyed. By that time, Callum received word from scouts that snowtroopers were approaching his position. The sergeant major marched along the trenches as the cheering died down, informing the other rebels of the incoming Imperial troops and ordering that the defenses keep the Imperial forces from passing the trenches. Callum's troops were able to decimate the snowtroopers of Blizzard Force using anti-personnel batteries, but were soon forced into a full retreat. Ultimately, the Empire successfully destroyed the shield generator and claimed victory on Hoth, but not before the Alliance managed to evacuate large amounts of its personnel. Outpost Beta was the first defense post reported to be destroyed.\nWhile on Hoth, Callum wore rebel snow gear including a white thermal flak jacket, white command gauntlets, and a white insulated watch cap with a comm set, a white face wrap, white cap warmers, and anti-glare goggles.\nTrey Callum was created for the 1980 original trilogy film, Star Wars: Episode V The Empire Strikes Back, in which he was portrayed by an uncredited Bob Anderson. Anderson was a stuntman who also acted as the fight double for Darth Vader during his lightsaber duels in the The Empire Strikes Back, as well as in Star Wars: Episode VI Return of the Jedi. Callum's full name was identified in his respective card in the 2013 digital card game Star Wars: Force Collection.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Trey_Callum",
  "/wiki/Trey_Callum/Legends",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alliance_Military",
  "/wiki/Sergeant_major",
  "/wiki/Battle_of_Hoth",
  "/wiki/Imperial_officer",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/3_ABY",
  "/wiki/Outpost_Beta",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Imperial_Army",
  "/wiki/Soldier",
  "/wiki/Walker",
  "/wiki/Cold_weather_assault_stormtrooper",
  "/wiki/Sergeant",
  "/wiki/Stormtrooper",
  "/wiki/Alliance_officer",
  "/wiki/Rebel_trooper",
  "/wiki/Nev_Ice_Flow",
  "/wiki/South_Ridge",
  "/wiki/Project_Swarm",
  "/wiki/Deflector_shield",
  "/wiki/Blizzard_Force",
  "/wiki/Deflector_shield_generator",
  "/wiki/Macrobinoculars",
  "/wiki/Echo_Station_3-T-8",
  "/wiki/Trooper",
  "/wiki/Armor",
  "/wiki/Emon_Kref",
  "/wiki/Andry_Ked",
  "/wiki/Blizzard_2",
  "/wiki/Alliance_military_uniform",
  "/wiki/Command_gauntlet",
  "/wiki/Insulated_watch_cap",
  "/wiki/Comlink",
  "/wiki/Hat",
  "/wiki/Anti-glare_goggles",
  "/wiki/1980",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Bob_Anderson",
  "/wiki/Anakin_Skywalker",
  "/wiki/Lightsaber_duel",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/2013",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Battle_of_Hoth_(Galaxy_of_Adventures)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Beyond_Hope",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_20",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/June_21",
  "/wiki/2011",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_132"
 ]
}