{
 "name": "Trhin_Voss%27on%27t",
 "display_name": "Trhin Voss'on't",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 1 ABY",
      "Ghostling Nest"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Trhin Voss'on't was a stormtrooper commander and commando. He was used as an instrument in the plans of Prince Xizor and Emperor Palpatine to destroy the Bounty Hunters' Guild and further the Bounty Hunter Wars.\nA strike force leader in one of the Corps' Strategic Insertion battalions, Voss'on't was hand-picked to participate in Xizor's Palpatine-backed plan to destabilize the Bounty Hunters' Guild. In an elaborate plot, Voss'on't had a large bounty placed on him to attract every bounty hunter in the galaxy. Xizor's hope was that with such a large price on his head, the already weakened Bounty Hunters Guild would shatter as the bounty hunters turned on each other to collect the prize, and only the strongest hunters would be left. The story was planted that he took over an Imperial Star Destroyer with a hand-picked skeleton crew, then when they got to a remote planet he killed everyone aboard. The plan was considered perfect—Voss'on't appeared to have stolen the useful parts of the Star Destroyer and sold them on the black market.\nBoba Fett and Bossk, forming a temporary partnership, tracked Voss'on't to a former Imperial mining colony on an unnamed planet. There they fought and subdued the stormtrooper, taking him unconscious to Boba Fett's ship Slave I. From there, Fett planned on delivering Voss'on't to Kud'ar Mub'at, the arachnid assembler who functioned as a middleman for many bounties and criminal contracts in the galaxy.\nBefore leaving for Kud'ar Mub'at's web, Boba Fett's ship was structurally damaged by his partner Bossk, who escaped Slave I via the escape pod. The following jump through hyperspace then further crippled Fett's ship, which, upon re-entering realspace, was ambushed by Prince Xizor. Fett managed to escape, though his ship was again damaged, and delivered Voss'on't to Mub'at. Xizor also arrived at the web and took charge of the stormtrooper. Voss'on't believed he would be greatly rewarded by Palpatine for his role in the plot, but instead was executed by Xizor's agents.\nA trained spy and soldier, Voss'on't was a ruthless, emotionless killer. His hair was grayed, his skin heavily tanned and scarred.\nVoss'on't was relatively old by human standards upon his inclusion and resulting death in Emperor Palpatine's plans involving the Bounty Hunter's Guild and Boba Fett. He was possibly old enough to have been a Stormtrooper since the Clone Wars, although his being a clone of Jango Fett is unlikely as his interaction with Boba Fett made no mention of this. However, it is also unlikely that Boba Fett would have acknowledged any shared heritage in front of the bounty hunter Bossk, so it is not completely impossible that Voss'on't hadn't been a clone trooper.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Ghostling_Nest_of_the_Assembler",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Slave_Ship",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Bounty_Hunter_Wars",
  "/wiki/Strategic_Insertion_battalion",
  "/wiki/The_galaxy/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Bossk/Legends",
  "/wiki/Slave_I/Legends",
  "/wiki/Kud%27ar_Mub%27at",
  "/wiki/Assembler",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Trhin_Voss%27on%27t",
  "/wiki/Hard_Merchandise",
  "/wiki/Aurra_Sing:_Dawn_of_the_Bounty_Hunters",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_27",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Battle_of_Circumtore"
 ]
}