{
 "name": "Tri_Tellon",
 "display_name": "Tri Tellon",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pa'lowick"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Tri Tellon was a Pa'lowick female thief who was active in the last decades of the Galactic Republic. Born on the ecumenopolis of Coruscant, she had worked the CoCo Town area since she was a hatchling. At some point, she partnered with an old rogue called Magreda. Over the course of her thieving career, Tellon stole many things from the clientele of Dexter Jettster's diner.\nOne day, she managed to steal an unidentified item from the Jedi Obi-Wan Kenobi, who was enjoying a drink at Dex's. Since she knew every nook and cranny of CoCoTown, she managed to outrun the pursuing Jedi and diner owner. Arrived at the den she shared with Magreda, the Pa'lowick proudly showed her partner the item stolen from Kenobi, which she assumed had mystical powers and was worth of fortune. When \"Magreda\" turned to face her, she realized that it was in fact the Jedi in disguise. On the other side of the room, Dexter Jettster held the door, blocking her only exit. While being taken away, Tellon learned that the so-called artifact was in fact a worthless paperweight bugged with a tracking device, and that she had been played all along.\nDecades after those events, the Wild Space cartographer and adventurer Emil Graf recounted the story of Tellon's arrest to his BB-series astromech BB-00.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Coruscant",
  "/wiki/Pa%27lowick",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Thief",
  "/wiki/Galactic_Republic",
  "/wiki/Reproduction",
  "/wiki/Ecumenopolis",
  "/wiki/CoCo_Town",
  "/wiki/Youngling",
  "/wiki/Magreda",
  "/wiki/Dexter_Jettster",
  "/wiki/Dex%27s_Diner",
  "/wiki/Standard_day",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Homing_beacon",
  "/wiki/Wild_Space",
  "/wiki/Cartographer",
  "/wiki/Emil_Graf",
  "/wiki/BB-series_astromech_droid",
  "/wiki/Astromech_droid",
  "/wiki/BB-00",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Tales_from_Wild_Space:_Stop,_Thief!",
  "/wiki/Star_Wars_Adventures_(2017)_1",
  "/wiki/The_Lost_Stories,_Part_3",
  "/wiki/Star_Wars_Adventures_(2017)_32"
 ]
}