{
 "name": "Tribeless_Sha",
 "display_name": "Tribeless Sha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "43.5 ABY",
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Under 1.50 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Blue Coral Divers"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Witches of Dathomir"
     ]
    }
   ]
  }
 ],
 "content": "Tribeless Sha, born Sha'natrac Tsu, was a Dathomiri female, formerly part of the Blue Coral Divers Clan, a clan that allowed both men and women to rule. The Blue Coral Divers Clan engaged in a feud with the Scissorfists Clan, another clan that was based near the sea. The two clans warred with each other for a number of years, before finally deciding to settle their differences through a diplomatic meeting. Sha was one of the Blue Coral Divers party sent to the meetings, where she met and fell in love with Vagan Kolvy, one of the representatives of the Scissorfists. When the peace talks ended badly, the two clans resumed their feud and both Sha and Kolvy were pressured by their respective clans to kill each other. When they refused, both of them were declared traitors and driven out by their clans. The two lovers settled on a site near the Dathomir Spaceport, well out of their former clan's hunting ranges. When Kolvy died in 38 ABY, Sha began hiring herself out as a tracker. When asked about Kolvy, she would say that he was dead and that she was going to kill whoever killed him.\nIn 43.5 ABY, Jedi Grand Master Luke Skywalker and his son Ben traveled to the planet Dathomir in search of Vestara Khai, a Sith apprentice. With them was a number of hired trackers and guides, one of which was Sha. The Jedi stayed in the company of the Raining Leaves Clan, a traditionalist Dathomir Witch clan, during their annual conclave with the Broken Columns Clan, a clan comprised of men. When the clans were attacked by the Nightsisters, who were against the planned merging of the two clans, Sha was one of the casualties when her throat was slashed. Ben, however, thought Sha was more than a random casualty. He theorized that one of the reasons Sha hired herself as a tracker was because she was searching for her missing daughter stolen by the Nightsisters around the same time they killed Kolvy. Ben started questioning the women of the Raining Leaves Clan who had daughters, and came to suspect that Aradasa Vurse, the supposed daughter of the Clan's chief trainer of scouts Halliava Vurse, was Tsu's missing child.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/43_ABY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Blue_Coral_Divers_Clan/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Dyon_Stadd",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Scissorfists_Clan",
  "/wiki/Vagan_Kolvy",
  "/wiki/Dathomir_Spaceport",
  "/wiki/38_ABY",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Planet/Legends",
  "/wiki/Vestara_Khai",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Raining_Leaves_Clan",
  "/wiki/Conclave_of_the_Raining_Leaves_Clan_and_the_Broken_Columns_Clan",
  "/wiki/Broken_Columns_Clan",
  "/wiki/Nightsisters/Legends",
  "/wiki/Aradasa_Vurse",
  "/wiki/Halliava_Vurse",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Everything_You_Always_Wanted_to_Know_about_the_Nightsisters_but_Were_Afraid_to_Ask",
  "/wiki/Star_Wars_Insider_122",
  "/wiki/Holocron_continuity_database",
  "/wiki/Leland_Chee",
  "/wiki/Dathomirian/Legends"
 ]
}