{
 "name": "Trista_Zel",
 "display_name": "Trista Zel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 20 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hapan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hapes Consortium"
     ]
    }
   ]
  }
 ],
 "content": "Trista Zel was an officer in Hapan Security in 41 ABY. Trista was five minutes older than her identical twin sister Taryn Zel and the first cousin of Queen Mother Tenel Ka Djo. She and her sister were almost identical in appearance to their cousin, Tenel Ka.\nTaryn and Trista were born to a male sibling of Isolder sometime around 20 ABY. When they reached adulthood, Taryn and Trista became officers in Hapan Security, and due to their close relations with Tenel Ka, were very useful operatives to her. Nobody knew of their close relationship to Tenel Ka, and they were given their own security team to help them out during missions.\nTrista and her sister were tasked by Tenel Ka and Prince Isolder to retrieve Ben Skywalker and return him to the Jedi base on Shedu Maad. However, on the way to meet up with Isolder at the rendezvous point, Isolder's ship came under attack by the Anakin Solo, and the prince was captured. The twins then took Ben directly to Tenel Ka to inform her of her father's capture.\nLater on, the twins and Ben Skywalker were assigned to defend Shedu Maad against an attack by the Anakin Solo. The pair were shocked to hear that a nanokiller had been released on the Dragon Queen, killing all those on board with royal blood, and refused to answer Ben's questions as to whether or not Tenel Ka and Allana were among the casualties. Shortly after, the twins and Ben uncovered a plot by General Livette to betray the Hapan crown by allying with the Remnant. Trista volunteered to stay behind and keep an eye on the traitor. She ordered Taryn and Ben to go after the Remnant troops and their leader, Tahiri Veila.\nAfterwards, during the Evacuation of Ossus, she helped evacuate the students and their families before an attack by the Lost Tribe of Sith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Trista_Zel",
  "/wiki/20_ABY/Legends",
  "/wiki/Hapan",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/Hapan_Security",
  "/wiki/41_ABY",
  "/wiki/Twin/Legends",
  "/wiki/Taryn_Zel",
  "/wiki/Queen_Mother",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Isolder",
  "/wiki/Prince/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Jedi/Legends",
  "/wiki/Shedu_Maad",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Nanovirus",
  "/wiki/Dragon_Queen",
  "/wiki/Allana_Solo",
  "/wiki/General/Legends",
  "/wiki/Livette",
  "/wiki/Imperial_Remnant",
  "/wiki/Tahiri_Veila",
  "/wiki/Evacuation_of_Ossus",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}