{
 "name": "Trix-sor",
 "display_name": "Trix-sor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sic-Six"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Trix-sor was a retired Sic-Six.\nTrix-sor worked as a \"fanger\" for an Imperial noble, injecting both the aristocrat and his friends with his natural \"poison\" which caused a state of delirium.\nA ryll addict with expensive tastes, Trix-sor eventually retired to Cloud City to live a life full of fine food, gambling, and constant celebration. He lived in a private suite at the H'gaard Park Towers hotel overlooking Figg Plaza and refused to become a citizen of Cloud City so that he could openly enjoy the city's casinos and gambling.\nTrix-sor lived off his fortune and was on good terms with his neighbors, many of whom were members of the Exex. He also had a great number of friends who stopped by for brief visits. Trix-sor was hired to be a spy on Cloud City by the minor Imperial noble Lord Spenz. Trix-sor reports on events and goings-on in Cloud City to Spenz, who hopes to use the information to increase his own power and influence.\nA polite being, Trix-sor was also sarcastic and found great joy in challenge of beating others in games of chance but was an exceptionally good sport. Trix-sor was fluent in nearly thirty languages but his own speech was high-pitched and peppered with squeaks and chirps.\nTrix-sor wore fine robes, and carried chemical vials and a small sack of ryll. He usually had 10,000 credits on his person.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sic-Six/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Fanging",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Ryll/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/H%27gaard_Park_Towers",
  "/wiki/Hotel/Legends",
  "/wiki/Figg_Plaza",
  "/wiki/Casino/Legends",
  "/wiki/Exex",
  "/wiki/Spy/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Spenz",
  "/wiki/Language/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)"
 ]
}