{
 "name": "Tryphon_Leo",
 "display_name": "Tryphon Leo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Sometime before the Typhojem Excavation",
      "Pashvi"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Volpai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corellian Merchants' Guild",
      "Mandroxan Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Tryphon Leo was a male Volpai who worked as a freelance smuggler during the reign of the Galactic Empire. After ingratiating himself at the castle of the former pirate Queen Maz Kanata, he managed to obtain a book that contained the locations of Kanata's treasure caches.\nLeo planned to use the wealth from the caches to establish a new smuggling network and take control of the Spice Triangle with a fleet of starships. After purchasing gear at an outfitter on Vergesso, he traveled to Pashvi in order to try and find the treasure vault Kanata had hidden in the Shrove of the Left-Handed God Typhojem. Leo was killed when a large rock fell and crushed him on the Grand Causeway during his search.\nTryphon Leo was a male Volpai smuggler who flew the starship Lessu Dancer during the reign of the Galactic Empire. During his freelance career he worked for half payment up front with no questions asked, smuggling everything from blasters to body parts. He gained membership of both the Corellian Merchants' Guild and the Mandroxan Cartel and on at least one occasion he flew through the Corkscrew in the Akkadese Maelstrom and scraped the hull of the Lessu Dancer on carbonbergs.\nLeo learned of a book that the former pirate Queen Maz Kanata owned which he suspected contained information that could help him shake up the entire criminal underworld. In order to obtain the book, which would eventually become known as the Smuggler's Guide, he became a regular at Kanata's castle on the planet Takodana where he traded favors with bartenders, bribed kitchen staff and generally made the entire establishment love him. This eventually drew Kanata's attention, and she eventually sat with him at one of the castle's tables with a drink he had bought her. Kanata ignored the drink and studied Leo before declaring that he would do, after which he managed to obtain the book.\nWith the information in the book—which included trade routes, shadowports, criminal contacts and the location of Kanata's hidden treasure caches—Leo planned to loot one of the caches and then use the wealth to set up his own trade network before setting out to find the rest of the treasures. The trade route Leo hoped to establish would involve him locking down trade throughout the Spice Triangle.\nThis would allow him to control all trade along the Death Wind Corridor and take fees from the most lucrative segments of the Triellus Trade Route and Corellian Run. In order to achieve this he believed he would need to purchase a fleet consisting of potentially twenty HWK-290 light freighters, fifty YT-series freighters and one hundred barges and then initially bribe the Hutt Cartel and Pyke Syndicate as well as the Imperial governor of Roon.\nBefore beginning his treasure hunt, Leo headed to an outfitter that Kanata had recommended on the asteroid Vergesso and spent most of savings on gear. He then decided to try and locate the treasure vault that Kanata had hidden in the Shrove of the Left-Handed God Typhojem on Pashvi, as it was the closest of the caches.\nBelieving he could load the entire cache onto his starship with a gravsled, Leo opted to work alone so that he would not have to split the take. Worried that the criminal Crimson Dawn syndicate would learn of the treasure, he kept quiet about his search for the vault while on Pashvi.\nLeo was then killed during his search, when a large boulder fell from the ceiling and crushed him approximately seventy meters along the Grand Causeway in front of a Typhojem Thrall. His remains were discovered during the Typhojem Excavation by senior terrain trekker Reginald Danfillo, who took Kanata's book from the smuggler's corpse and incorrectly identified Leo as a human in a report on the recovery of the book.\nTryphon Leo believed he was an accomplished smuggler who had earned the right to use the information in Kanata's book to shape the underworld to his needs and earn a huge fortune while doing so. He considered Kanata a \"dried-up fossil\" and believed she was more quirky than all-knowing, but was willing to flirt with her in order to steal the book. The smuggler was also greedy, believing anyone in the Outer Rim would be willing to take a bribe and choosing to work alone in order to earn more credits. A member of the Volpai species, Leo was a four-armed bipedal with blue skin.\nTryphon Leo was first mentioned in Star Wars: Smuggler's Guide, a 2018 reference book written by Daniel Wallace with illustrations of Leo by Studio Hive and Adrián Rodriguez.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Typhojem_Excavation",
  "/wiki/Pashvi",
  "/wiki/Volpai",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Corellian_Merchants%27_Guild",
  "/wiki/Mandroxan_Cartel",
  "/wiki/Smuggler",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Takodana_Castle",
  "/wiki/Pirate",
  "/wiki/Queen",
  "/wiki/Maz_Kanata",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Spice_Triangle",
  "/wiki/Starship",
  "/wiki/Vergesso",
  "/wiki/Shrove_of_the_Left-Handed_God_Typhojem",
  "/wiki/Death",
  "/wiki/Grand_Causeway",
  "/wiki/Lessu_Dancer",
  "/wiki/Blaster",
  "/wiki/The_Corkscrew_(Kessel_sector)",
  "/wiki/Akkadese_Maelstrom",
  "/wiki/Carbonberg",
  "/wiki/Book",
  "/wiki/Planet",
  "/wiki/Takodana",
  "/wiki/Hyperspace_route",
  "/wiki/Shadowport",
  "/wiki/Death_Wind_Corridor/Canon",
  "/wiki/Triellus_Trade_Route",
  "/wiki/Corellian_Run",
  "/wiki/HWK-290_light_freighter",
  "/wiki/YT-series",
  "/wiki/Freighter",
  "/wiki/Hutt_Cartel",
  "/wiki/Pyke_Syndicate",
  "/wiki/Unidentified_Imperial_governor_(Roon)",
  "/wiki/Roon",
  "/wiki/Asteroid",
  "/wiki/Hoversled",
  "/wiki/Crimson_Dawn",
  "/wiki/Meter",
  "/wiki/Typhojem",
  "/wiki/Senior_terrain_trekker",
  "/wiki/Reginald_Danfillo",
  "/wiki/Human",
  "/wiki/Credit",
  "/wiki/Species",
  "/wiki/Limb",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/2018",
  "/wiki/Daniel_Wallace",
  "/wiki/Studio_Hive",
  "/wiki/Adri%C3%A1n_Rodriguez",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor"
 ]
}