{
 "name": "TS-4068",
 "display_name": "TS-4068",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Blizzard Force",
      "Blizzard Force"
     ]
    }
   ]
  }
 ],
 "content": "TS-4068 was the designation of a human male who served in the Imperial Army during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic. By the time of the Battle of Hoth, TS-4068 served within the 501st Legion's Blizzard Force with the military rank of captain and participated in the Hoth campaign. There, he led his forces in an infantry ground assault on the base after deploying from the AT-ATs.\nDuring the Galactic Civil War, the snowtrooper designated TS-4068 served in the Galactic Empire's army, holding the rank of captain. In 3 ABY, he joined the Empire's Blizzard Force in a ground assault on Echo Base, the Rebel Alliance's secret base on the ice planet Hoth. TS-4068 led a squad of snowtroopers which was stationed aboard the AT-AT walker Blizzard 1, the personal walker of General Maximilian Veers, who led the ground assault.\nAs Blizzard 1 approached Echo Base's deflector shield generator, Veers called TS-4068 over to the command center of the walker. The snowtrooper joined Veers shortly after, silently awaiting his orders. The general ordered for all snowtroopers aboard Blizzard 1 to disembark from the walker, and TS-4068 hastily returned to his troops, who soon deployed onto the ground to assault the enemy rebel ground forces.\nThe stormtrooper that would later be known as TS-4068 first appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back, directed by Irvin Kershner. He was played by an uncredited extra. TS-4068 was later identified in the short story \"The Truest Duty,\" written by Christie Golden as a part of the 2020 short story collection From a Certain Point of View: The Empire Strikes Back.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Blizzard_Force",
  "/wiki/The_Truest_Duty",
  "/wiki/Imperial_Army",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Time",
  "/wiki/Battle_of_Hoth",
  "/wiki/501st_Legion",
  "/wiki/Military_rank",
  "/wiki/Captain",
  "/wiki/Hoth",
  "/wiki/Infantry",
  "/wiki/All_Terrain_Armored_Transport_(Galactic_Civil_War)",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Cold_weather_assault_stormtrooper",
  "/wiki/Operating_number",
  "/wiki/3_ABY",
  "/wiki/Echo_Base",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Stormtrooper",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Blizzard_1",
  "/wiki/Walker",
  "/wiki/General",
  "/wiki/Maximilian_Veers",
  "/wiki/Deflector_shield_generator",
  "/wiki/1980",
  "/wiki/Irvin_Kershner",
  "/wiki/Christie_Golden",
  "/wiki/2020",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}