{
 "name": "Tseebo",
 "display_name": "Tseebo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    },
    {
     "name": "Born",
     "values": [
      "42 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "AJ^6 cyborg construct"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Information Office",
      "Imperial Information Office"
     ]
    }
   ]
  }
 ],
 "content": "Tseebo was a male Rodian who worked for the Imperial Information Office on Lothal. He was outfitted with an AJ^6 cyborg construct containing information vital to the Galactic Empire, including a five year plan for the Outer Rim Territories. About four years before the Battle of Yavin, Tseebo went missing; prompting an Imperial manhunt that involved the Imperial Security Bureau Agent Kallus and the Jedi hunter known as the Grand Inquisitor. Tseebo was eventually found by Ezra Bridger, whose parents Tseebo had known, and the rebels, who rescued him from the Empire and arranged for him to go into hiding.\nTseebo was a close friend of Ezra Bridger's parents, Ephraim and Mira. However, he was concerned that their anti-Imperial activities would endanger their son's safety. Tseebo tried to warn Ephraim and Mira but the couple insisting on standing up for what they believed in. When the Galactic Empire arrested Ephraim and Mira, Tseebo did nothing to stop them. Their son Ezra was forced to eke out a living in the streets of Lothal's Capital City. Burdened by guilt, Tseebo went to work for the Imperial Information Office. In an attempt to find out what had happened to Ephraim and Mira, he volunteered to be implanted with an AJ^6 cyborg construct.\nBy the time of the Empire's fifteenth anniversary, Tseebo, at the age of 38, was carrying highly classified Imperial information including the schematics for new TIE fighters and walkers, schedules for stormtrooper tactics and strategies, and a five year plan for Lothal and every other world in the Outer Rim. He fled from the Imperial authorities and attempted to get the information off Lothal. Due to the highly sensitive nature of Tseebo's information, the Empire launched a planetwide manhunt in order to prevent Tseebo from falling into the hands of the rebellion.\nWith nowhere else to go, Tseebo went into hiding in the former Bridger household. Later that night, he was found by Ezra, Kanan Jarrus, and Sabine Wren; who were members of a rebel group known as the Spectres. Due to his resentment towards Tseebo for not helping his parents, Ezra refused to help him. However, Kanan and Sabine disagreed and decided to rescue Tseebo due to the valuable intelligence he was carrying. The rebels managed to hijack an Imperial Troop Transport, outrun their Imperial pursuers, and reach Capital City's outskirts. There, they were airlifted to safety by their rebel comrades aboard the Ghost; a modified VCX-100 light freighter which had become the Spectres' main base of operations.\nAs the Ghost headed into space, Tseebo regained his senses and quickly recognized Ezra. Before he could speak to the boy, the Ghost came under fire from several TIE fighters led by the Grand Inquisitor, the ship's captain Hera Syndulla called for Sabine to take the nose gun. When Sabine took an interest in Tseebo's knowledge of Ezra's parents, a resentful Ezra insisted that they were dead. After Sabine had left the room, Ezra questioned Tseebo about his parents' fate. Tseebo could only recount the day they were captured but could not ascertain their current whereabouts. He then lamented his failure to save the Bridgers. This only upset Ezra who refused to forgive Tseebo.\nTseebo managed to help the rebels escape the Empire by transmitting hyperspace coordinates into the Ghost's hyperdrive. As the crew took a moment to catch their breath, Tseebo returned to his unresponsive state. As Ezra and the other rebels debate what to do about Tseebo, the Rodian suddenly projected a hologram revealing that the Imperials had managed to attach a tracking device to the Ghost. The ship's astromech droid Chopper then performed a scan which confirmed that the said tracking device was on the hull of the Phantom.\nWhile Kanan and Ezra took the Phantom to Fort Anaxes to lure the Grand Inquisitor away from the Ghost, Tseebo remained on the Ghost. Hera had contacted the mysterious rebel leader known as Fulcrum and arranged for Tseebo to go into hiding. During the journey, Tseebo later heard Ezra calling out to him through the Force; forgiving the Rodian for not standing by his parents. Though he could not respond back the same way, Tseebo expressed relief that he had been forgiven. As the Ghost rendezvoused with Fulcrum's CR90 corvette, Tseebo told Hera that he knew about the fate of Ezra's parents. Before parting, Hera promised to share this information with Ezra when the time was right.\nSeveral months later, Tseebo's information proved useful when Ezra experienced a Force vision of his parents. Hera then revealed that Ezra's parents had been imprisoned within a vast network of Imperial prisons throughout the galaxy. Together with his master Kanan, Ezra then traveled back to the planet Lothal. There, they encountered Ryder Azadi, the former Governor of Lothal and a friend of the Bridgers. He revealed that Ephraim and Mira had been so inspired by their son's involvement in the rebellion that they had staged an escape attempt but were killed. Despite the loss of his parents, Ezra was able to make peace with his past and move on.\nYears after Tseebo was spirited away by the Spectres, the incident was still fresh in the Imperials' minds. When Everi Chalis, the governor of Haidoral Prime, defected to the Alliance to Restore the Republic, she feared that the Imperial Ruling Council would hunt her down, stating that the Empire could not have another Tseebo.\nAs a Rodian, Tseebo had a humanoid form with large round eyes and a slender snout. He had yellow skin and green eyes. He also wore an AJ^6 cyborg construct which allowed him to store a vast amount of sensitive Imperial information. While Tseebo was a good friend of Ezra Bridger's parents Ephraim and Mira, he lacked the same courage and fortitude to challenge the Galactic Empire. Out of guilt of having failed to stand by them and to protect Ezra, Tseebo joined the Imperial Information Office and volunteered to be implanted with a cybernetic implant in order to find the Bridgers and to aid the rebellion against the Empire. While the cyborg implant enabled him to interact easily with technology, the sheer amount of information made him unfocused and confused.\nTseebo first appeared as a secondary character in the Star Wars Rebels episodes \"Empire Day\" and \"Gathering Forces,\" which premiered on November 10 and November 17 2014 respectively. He was voiced by Peter MacNicol in both episodes. He also appeared in Michael Kogge's Ezra's Duel with Danger, a chapter book which consisted of elements from the Rebels episodes \"Empire Day,\" \"Gathering Forces,\" and \"Path of the Jedi.\" He was later referenced in Alexander Freed's 2015 novel Battlefront: Twilight Company.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Teebo",
  "/wiki/Ewok",
  "/wiki/Lothal",
  "/wiki/42_BBY",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/AJ%5E6_cyborg_construct",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Information_Office",
  "/wiki/Standard_year",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Battle_of_Yavin",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Jedi",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Ezra_Bridger",
  "/wiki/Spectres",
  "/wiki/Ephraim_Bridger",
  "/wiki/Mira_Bridger",
  "/wiki/Capital_City",
  "/wiki/Empire_Day",
  "/wiki/TIE_line",
  "/wiki/Walker",
  "/wiki/Stormtrooper",
  "/wiki/Bridger_household",
  "/wiki/Kanan_Jarrus",
  "/wiki/Sabine_Wren",
  "/wiki/K79-S80_Imperial_Troop_Transport",
  "/wiki/Ghost",
  "/wiki/VCX-100_light_freighter",
  "/wiki/Captain",
  "/wiki/Hera_Syndulla",
  "/wiki/Hyperspace",
  "/wiki/Hyperdrive",
  "/wiki/Hologram",
  "/wiki/XX-23_S-thread_tracker",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Phantom",
  "/wiki/Fort_Anaxes",
  "/wiki/Ahsoka_Tano",
  "/wiki/The_Force",
  "/wiki/CR90_corvette",
  "/wiki/Force_vision",
  "/wiki/Ryder_Azadi",
  "/wiki/Governor",
  "/wiki/Revolt_in_an_Imperial_prison",
  "/wiki/Everi_Chalis",
  "/wiki/Haidoral_Prime",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Eye",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Empire_Day_(episode)",
  "/wiki/Gathering_Forces",
  "/wiki/November_10",
  "/wiki/November_17",
  "/wiki/2014",
  "/wiki/Peter_MacNicol",
  "/wiki/Michael_Kogge",
  "/wiki/Ezra%27s_Duel_with_Danger",
  "/wiki/Path_of_the_Jedi",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Star_Wars_Rebels_(webcomic)",
  "/wiki/Path_of_the_Jedi:_A_Star_Wars_Rebels_Cinestory_Comic",
  "/wiki/Battle_to_the_End",
  "/wiki/Fire_Across_the_Galaxy",
  "/wiki/Legacy_(episode)",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Rebels,_Animated",
  "/wiki/Star_Wars_Insider_155",
  "/wiki/Sabine_My_Rebel_Sketchbook",
  "/wiki/Star_Wars_Rebels_Recounted",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/Star_Wars_Rebels:_Rebel_Power!",
  "/wiki/Star_Wars_Rebels:_Visual_Guide:_Epic_Battles",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_57",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/BB-8_and_Other_Astromech_Droids",
  "/wiki/Databank_(website)"
 ]
}