{
 "name": "Tsubaki",
 "display_name": "Tsubaki",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Sith"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "His Jedi Master",
      "Masago"
     ]
    }
   ]
  }
 ],
 "content": "Tsubaki a Force-sensitive human male, was a Jedi Knight that fell to the dark side of the Force and became a Sith apprentice. His master was the Sith Lord Masago.\nBefore his fall to the dark side of the Force, Tsubaki was a Jedi, and worked for a king at his royal palace. There, he met Princess Misa, with whom he developed a close friendship, later turned into forbidden love. Five years before his fall, Tsubaki helped Misa fend off an attack by the Orochi.\nUpon hearing about the king's death at the hands of Masago, who was the sister of the monarch, Tsubaki sought the counsel of a close elderly figure, who believed it was unwise for Tsubaki to confront the Sith Lord, as he would likely succumb to the dark side. At the time, the Jedi had repeatedly seen visions of his future self slaying Misa, although then it was not clear to him who was being struck, or whether the visions he had were actually premonitions. Not believing this to be his true destiny, Tsubaki ignored the advice he was given, and set his course for the royal palace to confront Masago.\nOn the way, he was attacked by Mushas and, upon experiencing traumatic flashbacks, he was knocked unconscious. Tsubaki was saved by the now-exiled Princess Misa and local guides Senshu and Kamahachi. Tsubaki and Misa decided to make way for the palace together, being aided by the two hired locals. Their goal was to recapture the kingdom from Masago.\nIn order to avoid checkpoints Masago had set up, taking dangerous alternative routes through mountains, a desert, a body of water, a roadblock, a forest and a village. At the feared stretch of mountain pass known as the Place of the Gods, Kamahachi went missing. Tsubaki rescued him and later regrouped with Misa and Senshu at a nearby village.\nReaching the palace, they neutralized the guards and infiltrated the residence. Masago then fought Tsubaki, and tempted him to join the dark side. During the fight, Tsubaki accidentally struck down Misa, and, in exchange for saving her life, accepted Masago's offer to become her Sith apprentice and they use the Force healing to heal Misa.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Sith",
  "/wiki/Masago",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Knight",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sith_apprentice",
  "/wiki/Sith_Lord",
  "/wiki/Jedi",
  "/wiki/Prince",
  "/wiki/Misa",
  "/wiki/Orochi",
  "/wiki/Musha",
  "/wiki/Exile_(punishment)",
  "/wiki/Senshu",
  "/wiki/Kamahachi",
  "/wiki/Place_of_the_Gods",
  "/wiki/Force_healing",
  "/wiki/Category:Images_of_Tsubaki",
  "/wiki/Akakiri",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/July_14",
  "/wiki/2021"
 ]
}