{
 "name": "Tsuulo",
 "display_name": "Tsuulo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "13 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "White Worms"
     ]
    }
   ]
  }
 ],
 "content": "Tsuulo was a Rodian male from Coruscant who became a scrumrat in the White Worms of Corellia.\nTsuulo was a Rodian male who hailed from the metropolis world of Coruscant during the waning years of the Galactic Empire. He was born into a rich family, along with his older brother, Reezo. As a boy, he insisted on receiving an education, studying the ways of technology and engineering. Once, he met a bearded, seemingly homeless man on the street, who was handing out pamphlets to a museum that studied an ancient religion known as the Force.\nHe read excerpts of a manuscript entitled Annals of Light and Being. One day, the Empire discovered the museum and shut it down. Nobody was able to answer any of Tsuulo's questions about the Force, though he held onto the belief that it was real. When he and his brother were still children, their parents took them with them on a business trip to Corellia, where they were hit by a speeder driven by an enraged Besalisk who had just lost his job.\nBecause Reezo was old enough to look after his brother, Tsuulo was left in his care, along with a small inheritance left by their parents. Reezo began spending all of their money acquiring parts to a speeder, which he was using to enter the illegal profession of street racing. He believed that he could easily double their fortune, but instead, he crashed the speeder. Tsuulo was infuriated when he found out, and though Reezo seemed apologetic, he continued racing. Having enough of this, Tsuulo left his brother, certain that he could do better on his own.\nTsuulo became a scrumrat for a small gang known as the White Worms, run by Lady Proxima. He was one of the oldest scrumrats there, hence putting him in the running for the position of Head, along with Han, Qi'ra, and Rebolt. The four of them were all in competition, though it was fairly obvious the position would either go to Han or Qi'ra. When the two of them were both sent out on the same mission, that was made undoubtedly certain.\nDuring his sleep the same morning, Tsuulo received a message from Han via a ratcatcher droid, asking for his help and to bring food to Old Man Powlo's cave. He did, and Han, who was with Qi'ra, explained that they were on the run from Proxima, that they had a Datacube which a lot of people seemed to be after, and that they needed his help decrypting it. He did just that, thus learning that it contained plans for a secret Imperial portable shield generator.\nThey were pursued through the sewers by Rebolt and his hounds, managing to escape and mugging Reezo of his speeder in order to make it to Qi'ra's safe house, located in the Silo. They made a plan to find Han's friend, TD-H4, who worked for the Droid Gotra. TD, otherwise known as Tool was a pile of scrap in the basement of the Foundry. Tsuulo used his datapad to help repair the droid so that he could give them information on the cube.\nThey then decided they would give it back to its creator, a woman called \"The Engineer\" for a second bidding. While trying to escape the Foundry, they were pursued by stormtroopers, who turned out to be working for The Engineer. They gave them a contact, which they used to speak with The Engineer. She told them that she would have a shuttle awaiting them to bring them to her yacht, but first, she wanted them to rescue a captured asset of hers from Imperial custody.\nThey rescued the Wookiee known as Kirroo and brought him back to The Engineer. Barely escaping the Empire, they were taken back to her yacht, the Red Nimbus. They returned the cube back to its owner, and from there, they devised a plan to revise the bid, and allow the trio to rejoin with the White Worms when all was done. They spoke with Lady Proxima, who agreed to the terms, and helped set up the auction for a fee of six-tenth one one percent the winning bid.\nThe winners were the Kaldana Syndicate, who brought a ship up to the Red Nimbus in order to make the exchange. They were also to give Han, Qi'ra, and Tsuulo a ride back to Corellia, however, The Engineer warned Qi'ra that once the exchange was made, the Kaldana were going to try to kill them, and that they needed to find a way to escape. She relayed the message to her friends, and when the gangsters pulled weapons on them, they made a break for an escape pod. Tsuulo was unfortunately shot in the back while they attempted their getaway. However, using his datapad, Han and Qi'ra were still able to make their escape.\nTsuulo's body was obliterated, along with the rest of the Kaldana syndicate by the Red Nimbus, as The Engineer has apparently been hired by the Droid Gotra to destroy the Kaldana once they received the data cube.\nAs thanks for helping repair Tool, the Droid Gotra wanted to present Tsuulo with his own speeder, however, with him gone, it was given to Han and Qi'ra, who gave it to Reezo as a replacement for the one they'd stolen.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Coruscant",
  "/wiki/13_BBY",
  "/wiki/Corellia",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/White_Worms",
  "/wiki/Scrumrat",
  "/wiki/Galactic_Empire",
  "/wiki/Reezo",
  "/wiki/Museum",
  "/wiki/The_Force",
  "/wiki/Annals_of_Light_and_Being",
  "/wiki/Speeder",
  "/wiki/Besalisk",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/Head",
  "/wiki/Han_Solo",
  "/wiki/Qi%27ra",
  "/wiki/Rebolt",
  "/wiki/Ratcatcher_droid",
  "/wiki/Powlo",
  "/wiki/Data_cube",
  "/wiki/Deflector_shield_generator",
  "/wiki/Dog",
  "/wiki/Qi%27ra%27s_safe_house",
  "/wiki/Silo",
  "/wiki/TD-H4",
  "/wiki/Droid_Gotra",
  "/wiki/Datapad",
  "/wiki/Jenra",
  "/wiki/Stormtrooper",
  "/wiki/Yacht",
  "/wiki/Wookiee",
  "/wiki/Kirroo",
  "/wiki/Red_Nimbus",
  "/wiki/Kaldana_Syndicate",
  "/wiki/Most_Wanted",
  "/wiki/Most_Wanted_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)"
 ]
}