{
 "name": "Tsyr",
 "display_name": "Tsyr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kintan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "28 BBY",
      "Kintan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kajain'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Morgukai",
      "Kh'aris Fenn"
     ]
    }
   ]
  }
 ],
 "content": "Tsyr was a male Morgukai Kajain'sa'Nikto from the planet Kintan. He had a very close bond with his Morgukai son Bok. The two's appearances were exactly the same except that Tsyr had three big scars on his face which he gained in a duel with Ma'kis'shaalas.\nIn 30 BBY, Tsyr and his son were employed by Kh'aris Fenn and they were ordered to kidnap the son of Lon Secura: Nat Secura. All went smooth when they arrived in the boy's chamber, but suddenly a 'Jeedai' entered the room and Tsyr took his attack position. His cortosis staff helped him to defeat the Jedi, who turned out to be Jedi Master Tholme. Just when Tsyr wanted to finish off the Jedi, the Nikto were outnumbered by Secura's guards and fled with the boy.\nIn Vilmarh Grahrk's ship the Inferno, Tsyr found a stowaway. This man was Tholme who followed the Nikto into the ship. He surrendered, was imprisoned and tortured by AX/RX in Kh'aris' fortress on Kintan.\nAccording to the way of the Morgukai, Tsyr was challenged by Bok and the winner could have the trophy, Tholme's lightsaber. Tsyr won. Kh'aris had to go to Ryloth for some business and Tsyr and his son were left on Kintan ordered to guard the prisoners and counter the enemy Jedi . Soon the Jedi arrived and were welcomed by Bok in his starfighter, but he was taken down by Aayla's impressive flying skills.\nTsyr and Bok chased the Jedi in the Endless Wastes, overtook them and buried themselves to ambush the unsuspecting Jedi. When the Jedi had to cross a lava river, the Jedi Knight went first. Aayla, the Padawan was next but when she wanted to jump, Bok grabbed her by her legs. Now it was two Morgukai versus one Jedi Padawan. But Tsyr and Bok underestimated the Jedi and she Force Jumped over the river with Bok following her. Tsyr was very angry about his son's disobedience and tried to blast the Jedi Padawan, but he hit his own son and the Jedi escaped. Bok was alone now in midst of hot swirling lava, wounded and unable to jump to the other side.\nTsyr himself returned to the fortress to await the Jedi. There he faced the older male Jedi Knight, the Padawan went looking for the prisoners. Meanwhile Bok returned and fought alongside his proud father against the Jedi. But then, the Jedi used his Force powers to retrieve Tsyr's trophy and in his surprise, Tsyr's head was sliced off.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kintan/Legends",
  "/wiki/28_BBY/Legends",
  "/wiki/Kajain%27sa%27Nikto/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Morgukai",
  "/wiki/Kh%27aris_Fenn",
  "/wiki/Star_Wars:_Republic:_Rite_of_Passage",
  "/wiki/Bok_(Nikto)",
  "/wiki/Ma%27kis%27shaalas/Legends",
  "/wiki/30_BBY/Legends",
  "/wiki/Lon_Secura",
  "/wiki/Nat_Secura",
  "/wiki/Jedi/Legends",
  "/wiki/Cortosis_staff/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tholme/Legends",
  "/wiki/Vilmarh_Grahrk",
  "/wiki/Inferno_(Vilmarh_Grahrk)",
  "/wiki/AX/RX",
  "/wiki/Lightsaber/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Wannschok",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Force_Jump",
  "/wiki/Force_power/Legends",
  "/wiki/Star_Wars_(1998)_42",
  "/wiki/Star_Wars_(1998)_43",
  "/wiki/Star_Wars_(1998)_44",
  "/wiki/Star_Wars_(1998)_45",
  "/wiki/Star_Wars:_Republic:_Siege_of_Saleucami",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}