{
 "name": "Tu-Wane_Jipps",
 "display_name": "Tu-Wane Jipps",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Volpai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Reddish-brown and light brown"
     ]
    }
   ]
  }
 ],
 "content": "Tu-Wane Jipps was a Volpai musician who was a gambling partner of the criminal Tobias Beckett. He came to owe Beckett a favor after some nasty business on Malkii and also fell into debt with the Hutts. Jipps ended up captured by the group known as the Winds of Ruin and was forced to play music for them until he was rescued by Beckett and his crew. After escaping from the Winds of Ruin, Jipps played a valachord for Beckett and his companions.\nThe male Volpai Tu-Wane Jipps was a musician who came to be a gambling partner of Tobias Beckett, a criminal who lead his own gang consisting of his partner Val and the pilot Rio Durant. After some nasty business on Malkii, Jipps came to owe a large favor to Beckett. He also became heavily indebted to the Hutts. At some point prior to Beckett's death in 10 BBY, Jipps was captured by the criminal group known as the Winds of Ruin, who made him perform music for them at their base.\nSome time after Jipps and Beckett had last crossed paths, Beckett overheard members of the Winds of Ruin in a cantina discussing the fact that they had Jipps and purposefully started a fight with them in order to be captured and taken to the location where Jipps was being kept. Unaware that Beckett hoped to free Jipps, Val then broke Beckett out of the jail and agreed to help him recover a \"shipment\" stolen by the Winds of Ruin. Beckett then led her to a room where the musician was playing a red ball jett organ for a group of Winds of Ruin members as they gambled.\nVal and Beckett defeated the thugs and Beckett reminded Jipps of the debt he was owed, also threatening to contact the Hutts if Jipps did not cooperate. Val then engaged more thugs outside the room before the trio took a turbolift to the building's penthouse. Val berated Beckett in the lift for his choice to extract Jipps, who tried to avoid interrupting the argument but eventually pointed out that there was a second lift led to the penthouse as more thugs exited from it. Before the thugs could attack, one of the penthouse's walls was destroyed, revealing Durant in the open bay door of a starship.\nJipps, Val, and Beckett then quickly boarded the vessel and made their escape. The group then travelled to an area of plains, where Beckett revealed that he had rescued Jipps so that the musician could play a valachord for Val. Durant, Beckett, and Val then sat with drinks on blankets around a campfire and listened to the musician play. As they enjoyed their drinks, Beckett mused to Val that they could still turn Jipps over to the Hutts for 15,000 credits.\nJipps belonged to a four-limbed bipedal species and had reddish-brown and light brown skin. He also had four eyes.\nVal described Jipps' musical ability with the valachord as fantastic.\nJipps played a red ball jet organ at the Winds of Ruin base and carried a valachord in a black case with him as he made his escape. The musician wore a white and brown tunic with blue pants and brown boots.\nTu-Wane Jipps appeared in the comic story \"Tales of Villainy: Credits\", which was published in Star Wars Adventures  4 on March 24, 2021. The story was written by Jordan Clark and illustrated by Yael Nathan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Volpai",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Musician",
  "/wiki/Gambling",
  "/wiki/Tobias_Beckett",
  "/wiki/Malkii",
  "/wiki/Hutt",
  "/wiki/Winds_of_Ruin",
  "/wiki/Music",
  "/wiki/Beckett%27s_gang",
  "/wiki/Valachord",
  "/wiki/Val",
  "/wiki/Pilot",
  "/wiki/Rio_Durant",
  "/wiki/Death",
  "/wiki/10_BBY",
  "/wiki/Time",
  "/wiki/Cantina",
  "/wiki/Red_ball_jett_organ",
  "/wiki/Turbolift",
  "/wiki/Starship",
  "/wiki/Credit",
  "/wiki/Limb",
  "/wiki/Species",
  "/wiki/Eye",
  "/wiki/Boot",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tales_of_Villainy:_Credits",
  "/wiki/Star_Wars_Adventures_(2020)_4",
  "/wiki/March_24",
  "/wiki/2021",
  "/wiki/Jordan_Clark",
  "/wiki/Yael_Nathan",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Category:Images_of_Tu-Wane_Jipps",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Savareen",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}