{
 "name": "Tu_Shoolb",
 "display_name": "Tu Shoolb",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong empire",
      "Domain Shoolb",
      "Domain Shoolb"
     ]
    }
   ]
  }
 ],
 "content": "The Yuuzhan Vong male Tu Shoolb served the Yuuzhan Vong empire as an intendant of the Domain Shoolb. He assisted Prefect Da'Gara aboard the latter's worldship during the Yuuzhan Vong invasion of the galaxy. During the worldship's voyage to the planet of Helska IV, he suggested not to accelerate in speed to Da'Gara, as an asteroid—which Gara's worldship was posing as—would not accelerate so \"obviously.\" However, his prefect refused to comply in anticipation for his arrival.\nA male Yuuzhan Vong, Tu Shoolb was a member of his species' empire and its Domain Shoolb family, who assisted the Vong invasion of the galaxy under Prefect Da'Gara aboard the prefect's worldship. In 25 ABY, Gara ordered Shoolb to accelerate the worldship, and the latter alerted the prefect that changing the worldship's speed could alert observers—members of the Extragalactic Society organization focused on searching for extra–galactic life—as natural bodies would not accelerate so obviously, which would prompt them to study the ship.\nThe prefect inquired his underling if he thought that the Vong agent Yomin Carr had not killed them as he had been commanded to do, prompting an apology from Shoolb using the Belek tiu Yuuzhan Vong phrase. The Domain Shoolb member then accelerated the worldship with its dovin basals, which propelled it, under Gara's directive. Although he reconsidered his order, Gara did not belay it, as he was anxious to arrive at their destination, the planet Helska IV.\nTu Shoolb was considered cunning and resourceful by Prefect Gara.\nTu Shoolb appeared in the 1999 novel The New Jedi Order: Vector Prime, written by R. A. Salvatore, the first volume in the Star Wars: The New Jedi Order novel series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Yuuzhan_Vong_empire",
  "/wiki/Domain_Shoolb",
  "/wiki/Prefect_(Yuuzhan_Vong_rank)",
  "/wiki/Da%27Gara",
  "/wiki/Da%27Gara%27s_worldship",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/Koros-Strohna",
  "/wiki/Planet/Legends",
  "/wiki/Helska_IV",
  "/wiki/Asteroid/Legends",
  "/wiki/Species/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/ExGal-4",
  "/wiki/Extragalactic_Society",
  "/wiki/Yomin_Carr",
  "/wiki/Death/Legends",
  "/wiki/Yuuzhan_Vong_(language)",
  "/wiki/Dovin_basal",
  "/wiki/1999",
  "/wiki/The_New_Jedi_Order:_Vector_Prime",
  "/wiki/R._A._Salvatore",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/The_New_Jedi_Order:_Vector_Prime_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}