{
 "name": "Tulagn",
 "display_name": "Tulagn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Wroona"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Starship Outfitters"
     ]
    }
   ]
  }
 ],
 "content": "Tulagn was a grizzled male Rodian, living on Wroona. The owner of Tulagn's Starship Outfitters, Tulagn was a shrewd entrepreneur, loyal to his Wroonan contacts but ready and willing to rip off offworlders. He often wore a dirt-smeared \"Starship Outfitters\" apron.\nTulagn's outfitters was a legitimate business that he ran moderately successfully. Stacked with shelves of spacer supplies, a couple of tough guards watch over the main entrance on one of Wroona's major boulevards. However, this business serves as a front for Tulagn's other work, dealing in stolen goods and contraband. Tulagn keeps this quite separate from his main business in the sealed-off rear section of the shop, accessible only from another entrance.\nProspective suppliers followed an established procedure. A number of cheap trinkets and junk—Wroonian sand glasses, Gamorrean amulets, rocks from Alderaan—were kept in the front of the shop. Upon attempting to purchase one of these items, Tulagn would indicate that it was the last one, but if more were wanted, to come back later. If this option was accepted, Tulagn would instruct the smuggler to return that night—not to the front, but to the rear of the shop. All shady dealings commenced there.\nTulagn was known to do some business with the smuggler Platt Okeefe. On one occasion he agreed to supply her with a small crate of Gruvian Tovash. Trying to rip her off, he tried to sell her an inferior brew from Chandrila. Okeefe refused and demanded the original deal of 500 credits, which she got with the concession of a small favor next time in port.\nAt a later point, Tulagn also sold munitions to Black Curs members Dirk Harkness, Jai Raventhorn, Starter, Okeefe, and Tru'eb Cholakk.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wroona/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Starship_Outfitters",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Gruvia",
  "/wiki/Gruvian_Tovash",
  "/wiki/Chandrila/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Black_Curs",
  "/wiki/Dirk_Harkness",
  "/wiki/Jai_Raventhorn",
  "/wiki/Starter",
  "/wiki/Tru%27eb_Cholakk",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Explosive_Developments",
  "/wiki/Star_Wars_Adventure_Journal_3",
  "/wiki/Platt%27s_Smugglers_Guide"
 ]
}