{
 "name": "Tull_Raine",
 "display_name": "Tull Raine",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Barabel"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "Tull Raine was a pit-fighting Barabel shock boxer. He held the Outer Rim Title for many years during the Age of the Galactic Empire and into the New Republic. He did most of his fighting in the Dool Arena of the The Broken Tusk on Reuss VIII.\nAn absolute monster of a Barabel, Tull Raine had been fighting in the Outer Rim for years and showed no signs of stopping or slowing down. Of all the other fighters in the Dool Arena, Tull held the ominous distinction of killing the most opponents.\nIt should be noted that he was not unbeatable, however. Other top contenders in the Dool Arena had beaten Tull in matches before. However, his reign remained uncontested and unblemished as he hadn't lost a fight since winning the title. His professional record was 344-19, but he had a record of 83-0 since winning the title.\nTull's personality was the same as his fighting style: blunt, aggressive, and punishing. He was not much of a conversationalist and any argument he had quickly devolved into a fight. He was a bit of a showman, turning his shock boxing gloves up to the max and performing a quick shadowboxing routine that sent blue sparks arcing through the air until he pounded his fists together in in a thunderous explosion of blue energy.\nEnormous natural strength combined with tremendous skill in boxing resulted in a supreme combatant that earned his title with every fight. He was also very intimidating when he wanted to be, knowing just how to glower and growl to make even the staunchest enemy cower.\nHe wore custom-made shock boxing armor and used a pair of custom shockboxing gloves that allowed him to dial the energy delivered up or down as required.\nTull Raine was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Barabel/Legends",
  "/wiki/The_Broken_Tusk_(Reuss_VIII)",
  "/wiki/Shockboxing/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Dool_Arena",
  "/wiki/Reuss_VIII",
  "/wiki/Armor/Legends",
  "/wiki/Shockmitt",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Fists_of_Ion",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Galaxy_at_War",
  "/wiki/Sports_in_the_Star_Wars_Galaxy"
 ]
}