{
 "name": "Tup_Tup_Grizbain",
 "display_name": "Tup Tup Grizbain",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gungan society"
     ]
    }
   ]
  }
 ],
 "content": "Tup Tup Grizbain was a male Gungan bongo racer alive during the build up to the Clone Wars on the planet Naboo.\nTup Tup was one of a large number of Gungans who raced during bongo racing's rise in popularity after the Battle of Naboo due to off-worlder tourist interest. Early in his career, he supported his fellow racer Zak Quiglee's attempt, along with Friggy Squig, to get their reckless competitors, Neb Neb Goodrow and Spleed Nukkels, banned from the sport. This was based on accusations of collusion, greatly endangering the lives of others and giving the sport a bad name with their reckless driving. However, their charges were thrown out by the Gungan race commissioner and never reached the Gungan High Council.\nSometime after the battle of Naboo, he took part in the Otoh Gunga challenge, where he drove a monobubble bongo, along with a large number of contestants, including Grizbain, Quiglee, Goodrow, Nukkels and veteran racer Brooboo Seep, along with twenty six other vessels, including the Opee Fleer. The race had a large number of spectators including, Boss Rugor Nass and the Ithorian ambassador, as well as large number of tourists and Gungans. Once the race began, the Opee Fleer took the lead with, Tup Tup, Friggy and Zak close behind it, in their respective vessels. However, Spleed, Neb Neb and Brooboo quickly caught up to the Opee Fleer, much to Tup Tup, Friggy and Zak's annoyance. In an attempt to stop Nukkels overtaking the trio, Friggy Squig performed a 'twisty', rolling his bongo to prevent her passing. This, however, led to Squig ramming his bongo into Nukkels' fins, causing her to crash. Angered by the humiliation of their friend, Grizbain and Quiglee then began working together to block Goodrow and Nukkels, but the former managed to slip pass and take the lead of the race, catching the Opee Fleer in his wake. The large vessel was slowed by the faster ship, and in his over eagerness to catch up to Neb Neb, Tup Tup accelerated straight into the side of the Opee Fleer, destroying both bongos.\nTub Tub was forced to eject from his ship and floated to the surface of lake Paonga. Brooboo Seep went on to win the race, after Zak Quiglee crashed and disappeared because of Neb Neb and Spleed colliding, while trying to overtake Brooboo.\nTup Tup was a fairly skilled Bongo racer, but was over eager and driven by his dislike of Goodrow and Nukkels, as shown by his crash with the Opee Fleer during the race, whilst trying to catch Goodrow.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gungan_society",
  "/wiki/Bongo",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Zak_Quiglee",
  "/wiki/Friggy_Squig",
  "/wiki/Neb_Neb_Goodrow",
  "/wiki/Spleed_Nukkels",
  "/wiki/Gungan_High_Council/Legends",
  "/wiki/Monobubble_bongo",
  "/wiki/Brooboo_Seep",
  "/wiki/Opee_Fleer",
  "/wiki/Rugor_Nass/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Lake_Paonga/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Deep_Spoilers",
  "/wiki/Star_Wars_Gamer_4"
 ]
}