{
 "name": "Tura_Raftican",
 "display_name": "Tura Raftican",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "HoloNet News"
     ]
    }
   ]
  }
 ],
 "content": "Tura Raftican was an investigative reporter working for the HoloNews Network. During the Galactic Civil War, she joined the Intelligence department of the Alliance to Restore the Republic, working under Major Arhul Hextrophon and General Airen Cracken. Raftican eventually became a lieutenant and wrote a report on the Zulirian Swordmasters and the threat that they presented to the Alliance. To perform her duties, Raftican made use of her background as a journalist.\nTura Raftican, a female Human, worked as an investigative reporter for the HoloNews Network and other news services from the Core Worlds. In this occupation, she covered the activities of several collectives seeking recognition through their work and developed a vast network of contacts while doing this.\nRaftican joined the Intelligence branch of the Alliance to Restore the Republic in 2 ABY; her main job in the Alliance was to provide intelligence to Rebel forces, using many of her contacts from her days as a journalist. Among her main contacts in the Rebel Alliance were Major Arhul Hextrophon and Lieutenant Voren Na'al. After reaching the rank of lieutenant herself, Raftican worked with a team of Rebel officers that included Lieutenant Commanders Deeve and Bakki Sourthol, Lieutenant Anson Blazer, and Special Agent Tay Vanis.\nRaftican wrote a report for the Task Force on Alliance Security about the Zulirian Swordmasters. In it, she noted that the Swordmasters had been simple lovers of datafiles before turning to fencing and that their move to swordplay was calculated to garner attention. Nevertheless, she cautioned that they deserved to be considered a threat, even though that was exactly what they were looking for.\nRaftican was considered a hard worker, both as a journalist and as an intelligence agent. She was known for using journalism skills to obtain secret information and for her position as a prominent professional of the press. These abilities made her an impressively capable spy.\nRaftican sometimes favored wearing necklaces when she went outdoors.\nTura Raftican was first mentioned in Alliance Intelligence Reports, a roleplaying game book edited by Bill Smith and published by West End Games in 1995. She later appeared in 1998 as a \"recruitable character\" in the computer game Star Wars: Rebellion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Journalist/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_Intelligence",
  "/wiki/Major/Legends",
  "/wiki/Arhul_Hextrophon/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Zulirian_Swordmasters",
  "/wiki/Core_Worlds/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Lieutenant_Commander/Legends",
  "/wiki/Deeve",
  "/wiki/Bakki_Sourthol",
  "/wiki/Anson_Blazer",
  "/wiki/Tay_Vanis",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Datafile/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Necklace/Legends",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Roleplaying_game",
  "/wiki/Bill_Smith",
  "/wiki/West_End_Games",
  "/wiki/1995",
  "/wiki/1998",
  "/wiki/Star_Wars:_Rebellion_(video_game)",
  "/wiki/Star_Wars:_Rebellion:_Prima%27s_Official_Strategy_Guide"
 ]
}