{
 "name": "Turfitch",
 "display_name": "Turfitch",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 2 BBY and 4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Turfitch was a human male who worked with the bounty hunter Zingo Gabnit. On Carajam, Turfitch and Gabnit meet the bounty hunter Boba Fett while stealing shards from a woman. Following their encounter, Fett hunted after Gabnit hoping to turn him in to the Bounty Hunters' Guild, dead or alive. Turfitch was betrayed by Gabnit after Gabnit stole his water canteen and left him for dead on the Death Plains of Carajam. In his dying moments, Turfitch gave away Gabnit's location to Fett, hoping the bounty hunter would track down and kill his former ally.\nTurfitch was a human male who worked alongside disgraced bounty hunter Zingo Gabnit during the Imperial Era. Between 2 BBY and 4 ABY Turfitch and Gabnit found themselves stealing shards from a human female on the desert planet Carajam. Gabnit planned to murder and silence the female as she knew him by his name. This execution was cut short however as fellow bounty hunter Boba Fett rode into the campsite hauling his bounty. Turfitch panicked, believing Fett had arrived to punish them for their misdeeds, but Gabnit reassured him Fett only went after bounties. In the commotion the human female had escaped into the desert.\nTurfitch and Gabnit were unaware that a bounty had been placed on Gabnit's head. Gabnit was wanted for collaborating with the Rebel Alliance, breaking guild code, and killing other members of the Bounty Hunters' Guild. Boba Fett picked up this job shortly after his encounter with Turftich and Gabnit.\nWhile traveling through the desert Turfitch and Gabnit got caught in a duststorm, caking their speeders full of sand. Turfitch headed into town to get gear grease, while Gabnit took refuge inside a cave. In town, Turfitch caught wind that Gabnit had a bounty on his head, and Boba Fett had taken the job. Turfitch returned to Gabnit empty handed and with news of their impending demise. However Gabnit had already arranged a deal to get off-planet. While Turfitch was gone, Gabnit had radioed his associates, the Xan sisters, and to meet them in rebuilt star commuter across the Death Plains. Knowing there was not enough water to sustain the two of them, Gabnit shot Turfitch in the chest and stole his canteen. Gabnit trekked across the desert leaving Turfitch for dead.\nSometime after, Boba Fett arrived to where Turfitch lay. Fett gave Turfitch water from his own canteen, and in return Turfitch gave Fett Gabnit's coordinates. Turfitch laughed as he died knowing Gabnit was as good as dead with Fett on his trail.\nBoba Fett eventually tracked down and killed Gabnit Gabnit, liberating a group of townsfolk that were being terrorized by the man. His bounty earned him a total of 100,000 Credits.\nTurfitch was a human male with grey eyes and black hair. He had a heavy build and a strong black mustache. Turfitch was referred to as a \"coward\" by his associate Ganbit when the two faced Boba Fett in the desert.\nWhile on Carajam, Turfitch dressed in brown clothing, and had a cloak to conceal himself. He carried a rifle on his back and breath mask strapped around his neck. Turfitch's canteen was stolen when Zingo betrayed him.\nTurfitch was first pictured in an article published on StarWars.com on April 15, 2019, providing a preview for the one-shot comic Age of Rebellion - Boba Fett 1. The comic was published by Marvel Comics on May 8, 2019, written by Greg Pak and pencilled by Marc Laming,",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/2_BBY",
  "/wiki/4_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Age_of_Rebellion_-_Boba_Fett_1",
  "/wiki/Bounty_hunter",
  "/wiki/Zingo_Gabnit",
  "/wiki/Carajam",
  "/wiki/Bounty",
  "/wiki/Boba_Fett",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Death",
  "/wiki/Water",
  "/wiki/Death_Plains",
  "/wiki/Imperial_Era",
  "/wiki/Shards_(Carajam)",
  "/wiki/Unidentified_human_(Carajam)",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Speeder",
  "/wiki/Xan_sisters",
  "/wiki/Credit",
  "/wiki/Eye",
  "/wiki/Rifle",
  "/wiki/Breath_mask",
  "/wiki/StarWars.com",
  "/wiki/April_15",
  "/wiki/2019",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Marvel_Comics",
  "/wiki/May_8",
  "/wiki/Greg_Pak",
  "/wiki/Marc_Laming",
  "/wiki/Category:Images_of_Turfitch",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}