{
 "name": "Turland_Hack",
 "display_name": "Turland Hack",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Turland Hack, known as \"Hack,\" was a male Human lieutenant in the Alliance to Restore the Republic early in the Galactic Civil War. After he failed to become a starfighter pilot, Hack took a role in communications and tactical assistance at the Alliance's Anchorhead Base on Tatooine. There, he helped to train other Rebel pilots, including Rookie One. Shortly after the Battle of Toprawa, Imperial forces under the command of Darth Vader traveled to Tatooine in search of the stolen plans to their Death Star battlestation. Hack was killed during a subsequent attack on Anchorhead Base, when Imperial TIE/LN starfighters destroyed the command center in which he was working.\nTurland Hack was a Human male who joined the Alliance to Restore the Republic during the early years of the Galactic Civil War, with the hope of becoming a starfighter pilot. When he proved unable to qualify for flight school, Hack chose to serve the Alliance in communications and tactical assistance. He was assigned to a communications post at Anchorhead Base, a training facility near Mos Eisley, and held the rank of lieutenant by 0 BBY. Among those who met him, he was simply known as \"Hack.\"\nWhile training in Mos Eisley, he met Rookie One, a farmboy from Tatooine who had become a daring civilian pilot. Hack was impressed by the young pilot's skill and enthusiasm for the Rebellion and encouraged him to continue his pilot training with the Alliance. Hack helped tutor Rookie One during his early flights, and served as both a friend and mentor to the young pilot.\nShortly after the Battle of Toprawa, Hack was working in Tac-Comm control on the morning when Rookie One took his trials through the nearby Beggar's Canyon, the culmination of his training on Tatooine. After granting Rookie One's T-16 skyhopper clearance to depart, Hack wished his friend luck, assuring him that Beggar's Canyon was not as difficult as the runs he used to do. Rookie One succeeded in navigating the canyon in close formation with two members of Green Squadron and engaging target drones, seeing him proceed to R-22 Spearhead training under Commander Jake Farrell, leaving Hack behind on Tatooine.\nShortly after Rookie One's trials, the CR90 corvette Tantive IV arrived at Tatooine, carrying Princess Leia Organa and the plans to the Empire's new battlestation, the Death Star. When Dark Lord of the Sith Darth Vader arrived to capture it aboard the Imperial-class Star Destroyer Devastator, Organa dispatched the plans to Tatooine in the care of the droids R2-D2 and C-3PO. When Vader realized the plans were no longer aboard the Tantive IV, he ordered his forces to begin searching Tatooine. This search eventually led the Imperials to discover Anchorhead Base.\nThe Rebels called for help from Kolaador, where Rookie One was training under Commander Ru Murleen. Murleen responded, leading Rookie One and Thurlow Harris, in a three-ship flight of T-65 X-wing starfighters, to Tatooine. After fighting their way past Imperial forces in orbit, the group proceeded into Tatooine's atmosphere and headed for Anchorhead base. Murleen signaled the base for a status report and Hack responded, telling them an Imperial attack was already underway. Hearing his friend's voice, Rookie One promised to get their as soon as possible—however, it was already too late. While Hack spoke to the approaching Rebels, a group of three TIE/LN starfighters entered the canyon and opened fire on Anchorhead Base. Their laser cannon blasts destroyed the hangar and control center in which Hack was working, killing him instantly. Rookie One and the other Rebels eliminated the TIEs responsible for destroying the base and engaged other Imperial forces before they were forced to withdraw.\nHack was dedicated to the Alliance Starfighter Corps. When he learned that he could not become a pilot himself, he took a role that allowed him to assist in training other pilots and dedicated himself to helping Rookie One become among the best pilots in the fleet. In this he was successful, and Rookie One went on to fight at the Battle of Yavin and was instrumental in stopping the Empire's TIE Phantom project. However, Hack still wanted to be a pilot himself and wished that he could accompany Rookie One when the young pilot took his trials in Beggar's Canyon.\nTurland Hack was created by Vincent Lee for the 1993 LucasArts video game Star Wars: Rebel Assault. The character's appearance was based upon footage of Jack Sorensen, the Director of Business Operations at LucasArts. His back-story was expanded in the game's manual and was later covered in the character's entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/0_BBY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/File:Hack1-RA.ogg",
  "/wiki/Lieutenant/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Anchorhead_Base",
  "/wiki/Rookie_One",
  "/wiki/Battle_of_Toprawa",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Death/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/File:HackRookie-RA.ogg",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Tac-Comm_control",
  "/wiki/Beggar%27s_Canyon/Legends",
  "/wiki/T-16_skyhopper/Legends",
  "/wiki/Green_Squadron_(Rebel_Alliance)/Legends",
  "/wiki/R-22_Spearhead_starfighter",
  "/wiki/Commander/Legends",
  "/wiki/Jake_Farrell/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Tantive_IV/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Devastator/Legends",
  "/wiki/Droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Kolaador",
  "/wiki/Ru_Murleen",
  "/wiki/Thurlow_Harris",
  "/wiki/Flight_group/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Laser_cannon/Legends",
  "/wiki/Battle_of_Tatooine_(Galactic_Civil_War)",
  "/wiki/File:Hack2-RA.ogg",
  "/wiki/Alliance_Starfighter_Corps",
  "/wiki/Alliance_Fleet",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/TIE/ph_phantom",
  "/wiki/Vincent_Lee",
  "/wiki/1993",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebel_Assault",
  "/wiki/Jack_Sorensen",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Category:Audio_files_of_Turland_Hack",
  "/wiki/Category:Images_of_Turland_Hack",
  "/wiki/Rebel_Assault:_The_Official_Insider%27s_Guide",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire"
 ]
}