{
 "name": "Tuz",
 "display_name": "Tuz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Tall"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Tuz was a tall, overweight Mon Calamari pirate and trader who operated during the reign of Emperor Palpatine. Tuz did not initially get involved in the Galactic Civil War, but he was reluctantly drawn into service to the Alliance to Restore the Republic as a result of pressure applied by the Rebel Admiral Gial Ackbar. Under the supervision of Vice Admiral Wirriz and Commander Fortune, Tuz participated in undercover missions against the Galactic Empire and supplied the Rebels with what he stole. Shortly before the Battle of Yavin, Tuz helped deliver some Imperial equipment from the stolen BFF-1 bulk freighter Sidral II to the Mon Calamari Star Cruiser Independence, which Alliance High Command hoped would lead back to contractors working on the Empire's Death Star battlestation.\nDuring the reign of Emperor Palpatine, the male Mon Calamari Tuz operated as a pirate and trader, taking advantage of other spacers and profiting at their expense. Over the years, Tuz had a long and involved history with Gial Ackbar, a fellow Mon Calamari who became an admiral in the Alliance to Restore the Republic during the Galactic Civil War. Though Tuz had no love for the Galactic Empire, he did not care about the Rebellion either. However, several months before the Battle of Yavin, Tuz was contacted by Ackbar, who used his considerable leverage over the pirate to persuade him to assist the Rebel Alliance. To ensure the reluctant pirate's cooperation, Ackbar assigned the Quarren Vice Admiral Wirriz and the Corellian Commander Fortune to accompany him. In the months that followed, Tuz allowed the Rebels to make use of his Imperial contacts and participated in undercover operations, acting as a privateer against the Empire and supplying the Rebels with what he stole.\nAfter learning that the Empire was building the Death Star, a battlestation capable of destroying an entire planet, the Alliance attempted to discover which contractors were involved in its construction. Shortly before the Death Star was completed, Tuz aided in the capture of the Imperial BFF-1 bulk freighter Sidral II, which was carrying a cargo of the latest military hardware, including timers and fusion shells. Hoping to analyze the equipment to learn who was building the Death Star, the Alliance dispatched the CR90 corvette Frazier to rendezvous with the freighter and transfer its cargo. The operation was interrupted by the Imperial-class Star Destroyer Immortal, but the Rebel forces were able to complete the transfer before escaping to hyperspace.\nFollowing the transfer, Tuz delivered the stolen equipment to the Mon Calamari Star Cruiser Independence. After landing his small freighter aboard the Rebel cruiser, Tuz disembarked, accompanied by Wirriz, Fortune, and two of his Gamorrean guards. Their arrival attracted the attention of three Rebel pilots—Captains Keyan Farlander, Samuel Raider, and Puck Naeco—who approached to see what they wanted. Raider recognized Tuz from some prior dealings and was suspicious of the pirate, but Tuz accepted Naeco's invitation to join the Rebels for a drink in the pilots' lounge. While they drank, Raider voiced his opinion of Tuz's business practices, causing one of the pirate's bodyguards to attack the pilot. Raider managed to knock the bodyguard to the floor with a well-placed uppercut, but Tuz brought the altercation to a halt before his second guard could intervene, threatening to send his guards back to the ship. The pirate admitted his checkered past and claimed that he had changed his ways, but Fortune, on Wirriz's order, told the pilots the truth about Tuz's reluctant involvement. The group finished their drinks, and the Rebels escorted Tuz and his companions back to their ship.\nPart of the stolen shipment had passed through an Imperial repair dock near Coruscant, the Imperial capital. Alliance High Command decided to launch an attack on the facility in the hopes of crippling the infrastructure that was servicing ships working on the Death Star. Before leaving the Independence, Tuz provided some information on the facility to Commanders S'man and Hamo Blastwell to assist in planning such a raid.\nOperating as a pirate, Tuz would happily take advantage of any young and gullible traders he encountered to achieve profit at their expense. As a result he acquired a reputation as a swindler and a cheat. He had little interest in the Rebellion until Admiral Ackbar used his influence to persuade Tuz to work against the Empire. Never truly trusted by the Rebels, Tuz was forced to conduct his work under the supervision of Wirriz and Fortune. Tuz later claimed that he had no love for the Empire and had come to admire the commitment and dedication of the Rebels. Those within the Alliance, however, continued to doubt his claims. Despite working under the charge of the Rebels, Tuz maintained the impression that he was in command. A tall, obese Mon Calamari male whose face was scarred in three places, he typically wore a military issue tunic, covered with numerous commendations and battle patches, a long cape, and an iridescent headband. While aboard the Independence, he spoke on behalf of his group and made sure he was heard complaining loudly about cheap Alliance negotiators not paying him a fair price for his cargo. On prompting by Wirriz, however, Tuz backed down and allowed Fortune to take command of the situation in the pilot's lounge.\nTuz was created by Rusel DeMaria for the 1993 book X-Wing: The Official Strategy Guide. The book, which included strategies for completing the LucasArts video game Star Wars: X-Wing, was presented as the story of Keyan Farlander, the player character in the game. Tuz makes a brief appearance in the story portion of the book, which links him to the capture of the Sidral II in the mission \"Guard Weapons Transfer\" and credits him with the intelligence leading to the mission \"Destroy Repair Dock.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Vice_Admiral/Legends",
  "/wiki/Wirriz",
  "/wiki/Commander/Legends",
  "/wiki/Fortune_(Human)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Capture_of_the_Sidral_II",
  "/wiki/BFF-1_bulk_freighter/Legends",
  "/wiki/Sidral_II",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Independence/Legends",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Spacer/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Fusion_shell",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Frazier",
  "/wiki/Freighter/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Immortal/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Keyan_Farlander/Legends",
  "/wiki/Samuel_Raider",
  "/wiki/Puck_Naeco/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Attack_on_the_Imperial_repair_dock",
  "/wiki/H._S%27man",
  "/wiki/Hamo_Blastwell",
  "/wiki/Commendation",
  "/wiki/Cape/Legends",
  "/wiki/Rusel_DeMaria",
  "/wiki/1993",
  "/wiki/X-Wing:_The_Official_Strategy_Guide",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_X-Wing",
  "/wiki/X-Wing_Collector%27s_CD-ROM:_The_Official_Strategy_Guide"
 ]
}