{
 "name": "Tweego",
 "display_name": "Tweego",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Azure Cabal"
     ]
    }
   ]
  }
 ],
 "content": "Tweego was a formidable but reclusive Rodian hunter who spent his time perfecting his hunting skills in the harsh wastelands of Tatooine. His life changed one day when he was out on safari, as he discovered a crashed speeder and rescued Loruna Scathe from the wreckage. He sheltered Loruna after the accident and while she recuperated, he salvaged her speeder. He used the credits he gained from selling it to have a bounty hunter eliminate a rival who had disgraced him in the eyes of his family.\nBecause of Loruna's timely appearance in his life, he developed a fondness for her, which was unusual for his aggressive species. Though he once thought himself her superior, Loruna's skills as a hunter soon humbled him and on her request, he joined her mercenary organization, the Azure Cabal.\nAt some point he also hired a spacer to gather the musk gland of a bantha.\nTweego appeared as a non-player character in the video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Azure_Cabal",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Hunting/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Loruna_Scathe",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Bantha/Legends",
  "/wiki/December_15",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/Template:SWGTCG"
 ]
}