{
 "name": "Twin_Suns_(assassins)",
 "display_name": "Twin Suns  (assassins)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Visionary"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "Twin Suns was the name given to female Twi'lek assassins Seer'aa and Teer'aa, who operated in the aftermath of the Jedi Civil War. Once slaves from Ryloth, they killed their Masters and then became bounty hunters taking the name of Twin Suns. Both used deadly Twi'lek spinning blades and personal energy shields while hunting bounties.\nIn 3951 BBY, Atton Rand faced them in a cantina when separated from Meetra Surik on Nar Shaddaa, and defeated them. Surik, along with two of her companions, later faced them aboard the Visionary and killed them shortly before it exploded.\nBorn on Ryloth, Seer'aa and Teer'aa were sold into slavery at a young age. At some point they killed their master, taking their first steps into their career as assassins.\nIn 3951 BBY, during the aftermath of the Jedi Civil War, the Twin Suns traveled on the Visionary with several other bounty hunters. Goto instructed them to capture the Jedi Exile alive, informing them that her death would not be tolerated.\nThey successfully tracked down the Exile's companion Atton Rand while Surik was in the Jekk'Jekk Tarr. At first, they tried to get Atton to come with them peacefully, but soon resorted to violence. Atton managed to best them and escape. The outcome of the first encounter angered the duo, so they returned to the Visionary, where they waited for the Exile and her friends. They finally got their chance just as the ship was falling apart. They attempted to kill Surik, but she and two of her companions killed the duo. Their bodies were destroyed when the Visionary exploded.\nTwin Suns appeared, though unnamed, in Star Wars: Knights of the Old Republic II: The Sith Lords video game. Their names were later revealed by Leland Chee.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twin_Suns",
  "/wiki/Ryloth/Legends",
  "/wiki/3951_BBY",
  "/wiki/Visionary",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Vossk",
  "/wiki/Assassin/Legends",
  "/wiki/Seer%27aa",
  "/wiki/Teer%27aa",
  "/wiki/Jedi_Civil_War",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Twi%27lek_spinning_blade",
  "/wiki/Personal_energy_shield/Legends",
  "/wiki/Atton_Rand",
  "/wiki/Meetra_Surik",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/G0-T0",
  "/wiki/Death/Legends",
  "/wiki/Jekk%27Jekk_Tarr",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Leland_Chee",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/June_4",
  "/wiki/2007"
 ]
}