{
 "name": "Ty_Yorrick",
 "display_name": "Ty Yorrick",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tholothian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light-blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Magenta"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Caratoo's band",
      "Dro-Nal-Pru's mercenary army"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Cibaba"
     ]
    }
   ]
  }
 ],
 "content": "Ty Yorrick, formerly known as Tylera, was a female Tholothian Force-sensitive monster hunter and saber-for-hire who lived during the High Republic Era. A former Jedi Padawan, Yorrick departed the Jedi Order and came to work as a mercenary, being part of a band led by Caratoo for a time. She crossed paths with the Jedi again when she came to the Republic Fair on Valo while working as a bodyguard for Mantessa and Klerin Chekkat.\nTylera was a Force-sensitive Tholothian who lived during the High Republic Era. As a child, she was inducted into the Jedi Order, eventually becoming a Padawan. During her time as an apprentice, she was taught how to construct her lightsaber by the Azumel Jedi Master Cibaba, and also befriended a fellow Padawan, Klias Teradine. However, Tylera eventually left the Jedi after an incident with Teradine at the Yallow Shrine.\nAs a padawan, Yorrick lived on Alaris Prime where she was friends with Klias Teradine. She was apprenticed to Jedi Master Cibaba. During a sparing match, Teradine suggested that she had was too meek and timid and needed to be more like him. She surprised him with a leg sweep, knocking him down. Later, Teradine convinced Yorrick to go with him to Mount Bikja to a Yallow Fellowship sanctum. As they were leaving, Yorrick pulled Teradine into a side passage to avoid a Jedi. The two padawans joined hands and left to climb the mountain.\nAs the pair climbed the mountain, Teradine told Yorrick that he wanted to find out the Yallow secrets so he could study them and be a better Jedi. When Yorrick lost her grip and started to fall, Teradine caught her by anchoring himself to the mountainside using a force technique from the Sabracci Sages. The finished their climb and entered the shrine. Yorrick saved Teradine from impalement after he tripped a booby trap. Deeper in the shrine, Teradine discovered artifacts including a Yallow soothsaber and a vitalicron. Yorrick attempted to persuade her friend to leave the artifacts as it would be dangerous and immoral to take them from the shrine. Teradine examined the vitalcron and was exposed to its contents when it unlocked in his hands. He was taken over by the Yallow and attacked Yorrick. She attempted to help him but was forced to kill him.\nBecoming known as Ty Yorrick, she eventually went into mercenary work, joining a band led by the Kerk Caratoo, whom she later killed after a betrayal. She spent almost a decade working as a monster hunter, becoming known as the \"Saber for Hire\" as well. At some point, a Weequay cut off one of her head-tendrils with a knife.\nIn 232 BBY, the Drengir, a species of sentient carnivorous plants which hungered for the meat of other beings, were awakened from a long slumber. Yorrick initially disbelieved the reports and laughed them off. However, during a hunt on Galidraan for a batarikan snake, she learned otherwise when she found her quarry infested by a root system. The discovery that many of the locals had also been killed by the Drengir meant she also did not get paid for the job, something her droid KL-03 lamented.\nThree months before the Valo Republic Fair was to be held, Yorrick was involved in a mission on Blarrum which brought her closer to encountering the Jedi than she had in quite some time.\nYorrick travelled to Blarrum where she was hired by Triv Blago to capture a gundark. During the fight, Yorrick was knocked away by the beast. She landed in a clearing where she found a Segredo youth who had followed her. Unfortunately, the gundark attacked and Yorrick was forced to kill it to save the youth. She returned to Kul Kenada Spaceport where she noticed a pair of Jedi. Avoiding them, she met with Blago and showed him the decapitated head of the gundark. He angrily confronted her, stating that he hired her to capture the creature alive. Before they could argue any more, the Jedi showed up to arrest Blago. Blago's gang fired at the Jedi, and Yorrick created a distraction so she could flee. Blago followed her but she knocked him to the ground. She fled on her speeder as the beast-trader was arrested. She boarded her ship and left the planet.\nOnce in space, KL-03 explained to her that the ship desperately needed repairs and upgrades, and advised her to find another paying job. She gave her two options, and Yorrick used her Verazeen stones to decide on which one to take. The stones told her to take the job on Loreth. She landed on the planet and was met by Layton Wyke. He introduced her to his colleague, Tapel, and explained that their colony was being attacked by a gretalax. While trying to decide if to take the job, she was knocked down by Wyke's niece, Pela. Wyke explained that Pela had been injured in the gretalax attack when she was exposed to rhydonium fumes. Standing back up, Yorrick used the Varazeen stones to determine if she should take the job. She ended up taking the job, and mounted a lyuna to take her to the top of Temple Peak.\nAs she ascended, Yorrick detected the presence of someone. She located the being and chased it into a spider web. A Rock Weaver came out of a cave and advanced towards Yorrick. The rock weaver shot webbing in Yorrick's face, blinding and suffocating her. She thought back to her Jedi training, when her master taught her how to use the Force to tame an animal. She was unable to join with the rock weaver, but did manage to scare it off by causing an avalanche. KL-03 communicated to her over the comlink and informed her that rock weaver webbing could be removed with sound waves. The droid advised her to use her sonic cutter at level three. Yorrick was able to remove the webbing from her face and then used it to get rid of the webbing on the being she had detected earlier. The unknown individual was freed, but was still invisible. Yorrick trapped them with a bolo and told them to reveal themselves. She found out it was the Segredo child from Blarrum who had snuck onto her ship. He introduced himself as Drewen and explained he was following Yorrick because he wanted to be trained as a Jedi. She refused and sent him back down the mountain by himself. Yorrick changed her mind and found Drewen. She told him he could camp overnight with her but had to leave in the morning. As she set up camp, he told her his life story. Later that night, the lyuna got spooked and ran off. Yorrick awoke and sensed that someone was coming. She was again attacked by Pela, who drew a blaster and shot at her. She deflected the blast with her lightsaber, but it went back towards Pela. The girl was startled and stumbled off the cliff. Yorrick attempted to catch her using the Force, but wa unable to hold the girl. She sat on the edge of the cliff and mourned her inability to save the girl. The next morning, Drewen started to leave but Yorrick told him he could stay, mostly due to the fact that the lyuna had run off and she needed someone to carry the supplies.\nThe pair continued to climb the mountain, looking for the monster's lair. Yorrick lost her footing and fell off the path, but saved herself by jamming her lightsaber hilt into the mountainside. She took Drewen's hand and flung him across a chasm and joined him on the other side. They arrived at the lair and Yorrick gave Drewen a glowrod but refused to provide him a weapon. Deeper in the cave, they were attacked by the gretalax. Yorrick attempted to bond with the gretalax to calm it down but was tossed aside, losing her lightsaber. She attempted to avoid the attacks and call the lightsaber back to her hand. While difficult, she managed to do it but it caused the floor of the cave to collapse, dropping her and gretalax into a pit. She and the beast were trapped under rubble, and Yorrick found herself surrounded by rock weavers. They didn't attack and started to help clear the debris, freeing her. Drewn jumped down with her saber and confronted the spiders, but Yorrick stopped him when she realized they were being controlled by the gretalax. She took her saber from Drewen, warning him that no-one was allowed to touch it. She again attempted to bond with the gretalax and was surprised when the creature created the bond itself. She was able to see its memories of the attack on Wyke Town and realize the truth that the gretalax had not been the aggressor.\nYorrick returned to Wyke Town where she confronted Wyke about him capturing the lax which caused the greta to attack in an attempt to free its partner. While talking to Wyke, she was stunned by Tapel. Wyke hung her above a large shredder and explained his plan of crushing the gretalax horns to make a potion that would make his group powerful. He decided to use Yorrick's body as a substitute but she revealed she had a group of rock weavers who attacked the settlers, allowing Drewen to recover Yorrick's lightsaber from Wyke and return it to the monster hunter. She freed herself from the chains and destroyed the shredding machine. She chased down Wyke and forced him to confess his crimes. They were broadcast by KL-03 to the entire settlement, causing Wyke to be embarrassed and lose stature. Yorrick returned to see the gretalax reunite and use their Force healing ability on each other and then Pela. She decided to leave Loreth and gave her Verazeen stones to Drewen, telling him that she would start to make her own decisions. She told Drewen that she preferred to work alone and left him with Pela and the other settlers. As she flew away, KL-03 told her that she could have brought Drewen with them, but Yorrick didn't want to discuss it. She went to the back of the ship and trained with several training remotes.\nSoon afterward, she found herself fighting alongside the Jedi to defeat the Nihil raiders during the attack on Valo, later joining the Battle of Grizal in a failed effort to wipe out the pirates.\nTy Yorrick was a female Tholothian with dark skin and silver head-tendrils. Due to the trauma of how she had left the Jedi, she avoided members of the Order and disliked talking about what had happened. She was once extremely superstitious, relying on Verazeen stones to make every decision. Yorrick could also be quite skeptical, reacting to initial reports of the emergence of the Drengir with derision at the thought of \"plant monsters\" running about.\nWhen Yorrick realized that Klerin Chekkat appeared to have a crush on her, she would have considered exploring a possible connection if the timing was different, but Chekkat being the daughter of her unpredictable client made it unwise. Nevertheless, she flirted with Chekkat in an attempt to solicit more information about the job. When she later shared through the Force Elzar Mann's intimate memories of Avar Kriss, she felt attraction and teased Mann by clarifying that it was not towards him as he was not her type.\nDespite her name being Tylera and only going by the name Ty, Yorrick insisted that she did not \"do\" nicknames.\nTy Yorrick was experienced in the use of her Force powers, particularly telekinesis, mind tricks, force speed and lightsaber combat.\nTy Yorrick owned a purple-bladed lightsaber, a starship which she refused to name, and two droids: the admin unit KL-03 and the astromech droid R0-VR. She wore blue clothing and a golden headdress.\nTy Yorrick was created by author Cavan Scott for the Star Wars: The High Republic multimedia project. She first appeared simultaneously in the novel The High Republic: The Rising Storm by Scott and the junior novel The High Republic: Race to Crashpoint Tower by Daniel José Older on June 29, 2021. In Race to Crashpoint Tower, the character's surname was misspelt as \"Yorrik.\" Prior to her debut, Yorrick was first pictured on the cover of The Rising Storm in a StarWars.com article on December 4, 2020 that revealed the book's title. After the release of the article, Scott confirmed on Twitter that the female Tholothian on the book's cover was indeed Yorrick. She was later identified by her full name \"Tylera\" in the first issue of the comic miniseries Star Wars: The High Republic Adventures — The Monster of Temple Peak, which was written by Scott and published by IDW Publishing on August 11, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic_Adventures_Free_Comic_Book_Day_2021",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Ty_Yorrick",
  "/wiki/Tholothian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Cibaba",
  "/wiki/Force-sensitive",
  "/wiki/Lightsaber",
  "/wiki/Mercenary",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Caratoo",
  "/wiki/Republic_Fair",
  "/wiki/Valo",
  "/wiki/Bodyguard",
  "/wiki/Mantessa_Chekkat",
  "/wiki/Klerin_Chekkat",
  "/wiki/Azumel",
  "/wiki/Jedi_Master",
  "/wiki/Klias_Teradine",
  "/wiki/Yallow_Shrine",
  "/wiki/Alaris_Prime",
  "/wiki/Mount_Bikja",
  "/wiki/Yallow_Fellowship",
  "/wiki/Sabracci_Sages",
  "/wiki/Yallow_soothsaber",
  "/wiki/Vitalicron",
  "/wiki/Kerk",
  "/wiki/Death",
  "/wiki/Standard_decade",
  "/wiki/Weequay",
  "/wiki/Knife",
  "/wiki/232_BBY",
  "/wiki/Drengir",
  "/wiki/Species",
  "/wiki/Sentience",
  "/wiki/Carnivorous_plant",
  "/wiki/Galidraan",
  "/wiki/Batarikan",
  "/wiki/Snake",
  "/wiki/Droid",
  "/wiki/KL-03",
  "/wiki/Standard_month",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Blarrum",
  "/wiki/Triv_Blago",
  "/wiki/Gundark",
  "/wiki/Segredo",
  "/wiki/Kul_Kenada_Spaceport",
  "/wiki/Verazeen_stones",
  "/wiki/Loreth",
  "/wiki/Layton_Wyke",
  "/wiki/Tapel",
  "/wiki/Gretalax",
  "/wiki/Pela",
  "/wiki/Rhydonium",
  "/wiki/Lyuna",
  "/wiki/Temple_Peak",
  "/wiki/Spider",
  "/wiki/Rock_Weaver",
  "/wiki/Sonic_cutter",
  "/wiki/Drewen",
  "/wiki/Glowrod",
  "/wiki/Wyke_Town",
  "/wiki/Force_healing",
  "/wiki/Remote",
  "/wiki/Nihil",
  "/wiki/Attack_on_Valo",
  "/wiki/Battle_of_Grizal",
  "/wiki/Pirate",
  "/wiki/Plant",
  "/wiki/Elzar_Mann",
  "/wiki/Avar_Kriss",
  "/wiki/Force_power",
  "/wiki/Telekinesis",
  "/wiki/Mind_trick",
  "/wiki/Force_Dash",
  "/wiki/Lightsaber_combat",
  "/wiki/Ty%27s_lightsaber",
  "/wiki/Ty_Yorrick%27s_starship",
  "/wiki/Admin_unit",
  "/wiki/Astromech_droid",
  "/wiki/R0-VR",
  "/wiki/Cavan_Scott",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/June_29",
  "/wiki/2021",
  "/wiki/StarWars.com",
  "/wiki/December_4",
  "/wiki/2020",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak",
  "/wiki/IDW_Publishing",
  "/wiki/August_11",
  "/wiki/Undead_of_Alive",
  "/wiki/Star_Wars:_Tales_from_the_Rancor_Pit",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_2",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_3",
  "/wiki/The_High_Republic_Adventures_%E2%80%94_The_Monster_of_Temple_Peak_4",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Category:Images_of_Ty_Yorrick",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Galactic_standard_calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_High_Republic:_Into_the_Dark"
 ]
}