{
 "name": "Tyber_Zann",
 "display_name": "Tyber Zann",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Anaxes"
     ]
    },
    {
     "name": "Born",
     "values": [
      "34 BBY",
      "Anaxes"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zann Remanufacturing",
      "Galactic Empire",
      "Academy of Carida",
      "Academy of Carida",
      "Zann Consortium",
      "Hutt Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Tyber Zann was a human male crime lord from Anaxes who rose to prominence after the Battle of Yavin during the Galactic Civil War and led his own crime syndicate, known as the Zann Consortium, a powerful underworld consortium. He would wage a campaign against the Galactic Empire as revenge for expelling him from the Imperial Academy.\nTyber Zann was born on Anaxes in 34 BBY, and first worked in the family firm Zann Remanufacturing, which specialized in refitting outdated Old Republic and Imperial Military hardware for civilian use. He became bored with the linear business, and started running illicit sabacc games and book-making, which he found to provide the excitement and revenue that he sought.\nIn order to arm his gambling ring's enforcers, Zann attempted to steal an arms shipment from one of the company's warehouses. The security forces caught him and reported the attempted theft to his father, who as punishment, arranged for him to be enrolled as a cadet in the Imperial Academy of Carida.\nOperating out of the Academy, Zann established a new smuggling ring - the Zann Consortium. The facility's lax security made it simple for him to steal Imperial weaponry and smuggle it off-world, to his partner Urai Fen, who sold them on the black market. A top performer, Zann used the credentials this granted him to get on training missions where he could form a network of contacts for the smuggling trade. The operation became one of the largest in the galaxy, and he started to evoke the attention of more powerful criminals, namely Jabba the Hutt. Jabba coordinated a plan to catch Zann during a smuggling run shortly before his graduation. Fortunately for Tyber, Urai intercepted transmissions between Imperial authorities about the plot. Although he was able to avoid any prosecution, Zann was forced to leave the Academy in contempt.\nDespite his misgivings, Zann perceived that to continue building the Zann Consortium he would need to forge an alliance with Jabba. Subsequently he began running smuggling operations for the Hutt in exchange for vehicles and vessels, while also concealing assets from the fellow Crime Lord. Zann never intended this arrangement to be permanent, and after a year he had gained word that Jabba had spent nearly half his wealth on a unique artifact, though Tyber did not know anything of its origins.\nThe Zann Consortium was still small, and Zann intended to establish communications with a black market on Nal Hutta, though first he needed to show them an example of his capabilities, and develop a reputation that the Consortium was a force-to-be-reckoned with. After being informed by one of his soldiers that the Mandalorian Supreme Strategist was traveling to the asteroid station above Mandalore, Zann seized the opportunity. Traveling to Mandalore, the Consortium flotilla destroyed the V-wing escort sent to prepare for the strategist's arrival. Shortly afterwards, the strategist arrived, though the Consortium ambushed him. During the battle, the strategist's engines were destroyed, his ship was boarded, and he was taken prisoner. Zann assigned one of his defilers to establish communications with the black market, and Urai was sent to buy disruptor technology for the Consortium's mercenaries.\nZann's agents decoded a message from an Imperial outpost on Felucia that authorized Jabba to land on the planet's surface. Recognizing that the Hutt intended to sell the artifact to the Empire, Zann lead a taskforce along with Urai and several squads of mercenaries to steal the artifact before the transaction could be made. Posing as Hutt Cartel forces, the Imperial fleet commander was convinced, though hesitantly, that the group were arriving separately from the main group to safeguard the artifact. The taskforce, aboard a TZ-86 transport located a clearing in the dense foliage and landed there. Ordering Alpha Squad to scout ahead and make sure that their path to the Hutt landing site was clear, Zann watched as they perished to Felucian spore plants. Fortunately for the remainder, they had brought a repulsorlift F9-TZ Transport, which Zann ordered his troops to unload, and to deploy a Mobile Defense Unit with a rocket pod, lest somebody stumble across the landing site. The group proceeded to ride the transport as far as they could, but thick vegetation obstructed their path, so they had to traverse the rest by foot. The taskforce came into conflict with Cartel forces along the way, although they failed to avert the Consortium's advance. Leaving the troops behind, Zann and Urai utilized their personal cloaking devices to bypass the anti-infantry turrets and reach where the artifact was being held. Urai uncloaked and killed the Hutt mercenaries guarding the artifact, and Zann ordered him to take the relic and meet him at the rendezvous point. Just after the cloaked Urai left, Tyber was apprehended by Stormtroopers, which Zann defeated, though many more Imperial forces arrived immediately afterwards. Outnumbered, Zann let them take him into custody, but vowed that they wouldn't hold him for long.\nWhile Zann rotted away in the spice mines of Kessel, Urai Fen waited for the time Zann had set for his escape. By starting a riot on Kessel and hiring the crew of the Millennium Falcon to pick him up, Zann made his escape, narrowly avoiding execution from a bounty hunter hired by Jabba.\nAfter his return to freedom, Zann, along with his closest companion Urai Fen, gradually reestablished the Consortium as a power to be reckoned with from their headquarters on Ryloth. Among other things, the criminal organization would offer protection to worlds affected by the Galactic Civil War, having built up a sizable military force.\nLieutenant Izbela Saarrj of the Imperial Security Bureau wrote a report on his activities around 0 ABY, mentioning his use of spies to study the Star Dreadnought Eclipse, the first Eclipse-class dreadnought, while it underwent construction. The Eclipse was armed with an axial-super laser and was larger than any star destroyer created prior.\nZann also made a treaty with Jabba the Hutt stating that he would not operate on Hutt worlds after a battle on Hypori. He was allowed to keep Saleucami and Hypori as a condition of the treaty.\nHe used his extensive crime network to influence the warring factions of the Galactic Civil War, siphon their credits, and sabotage their operations when necessary. During the course of his ascent to power, his forces fought against both factions of the war. He had his own flagship, an Aggressor-class destroyer named Merciless, for his navy. When fighting, he would sometimes make use of his own personal cloaking device that rendered him invisible.\nZann was also intent on discovering the mysteries of the ancient Sith holocron, stolen from Jabba while he was making a deal with the Galactic Empire on Felucia. He employed a Nightsister, Silri, whom he freed on Dathomir in order to have her decipher the Sith artifact. Though she knew of the artifact's true importance, she withheld information from Tyber causing them to quarrel verbally on several occasions. After the battle of Dathomir, Tyber was contacted by Admiral Thrawn who warned him about his behavior and actions.\nAfter the Empire seized control of Bespin, Prince Xizor contacted Tyber Zann and offered him a job to steal Tibanna Gas from the Bespin refinery which they would split in half. In exchange, Xizor\nwould arrange a meeting with the Emperor or one of his representatives to whom Tyber could sell the Sith Artifact. Tyber and Urai knew this was a trap and knew that Xizor's rival Darth Vader controlled Bespin. Tyber and Urai Fen hired IG-88 to plant evidence to frame Xizor and the Black Sun. Later on, a stormtrooper reported to Vader and told him that they had evidence that suggested that the Black Sun stole the Tibanna Gas. Vader later killed Xizor partly because of this robbery of Bespin.\nAfter Tyber, Urai, and IG-88 raided tibanna gas from Bespin, Xizor of Black Sun provided Tyber with a contact in the Empire, to whom he would sell the Sith Artifact.\nThe negotiation was a trap. Grand Admiral Thrawn's fleet engaged Tyber's; the Merciless was first revealed in the battle.\nDuring the battle Bossk stole the Sith Artifact from Zann and gave it to Thrawn, who then fled in the Star Destroyer Admonitor, leaving the remaining ships to their fates.\nAfter defeating the remaining Imperial fleet, Tyber returned to Ryloth.\nAfter he and Silri had a \"misunderstanding\" over the information of the Sith Artifact, Tyber promised to have every Nightsister on Dathomir annihilated if she lied or withheld information again. He also made clear that his associate and friend, Urai Fen, would kill Silri if any attempt was made on Zann's life .\nTyber, Urai, and Silri raided the Emperor's archive at Coruscant after they put a tracer on the Sith Artifact. Tyber stole the Emperor's passkey to get on the Eclipse and Silri reclaimed the Sith Artifact.\nTheir last known action involved taking over the Eclipse in 4 ABY in order to gain information on the Emperor's vaults, during the Battle for the Eclipse. Zann proceeded to steal tens of billions of credits, technical data, and many priceless works of art from Emperor Palpatine's personal vault network, thus ensuring that he has enough resources to spread the Consortium throughout the galaxy. After his theft, Tyber decided to abandon the Eclipse as it would be a \"target even the Rebels could not miss.\" He also decided to allow the Rebel Alliance to form their New Republic, seeing it as a chance to \"own a senator.\" The Eclipse was later recovered by Imperial forces, who continued its construction.\nHowever, Silri secretly unlocked the holocron behind Zann's and Fen's backs. The artifact led her to an ancient Sith tomb, with thousands of Sith soldiers frozen in carbonite.\nInspired by Zann's earlier riot, the prisoners in the spice mines of Kessel staged yet another revolt.\nZann was cold, methodical, ambitious, and ruthless, and had an arrogant streak, as evidenced by his steadfast confidence in himself. He liked to be in complete control of things and was also quite cunning. He was a criminal mastermind, a tactical genius, and adept at using most weapons of war. He could hold a grudge on people and would not let it go until he made them pay. Zann also seemed quite confident in his abilities, making his leadership abilities very powerful. Zann's cruelty was expressed during the Felucia theft, when his scouts in Alpha Squad were killed by native spores, he expressed no sense of dismay or sadness, but said the ship would be a little bit lighter when they left the planet.\nDespite these negatives traits, Tyber had a sense of humor, albeit a rather rude one, as seen throughout the Campaign towards Urai, such as when he asked Urai whether he had trained to be a Jedi during his absence. He was a long time ally of Urai Fen, who was possibly his only true friend, and the two were known to call each other by their first names. He however cared very little for those who served him as soldiers and would kill those who disobeyed him even if their actions actually gained him something. He was also very tolerant of Silri's actions compared to Urai, who often wanted to kill her. Tyber kept her around and she even managed to grow on him, though he loathed to admit it.\nZann wielded a modified Rawk chopped special, a weapon which was later favored by Cade Skywalker around 130 ABY.\nZann was included in Star Wars Insider 89's \"Underworld: A Galaxy of Scum and Villainy\" at the request of LucasArts, who wished additional publicity for him. For his illustration in Insider 89, artist Joe Corroney based him on British actor Jason Isaacs, using a promotional image of Isaacs' character Lucius Malfoy from the Harry Potter films as a reference.\nZann was voiced by Steve Blum in the Forces of Corruption trailer, and by Jake Eberle in the actual game.\nThis character name is often misspelled 'Zahn' as the gold pack version of the game's case featured this spelling. This error was corrected in later printings.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Anaxes/Legends",
  "/wiki/34_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Zann_Remanufacturing",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Academy_of_Carida",
  "/wiki/Zann_Consortium/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption",
  "/wiki/Crime_lord/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Consortium",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Urai_Fen",
  "/wiki/Black_market/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Supreme_Strategist",
  "/wiki/Hutt_asteroid_station",
  "/wiki/Mandalore/Legends",
  "/wiki/Alpha-3_Nimbus-class_V-wing_starfighter/Legends",
  "/wiki/Defiler",
  "/wiki/Disruptor/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Felucia/Legends",
  "/wiki/Fleet_commander",
  "/wiki/TZ-86_transport",
  "/wiki/Alpha_Squad_(Zann)",
  "/wiki/Felucian_spore_plant",
  "/wiki/Repulsorlift/Legends",
  "/wiki/F9-TZ_Transport",
  "/wiki/Mobile_Defense_Unit",
  "/wiki/Rocket_pod",
  "/wiki/Personal_cloaking_device",
  "/wiki/Bp.2_anti-infantry_turret",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Kessel_prison",
  "/wiki/Spice_Mines_of_Kessel",
  "/wiki/Kessel/Legends",
  "/wiki/Kessel_Insurrection",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Unidentified_Mustafarian_bounty_hunter",
  "/wiki/Ryloth/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Izbela_Saarrj",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Star_Dreadnought/Legends",
  "/wiki/Eclipse_(Eclipse-class)",
  "/wiki/Eclipse-class_dreadnought",
  "/wiki/Holocron/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Hypori/Legends",
  "/wiki/Saleucami/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Flagship/Legends",
  "/wiki/Aggressor-class_Star_Destroyer",
  "/wiki/Merciless_(Aggressor-class)",
  "/wiki/Carbonite_Sith_Army_holocron",
  "/wiki/Silri",
  "/wiki/Dathomir/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/IG-88B/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Bossk/Legends",
  "/wiki/Admonitor",
  "/wiki/4_ABY/Legends",
  "/wiki/Battle_for_the_Eclipse",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Carbonite_Sith_Army",
  "/wiki/Carbonite/Legends",
  "/wiki/Rawk_chopped_special",
  "/wiki/Cade_Skywalker",
  "/wiki/130_ABY",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/Underworld:_A_Galaxy_of_Scum_and_Villainy",
  "/wiki/LucasArts",
  "/wiki/Joe_Corroney",
  "/wiki/Jason_Isaacs",
  "/wiki/Steve_Blum",
  "/wiki/Jake_Eberle",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Insider",
  "/wiki/News_from_the_Underworld:_Vol._1,_Issue_1",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption_Expansion:_Prima_Official_Game_Guide",
  "/wiki/Scum_and_Villainy_(sourcebook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Starships_of_the_Galaxy_(Saga_Edition)",
  "/wiki/Rebellion_Era_Campaign_Guide",
  "/wiki/The_Essential_Atlas",
  "/wiki/Wizards.com",
  "/wiki/Message_to_Spacers_8",
  "/wiki/Everything_You_Always_Wanted_to_Know_about_the_Nightsisters_but_Were_Afraid_to_Ask",
  "/wiki/Star_Wars_Insider_122",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Star_Wars:_Edge_of_the_Empire_Core_Rulebook",
  "/wiki/StarWars.com",
  "/wiki/Barely_Tolerable:_Alien_Henchmen_of_the_Empire",
  "/wiki/The_Rebel_Bruiser",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/Category:Audio_files_of_Tyber_Zann",
  "/wiki/Category:Images_of_Tyber_Zann"
 ]
}