{
 "name": "Tybert_Capucot",
 "display_name": "Tybert Capucot",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Captain Tybert Capucot was a Human male Imperial officer onboard the Imperial customs ship, Assessor, that was in service around The Pit shortly before the Battle of Yavin.\nCapucot and a heavily armed boarding party boarded the Millennium Falcon and searched the ship for spice. Han Solo was running the spice for Jabba Desilijic Tiure from Kessel to Tatooine, but actually jettisoned the spice in fear that he and Chewbacca would be arrested and the Millennium Falcon impounded. He also had a group of children he had rescued from the Ylesian spice colonies after the Rebel raid. Capucot and the search team failed to find any spice. However, due to Solo's heroism, Capucot decided to escort him to Corellia where he would drop the children off. This kept Han from returning to the coordinates where he had jettisoned the spice in order to pick it up.\nRebel Dawn author A. C. Crispin auctioned off the name of Capucot's character when writing the novel, the proceeds going to the Science Fiction and Fantasy Writers of America Emergency Fund, an insurance fund for freelance writers. Two fans pooled their money to win the auction, and Crispin created the name Tybert Capucot as a takeoff of both their names.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Assessor_(Immobilizer_418_cruiser)",
  "/wiki/The_Pit_(asteroids)",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Ylesia/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Rebel_Dawn",
  "/wiki/A._C._Crispin",
  "/wiki/Jedi_Council_Forums"
 ]
}