{
 "name": "Tyger",
 "display_name": "Tyger",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gold"
     ]
    }
   ]
  }
 ],
 "content": "Tyger was a male Wookiee who operated a nightclub on the planet Cularin during the waning years of the Galactic Republic. Circa 31 BBY, a group of freelance agents spoke to Tyger during the course of an investigation to locate the Human Selima DeWitt, an acquaintance of the Wookiee.\nTyger was a male Wookiee who lived during the waning years of the Galactic Republic on the planet Cularin, where he owned and operated the nightclub Tyger Burning Bright in the platform city Bayonard. He was an acquaintance of the Human Selima DeWitt, the daughter of Davin DeWitt, Bayonard's Baron Administrator, and Selima often visited Tyger in his club, or elsewhere if the club was not open.\nCirca 31 BBY, Selima joined the Bark Lovers' Alliance, a Cularin-based environmental group, and left Bayonard to establish a shop in the city Gadrin with her boyfriend, Percival Vale, and the Cerean Higgie Sethven. However, she did not tell her father where she was going, and he eventually hired the Heroes of Cularin, a group of freelance agents who operated in the Cularin system, to find her. Davin provided the agents with a list of Selima's known contacts, which included Tyger, and, during the course of their investigation, the agents traveled to Tyger's club to ask the Wookiee about Selima. Tyger told them that he had heard that Selima had joined the Bark Lovers' Alliance and was living in Gadrin. The agents subsequently traveled to Gadrin and located Selima.\nTyger was fond of Selima DeWitt, and he was worried when she disappeared and joined the Bark Lovers' Alliance. While he wanted to help look for her, he was unable to do so because he had to run his nightclub. He had gold-colored hair.\nTyger was created by Megan Robertson and appeared in the 2001 roleplaying adventure Find the Lady, a supplement that formed part of the Trade War trilogy of the Living Force campaign. In the adventure, the player-characters roleplay as the Heroes of Cularin, and, if they travel to Tyger's club when it is not open, they knock on the door and Tyger answers it personally. If the players later inform Tyger of any of their findings in their search for Selima, he is very grateful to them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookiee/Legends",
  "/wiki/Amanda_Lucas",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tyger_Burning_Bright",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Human/Legends",
  "/wiki/Selima_DeWitt",
  "/wiki/Platform_city",
  "/wiki/Bayonard",
  "/wiki/Davin_DeWitt",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/Bark_Lovers%27_Alliance",
  "/wiki/Natural",
  "/wiki/City/Legends",
  "/wiki/Gadrin",
  "/wiki/Percival_Vale",
  "/wiki/Cerean/Legends",
  "/wiki/Higgie_Sethven",
  "/wiki/Parent/Legends",
  "/wiki/Cularin_system",
  "/wiki/Gold/Legends",
  "/wiki/Megan_Robertson",
  "/wiki/2001",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Find_the_Lady",
  "/wiki/Trade_War_trilogy",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Roleplaying_game",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}