{
 "name": "Tyla_Jinn",
 "display_name": "Tyla Jinn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Tyla Jinn was a Human female criminal who lived on Naboo during the Galactic Civil War.\nAfter the Battle of Yavin, Tyla Jinn lived in the city of Theed, on Naboo. She was an underworld figure who frequented the Theed Cantina.\nIn 1 ABY, one of her close friends, the smuggler Cal Handro, was shot down above Naboo's moon of Rori. The pilot was transporting a new kind of spice for the Rebel Alliance when he was attacked and crash-landed on the moon. Tyla Jinn, who claimed she ignored everything about the illegal activities of her friend, recruited a group of spacers to rescue the pilot. It appeared that the man had survived the crash but he had vanished in the wilderness. The spacers successfully localized the crash site of Cal Handro's ship, in the Madyn Plains of Rori, but did not find any trace of the smuggler, only Black Sun henchmen also looking for the missing pilot. The spacers managed to collect Handro's datapad and a sample of spice and brought it back to Tyla Jinn. The woman then requested the spacer to bring the spice to her cousin, Doctor Edvar Vang, for analysis. In fact, Vang already knew the existence of that spice but he was too afraid to provide any information. He suggested the spacers to meet his friend Moxxar Krieg on Tatooine but the latter was found murdered at his place. In the meantime, spacers working for Imperial and Rebel officers Jevan Monsul and Veega Madish also searched for the missing pilot on Rori.\nA short time later, a woman by the name Kaila Min, a regular at the Gambling Hall in Narmle, contacted Tyla Jinn and pretended she saw Cal Handro in the wilderness of Rori. The spacers rushed to the pilot's last known location, only to be attacked by Black Sun minions. From their attackers, they obtained the location of the Black Sun base on Rori. The spacers then raided the base but did not find Handro there.\nTyla Jinn later learnt that Cal Handro had met the Bothan information broker Wire on Talus. The Bothan informed the spacers that the smuggler was wanted dead by Trussk, a slavemaster of the Blackscale Clan who considered that Handro was interfering in their business by shipping slaves for a rival Trandoshan clan. The spacers then assaulted Trussk's fortress on Naboo but, again, they did not find Handro.\nFinally, Cal Handro was localized at the Martano estate, on Rori. Tyla Jinn tasked the spacers to encounter the wealthy gambler Tierce Martano to confirm that the missing pilot was safe. However, when they arrived at the estate, the place was besieged by Black Sun enforcers. While the spacers attacked the criminals, Martano sent a distress alert to both the Empire and the Rebel Alliance because he knew that both were also looking for Handro. The adventurers finally managed to kill all Black Sun forces and met Tierce Martano. As the gambler wished to get rid of Handro as soon as possible, he eagerly accepted to give the location of Handro to the spacers. Furthermore, they learnt from Martano that the Empire and the Rebellion were now on their traces and would probably find Handro soon. At that point, the spacers decided to stop following Tyla Jinn's orders and continued tracking the smuggler by joining one of the two factions. Cal Handro was eventually killed in his starship during a space battle between Imperial and Rebel forces in the Naboo system.\nTyla Jinn was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts. The game was shut down on December 15, 2011. Tyla Jinn was added to the game with the first chapter of the \"Secrets of the Syren\" questline, released with the \"Publish 14\", on March 9, 2005. The \"Secrets of the Syren\" story arc was removed from the game with the \"Chapter 1\", published on June 8, 2006, due to the major changes planed for Rori with the introduction of the Battle of Restuss.\nTyla Jinn's appearance was randomly generated, but she always appeared as a Human female.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Theed_Cantina",
  "/wiki/Cal_Handro",
  "/wiki/1_ABY/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Rori/Legends",
  "/wiki/Syren_spice",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Madyn_Plains",
  "/wiki/Black_Sun/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Edvar_Vang",
  "/wiki/Moxxar_Krieg",
  "/wiki/Tatooine/Legends",
  "/wiki/Moxxar_Krieg%27s_house",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jevan_Monsul",
  "/wiki/Veega_Madish",
  "/wiki/Black_Sun_bunker",
  "/wiki/Kaila_Min",
  "/wiki/Narmle_(city)",
  "/wiki/Bothan/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Wire",
  "/wiki/Talus/Legends",
  "/wiki/Trussk",
  "/wiki/Blackscale_Clan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Trussk%27s_house",
  "/wiki/Martano_estate",
  "/wiki/Tierce_Martano",
  "/wiki/Cal_Handro%27s_Warlord_Heavy_Cruiser",
  "/wiki/Naboo_system/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/March_9",
  "/wiki/2005",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Battle_of_Restuss",
  "/wiki/Star_Wars_Galaxies:_Jump_to_Lightspeed",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}