{
 "name": "Tyrans",
 "display_name": "Tyrans",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3638 BBY",
      "Oricon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dread Masters"
     ]
    }
   ]
  }
 ],
 "content": "Tyrans, also known as the \"Tactician of the Masters,\" was a member of the Dread Masters, a group of powerful dark side sorcerers. He wielded a black and white bladed lightsaber.\nTyrans would be one of the more vocal members of the Dread Masters. On Oricon, he would be the master mind behind the tactics used by the Dread Guard and Dread Host forces. When confronted in their Palace, Tyrans treated the encounter like a game, merely using the flooring of his sanctum as a means of making the battle more interesting and using its temporary placement as a means of removing his enemies 'from play'. Tyrans stated upon his 'defeat' that \"It was but a game, the true test is to come.\"\nTyrans was a master of Force attacks; unlike many of his fellow Dread Masters, he did not use any melee strikes. His Thundering Blast, Shock, and Death Mark were all powerful abilities in his arsenal and as such were not to be underestimated. Tyrans' Death Mark would cause his opponent to wither and die over the course of a few seconds, meaning it was one of his most powerful and deadly abilities.\nThe strike team confronted him again in the inner sanctum with the remaining Dread Masters. During the fight, Brontes and Styrak were brought back as apparitions, but were both dispatched by the strike team. Tyrans in particular reeled in shock upon witnessing Styrak's defeat. Soon afterwards, he fell along with the other Dread Masters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3638_BBY",
  "/wiki/Oricon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Dread_Masters",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_sorcerer",
  "/wiki/Color/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Tyrans",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/2013",
  "/wiki/Standard_year/Legends",
  "/wiki/2014",
  "/wiki/3637_BBY",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/3636_BBY",
  "/wiki/Galactic_Standard_Calendar"
 ]
}