{
 "name": "Tyric_(Shaliz%27Na)",
 "display_name": "Tyric  (Shaliz'Na)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Shar'Ack"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Shaliz'Na"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Rebel Alliance"
     ]
    }
   ]
  }
 ],
 "content": "Tyric was a Shaliz'Na from the forested planet of Shar'Ack who loved to play music. He was roughly 2.14 meters tall and very muscular with a twelve-foot wingspan, talon-like fingernails, black hair, and light down covering skin. While living on Shar'Ack, he became an alcoholic, most probably due to the fact that the planet produced a ready supply. Preferring the chemically-propelled weapons of his home planet over laser weapons used by the galaxy at large, he generally carried two slugthrowers and a mini-submachinegun at all times.\nWhen he met with Kelly Vermillion he was still very much an alcoholic, and had a rather large deathwish due to his inability to shake the habit. Kelly and others helped put him on the course to recovery, but he knew only he could beat the habit entirely. He was known to risk everything, bar his friends, for anything he considered art and would often accept paintings, sculptures, and other ornamental objects instead of credits for payment of his performances. Whenever he could, he would try to compose music and enjoyed listening to other musicians.\nHe once played in a bar called Maizie's on the planet Mandrine when Kronus and his goons entered and caused a brawl. Luckily he noticed when a thermal detonator was dropped by one of the men who had just been shot dead and, before it could explode, he picked it up and threw it at Kronus causing his death.\nAfter that, he and the rest of Kelly's crew went to the spice mines of Kessel, where they acquired the Long Shot, which they rechristened the Menagerie in honor of the group. Tyric eventually overcame his alcohol problem, and his music sweetened as a result.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tyric_(Imperial)",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Shar%27Ack",
  "/wiki/Shaliz%27Na",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Polyhedron_59",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Slugthrower/Legends",
  "/wiki/Kelly_Vermillion",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Maizie%27s",
  "/wiki/Mandrine/Legends",
  "/wiki/Kronus",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Menagerie",
  "/wiki/Polyhedron",
  "/wiki/The_New_Rogues_Gallery:_Unsung_Heroes_of_the_Rebellion",
  "/wiki/The_Living_Galaxy:_Flawed_Gems_Shine_The_Brightest",
  "/wiki/Polyhedron_63"
 ]
}