{
 "name": "Tyrn_Jiton",
 "display_name": "Tyrn Jiton",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Fenves"
     ]
    },
    {
     "name": "Born",
     "values": [
      "20 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "Tyrn Jiton was a male Devaronian who operated as a bounty hunter within the Borderland Regions of the galaxy during the first years of the New Republic in order to fund his gambling expenses. Jiton also perpetrated kidnappings, selling his victims to either the Galactic Empire or crime lords. For this reason, he ran afoul of the New Republic Intelligence Service, who put out a warrant for his arrest as soon as they discovered his nefarious activities.\nTyrn Jiton, a Devaronian male, was born on the planet Fenves in 20 BBY. Having expensive tastes as an adult—including gambling—he became a bounty hunter during the time of the Galactic Empire so that he could earn enough money to satisfy his penchants. Jiton affiliated himself with the Bounty Hunters' Guild, an ancient institution that dominated the bounty hunting profession, and as a hunter, he was known to be selective about the targets he tracked. At some point, the tip of his left horn was severed. Jiton's taste for gambling led to loosing fortunes of wealth on seven different occasions, which earned him a reputation within the Bounty Hunters' Guild as an oddball and he received a mention in the Guilds' handbook, in a passage by the hunter Arack Dostryt.\nAfter the creation of the New Republic in 4 ABY, Jiton was active in the Borderland Regions, an area of the galaxy bordering both Imperial and Republic space. During this time, he kidnapped agents of the New Republic and sold them to the Empire. Jiton also kidnapped other individuals to sell to either the Empire or crime lords, achieving remarkable success at this task. The New Republic did know that a bounty hunter was behind these kidnappings, but they were unaware of the hunter's identity until they captured an Imperial Star Destroyer.\nGeneral Airen Cracken of the New Republic Intelligence Service then composed a detailed report on Jiton. He also issued a warrant for his arrest on charges of theft, kidnapping and murder, and offered a 12,000 credit bounty on Jiton. Following the issuing of Cracken's report, Jiton piloted a Firespray-31-class patrol and attack craft and was considered dangerous. By 7 ABY, the Devaronian had escaped from New Republic agents and was last seen in the Gantonnerre system before disappearing from Cracken's sights.\nJiton used his bounty hunting career as a means to support his lifestyle of high-stakes gambling and jamboree, which commonly included illegal activities. When hunting, he preferred stealth and ambush over direct confrontation with his target, to the point that his prey was frequently unaware of Jiton's presence. Whenever Jiton was asked to kill, he took pride in using only one shot to eliminate the target.\nJiton was a non-Force-sensitive Devaronian who could be identified because he had lost the tip of his left horn. He had honed several of his skills, including tracking, repairing technology, and piloting. He was also a proficient brawler. At some point between the period between 0 ABY and 4 ABY and 7 ABY, he also increased his ability to hide.\nDuring the years of the Empire, Jiton used both a blaster pistol and a blaster rifle, as well as grenades, a thermal detonator, a combat knife, and a neurostaff. He wore partial armor and carried with him syntherope and a comlink. His gear also included MCI-100 magnacuffs and a MCI-200 magnaharness, but he stopped using those two items after the Battle of Endor.\nTyrn Jiton was first mentioned in Wanted by Cracken, a 1993 role playing sourcebook for West End Games' Star Wars: The Roleplaying Game, which detailed enemies of the New Republic. The book was written by Louis J. Prosperi and included an image of Jiton drawn by Rob Caswell. The 1994 role playing sourcebook Galaxy Guide 10: Bounty Hunters included a new image of Jiton by David Plunkett, and updated role-playing game statistics that specified his skills. However, the changes from Wanted by Cracken to Galaxy Guide 10 reduced his ability to parry brawling attacks, something very uncommon following the rules of the role-playing game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Fenves",
  "/wiki/20_BBY/Legends",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Trans-Hydian",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Bounty_Hunters_Guild_Handbook",
  "/wiki/Arack_Dostryt",
  "/wiki/4_ABY/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Operative",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/General/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Pilot/Legends",
  "/wiki/Firespray-31-class_patrol_and_attack_craft/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Gantonnerre_system",
  "/wiki/Death/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Knife/Legends",
  "/wiki/Neurostaff",
  "/wiki/Armor/Legends",
  "/wiki/Syntherope",
  "/wiki/Comlink/Legends",
  "/wiki/MCI-100_magnacuffs/Legends",
  "/wiki/MCI-200",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/Roleplaying_game",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Louis_J._Prosperi",
  "/wiki/Rob_Caswell",
  "/wiki/1994",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/David_Plunkett",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Wizards.com",
  "/wiki/Saga_Edition_Web_Enhancement:_Devaronians",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Bounty_Hunter_Code:_From_the_Files_of_Boba_Fett",
  "/wiki/Category:Images_of_Tyrn_Jiton",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Malindin_Gevarak",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/0_BBY/Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game_(first_edition)",
  "/wiki/Galaxy_Guide_1:_A_New_Hope",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/Galaxy_Guide_5:_Return_of_the_Jedi"
 ]
}