{
 "name": "Ubis_Reendorr",
 "display_name": "Ubis Reendorr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chirq Council"
     ]
    }
   ]
  }
 ],
 "content": "Ubis Reendorr was a male Rodian smuggler and information broker from Corellia.\nBy the time following the Battle of Yavin, underboss Ubis Reendorr was the leader of the ryll smuggling ring of the Chirq Council, best known as the Red Circle Gang. The ryll smugglers transported the spice onto Corellia on small ships and unloaded it at a bunker in the Vella plains where they refined the spice. Smugglers working under his orders included Ladonna Poe, who served as the contact of the ryll smuggling ring with Vuul Sarlin and his group of spice dealers in Kor Vella, as well as Jaryn Minoze and Oret Sturm.\nAt some point, Reendorr was contacted by a Rebel Alliance agent trying to learn the identify of an Imperial officer by a holographic image. Reendorr saw it as a chance to settle some of his own business and asked the agent to return a shipment of of B1-Series battle droids stolen from him by Shalera the Hutt in exchange. Reendorr did not think the Rebel could get the job done, but the agent succeeded and brought the shipment to him. However, he had learned from the manifests for the shipment, that it was never hijacked and that he, in fact, stole it from the rightful owner. Such detail was no importance for Reendorr, who kept his part of the bargain and provided the Rebel with the identity of the Imperial - Grand Admiral Andal Sait of the Imperial-class Star Destroyer Blackguard. The Rebel needed a fragment of the Codex of Tython kept by Sait, but had no idea how to get aboard the Star Destroyer. Reendorr offered him his help and, for a reasonable payment, smuggled the Rebel aboard inside a cargo container with a shipment of bacta. He also made sure that the agent would be contacted by Chief Engineer Olum, whom Reendorr has dealt with before.\nIn 1 ABY, the Corellian Security Force started an investigation against the ryll smuggling ring following the increase of spice traffic in Kor Vella. A spacer working for Lieutenant Cope questioned a spice addict known as Menchi Lerann and the man revealed that he bought his ryll from Vuul Sarlin. The spacer later interrogated Sarlin who was forced to reveal everything he knew about the ryll smuggling ring, including the location of the Ryll Smuggler Bunker. Lieutenant Lon Cope, who has been trying to crack the organization for some time, used his man inside the organization to arrange the meeting between Reendorr and an Alliance operative looking for a large missing shipment of ryll. The two met at a small cantina in Kor Vella, but after the operative had asked Reendorr about the shipment, the Rodian gave the sign to the Red Circle members, who prepared to ask the Rebel some questions in turn - the hard way. The Rebel, however, managed to defeat the thugs and, after he took from Reendorr the access card to the Red Circle bunker, departed. CorSec forces finally raided the Ryll Smuggler Bunker. A spacer working for Lieutenant Cope fought and killed underboss Ubis Reendorr. Thanks to Reendorr's access code, the CorSec was able to access the Red Circle Base nearby. The CorSec investigation eventually led to the disbandment of the Chirq Council.\nUbis Reendorr appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Ubis Reendorr was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Chirq_Council",
  "/wiki/Smuggler/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Lon_Cope",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Ryll/Legends",
  "/wiki/Ryll_Smuggler_Base",
  "/wiki/Vella_plains",
  "/wiki/Ladonna_Poe",
  "/wiki/Vuul_Sarlin",
  "/wiki/Kor_Vella/Legends",
  "/wiki/Jaryn_Minoze",
  "/wiki/Oret_Sturm",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Shalera",
  "/wiki/Hutt/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Andal_Sait",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Blackguard_(Star_Destroyer)",
  "/wiki/Codex_of_Tython",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Olum",
  "/wiki/Corellian_Security_Force",
  "/wiki/Spacer/Legends",
  "/wiki/Menchi_Lerann",
  "/wiki/Kor_Vella_Cantina",
  "/wiki/Red_Circle_Base",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/Agents_of_Deception",
  "/wiki/Template:SWGTCG",
  "/wiki/Threat_of_the_Conqueror",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}