{
 "name": "Ubrik_Adelhard",
 "display_name": "Ubrik Adelhard",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "graying"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Anoat sector fleet",
      "Stormtrooper Corps",
      "Anoat sector fleet",
      "Ubrik Adelhard's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "Ubrik Adelhard was a human male Moff of the Galactic Empire who served as the governor of the Anoat sector during the Galactic Civil War. Upon hearing of Emperor Sheev Palpatine's demise at the Battle of Endor, Adelhard locked down his sector, establishing the Iron Blockade and isolating his citizens from news of the Empire's defeat. With the help of Commander Bragh and his Purge Troopers, Adelhard started killing those who opposed the status quo or dared to propagate so-called anti-Imperial rumors or people who wanted to rebel against Adelhard.\nA male human, Ubrik Adelhard started as a mere stormtrooper in the armed forces of the Galactic Empire. A true believer in the need for a strong Empire to keep the galaxy from descending into chaos, he gradually rose up the ranks. Years prior to the Battle of Yavin, Adelhard served as a junior advisor in the Imperial Military. When Imperial forces received word of a base of dissidents on Anoat, the sector capital of the Anoat sector, Adelhard ordered his forces to gas the planet, transforming the city-world into a toxic waste dump. Many citizens believed that the incident was the result of an industrial accident, though a few were privy to the truth. Eventually, Adelhard became one of the rare stormtroopers to become a general. At some point before the Battle of Endor, Adelhard was made a Moff and became the governor of the Anoat sector. He had also married a woman who had ended up being killed by the Kouhun, a secretive order of assassins.\nAfter the Battle of Endor, a cataclysmic defeat for the Empire in which the Alliance to Restore the Republic destroyed the DS-2 Death Star II Mobile Battle Station and the Emperor, Sheev Palpatine, was killed, reports of the Empire's defeat began to circulate across the galaxy. The Empire claimed that these reports were lies propagated by the Rebel Alliance. When Adelhard learned that the Emperor had indeed been killed, he locked the Anoat sector down with the Iron Blockade and said that anyone who challenged the Empire in the sector would have to answer to him.\nThe Iron Blockade led to an uprising against the Empire, one carried out by a collection of resistance fighters, bounty hunters, smugglers, and more. To combat this uprising, the Empire used Purge Troopers led by Commander Bragh, who reported to Adelhard. Adelhard had a chamber within the prime tower on the Tibanna gas mining colony of Cloud City, located on the planet Bespin. In the months following the Battle of Endor, Lobot hired the pirate Kars Tal-Korla and his companions to capture the Imperial collaborator Borgin Kaa in order to extract an access code needed to open an access hatch leading to Adelhard's personal quarters. Once the hatch was open, Lobot and an intrusion team planned to capture the Governor. Though Adelhard escaped, the planet was soon liberated by the Uprising.\nBy the time of the Battle of Jakku, Adelhard's Imperial forces had crumbled under Lando Calrissian's siege. Lando and Lobot led a joint force of Bespin Wing Guards and New Republic soldiers as they mopped up the remaining Imperial holdouts in Cloud City. Calrissian managed to convince a dozen Imperials holed up in the Bolo Tanga room to surrender by telling them that Adelhard's story about Palpatine was a lie.\nAdelhard was a human male with black hair, a full beard, and fair skin. He was a strong supporter of the Galactic Empire and was willing to lock off his entire sector in order to punish those who reported the truth about the Battle of Endor. A man of humble beginnings, he was opposed to luxury and pomp.\nAdelhard is a character who appears in the mobile game Star Wars: Uprising, which was released by Kabam on September 10, 2015. His first name was revealed in the 2018 reference book Star Wars: Scum and Villainy: Case Files on the Galaxy's Most Notorious, written by Pablo Hidalgo.\nThe governor was designed by Brian Matyas. One of Matyas' first designs had Adelhard wearing a long cape and an armored chest plate similar to Darth Vader's, but this did not pass the approval process.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Ubrik_Adelhard",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Anoat_sector_fleet",
  "/wiki/Ubrik_Adelhard%27s_Imperial_remnant",
  "/wiki/File:SW_Uprising_Teaser_Trailer_audio.ogg",
  "/wiki/Moff",
  "/wiki/Governor",
  "/wiki/Anoat_sector",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Death",
  "/wiki/Battle_of_Endor",
  "/wiki/Sector",
  "/wiki/Iron_Blockade",
  "/wiki/Commander",
  "/wiki/Bragh",
  "/wiki/Purge_Trooper_(Anoat_sector)",
  "/wiki/Stormtrooper",
  "/wiki/Imperial_Army",
  "/wiki/The_galaxy",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Imperial_Military",
  "/wiki/Anoat",
  "/wiki/Capital",
  "/wiki/Gassing_of_Anoat",
  "/wiki/Planet",
  "/wiki/City",
  "/wiki/General",
  "/wiki/Marriage",
  "/wiki/Ubrik_Adelhard%27s_wife",
  "/wiki/Kouhun_(order)",
  "/wiki/Assassin",
  "/wiki/Endor",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Galaxy",
  "/wiki/Propaganda",
  "/wiki/Uprising",
  "/wiki/Bounty_hunter",
  "/wiki/Smuggler",
  "/wiki/Governor_Adelhard%27s_chamber",
  "/wiki/Prime_tower",
  "/wiki/Tibanna",
  "/wiki/Mining",
  "/wiki/Cloud_City",
  "/wiki/Bespin",
  "/wiki/Lobot",
  "/wiki/Kars_Tal-Korla",
  "/wiki/Borgin_Kaa",
  "/wiki/Liberation_of_Cloud_City",
  "/wiki/Battle_of_Jakku",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Bespin_Wing_Guard",
  "/wiki/New_Republic_soldier",
  "/wiki/Bolo_Tanga_room",
  "/wiki/The_Smuggler",
  "/wiki/Tam_Bastion",
  "/wiki/Star_Destroyer",
  "/wiki/Bridge_(starship)",
  "/wiki/Hair",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/2018",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Brian_Matyas",
  "/wiki/Category:Images_of_Ubrik_Adelhard",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Darth_Vader_(2020)_14",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_160",
  "/wiki/On_the_Go!",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/The_Art_of_Star_Wars:_Uprising",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Battle_of_Endor_and_the_Fall_of_the_Empire",
  "/wiki/June_24",
  "/wiki/2016",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/January_22"
 ]
}