{
 "name": "Ucce",
 "display_name": "Ucce",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire Reborn"
     ]
    }
   ]
  }
 ],
 "content": "Lady Ucce was a member of the Empire Reborn, which was lead by the Dark Jedi Hethrir, the former Imperial Procurator of Justice. She was rich and powerful, owning vast resources including starships and having several followers and slaves. She was served by an individual with starburst protuberances.\nDuring a meeting with Hethrir in 14 ABY, Ucce was present along with Lords Qaqquqqu and Cnorec. When Hethrir suggested sending the then three-year old Anakin Solo back to where he came from, she suggested memory wiping Anakin and then putting him back, before concluding by saying that Hethrir was so wise. Like Qaqquqqu and Cnorec, she auctioned for children whom were held captive on Hethrir's Worldcraft. On that meeting, she won the auction and the right to sell them as slaves to the Imperial loyalists in Hethrir's trade gathering at Crseih Station, which supported his achievements.\nDuring the meeting, she and Qaqquqqu witnessed Hethrir use the Force to murder Cnorec for disagreeing with him. She was later present during a ceremony to sacrifice Anakin Solo to Waru at Crseih Station.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Empire_Reborn",
  "/wiki/Lord/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Hethrir",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Procurator_of_Justice",
  "/wiki/Lady_Ucce%27s_starship",
  "/wiki/Slavery/Legends",
  "/wiki/Ucce%27s_servant",
  "/wiki/14_ABY/Legends",
  "/wiki/Qaqquqqu",
  "/wiki/Cnorec",
  "/wiki/Anakin_Solo",
  "/wiki/Worldcraft",
  "/wiki/Crseih_Station",
  "/wiki/The_Force/Legends",
  "/wiki/Waru",
  "/wiki/The_Crystal_Star",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}