{
 "name": "Ufsa%27mak%27ro",
 "display_name": "Ufsa'mak'ro",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Ascendancy military",
      "Chiss Expansionary Defense Fleet",
      "Ufsa family",
      "Ascendancy military",
      "Chiss Expansionary Defense Fleet",
      "Chiss Expansionary Defense Fleet",
      "Ufsa family"
     ]
    }
   ]
  }
 ],
 "content": "Ufsa'mak'ro, better known by his core name Samakro, was a Chiss male who served as the first officer of Senior Captain Mitth'raw'nuruodo aboard the Chiss Ascendancy cruiser Springhawk. He held the rank of merit adoptive of the Ruling Ufsa family.\nSamakro suspected Caregiver Mitth'ali'astov of being a spy for Syndics of the Mitth family, particularly Mitth'urf'ianico. He believed anyone trying to take down Thrawn would have no qualms taking down the entire crew of the Springhawk with him. During the Nikardun campaigns, Samakro tried to prove his theory that Thalias was a spy by telling the caregiver a false but plausible-sounding explanation for some of Thrawn's decisions. Samakro believed Thalias would relay that false information to the Syndicure, who would then make it public, and the information would supposedly have only been able to come to them through Thalias. Syndic Thurfian had indeed attempted to recruit Thalias to be his personal spy against Thrawn, but she refused and escaped his blackmail by becoming a Trial-born of the Mitth.\nA male Chiss, Samakro had great pride in his service to the Expansionary Defense Fleet. Samakro often held private reservations, objections, frustrations or even anger towards his commanding officer Thrawn and his tactics. However, Samakro was a very disciplined Chiss officer, and enforced obedience to protocol and the chain of command to his subordinates. When the Springhawk was transferred back to Thrawn's command just before the attack on the Paataatus, Senior Commander Plikh'ar'illmorf approached Samakro to coordinate a complaint to the Defense Hierarchy Council about being undercut on the eve of battle. Samakro privately shared Kharill's anger at being snubbed, but knew no good would come of anything but their utmost behavior and loyalty to Senior Captain Thrawn. Samakro had a strong dislike for family politics, believing it always led to disaster when it penetrated Fleet business.\nUfsa'mak'ro first appeared in Timothy Zahn's 2020 novel Thrawn Ascendancy: Chaos Rising, the first installment of Zahn's Star Wars: The Ascendancy Trilogy. In Chaos Rising, Samakro is a secondary character, and one from whose point of view events were often described.\nIn the dramatis personae of Chaos Rising, Samakro is listed as a merit adoptive of the Ufsa family. In its April 2021 sequel, Thrawn Ascendancy: Greater Good, Samakro is listed in the dramatis personae as having the rank of cousin in the Ufsa family. However, Thrawn Ascendancy: Lesser Evil, the Ascendancy Trilogy's November 2021 conclusion, again lists Samakro as an Ufsa merit adoptive in its dramatis personae. Neither Chaos Rising nor Greater Good makes any reference to Samakro's rank within his Ufsa family in their body of text. Both novels' only mention of Samakro's family rank are in their corresponding dramatis personae. This article assumes Samakro's listing as cousin in Greater Good was erroneous.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Ascendancy_military",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Ufsa_family",
  "/wiki/Core_name",
  "/wiki/Executive_officer",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Cruiser",
  "/wiki/Springhawk",
  "/wiki/Merit_adoptive",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Caregiver",
  "/wiki/Mitth%27ali%27astov",
  "/wiki/Spy",
  "/wiki/Syndic",
  "/wiki/Mitth_family",
  "/wiki/Mitth%27urf%27ianico",
  "/wiki/Nikardun_campaigns",
  "/wiki/Trial-born",
  "/wiki/Chiss_officer",
  "/wiki/Attack_on_the_Paataatus",
  "/wiki/Senior_Commander",
  "/wiki/Plikh%27ar%27illmorf",
  "/wiki/Defense_Hierarchy_Council",
  "/wiki/Chiss_family#Family_politics",
  "/wiki/Timothy_Zahn",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/April",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Cousin",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/November",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/August_5",
  "/wiki/Del_Rey"
 ]
}