{
 "name": "Ugarte",
 "display_name": "Ugarte",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bespin"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 42 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugnaught"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1 meter"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dirty pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Botrut tribe"
     ]
    }
   ]
  }
 ],
 "content": "Ugarte was a male Ugnaught that lived in Cloud City on Bespin.\nBorn around 42 BBY, Ugarte was a male Ugnaught, and a member of the Botrut tribe. He grew up on Cloud City on Bespin, but never fit in with his culture, not as a member of his tribe, or in the various Ugnuaght gangs that were comprised of members from multiple tribes. From an early age, Ugarte knew what he wanted; to be rich. He found work at a pub that was a known tourist trap that boasted an exotic, alien staff, serving as a busboy for several years. During his time there, he made several contacts, including grifters who would swindle tourists for thousands of credits. Seeing the money to be made, Ugarte struck out on his own.\nHowever, Ugarte was less than successful; while he had the ability to source potential profits, he usually lacked the ability to secure it. As such, he moved from one scam to the other, always burning himself on the deal and generally anyone else involved in the deal. His favorite hangout was K'cri's Cafe, and he considered K'cri Elban to be a friend, which was not reciprocated by the Human. Ugarte was always on the lookout for an investor for one of his schemes, or to unload stolen wares.\nUgarte was a one meter tall Ugnaught with dirty pink skin and white hair. His speech was high-pitched, and he distorted his vowels. Above all else, Ugarte's main goal was to get rich.\nUgarte had connections with the criminal underworld, and was an effective con man.\nUgarte always carried a datapad and a liquor flask.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bespin/Legends",
  "/wiki/42_BBY/Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Botrut",
  "/wiki/Cloud_City/Legends",
  "/wiki/Pub",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/K%27cri%27s_Cafe",
  "/wiki/K%27cri_Elban",
  "/wiki/Human/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Alcohol/Legends",
  "/wiki/Flask/Legends",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin",
  "/wiki/Galaxy_Guide_2:_Yavin_and_Bespin_(Second_Edition)"
 ]
}