{
 "name": "Ujaa",
 "display_name": "Ujaa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Twisted Rancor Trio"
     ]
    }
   ]
  }
 ],
 "content": "Ujaa was a male Bith musician who was the second member of the Twisted Rancor Trio, playing the kloo horn.\nUjaa was hired by Gilthos Uksaris, the founder and manager of the band, as Uksaris scrambled to find musicians to back Elinda, the intended lead singer. Ujaa's recruitment was promptly accompanied by that of his brother, Ujii, establishing the first incarnation of the Twisted Rancor Trio. Friction developed between Elinda and Ujaa as the former found his skills as a musician to be mediocre. When Elinda threatened to quit due to Ujaa's lack of talent, Gilthos fired Ujaa and replaced him with another Bith named Loopa, upsetting Ujii who very soon left the band.\nUksaris would later draft a chronicle of the band titled Guts and Glory: A Chronicle of The Amazing Story of The Twisted Rancor Trio which detailed Ujaa's role in the formation of the band and his subsequent dismissal.\nUjaa, like the other members of the Twisted Rancor Trio, only appear as holograms in the video game Star Wars: Knights of the Old Republic if the player, as Revan finds a package delivered to Gilthos Uksaris in an apartment in the Lower City of Taris. The package, in the form of a security crate, is booby-trapped by a Holo-Sec Corp anti-theft explosive such that for the crate to be opened, the six holoprojectors of the band's members must be activated in order of their recruitment. The player can find the correct order by reading Uksaris's chronicle within a datapad on the desk nearby.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/The_Twisted_Rancor_Trio",
  "/wiki/Musician/Legends",
  "/wiki/Kloo_horn/Legends",
  "/wiki/Gilthos_Uksaris",
  "/wiki/Elinda",
  "/wiki/Ujii",
  "/wiki/Loopa",
  "/wiki/Guts_and_Glory:_A_Chronicle_of_The_Amazing_Story_of_The_Twisted_Rancor_Trio",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Revan/Legends",
  "/wiki/Lower_City_Apartments",
  "/wiki/Lower_City",
  "/wiki/Holo-Sec_Corp",
  "/wiki/Holo-Sec_Corp_anti-theft_explosive",
  "/wiki/Holoprojector/Legends"
 ]
}