{
 "name": "Ula_Vii",
 "display_name": "Ula Vii",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Panatha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Epicanthix"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Intelligence",
      "Imperial Intelligence",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Ula Vii was a male Epicanthix who served as an agent of the Intelligence division during the Cold War between the Galactic Republic and the resurgent Sith Empire.\nBorn on the planet Panatha, Ula Vii joined the Imperial Intelligence of the Sith Empire during the time of the Great Galactic War.\nAround the year 3643 BBY during the Cold War, Vii served his Sith masters by posing as a senior aide in service to the Republic Supreme Commander Stantorrs, reporting to Watcher 3 and subsequently as an acting envoy to an auction held on Hutta by the Bareesh Cartel. However, he along with Jet Nebula were captured by a Mandalorian bounty hunter named Dao Stryver. Stryver kidnapped Vii and Nebula and threatened to kill them if they did not tell him where the remains of the vessel, called the Cinzia, were inside the palace of Tassaa Bareesh. Vii told him and soon after former Republic trooper Larin Moxla and Vii's escorts broke in to where Vii and Nebula were being held. Stryver managed to escape from Moxla and the escorts by blowing up a large hole in the roof and used his jetpack to fly out of the palace.\nAt the end of the fight, Vii was fond of Moxla when her and a group of Vii's escorts rescued him and Jet. They wanted to travel to the mysterious planet because Shigar Konshi had negotiated with the Bareesh that she would let them go if she would get coordinates of the planet. However, it was Dao Strvyer who got the navigation computer, which is why they did not have coordinates. During the flight, Vii helped Moxla to tend her hand that was cut off by Sith apprentice's Eldon Ax lightsaber.\nAfter orbiting the planet, Vii secretly went with Eldon Ax to their master Darth Chratis. He revealed that he was on the side of the Empire, but they showed only contempt. After he revealed to Darth Chratis of what he saw, Vii was granted in return for his loyalty.\nDuring a battle, Vii was able to coordinate and hack the computers of two jet droids so that Nebula had the command. He shot out Vii in an escape pod from the aircraft and disappeared after the battle. Vii was fortunately rescued by another ship. After these events came back to Coruscant, his superiors put him to a division of the data distribution. He was able to speak to Moxla once more, and they promised to stay in touch in the future.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Panatha",
  "/wiki/Epicanthix",
  "/wiki/Gender/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Imperial_Agent",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Great_Galactic_War",
  "/wiki/3643_BBY",
  "/wiki/Sith/Legends",
  "/wiki/Supreme_Commander",
  "/wiki/Stantorrs",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Bareesh_Cartel",
  "/wiki/Jet_Nebula",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Dao_Stryver",
  "/wiki/Cinzia",
  "/wiki/Tassaa_Bareesh%27s_palace",
  "/wiki/Tassaa_Bareesh",
  "/wiki/Republic_trooper",
  "/wiki/Larin_Moxla",
  "/wiki/Jetpack/Legends",
  "/wiki/Sebaddon",
  "/wiki/Shigar_Konshi",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Cho_sun/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Eldon_Ax",
  "/wiki/Sith_lightsaber/Legends",
  "/wiki/Darth_Chratis",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ula_Vii",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}