{
 "name": "Ulbik_Tan",
 "display_name": "Ulbik Tan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Cosmatanic Steppes"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Ulbik Tan was a human male criminal who teamed with the rogue archaeologist Doctor Chelli Aphra in 0 ABY to find a relic below the surface of the suspended mantle known as the Cosmatanic Steppes. Tan, though, backstabbed Aphra and left her dead. He then acquired the relic in a cave and escaped it when it reactivated the carcass of a droid. However Aphra survived and in return shot Tan, taking the relic and leaving his body behind.\nIn 0 ABY, the criminal Ulbik Tan teamed with the rogue archaeologist Doctor Chelli Aphra to acquire a relic located beneath the surface of the Cosmatanic Steppes, a layer of mantle suspended above a gas giant in the Outer Rim Territories. Aphra's assassin droid companion 0-0-0 predicted that criminal would backstab her, and was corrected, as Tan left the rogue archaeologist for dead. Tan then found the relic in the carsass of a large group in a cave under the mantle surface. He pulled the artifact out of the carcass and examined it, only for the massive droid to reactivate.\nTan fled the droid as it fired a laser at him. The criminal managed to get on his speeder to flee his attacker, heading for the cave's exit. He additionally threw a trio of a grenades at the droid and destroyed it, flinging him and his speeder out of the cave's mouth in the process. Coming out unscathed, Tan removed his helmet and got up, remarking that he had been close to death. However, Aphra, who had survived Tan's betrayal, interrupted and fatally shot the criminal. The rogue archaeologist took the relic from her betrayer's body and left on his speeder, leaving the dead Tan laying in the grasslands of the Cosmatanic Steppes.\nAphra returned to 0-0-0 and the rest of her companions, recounting how her unsuccessful partnership with Tan had ended. Despite some initial complications, the relic originally acquired by the criminal was auctioned through the Archaeological Association on the Cosmatanic Steppes, earning the rogue archaeologist some credits. While being tortured by the Mairan Bor Ifriem in 3 ABY, Aphra was subjected to visions of a number of people from her past, including Tan himself.\nUlbik Tan was a human male with light skin and black hair.\nTan wore gray clothing with gray armor on top. His gray helmet had two orange eye holes. The criminal also had a red backpack and face covering.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Tan_(disambiguation)",
  "/wiki/Doctor_Aphra_(2020)_22",
  "/wiki/0_ABY",
  "/wiki/Cosmatanic_Steppes",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Archaeologist",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Death",
  "/wiki/Cave",
  "/wiki/Droid",
  "/wiki/Cosmatanic_Steppes_gas_giant",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Assassin_droid",
  "/wiki/0-0-0",
  "/wiki/Laser",
  "/wiki/Speeder",
  "/wiki/Grenade",
  "/wiki/Helmet",
  "/wiki/Grass",
  "/wiki/Archaeological_Association",
  "/wiki/Credit",
  "/wiki/Torture",
  "/wiki/Mairan",
  "/wiki/Bor_Ifriem",
  "/wiki/3_ABY",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Eye",
  "/wiki/Doctor_Aphra_(2016)_1",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_8",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Screaming_Citadel",
  "/wiki/Mutiny_on_Mon_Cala",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Mon_Cala",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/19_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Doctor_Aphra_(2016)_6",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back"
 ]
}