{
 "name": "Ulbrek_Gostech",
 "display_name": "Ulbrek Gostech",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.5 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Ulbrek Gostech was the Governor of Gacerian during the Galactic Civil War. He lived and ruled from Harmonia, the only city on the planet, and was popular among Gacerites. They called him Gacer'grocinga, meaning \"the leader of artists\".\nGostech was appointed to his position by the Emperor himself. He knew Gostech was the right man to govern a planet of \"loyal artists\". In return, he was fanatically loyal to the Empire.\nGostech was patient and considerate, and he valued, more than anything else, good manners. He loved music and other forms of art, and always dressed properly.\nGostech's ruling philosophy was based on fairness. As long as Gacerites didn't cause any problems, he made sure his troops left them alone. He wanted to maintain good manners even with criminals, such as Rebel prisoners. Gostech wanted to have civilized conversations with them and to learn about their motives. He was usually generous with Corellian whiskey, which sometimes helped him to get some vital information.\nGostech's goal was only to gain reputation as an excellent administrator and an enforcer of Imperial law. Still, his apparently soft touch on the governorship disturbed his superiors and Imperial officers around him, such as Captain Engar Ret. In order to demonstrate he was not too soft-hearted, he had some Rebel prisoners executed and ordered harsh imprisonments to the Gacerites who were found guilty in assisting them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Gacerian",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Harmonia",
  "/wiki/Gacerite",
  "/wiki/Palpatine/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Corellian_whiskey/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Engar_Ret",
  "/wiki/Planets_of_the_Galaxy,_Volume_Two",
  "/wiki/The_Star_Wars_Planets_Collection"
 ]
}