{
 "name": "Uldir_Lochett",
 "display_name": "Uldir Lochett",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "4 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Chestnut brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Amber"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New RepublicNew Republic Defense ForceSpace Rescue Corps",
      "New Republic Defense Force",
      "Space Rescue Corps",
      "New Jedi Order",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Uldir Lochett was a Human male who, as a young man, attempted to join Luke Skywalker's Jedi Praxeum in 22 ABY in the hope of becoming a Jedi and later became a starfighter pilot working with the Space Rescue Corps.\nUldir was the son of shuttle pilots who served in the New Republic Defense Force. As a result of their job, Uldir found himself traveling frequently. He had been to worlds as diverse as Coruscant, Corellia, Malastare, and even Tatooine. As a result of his travels, Uldir was able to speak the Dug language. However, he dreamed of a life of adventure and excitement though his parents wanted him to follow in their footsteps and become a shuttle pilot like them. That was the reason why he dreamed of becoming a Jedi.\nIn his early teens, he stowed away on the Lightning Rod, which was destined for the Jedi Praxeum on Yavin 4. On one morning, Jedi trainees Anakin Solo and Tahiri Veila were unloading supplies from the ship when they came across the box which Uldir had hidden in. Having being found, Uldir introduced himself to his newly found friends and they became close quickly despite Uldir being years older than them.\nIn spite of his optimism, he lacked obvious Force sensitivity—in his own later, rueful opinion, all he had were good hunches, a whisper-like ability to sense when the Force was being used, and a habit of causing trouble. However, Jedi Master Luke Skywalker allowed him to study and work at the Academy because of his enthusiasm and after getting an approval from his concerned parents.\nLater, Uldir stowed away again on the same ship when Anakin, Tahiri and the Kushiban Master Ikrit traveled to Dagobah in order for Anakin to undergo a test to find out if he had any potential for evil at the same cave that Luke Skywalker had gone into decades earlier in 3 ABY. When Uldir emerged from his hiding place, he found himself on the swampy world of Dagobah. He fell into the mud and encountered a swamp slug and was only saved by the intervention of his Jedi friends. Uldir also discovered that Ikrit, whom he had thought of as Anakin's pet, was actually an ancient Jedi Master. After that, they reached the cave where Skywalker had faced his own dark side years earlier. There, Anakin faced the manifestations of his own doubts, though he emerged victorious in the end. Uldir, however, saw nothing in the cave.\nLater that year, the Jedi historian Tionne Solusar discovered that Darth Vader had saved Obi-Wan Kenobi's lightsaber after their duel on the first Death Star in 0 BBY and kept the captured artifact at Bast Castle on Vjun. Since an information broker had sold this information to them, she feared that others may have gotten to it first and quickly informed Master Luke Skywalker who administrated the Jedi Praxeum. Thinking it was just a simple trip and time for training, Tionne allowed Uldir, Anakin, Tahiri Veila and Ikrit to accompany her to Vjun on her personal transport Lore Seeker.\nHaving arrived on Vjun, they discovered another vessel and feared another group had reached it first. Having survived Bast Castle's automated defense systems and booby traps, they discovered the lightsaber in display in a protected alcove. Unfortunately, a group of mercenaries and pirates under a cloaked man named Orloc arrived. Orloc claimed to be a mage who possessed great powers and his henchmen also stole Kenobi's lightsaber.\nIn response, the Jedi pursued Orloc and his henchmen on a chase through Bast Castle. During a confrontation, Orloc easily defeated Ikrit in lightsaber combat since the Kushiban had no lightsaber at all. He also deceived Uldir by claiming to train him all the Force skills he desired. However, the other Jedi managed to rescue Uldir and escape Bast Castle, along with Kenobi's lightsaber and the holocron of the ancient Jedi Master Asli Krimsan.\nDespite having escaped Orloc, he still believed that the Mage would be able to awaken the Force powers within him, which nobody at the Jedi Praxeum on Yavin 4 had been able to do so. Uldir then stole Ikrit's ship Sunrider  and the two Jedi artifacts recovered during the previous adventure at Bast Castle.\nHe eventually found Orloc at an abandoned space station called Exis Station, where Tionne had met Luke years earlier in her search for relics. Having arrived at the derelict space city, Uldir found Orloc whom took the youth as his student. The Mage had already set up his base on the moon and planned to create his own Jedi Order. In reality, Orloc had no Force powers but had actually used high-tech gimmicks to deceive others with demonstrations of so called \"Force power\". Uldir did not realize it.\nTionne, Ikrit, Anakin and Tahiri set out to find Uldir on their transport Lore Seeker and eventually found Exis Station. Having arrived, they tried to tell Uldir that Orloc was a fraud and that he had been deceived. The Mage attacked the four Jedi with his high-tech gimmicks, who fought back by using the Force.\nDuring the duel, Tionne was wounded and Ikrit—who had sworn not to wield a lightsaber until he had found worthy students—made his decision and join Anakin and Tahiri in their fight. Uldir then saw that Orloc was little more than a charlatan who used technology to deceive others with demonstrations of power. Together, the Jedi defeated Orloc, thus removing a threat to the growing New Jedi Order.\nDespite this, he did not qualify to be a Jedi and left the Jedi Praxeum. Uldir then became a pilot with the Space Rescue Corps, but when the Yuuzhan Vong invaded, he chose not to transfer to a combat starfighter unit, claiming that he believed in saving lives rather than taking them. During the Battle of Duro in 26 ABY, he calmly rescued three pilots while under fire from a full flight of coralskippers. As a former Jedi Academy student, his name was on the lists of Jedi supplied to the Peace Brigade when Tsavong Lah called for the extermination of the Order, and he discovered that his new partner, \"Doc\" Dacholder, was a Brigadier with orders to hand him over to the Yuuzhan Vong.\nBut when Dacholder tried to hustle him over to a Peace Brigade ship, Uldir spaced him into hard vacuum. Soon after, he exchanged his ship Pride of Thela for the larger No Luck Required, with which he worked nominally under the New Republic Space and Rescue Corps, though in fact receiving orders directly from Master Skywalker concerning his Great River. With a new crew, this involved rescuing Jedi, and occasionally inserting them into Yuuzhan Vong space, if required. With his small crew, he served bravely, and was instrumental in stopping the young Jedi girl Klin-Fa Gi from falling to the dark side.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/New_Republic/Legends",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Space_Rescue_Corps/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/22_ABY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Tatooine/Legends",
  "/wiki/Dug/Legends",
  "/wiki/Dug_(language)/Legends",
  "/wiki/Lightning_Rod",
  "/wiki/Yavin_4/Legends",
  "/wiki/Anakin_Solo",
  "/wiki/Tahiri_Veila",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kushiban",
  "/wiki/Ikrit",
  "/wiki/Dagobah/Legends",
  "/wiki/Dark_Side_Cave",
  "/wiki/3_ABY/Legends",
  "/wiki/Swamp_slug/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Bast_Castle",
  "/wiki/Vjun/Legends",
  "/wiki/Mission_to_Bast_Castle",
  "/wiki/Lore_Seeker",
  "/wiki/Orloc",
  "/wiki/Exis_Station/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Asli_Krimsan",
  "/wiki/Sunrider_(starship)",
  "/wiki/Nomi_Sunrider",
  "/wiki/Mission_to_Exis_Station",
  "/wiki/Klin-Fa_Gi",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Duro_(Yuuzhan_Vong_War)",
  "/wiki/26_ABY",
  "/wiki/Yorik-et",
  "/wiki/Peace_Brigade",
  "/wiki/Tsavong_Lah",
  "/wiki/Dacholder",
  "/wiki/Brigadier",
  "/wiki/Pride_of_Thela",
  "/wiki/No_Luck_Required",
  "/wiki/Great_River",
  "/wiki/Junior_Jedi_Knights:_Anakin%27s_Quest",
  "/wiki/Junior_Jedi_Knights:_Vader%27s_Fortress",
  "/wiki/Junior_Jedi_Knights:_Kenobi%27s_Blade",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_I:_Conquest",
  "/wiki/Emissary_of_the_Void",
  "/wiki/Databank_(original)",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}