{
 "name": "Ulon_Glost",
 "display_name": "Ulon Glost",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Northern Mustafarian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mensix Mining Facility"
     ]
    }
   ]
  }
 ],
 "content": "Chief Ulon Glost was a male Mustafarian that lived on Mustafar at the time of the Galactic Civil War. He was one of the mining crew chiefs of Mensix Corp, working at the Mensix Mining Facility.\nIn 1 ABY a man-eating tulrus attacked several of Glost's mining teams, wounding several and killing eight miners who had been out on survey missions in the area near the Tulrus Island. The mining crews were afraid of the beast and refused to go out before the problem was taken care of. To ensure the safety of their employees, the Mensix Mining Company decided to hire a hunter.\nGlost was glad to meet an expert hunter at the Mensix Mining Facility who agreed to track down and kill the man-eating tulrus. As the miners didn't know which tulrus was attacking the miners, the hunter had to kill several of the creatures to examine their stomach contents. But when the hunter was still busy examining a dead tulrus, the dangerous beast stuck again at a mining camp. When the hunter arrived at the camp, most of the miners were dead or dying. The beast, a huge and furious tulrus named Foehorn was still near the camp. The hunter attacked Foehorn and after a hard fight, managed to slay the beast.\nWhen the hunter returned, Glost rewarded the hunter with a mounted tulrus spine.\nChief Ulon Glost was a Non-Player Character  in Trials of Obi-Wan, the third expansion for Sony Online Entertainment's MMORPG Star Wars Galaxies prior to the games closure on December 15, 2011. He could be found in the Mensix Mining Facility on Mustafar where he offered the quest The Man-eater to players. This quest required the player to kill several tulruses as well as the tulrus Foehorn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mustafar/Legends",
  "/wiki/Mustafarian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mensix_Mining_Facility",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/Chief/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Mensix_Corp",
  "/wiki/1_ABY/Legends",
  "/wiki/Tulrus/Legends",
  "/wiki/Tulrus_Island/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Dying_miner%27s_camp",
  "/wiki/Foehorn",
  "/wiki/Sony",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/December_15"
 ]
}