{
 "name": "Umwak%27s_nephew",
 "display_name": "Umwak's nephew",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dulok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Less than 1.35 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Duloks"
     ]
    }
   ]
  }
 ],
 "content": "This male Dulok was a member of the tribe ruled by King Gorneesh and the nephew of the tribe's shaman, Umwak. In 3 ABY, when this Dulok was still young, he accompanied his uncle on a mission for Gorneesh. Umwak and his nephew were ordered to delay a group of young Ewoks who were trying to replenish their holy Tree of Light with Light Dust; the Duloks hoped that this interference would allow Gorneesh and his band to reach the weakened tree first and uproot it. Umwak's nephew proved a bright and astute boy on the mission, although his efforts to keep his uncle from ruining the operation with his bumbling failed again and again. Eventually, the youngster and his uncle followed the Ewoks into the Arbo Maze, a thick copse of trees. There, a skirmish with two of the Ewoks left the Duloks entangled in their own net, which had been soaked in sticky ganga sap. Undeterred despite their inability to extricate themselves from the net, the younger Dulok and his elder hobbled to the Tree of Light to warn Gorneesh of the Ewoks' impending arrival. They arrived too late—the Ewoks they had been harassing had already renewed the tree, and the light-sensitive Duloks were fleeing back to the darkness of their swamp.\nThis male Dulok was a member of Gorneesh's tribe of Duloks, who inhabited the Dulok Swamp on the Forest Moon of Endor. His uncle was the tribe's shaman, Umwak. In 3 ABY, the Dulok was not yet an adult. That year, King Gorneesh learned that the Tree of Light, sacred to his enemies, the Ewoks, was weakening and needed its annual replenishment from Ewok Light Dust. Gorneesh thus tasked Umwak with tracking down the Ewok party that had been sent to tend to the tree. This delay would allow Gorneesh and his warriors to reach the ailing tree first and tear it down. Umwak decided to take his young nephew along to help with the mission.\nThe younger Dulok and his uncle traveled through the forest, following the group of young Ewoks to the entrance to the Arbo Maze, a patch of forest so dense that its trees grew together into circuitous passages. When Umwak suggested that he and his nephew enter the maze, stealthily pass the Ewoks by, and set a trap for them, his nephew pointed out that they had no way of navigating the maze successfully. Umwak presented his special glasses, a set of spectacles of the shaman's own invention that he claimed would show them the way through the labyrinth. Despite the younger Dulok's misgivings that the glasses were useless, Umwak's nephew followed his elder into the maze, carrying the sack that held Umwak's trap.\nThe shaman's nephew tried to direct his uncle safely through the maze's obstacles—it seemed that Umwak could not see anything with his special glasses—but he was unable to keep the shaman from colliding with a rock and destroying the goggles. Umwak berated his nephew for the accident but then ordered the younger Dulok to open the sack, revealing a net soaked in ultra-adhesive ganga sap. When Umwak claimed that the sap's stickiness would make it the perfect trap for the Ewoks, his nephew asked how he and his uncle could prevent it from sticking to them instead. Umwak merely said that this concern was the younger Dulok's problem and ordered him to carry the net.\nAfter some time, Umwak and his nephew ran into two young Ewoks—the females Kneesaa and Latara. Umwak ordered his nephew to give chase, and the youngster reluctantly did so. In the ensuing skirmish, the Ewok Kneesaa maneuvered her adversaries so that they collided with one another, trapping both in the ganga sap net. The Ewoks fled, leaving the Duloks in the maze.\nDespite their predicament, the young Dulok and his uncle tottered their way toward the Tree of Light, still entangled in the net, to warn King Gorneesh of the Ewoks' approach. By the time they arrived in the vicinity of the tree, however, the entangled Dulok relatives were met by a stampede of their tribemates in flight; the Ewoks had replenished the tree, and its light was driving the Duloks back to the swamps.\nIn 3 ABY, Umwak's nephew had yet to reach adulthood. He stood shorter than an adult Dulok, but otherwise looked like a typical member of his species, with green fur, a gray facial mask, brown eyebrows, and pink eyes. The young Dulok followed his uncle Umwak's orders dutifully, carrying out the shaman's grunt work, like hefting around a heavy sack. Nevertheless, the youngster was clever and observant and not afraid to point out flaws in his uncle's plans. Despite the constant and demoralizing browbeating Umwak gave him, the younger Dulok cared for his uncle and tried to keep him out of trouble. Despite his tribe's hatred for the Ewoks, the young Dulok seemed reluctant to fight his supposed enemies. He was stealthy, able to stalk a group of Ewoks without their noticing.\nThis young Dulok appears in The Tree of Light, an episode of the Ewoks animated series that originally aired on October 12, 1985. The episode, written by Bob Carrau, provides no name for the character. The character's voice was provided by voice actor Hadley Kay.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Endor/Legends",
  "/wiki/Dulok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/The_Tree_of_Light",
  "/wiki/Gorneesh%27s_tribe",
  "/wiki/King/Legends",
  "/wiki/Gorneesh",
  "/wiki/Shaman/Legends",
  "/wiki/Umwak",
  "/wiki/3_ABY/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Tree_of_Light",
  "/wiki/Light_Dust",
  "/wiki/Tree/Legends",
  "/wiki/Arbo_Maze",
  "/wiki/Skirmish_in_the_Arbo_Maze",
  "/wiki/Net",
  "/wiki/Ganga_sap",
  "/wiki/Dulok_Swamp",
  "/wiki/Standard_year/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Umwak%27s_special_glasses",
  "/wiki/Spectacles",
  "/wiki/Time/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Latara",
  "/wiki/Species/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/October_12",
  "/wiki/1985",
  "/wiki/Bob_Carrau",
  "/wiki/Hadley_Kay",
  "/wiki/Droids%5CEwoks",
  "/wiki/Castaways_of_Endor",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27"
 ]
}