{
 "name": "Unaw_Aharo",
 "display_name": "Unaw Aharo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow-green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Unaw Aharo was a male Bith who served the Jedi Order and the Galactic Republic as a Jedi Knight during the Galactic War with the reconstituted Sith Empire. As a Jedi Padawan, Aharo discovered that the Dark Jedi Callef was leading the native Flesh Raiders of Tython against the Order, and was rescued by another Jedi learner who would become the apprentice of Master Orgus Din. Aharo passed the Jedi Trials not long after the conflict with the Flesh Raiders, and when Grand Master Satele Shan and Master Jaric Kaedan sent Jedi to aid the Republic Military in the Battle of Corellia, Aharo was among those sent to the world.\nAfter passing the Jedi Trials, Aharo was soon recruited by Satele Shan to serve under Orgus Din's former apprentice, the Jedi Knight known as the Hero of Tython, and served as the Hero's lieutenant during the group's mission to stop the corrupted Jedi Master Tol Braga from massacring civilians on the command of the Sith Emperor. After the Hero departed Corellia to confront the Emperor himself, Aharo remained behind with the other Jedi to aid the Republic in their ultimately successful battle for control of the planet. As the Galactic War dragged on, Aharo eventually became a Master.\nA Force-sensitive Bith male, Unaw Aharo was recruited into the Jedi Order and trained in the ways of the Force during the Cold War between the Republic and the Sith Empire. Aharo was training on the Order's homeworld of Tython in 3643 BBY when he encountered a group of armed Flesh Raiders—the planet's hostile natives—in the Tythonian Gnarls region. Contacting Jedi Knight Derrin Weller at the nearby Masters' Retreat, Aharo informed Weller that the Flesh Raiders were emerging from a cave nearby and were attacking the Jedi outpost in the area. However, after ending his holocall, Aharo was captured by Flesh Raiders, who injured the Bith and brought him into the cave before their Human leader.\nThe Dark Jedi, whose name was Callef, mocked Aharo and the Order for their weakness and prepared to execute the injured apprentice, but Aharo was saved by the arrival of another initiate. The second apprentice, who had been sent by Weller to close off the cave, asked Callef to release Aharo, but the Dark Jedi drew his lightsaber before attacking the learner. Shoved to the side, Aharo watched as the apprentice fought back against Callef and ultimately struck down the Dark Jedi in a fierce duel. As the apprentice helped Aharo to his feet, the Jedi Master Orgus Din arrived and escorted Aharo back to the Jedi Temple after collapsing the tunnel with the Force.\nAs the Cold War gave way to a rising escalation between the Republic and Sith Empire, Unaw eventually attained the rank of Jedi Knight and was dispatched to Corellia. Upon arriving, he took shelter with a family of Corellians, only to be exposed by an Imperial spy. The Imperials assaulted their safehouse, determined to kill everyone for sheltering a Jedi. Thankfully, Unaw's saviour, now known as the Hero of Tython, arrived and killed the Imperials. Afterwards, the Bith reminded the Hero of who he was. The Hero then passed Unaw the rendezvous coordinates for all Jedi. There he joined the besieged Jedi leading the defense against the invading Sith Empire and served as part of a strike team to help defeat renegade Jedi Master Tol Braga, who had fallen under the sway of the Sith Emperor.\nThe first deployment of the Jedi troops was to retake a munitions factory in Labor Valley. The Hero ordered their forces to secure any and all munitions for the Republic's use while they thwarted the Sith's attempts to use chemical bombs. Afterward, the Jedi moved on Axial Park. Before the Hero arrived at a museum converted into a command center, Unaw was attempting to mediate an argument between Colonel Brint and Senator Jol Zackin. When the Hero arrived, both parties explained their situation. Brint wanted payback against Imperials for slaughtering medical camps and were rewarded for their efforts. Zackin insisted that their efforts should be concentrated on rescuing Corellian citizens who were being enslaved by the Empire. Brint corrected that the \"citizens\" were being kidnapped from prison, so he designated them criminals. Zackin insisted that his \"citizens\" are innocent until proven guilty in court. The Hero deferred to Unaw for the best course of action. He stated that revenge is not the Jedi way and their efforts are best used helping people. Brint then attempted to offer equipment from Balmorra to augment the Jedi, which an outraged Zackin viewed as bribery. Ultimately, the Hero chose to deploy the Jedi forces to assisting Zackin's cause. They were able to succeed in their mission with no casualties.\nUnaw was later part of General Var Suthra's assault on Imperial command center in an effort to distract them from the Hero's infiltration of Braga's cruiser. When the Hero succeeded in their mission and redeemed Braga to the light side, they contacted Var Suthra as he was in the middle of the assault. Unaw was in combat while this was going on, managing to kill a few Imperial troopers, even causing one to misfire his rocket launcher.\nUnaw was eventually promoted to the rank of Jedi Master. He continued to serve on Corellia, taking time to meditate and get away from battle while seeing the war take a toll on the people. During one of his reprieves, he encountered Republic and Imperial forces secretly planning to crash their ships into the flagships of their respective sides. When he encountered them, they detonated themselves.\nAccording to the titles of the conversation files, Aharo was originally named Benor Unaw, though the name was changed to Unaw Aharo by the time of the game's release.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Callef",
  "/wiki/Flesh_Raider",
  "/wiki/Tython/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Orgus_Din",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Flesh_Raider_uprising",
  "/wiki/Grand_Master/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Jaric_Kaedan",
  "/wiki/Republic_Military/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/Tol_Braga",
  "/wiki/Tenebrae",
  "/wiki/Corellia/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/3643_BBY",
  "/wiki/Tythonian_Gnarls",
  "/wiki/Derrin_Weller",
  "/wiki/Masters%27_Retreat",
  "/wiki/Gnarls_cave",
  "/wiki/Gnarls_Outpost",
  "/wiki/Human/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Duel_in_the_Gnarls_cave",
  "/wiki/Jedi_Temple_(Tython)/Legends",
  "/wiki/Labor_Valley",
  "/wiki/Axial_Park",
  "/wiki/Brint",
  "/wiki/Jol_Zackin",
  "/wiki/Balmorra/Legends",
  "/wiki/Var_Suthra",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Rise_of_the_Hutt_Cartel"
 ]
}