{
 "name": "Unger_Gout",
 "display_name": "Unger Gout",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Khorm"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 22 BBY",
      "Khorm"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Khormai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Warlord Unger Gout was a Khormai Separatist who lived during the Clone Wars. Born on Khorm, he rose to power in the government and took over the planet, giving himself the title of \"Warlord\". By 22 BBY, he had enslaved his species to mine Agrocite for Dooku. During the Battle of Khorm, he, along with Dark Acolyte Asajj Ventress, commanded the droid forces against the Republic troops, even kidnapping Major Kendal Ozzel and CC-3636 in the process, though they later escaped. Gout died when Jedi Master Kit Fisto detonated explosives on Gout's Agrocite cannons, destroying them.\nUnger Gout was born on Khorm and quickly rose to power in the government. He eventually took over and made a deal with Count Dooku to enslave his own people to mine Agrocite for the Separatists on Khorm, giving himself the title of Warlord.\nAround 22 BBY, the Republic launched a full-scale assault on Khorm to halt the mining and production of Agroncite for the Separatist cause. Gout, though, had foreseen their attack and built a Weather-control station in order to create a planet-wide storm so air support could not be utilized by the Republic. During the initial stages of battle Gout managed to escape from Jedi Masters Plo Koon and Kit Fisto on a rail jet. Later, reinforced by Dark Acolyte Asajj Ventress, his droid forces managed to take Major Kendal Ozzel and Commander CC-3636 prisoners. They later escaped, and Gout returned to the Agrocite mine, where he commanded his troops from a distance. Despite having multiple disagreements about the mine's security with Ventress, he reluctantly allowed her to plant explosives in the mine, in case the Jedi managed to penetrate the station's defenses. This ultimately proved the be his undoing, however, as the explosives were activated by Kit Fisto after he escorted the slaves to safety. The explosives reached Gout's Agrocite cannons and his reserve of Agrocite, where he was hiding from the battle, and exploded. While trying to escape the facility, Gout was caught in the ensuing blast and was killed.\nUnger Gout was created for the 2009 In Service of the Republic storyline of the Star Wars: The Clone Wars comic series. The three issues of the storyline were written by Henry Gilroy and Steven Melching and were illustrated by Scott Hepburn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Khorm/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Khormai/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Adaroo",
  "/wiki/Warlord/Legends",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Agrocite/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Battle_of_Khorm/Legends",
  "/wiki/Dark_Acolyte/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Major/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/CC-3636",
  "/wiki/Death/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Agrocite_cannon",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Weather-control_station",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Rail_jet/Legends",
  "/wiki/Commander/Legends",
  "/wiki/2009",
  "/wiki/Star_Wars:_The_Clone_Wars:_In_Service_of_the_Republic",
  "/wiki/Star_Wars:_The_Clone_Wars_(comic_series)",
  "/wiki/Henry_Gilroy",
  "/wiki/Steven_Melching",
  "/wiki/Scott_Hepburn",
  "/wiki/The_Clone_Wars_7",
  "/wiki/The_Clone_Wars_8",
  "/wiki/The_Clone_Wars_9",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}