{
 "name": "Unidentified_shock_trooper_quartermaster",
 "display_name": "Unidentified shock trooper quartermaster",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Coruscant Guard",
      "Coruscant Guard",
      "Galactic Empire",
      "Coruscant Guard",
      "Coruscant Guard"
     ]
    }
   ]
  }
 ],
 "content": "In 19 BBY, the final year of the Clone Wars, a shock trooper quartermaster served as an officer within the Coruscant Guard of the Galactic Republic. Following the end of the war with the death of Separatist Alliance Head of State, General Grievous, the quartermaster, alongside the rest of the Grand Army of the Republic, received Order 66 from Supreme Chancellor Sheev Palpatine to execute the Jedi Order.\nAfter the order's initiation, leading to the Republic's transformation into the Galactic Empire, the shock trooper and personnel from the Coruscant Guard were transported to the cloning planet Kamino. There, the shock trooper escorted Admiral Wilhuff Tarkin to the planet, who had come to assess the clone army's continued service in the newly formed Imperial Military.\nSometime prior to 19 BBY, the clone trooper was born on the planet Kamino, created from the DNA of Bounty hunter Jango Fett, the genetic template for the clone army. After his creation, in 19 BBY, the clone served as a shock trooper quartermaster and officer in the Galactic Republic's Coruscant Guard and Grand Army of the Republic, where he participated in the Clone Wars against the Confederacy of Independent Systems. Following the end of the war, which came from the deaths of Separatist Head of State and Supreme Martial Commander, General Grievous, on the planet Utapau, and the Executive Separatist Council on the planet Mustafar, the shock trooper and the rest of the clone army were ordered by Supreme Chancellor Sheev Palpatine to execute the Jedi Order in accordance with Order 66.\nWith the beginning of the Great Jedi Purge, the quartermaster and a large detachment from the Coruscant Guard were transported to Kamino with the Republic Army. Not long after their arrival on Kamino, the quartermaster led several shock troopers through landing bay one-tac-one, one of the hangars in Tipoca City on the planet, where they encountered Clone Force 99, who arrived aboard the Omicron-class attack shuttle Marauder. After Clone Force 99 arrived, the clone commando Sergeant, \"Hunter,\" expressed confusion on the Coruscant Guard's presence on Kamino, to which his squad member \"Wrecker\" inquired as to the events they were not aware of after hearing a security lockdown annoucement. In response, the quartermaster, clarifying upon Hunter's request, explained that the Separatist leadership had been killed, resulting in the fall of the Confederacy and the end of the Clone Wars.\nAfter explaining the events, the shock trooper quartermaster retrieved the lightsaber of a deceased Jedi, whose body was carried through the hangar by two clone troopers. Alarmed by the situation, the clone officer inquired if there was an issue with the clone commando squad, to which Hunter explained that there were none, stating their return to their barracks. In immediate response, the shock trooper informed them to be quick, as there was to be a mandatory general assembly at 1500 hours. Sometime after, during the assembly, the Grand Army of the Republic witnessed a special session in the Galactic Senate, held by Chancellor Palpatine, who proclaimed the Republic's transformation into the Galactic Empire and his new title of Galactic Emperor.\nAfter some time, the quartermaster escorted Admiral and Governor Wilhuff Tarkin to Kamino aboard his Nu-class attack/transport shuttle alongside three other shock troopers. Tarkin sought to assess the needs and costs of the Imperial Army. Following a scuffle in the cafeteria between Clone Force 99 and other clone troopers, Clone Force 99 was summoned by Admiral Tarkin. Assuming that they were being reprimanded, they passed the shock trooper quartermaster and two other shock troopers in a corridor. The quartermaster turned and informed them to head to the Tipoca City Training Facility as Tarkin sought to view their performance.\nWhile Clone Force 99 was returning from a mission to Onderon, the quartermaster arrived at the barracks of the unit with several standard Imperial clone troopers to remove the squad's gear to the hangar. While opening the door, the quartermaster bumped into the enhanced young clone Omega and AZI-3. The quartermaster informed Omega that she was not authorized to be there, and ordered the other clones to pack up the squad's gear. Afterward, the quartermaster stated that Omega was going to go with him and grabbed her, but AZI intervened by grabbing the quartermaster's arm and stated that as medical personnel, they would not follow the quartermaster. The shock trooper quartermaster then told the droid not to touch him, and stunned AZI, shutting it down. The quartermaster then grabbed Omega and proceeded to move her.\nShortly after Clone Force 99 landed in a hangar, a contingent of shock troopers stealthily surrounded the unit by using the crates and storage in the area. Once the shock troopers surrounded the squad, the shock trooper quartermaster moved in alongside Admiral Tarkin. Clone Force 99 was subsequently imprisoned in a holding area, but eventually managed to escape with Omega despite one member, CT-9904, remaining loyal to the Empire and leading a group of other shock troopers in a skirmish at the hangar.\nAs a clone of the bounty hunter Jango Fett, the shock trooper quartermaster was a human male who stood at 1.83 meters tall. He disliked being touched by droids and did not hesitate to fire on AZI-3 when the medical droid attempted to stop him from arresting Omega. As an officer of the Galactic Empire, the clone had no regard for the property of the Kaminoan government, having damaged one of their droids while arresting Nala Se's medical assistant.\nThe clone was an officer, and as such had administrative duties on Kamino. He also possessed leadership capabilities. As a quartermaster, he oversaw supply logistics.\nThe clone shock trooper quartermaster was equipped with Phase II clone trooper armor during his active service, which donned the red markings of the Coruscant Guard, albeit a brighter red. When the quartermaster escorted Admiral Tarkin, he was equipped with a DC-15A blaster carbine. As an officer, he made use of a red left-shoulder pauldron, and often used a datapad. Later in his Imperial service, the quartermaster equipped himself with a holder on his right thigh for a DC-17 hand blaster. The quartermaster's Phase II helmet was slightly damaged near the mouth area.\nThe shock trooper quartermaster appeared, albeit unnamed, in the premier episode for Star Wars: The Bad Batch, titled \"Aftermath.\" The episode aired in 2021, and the clone was voiced by Dee Bradley Baker. The shock trooper remained unnamed in the script, with it identifying him as \"Shock Trooper Quartermaster,\" as confirmed by Lucasfilm Story Group executive Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Coruscant_Guard",
  "/wiki/Galactic_Empire",
  "/wiki/19_BBY",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Officer",
  "/wiki/Battle_of_Utapau",
  "/wiki/Death",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Head_of_State",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Quartermaster",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Order_66",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Death_penalty",
  "/wiki/Jedi_Order",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_shock_trooper",
  "/wiki/Planet",
  "/wiki/Admiral",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Imperial_Military",
  "/wiki/File:Coruscant-shock-troopers.png",
  "/wiki/Clone_trooper",
  "/wiki/Reproduction",
  "/wiki/DNA",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Clone_template",
  "/wiki/Army",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Clone_trooper_officer",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Supreme_Martial_Commander_of_the_Separatist_Droid_Armies",
  "/wiki/Utapau",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Mustafar",
  "/wiki/Trooper",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Landing_bay_one-tac-one",
  "/wiki/Hangar",
  "/wiki/Tipoca_City",
  "/wiki/Clone_Force_99",
  "/wiki/Omicron-class_attack_shuttle",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Clone_commando",
  "/wiki/Clone_Sergeant",
  "/wiki/Hunter",
  "/wiki/Squad",
  "/wiki/Wrecker",
  "/wiki/Lightsaber",
  "/wiki/Clone_Force_99%27s_barracks",
  "/wiki/Standard_hour",
  "/wiki/Galactic_Senate",
  "/wiki/Galactic_Emperor",
  "/wiki/File:Shock-troopers-Kamino-training.png",
  "/wiki/Governor",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/Imperial_Army",
  "/wiki/Tipoca_City_cafeteria",
  "/wiki/Tipoca_City_Training_Facility",
  "/wiki/Mission_to_Onderon_(Clone_Force_99)",
  "/wiki/Omega",
  "/wiki/AZI-345211896246498721347",
  "/wiki/Limb",
  "/wiki/Droid",
  "/wiki/CT-9904",
  "/wiki/Escape_from_Kamino",
  "/wiki/File:Shock-trooper-officer-attacks.png",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Kaminoan",
  "/wiki/Ruling_Council_(Kamino)",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Color",
  "/wiki/Coruscant",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Pauldron",
  "/wiki/Datapad",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Helmet",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Aftermath_(episode)",
  "/wiki/2021",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_unidentified_shock_trooper_officer",
  "/wiki/StarWars.com",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Databank_(website)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Thrawn_(novel)",
  "/wiki/Battlefront:_Twilight_Company"
 ]
}