{
 "name": "Unidentified_fleet_trooper",
 "display_name": "Unidentified fleet trooper",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "aboard the Profundity"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alderaanian consular security",
      "Alderaanian consular security"
     ]
    }
   ]
  }
 ],
 "content": "A human male was an Alderaanian consular security soldier, better known as a fleet trooper. At the end of the Battle of Scarif, he downloaded the Death Star plans onto a datacard and attempted to bring it onto the Tantive IV. However, the trooper and almost a dozen others found themselves trapped behind a partly opened security door and were soon intercepted by Darth Vader. The trooper handed the datacard through the gap in the door to another, named Toshma Jefkin, and he was killed by Vader as he made chase for the datacard.\nThe individual joined the Alliance to Restore the Republic before or during 0 BBY, where he became an Alderaanian consular security soldier, better known as a fleet trooper. He was stationed aboard the MC75 Star Cruiser Profundity during the Battle of Scarif, the battle that assured the theft of the Death Star plans. At the end of the battle, the Profundity attempted to escape with the other ships when the Imperial-class Star Destroyer Devastator arrived and disabled the cruiser. The fleet troopers aboard the Profundity began evacuating onto the CR90 corvette Tantive IV, which was docked in the cruisers hanger.\nWhilst the other troopers ran to the next security door, the individual stopped at a terminal where he downloaded the Death Star plans onto a datacard. As he did that, another trooper told him to hurry and they ran down to the next security door. The trooper attempted to open it when a power surge disabled everything around them, leaving the door only partly opened. The troopers started pulling the door to get someone through and the trooper knocked on it, calling to the soldiers on the other side. However, the troopers stopped as they heard something behind them. As they pointed their guns towards the darkness, a deep breathing sound became clear to them and the area in front of them was lit up to reveal Darth Vader activating his lightsaber. A trooper ordered them to open fire and a firefight ensued.\nVader began picking off the rebels and the trooper began banging on the security door for help. The trooper Toshma Jefkin came to his aid on the other side and tried to pull the door open. As Vader swiftly approached, one of the remaining men took the troopers gun and confronted Vader, only to be Force choked and thrown aside. The trooper then reached through the gap in the door and gave the datacard to Jefkin. Jefkin ran towards the Tantive IV and Vader dug his lightsaber into the trooper, using the Force to open the door. Jefkin ran into the corvette and close the door as Vader cut through some other troopers trying to slow him. He then ordered the corvette to launch and the Tantive IV flew out the hanger and escaped the system.\nAfter making it aboard the Tantive IV, Jefkin gave the fleet trooper's datacard, with the Death Star plans on it, to Captain Raymus Antilles, who gave it to Princess Leia Organa. When the Tantive IV was intercepted, Organa put the datacard into an astromech droid known as R2-D2, which escaped the corvette. The astromech then eventually made it back to the Alliance at Yavin 4 and they planned an attack on the Death Star. The attack became known as the Battle of Yavin and was a complete success, ensuring the Death Star's destruction in just under thirty standard minutes.\nDespite having a central role in the one scene they're in and having several speaking lines, the character was portrayed by an uncredited actor in Rogue One: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/0_BBY",
  "/wiki/Profundity",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Alderaanian_consular_security",
  "/wiki/Soldier",
  "/wiki/Battle_of_Scarif",
  "/wiki/Death_Star_plans",
  "/wiki/Datacard",
  "/wiki/Tantive_IV",
  "/wiki/Anakin_Skywalker",
  "/wiki/Toshma_Jefkin",
  "/wiki/Fleet",
  "/wiki/Trooper",
  "/wiki/MC75_Star_Cruiser",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/Cruiser",
  "/wiki/CR90_corvette",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Force_choke",
  "/wiki/Captain",
  "/wiki/Raymus_Antilles",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Corvette",
  "/wiki/Yavin_4",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Standard_minute",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Way_of_the_Force",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Vader_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope"
 ]
}