{
 "name": "Unidentified_First_Order_stormtrooper_sergeant",
 "display_name": "Unidentified First Order stormtrooper sergeant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown",
      "blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic left eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "First Order",
      "709th Legion",
      "709th Legion"
     ]
    }
   ]
  }
 ],
 "content": "A human male served as a stormtrooper sergeant and military officer in the First Order. He was an officer in the elite 709th Legion, also known as the \"Red Fury.\" During the conflict with the Resistance, the sergeant was deployed with his legion of stormtroopers to the Black Spire Outpost on the planet Batuu to eliminate any Resistance activity. He later paid a visit to Dok-Ondar's Den of Antiquities, and found a lightsaber purported to have belonged to the late Jedi Master Ki-Adi-Mundi. He attempted to threaten the Ithorian proprietor, Dok-Ondar, into supplying him with the weapon so that he could ensure it would not fall into Resistance hands. Unbeknownst to them, they were being watched via a cam droid by the criminal trio known as the Kendoh Gang.\nThe sergeant later left Batuu to attend a meeting with First Order Lieutenant Agnon, but he had to immediately return after his stormtroopers called for reinforcements against suspected Resistance agents. The sergeant arrived and killed the two suspected Resistance agents on a 125-Z treadspeeder bike. Afterwards, he deduced they were not actually affiliated with the Resistance and reprimanded his troopers. He then received an urgent message citing three individuals with death marks issued by the First Order being spotted near the Black Spire Outpost spaceport. With that the sergeant and the squad departed for the spaceport.\nThe sergeant eventually cornered the Kendoh Gang at Dok-Odnar's shop, and promptly had one of his stormtroopers smack Voss's Aqualish associate Wooro with his baton as a form of intimidation towards Voss. A skirmish broke out between the gang and the stormtroopers but the criminals were able to escape Ondar's shop.\nA human male served as a stormtrooper sergeant in the ranks of First Order military regime. The sergeant was an officer in the First Order military's elite 709th Legion, also known as the \"Red Fury\". At one point, he acquired a deep scar on the left side of his face, which resulted in him getting a prosthetic left eye. In 34 ABY, at Black Spire Outpost on the Outer Rim planet Batuu, the sergeant was present onboard a First Order assault shuttle flying above the outpost. The First Order stormtrooper sergeant looked down at all the individuals at Black Spire Outpost below him and referred to them as \"Batuuan Rats.\" He believed that there were members of the Resistance, a paramilitary force at war with the First Order, hiding on the planet and it was the task of the 709th Legion to snuff them out. The sergeant stated he was willing to burn all of Batuu in order to locate the Resistance members. Standing next to him, First Order Lieutenant Agnon accepted nothing less from the sergeant, stating that Batuu would never be the same once the First Order was done with it.\nSometime later, the sergeant arrived at the antiquities store of the Ithorian collector Dok-Ondar. The stormtrooper sergeant held the lightsaber used by the late Cerean Jedi Master, Ki-Adi-Mundi. During their encounter he removed his helmet, and tried to remember who Mundi was, asking Ondar if he was the Jedi with the pointed head. The sergeant told Ondar that he had never paid much attention to history, as he was more concerned with the future. He activated the blue bladed lightsaber and asked Ondar if he believed in the future. When Ondar replied in Ithorese, the native language of the Ithorian people, the sergeant lashed out at him, not understanding the language himself. Ondar's human translator Tohago translated the Ithorese into the standard Basic language of the galaxy for the sergeant.\nTohago told the sergeant that Ondar said that he did not have to threaten the antique owner, because the Ithorian was just a humble store owner with only respect for the First Order. The sergeant did not believe what Ondar had said, replying that his store was known across the galaxy for its ancient relics. He deactivated the lightsaber and placed the weapon down, telling Ondar that his store was the perfect location for Resistance spies. As the sergeant continued lecturing Ondar about the future, a recording video droid, secretly placed there by the Clawdite Remex Io of the Kendoh Gang was being monitored and watched by Io, and his fellow partners in crime, the Aqualish Wooro, and the leader, Kendoh Voss from their starship. Io changed his form into the sergeant to move the gang's heist of Ondar's store forward.\nPlacing his helmet back on, the sergeant warned Ondar that it was the collector's duty to report any Resistance activity to the First Order, or else the Order would confiscate and destroy all his relics. Ondar understood that the sergeant had no appreciation for the past but told him the story of how he came into possession of Mundi's lightsaber.\nAfter finishing the story, the sergeant was angry that Ondar wasted his time. Ondar told him to take a deeper look into the lightsaber. He explained that the lightsaber had survived the falls of the old Galactic Republic and its successor, the Galactic Empire, and it would in turn survive the First Order. He continued, telling the sergeant that his grip on Black Spire Outpost was weak and to never come into his store and threaten him. Before the sergeant could lash back at Ondar, one of his stormtroopers reported a disturbance in the market that could be tied to the Resistance. The sergeant sarcastically wished Ondar a good day and promised to see him again soon.\nAbove Batuu, the stormtrooper sergeant attended a briefing from Lieutenant Agnon but was called back to the planet when two suspected Resistance operatives attacked a group of stormtroopers. The sergeant took an assault shuttle to the surface of the planet and joined the firefight on a 125-Z treadspeeder bike. He was not impressed that the stormtroopers could not handle the two operatives. The sergeant drove at the operatives on his speeder bike and quickly took both of them out. He realized that this incursion was useless as the operatives were not members of the Resistance. The sergeant then received an incoming message informing him that the First Order had received a tip that three fugitives with death marks from General Armitage Hux were located near the spaceport. He then ordered his troopers to move out as a Resistance operative fled the scene unnoticed.\nShortly after, the bounty hunter Kendoh Voss and her gang confronted Dok Ondar at his antique store to begin their heist. Before they could begin, Io reported that there was an emergency. He told her that the sergeant and the Red Fury had tracked them down and were just outside the store, getting ready to confront them.\nThe sergeant and his then stormtroopers entered Ondar's store and reminded him of the punishments that would take place for associating himself with individuals like Voss. He then turned to Voss and went over her past heists, flattering her. Ondar warned her not to antagonize the sergeant but the sergeant instead lashed out at Ondar for speaking in Ithorese. To show Voss the gravity of the situation she was in, he ordered one of his stormtroopers, RS-2112, to strike Wooro with a Z6 riot control baton. The stormtrooper complied and the Aqualish was knocked back by the blow. Voss began to threaten the sergeant, who interrupted her and noted her loyalty to her crew. He told her to stand down because he was only keeping the two alive for answers.\nThe sergeant told them about the First Order's goal of conquering the galaxy and destroying the Resistance, and warned them that the First Order would do whatever it took to find the Resistance operatives. The stormtrooper sergeant was also suspicious of the Kendoh Gang's arrival to Batuu and suggested that they could be affiliated with the Resistance. Voss threw another sarcastic comment at the sergeant, claiming that her crew were the professionals. This caused him smack Voss with the end of his blaster, making her bleed from her mouth.\nAfter Ondar finished telling Voss about the ending to his mission to the planet Moraband years earlier, the sergeant asked Voss why she was on Batuu. She told him about the heist and admitted that the heist had gone wrong but said that she would improvise. She then leapt across the store and grabbed the box containing the hilt of the ancient sith artifact, the Sword of Khashyun as the sergeant ordered his soldiers to shoot them down. Voss grabbed Ki-Adi-Mundi's lightsaber as the sergeant and the stormtroopers surrounded her. The sergeant believed that Voss didn't stand a chance against them. She then activated the lightsaber and freed Ondar's juvenile sarlacc Simpi. The sarlacc attacked the stormtroopers, killing one of them and causing the sergeant to order his troops to retreat and chased Voss out of the store. The sergeant and another trooper lost Voss in the crowd of people and he ordered a perimeter to be set up around the area.\nThe stormtrooper sergeant had blond hair and a pale skin tone. He also had a brown right eye and a blue cybernetic left eye. The sergeant was fiercely loyal to the First Order and was willing to do whatever it took to remove the Resistance presence on Batuu. The sergeant never paid much attention to history because he was more concerned about the future of the galaxy. He had strong confidence in himself and was angry when individuals or the stormtroopers under his command failed to complete their tasks. He would also use sarcasm as a way to threaten people. He often lashed out and used brute force when individuals would go against him or annoy him intentionally.\nThe stormtrooper sergeant demonstrated great skill on a 125-Z treadspeeder bike, as he was able to take out suspected Resistance operatives with relative ease. The stormtrooper also prepared for battle ahead of time as he read up on the file of Voss. With a blaster rifle, the stormtrooper was very dangerous, shown when he knocked Voss in the jaw with the back of his blaster rifle.\nThe sergeant was equipped with a F-11D blaster rifle, which was standard issue for stormtroopers of the First Order. He wore standard white First Order stormtrooper armor as well as a black pauldron on his shoulder to represent his rank of sergeant in the First Order military. The stormtrooper sergeant also rode a 125-Z treadspeeder bike when fighting suspected members of the Resistance.\nThe sergeant first appeared in the first issue of the Star Wars Galaxy's Edge comic series, which was written by Ethan Sacks, illustrated by Will Sliney, and published by Marvel Comics on April 24, 2019. The stormtrooper sergeant was first pictured in a reveal of the art for Galaxy's Edge 1 on StarWars.com on April 15, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/Unidentified_First_Order_stormtrooper_sergeant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Eye",
  "/wiki/First_Order",
  "/wiki/709th_Legion",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/First_Order_military",
  "/wiki/Officer",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Sergeant",
  "/wiki/Legion",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Battle_of_Batuu",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Lightsaber",
  "/wiki/Ki-Adi-Mundi%27s_lightsaber",
  "/wiki/Jedi_Master",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Ithorian",
  "/wiki/Dok-Ondar",
  "/wiki/Weapon",
  "/wiki/Cam_droid",
  "/wiki/Kendoh_Gang",
  "/wiki/Lieutenant",
  "/wiki/Agnon",
  "/wiki/Death",
  "/wiki/125-Z_treadspeeder_bike",
  "/wiki/Death_mark",
  "/wiki/Spaceport_(Batuu)",
  "/wiki/RS-2112",
  "/wiki/Aqualish",
  "/wiki/Wooro",
  "/wiki/First_Order_High_Command",
  "/wiki/34_ABY",
  "/wiki/Outer_Rim_Territories",
  "/wiki/TIE/es_assault_shuttle",
  "/wiki/Batuu_system",
  "/wiki/Stormtrooper",
  "/wiki/Batuuan_Rat",
  "/wiki/Fire",
  "/wiki/Collector",
  "/wiki/Cerean",
  "/wiki/Helmet",
  "/wiki/Jedi",
  "/wiki/Ithorese",
  "/wiki/Language",
  "/wiki/Species",
  "/wiki/Translator",
  "/wiki/Tohago",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/The_galaxy",
  "/wiki/Spy",
  "/wiki/Clawdite",
  "/wiki/Remex_Io",
  "/wiki/Kendoh_Voss",
  "/wiki/Starship",
  "/wiki/Changeling",
  "/wiki/Time",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Black_Spire_Outpost_Market",
  "/wiki/Standard_day",
  "/wiki/Realspace",
  "/wiki/Shuttle",
  "/wiki/Speeder_bike",
  "/wiki/General",
  "/wiki/Armitage_Hux",
  "/wiki/Bounty_hunter",
  "/wiki/Bothan_Museum_heist",
  "/wiki/Gravity",
  "/wiki/Z6_riot_control_baton",
  "/wiki/Blaster",
  "/wiki/Blood",
  "/wiki/Mouth",
  "/wiki/Mission_to_Moraband_(Dok-Ondar)",
  "/wiki/Moraband",
  "/wiki/Standard_year",
  "/wiki/Sith_artifact",
  "/wiki/Sword_of_Khashyun",
  "/wiki/Soldier",
  "/wiki/Sarlacc",
  "/wiki/Simpi",
  "/wiki/ZJ-7199",
  "/wiki/Hair",
  "/wiki/Blaster_rifle",
  "/wiki/F-11D_blaster_rifle",
  "/wiki/First_Order_stormtrooper_armor",
  "/wiki/Pauldron",
  "/wiki/Galaxy%27s_Edge_1",
  "/wiki/Star_Wars:_Galaxy%27s_Edge_(comic_series)",
  "/wiki/Ethan_Sacks",
  "/wiki/Will_Sliney",
  "/wiki/Marvel_Comics",
  "/wiki/April_24",
  "/wiki/2019",
  "/wiki/StarWars.com",
  "/wiki/April_15",
  "/wiki/Category:Images_of_Unidentified_First_Order_stormtrooper_sergeant",
  "/wiki/Galaxy%27s_Edge_2",
  "/wiki/Galaxy%27s_Edge_4",
  "/wiki/Galaxy%27s_Edge_5",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Template:Galaxy%27s_Edge_Date",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Bloodline_(novel)",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary"
 ]
}