{
 "name": "Unidentified_Imperial_gunnery_officer_(Gideon)",
 "display_name": "Unidentified Imperial gunnery officer  (Gideon)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gideon's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "A human male gunnery officer served in Moff Gideon's remnant of the Galactic Empire, operating aboard Gideon's light cruiser. When the cruiser destroyed the gunship Razor Crest on the planet Tython around 9 ABY, the gunnery officer reported a direct hit to Gideon. He later followed an comms officer to alert Gideon to a message from the Mandalorian Din Djarin. When Djarin's allies boarded the cruiser, Gideon had the gunnery officer activate the dark troopers.\nDuring the New Republic's reign, the gunnery officer served in a remnant of the Galactic Empire led by Moff Gideon, holding the rank of lieutenant. He served on a Gideon's light cruiser around 9 ABY and was stationed at the bridge of the cruiser when it traveled to the planet Tython while tracking the gunship Razor Crest. After Gideon's ground forces, hunting the Force-sensitive infant Grogu, the light cruiser fired on the Razor Crest, obliterating the starship. At the cruiser's bridge, the gunnery officer confirmed to Gideon that it had been a direct hit on the Crest, and the moff had some dark troopers deploy to apprehend the infant.\nThe dark troopers successfully captured Grogu, and the cruiser promptly escaped into hyperspace. Later, the gunnery officer followed an Imperial comms officer into the bridge to inform Gideon of a message from the Mandalorian Din Djarin, who intended to take Grogu back from Gideon. The two officers stood beside a table as it displayed the holographic message from the Mandalorian. Sometime later, an Imperial Lambda-class T-4a shuttle designated Shuttle 2743 arrived out of hyperspace near Gideon's cruiser, pursued by the Firespray-31-class patrol and attack craft Slave I. The cruiser was force to take aboard the shuttle, and the Slave I escaped into hyperspace. An infiltration team comprised of Djarin's allies then exited the shuttle and attacked the personnel in the hanger.\nThe bridge crew listened to the fighting over the comms, and Gideon ordered the dark troopers to be activated. The gunnery officer carried this out, using one of his code cylinders to access his terminal to activate the troopers. Gideon departed the bridge, and Djarin's allies soon stormed the bridge. The infiltrators massacred the defending stormtroopers and officers present there.\nThe gunnery officer was a human male with light skin, brown hair and brown eyes.\nThe gunnery officer wore the standard uniform of an Imperial naval officer, including an Imperial kepi and two code cylinders attached below each shoulder, one of which he used to access his terminal. He wore a rank insignia plaque on his left breast with two red bars above two blue, which signified the rank of lieutenant.\nThe officer first appeared in \"Chapter 14: The Tragedy\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Robert Rodriguez and released on December 4, 2020. Credited as \"Gunnery Officer\", he was played by Gabriel Ebert.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Galactic_Empire",
  "/wiki/Gideon%27s_light_cruiser",
  "/wiki/Cruiser",
  "/wiki/Gunship",
  "/wiki/Razor_Crest",
  "/wiki/Planet",
  "/wiki/Tython",
  "/wiki/9_ABY",
  "/wiki/Gunnery_officer",
  "/wiki/Unidentified_Imperial_comms_officer",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Third-generation_design_Dark_Trooper",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Era",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/Bridge_(starship)",
  "/wiki/Force-sensitive",
  "/wiki/Grogu",
  "/wiki/Light_cruiser",
  "/wiki/Starship",
  "/wiki/Imperial_officer",
  "/wiki/Hyperspace",
  "/wiki/Officer",
  "/wiki/Hologram",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Operating_number",
  "/wiki/Shuttle_2743",
  "/wiki/Firespray-31-class_patrol_and_attack_craft",
  "/wiki/Slave_I",
  "/wiki/Shuttle",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Code_cylinder",
  "/wiki/Stormtrooper",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Breast",
  "/wiki/Chapter_14:_The_Tragedy",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Robert_Rodriguez",
  "/wiki/December_4",
  "/wiki/2020",
  "/wiki/Gabriel_Ebert",
  "/wiki/Chapter_15:_The_Believer",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion"
 ]
}