{
 "name": "Unidentified_Hutt_brother",
 "display_name": "Unidentified Hutt brother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green and tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "The Twins",
      "The Twins"
     ]
    }
   ]
  }
 ],
 "content": "A Hutt male, alongside his twin sister, attempted to claim Jabba Desilijic Tiure's criminal empire after the death of Bib Fortuna. However, Boba Fett—the new Daimyo of Mos Espa—claimed Jabba's territory for his own empire, putting him in conflict with the Hutt siblings from Nal Hutta.\nThe Hutt male was a cousin of Jabba Desilijic Tiure, the crime lord who controlled the city of Mos Espa on the planet Tatooine until his demise in 4 ABY. The Hutt and his twin sister were collectively known as \"the Twins;\" they originally resided on Nal Hutta—the homeworld of the Hutt species—prior to their move to Tatooine around 9 ABY. Their claim over Jabba's territory conflicted with the agenda of Boba Fett, the self-proclaimed Daimyo of Mos Espa, who sought to build his own criminal empire after killing Bib Fortuna.\nAccompanied by their servants and the Wookiee gladiator Krrsantan, the Twins met with Fett and Fennec Shand outside of Garsa Fwip's cantina, the Sanctuary, and publicly declared their intention to take control of Mos Espa. Fett rejected the assertion that the Twins were the legitimate inheritors of Jabba's legacy, and presented himself as the rightful crime lord on Tatooine. While the Hutt sister desired to kill the former bounty hunter immediately, the Hutt brother decided to settle the dispute with Fett at a later point in time.\nContrary to the opinion of Boba Fett, who believed that the Twins were too distracted by a life of \"debauchery\" on Nal Hutta to pursue their ambitions on Tatooine, the Hutt brother journeyed to the remote desert world alongside his sister with the intention of claiming the dominion of their late cousin, Jabba Desilijic Tiure. Whereas Fett had chosen to eschew the outward signs of power as a crime lord, the Hutt brother and his sister traveled in comfort, riding together on a double-wide litter supported by servants and using drums to announce their arrival to the population of Mos Espa. In addition to the litter, the Hutt brother used a rodent to wipe sweat off of his face.\nThe Hutt brother believed himself and his sister to be the true beneficiaries of their cousin's estate. He refuted Fett's claim that Mos Espa was his territory by presenting a document to confirm Jabba's authority over the city. Possessing more patience than his sister, who wanted to kill Fett after he had upset her, the brother decided to settle their disagreement at a later date, observing that bloodshed was \"bad for business.\"\nThe brother twin was a large Hutt with orange eyes, green and tan skin, and a facial tattoo. He spoke Huttese—the language of the Hutts—and understood Galactic Basic Standard.\nThe Hutt brother first appeared in the episode \"Chapter 2: The Tribes of Tatooine\" of the Disney+ series The Book of Boba Fett on January 5, 2022. According to the Simplified and Traditional Chinese subtitles of the episode on Disney+, the female Hutt is the male Hutt's younger sister . The line is spoken in Huttese, regardless of the language a viewer chooses for audio.\nAccording to Ming-Na Wen, cardboard cutouts were used on set to represent the Hutts that would eventually be realized through computer-generated imagery. JJ Dashnaw, the body double of Temuera Morrison, provided dialogue for the Twins during filming.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nal_Hutta",
  "/wiki/Hutt",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/The_Twins_(Hutts)",
  "/wiki/Twin",
  "/wiki/Unidentified_Hutt_sister",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Death",
  "/wiki/Bib_Fortuna",
  "/wiki/Boba_Fett",
  "/wiki/Daimyo",
  "/wiki/Mos_Espa",
  "/wiki/Fett_gotra",
  "/wiki/Crime_lord",
  "/wiki/City",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/4_ABY",
  "/wiki/Homeworld",
  "/wiki/Species",
  "/wiki/9_ABY",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Wookiee",
  "/wiki/Gladiator",
  "/wiki/Krrsantan",
  "/wiki/Fennec_Shand",
  "/wiki/Garsa_Fwip",
  "/wiki/Cantina",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Lord",
  "/wiki/Bounty_hunter",
  "/wiki/Time",
  "/wiki/Drum",
  "/wiki/Rodent",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Huttese",
  "/wiki/Language",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/January_5",
  "/wiki/2022",
  "/wiki/Ming-Na_Wen",
  "/wiki/JJ_Dashnaw",
  "/wiki/Temuera_Morrison",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/StarWarsKids.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor"
 ]
}