{
 "name": "Unidentified_village_sister",
 "display_name": "Unidentified village sister",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  }
 ],
 "content": "A human female individual worked as a farmer in a village during the Imperial Era, alongside her brother. During her time in the village, the sister was saved from falling bales of harvested crops by Jedi Purge survivor Ahsoka Tano, who was living and working in the village under the alias \"Ashla\". The sister saw Tano immediately afterward and realized she had used the Force to save her life. Grateful, the sister made friendly overtures towards Tano, inviting her to eat with the others during a meal. That night, the sister approached Tano and revealed that she knew her secret, promising to keep quiet about it. However, her brother overheard the conversation and, being a supporter of the Galactic Empire, decided to report Tano in the hopes of reward. Tano and the sister went away on an errand the next day, delivering harvested crops to Mon-Hella. When they returned, they found that the village had been destroyed by an Inquisitor, who was holding the brother and an old man hostage. Tano defeated and killed the Inquisitor, and the sister, while relieved that her brother was still alive, was also angry with him for his actions. As the three survivors had to leave the area, Tano used a comlink she had been given to contact Alderaanian Senator Bail Organa, who came in the corvette Tantive IV to pick them up.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Resolve_(episode)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Farmer",
  "/wiki/Imperial_Era",
  "/wiki/Unidentified_village_brother",
  "/wiki/Time",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Ahsoka_Tano",
  "/wiki/The_Force",
  "/wiki/Galactic_Empire",
  "/wiki/Mon-Hella",
  "/wiki/Attack_on_a_farm_village",
  "/wiki/Unidentified_Inquisitor",
  "/wiki/Unidentified_old_man_(Ahsoka_Tano)",
  "/wiki/Death",
  "/wiki/Inquisitor",
  "/wiki/Comlink",
  "/wiki/Alderaanian",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Corvette",
  "/wiki/Tantive_IV",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_village_sister",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)"
 ]
}