{
 "name": "Unidentified_Blue_Squadron_pilot",
 "display_name": "Unidentified Blue Squadron pilot",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Blue Squadron",
      "Blue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A human male pilot served in the Rebel Alliance at the time of the Battle of Scarif. As part of Blue Squadron, he served under General Antoc Merrick at the time. He flew a T-65B X-wing starfighter when the Alliance Fleet decided to aid the rebels on the planet Scarif. In the opening stages of the Battle of Scarif, General Merrick called all of his fighters together to pass through the Shield Gate and aid the rebels fighting on the surface of Scarif, attempting to steal the plans to the Galactic Empire's Death Star superweapon, as Blue Squadron had been ordered. This pilot, along with Barion Raner, responded in acknowledgement.\nOnly twelve fighters made it through the Gate. Two fighters were shot down attempting to make it through, Vangos Grek and another pilot impacted the shield, and at least three other fighters were forced to stay in space. Blue Squadron fought bravely suffering at least four casualties before plans to the Death Star were transmitted to the fleet and the surviving Blue Squadron pilots retreated victoriously back to the Rebel Base on Yavin 4. Blue Squadron's destruction on Scarif and the death of its leader meant that it could not be present at the next Empire-Alliance major battle, which left Red and Gold Squadrons to take care of those affairs.\nAs part of Blue Squadron at the time, this pilot wore the customary Blue Squadron jumpsuit, and a helmet similar to Puck Naeco's, Wes Janson's and Wion Dillems'. His skin and hair were fair and black, respectively. He also had facial hair in the style of a beard.\nThe pilot appears in the December, 2016 film Rogue One: A Star Wars Story played by an actor who was not credited in the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/File:Unknown_Blue_Squadron_Pilot.ogg",
  "/wiki/Battle_of_Scarif",
  "/wiki/General",
  "/wiki/Antoc_Merrick",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Rogue_One",
  "/wiki/Planet",
  "/wiki/Scarif",
  "/wiki/Starfighter",
  "/wiki/Shield_Gate",
  "/wiki/Death_Star_plans",
  "/wiki/Galactic_Empire",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Pilot",
  "/wiki/Barion_Raner",
  "/wiki/Vangos_Grek",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Time",
  "/wiki/Squadron",
  "/wiki/Flight_suit",
  "/wiki/Flight_helmet",
  "/wiki/Puck_Naeco",
  "/wiki/Wes_Janson",
  "/wiki/Wion_Dillems",
  "/wiki/Hair",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide"
 ]
}