{
 "name": "Unidentified_TIE_pilot",
 "display_name": "Unidentified TIE pilot",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Apprentices",
     "values": [
      "Galactic Empire",
      "Imperial Starfighter Corps",
      "Imperial Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "A human male TIE pilot served in the Galactic Empire's starfighter corps during the Galactic Civil War. During the Battle of Jakku in 5 ABY, he searched for jettisoned escape pods on the surface of the planet Jakku, finding one with the injured New Republic Starfighter Commander Wyl Lark. The TIE pilot helped Lark out of his pod and the pair traveled across Jakku's desert until they were found by one the Lark's comrades.\nDuring the Galactic Civil War, the human male served as a TIE pilot in the starfighter corps of the Galactic Empire. He eventually participated in the Battle of Jakku in 5 ABY, where the Imperial loyalist forces were defeated by the New Republic at the desert planet Jakku. With many vessels being lost and jettisoning escape pods, the TIE pilot found an escape pod which had come from a Star Destroyer. Looking through the pod's viewport, he saw an injured individual inside with a lot of blood. Opening the door to the escape craft, he questioned what starship the passenger had come from, to which the injured man answered the Deliverance, which was a New Republic refitted Star Destroyer.\nThe TIE pilot asked the passenger's name, and the individual introduced himself as Wyl Lark, who was the Starfighter Commander of a New Republic fighter wing aboard the Deliverance. Recognizing Lark, the pilot laughed, revealing that he had heard a lot about the commander. The TIE pilot then helped the New Republic commander out of the escape pod and across the Jakku's desert. They were eventually found by a BTL-A4 Y-wing assault starfighter/bomber flown by lark's comrade Nath Tensent, who called in a priority pickup from the New Republic for the injured Lark. The pair frantically waved at the Y-wing as it flew above them.\nA human male, the TIE pilot chose to rescue escape pod survivors, even after he discovered the passenger he had found was with the New Republic.\nThe TIE pilot wore a black flight suit and helmet which featured breathing tubes.\nThe TIE pilot appeared in the 2021 novel Victory's Price, the final installment of the Star Wars: Alphabet Squadron trilogy which was written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Victory%27s_Price",
  "/wiki/Galactic_Civil_War",
  "/wiki/Battle_of_Jakku",
  "/wiki/5_ABY",
  "/wiki/Escape_pod",
  "/wiki/Planet",
  "/wiki/Jakku",
  "/wiki/New_Republic",
  "/wiki/Starfighter_Commander",
  "/wiki/Wyl_Lark",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Desert",
  "/wiki/Nath_Tensent",
  "/wiki/Imperial_Military",
  "/wiki/Starship",
  "/wiki/Pilot",
  "/wiki/Star_Destroyer",
  "/wiki/Viewport",
  "/wiki/Blood",
  "/wiki/Deliverance",
  "/wiki/Deliverance%27s_starfighter_wing",
  "/wiki/Commander",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Color",
  "/wiki/Flight_suit",
  "/wiki/Helmet",
  "/wiki/2021",
  "/wiki/Star_Wars:_Alphabet_Squadron",
  "/wiki/Alexander_Freed",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}