{
 "name": "Unidentified_Human_Emperor%27s_Voice_(Galactic_War)",
 "display_name": "Unidentified Human Emperor's Voice  (Galactic War)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Dromund Kaas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "A Human male was utilized by the Sith Emperor of the reconstituted Sith Empire as the Emperor's Voice, the host of the Sith ruler's immortal essence, during the Galactic War with the Galactic Republic. After the death of his previous Voice, the Emperor transferred his consciousness to the Human and gathered his strength on the Imperial capital planet of Dromund Kaas, preparing to perform the ritual of Sith magic that would allow him to consume all life in the galaxy. However, the Jedi Knight known as the Hero of Tython foiled his agent's attempts to start the ritual, and the Emperor used the Voice to battle the Jedi when the Knight confronted the Sith in the depths of the Dark Temple on Dromund Kaas—a battle that ended with the Voice's death.\nIn 3640 BBY, during the Galactic War between the Galactic Republic and the Sith Empire, the Sith Emperor was trapped in his current Emperor's Voice—the host body for his immortal essence—when the Sith Lord Darth Baras lured the Sith ruler to the ancient ruins known as the Dark Heart on the planet Voss. The Emperor and his Voss host were unable to leave the Dark Heart, as the Ancient Halls of the Dark Heart were built in a way that prevented any Voss from leaving once they entered, and the Sith was forced to fight the dark side entity Sel-Makor for control of the Voice. However, the newest Emperor's Wrath, the Emperor's personal executioner, freed the Emperor by killing the Voice, and the Emperor's essence returned to the care of his servants in the organization known as the Emperor's Hand.\nThe Hand secured a Human male for the Emperor to use as his newest Voice, and the Sith ruler took full possession of his host on the Imperial capital planet of Dromund Kaas. Now free to continue the preparations for the dark side ritual by which he would consume all life in the galaxy, the Emperor traveled to the Sith edifice known as the Dark Temple with an escort of Sith and members of the Imperial Guard. The Emperor then gathered his strength in the Temple's inner chambers, awaiting the moment that he could begin his ritual, but his plans were foiled when the Jedi Knight known as the Hero of Tython prevented the Emperor's servants from achieving the mass sacrifice that the Emperor required. From the fallen Jedi Tol Braga, the Hero learned the Emperor's location on Dromund Kaas, and the Knight decided to confront the Sith ruler while he was weakened.\nThe Hero and a crew of allies infiltrated Dromund Kaas and the Dark Temple while a Republic invasion fleet attacked the Imperial capital, and the Emperor's Voice waited in the Dark Temple's inner chambers as the Knight and the astromech droid T7-O1 fought through the Imperial Guardsmen and Sith defending the Emperor. The Emperor used his Human host to battle the Knight and T7-O1, summoning multiple phantom copies of the Voice with the Force to overwhelm his opponent. However, the battle ultimately saw the Jedi victorious, and a greatly weakened Emperor relinquished control of the dying Voice—who had been mortally wounded by the Knight's final lightsaber strike—in order to return to his true body. As a final act of vengeance, the Emperor used the Force to bring down the Dark Temple upon the Hero and T7-O1. Though the pair escaped the collapsing building, the Voice's body was crushed under tons of rubble.\nIn circa 3626 BBY, the likeness of the last Emperor's Voice was recreated in the mind of Satele Shan, representing Tenebrae`s persona as Vitiate. He was used by Tenebrae to attempt to restore his dead spirit.\nThe Human male had pale, wrinkled skin and red eyes, though later in the likeness of the Voice had  orange eyes. He spoke with the Emperor's own emotionless voice while possessed by the Sith ruler. As the Voice of the Emperor, the Human's mind was completely subjugated by the Emperor's consciousness, and each of his actions were orchestrated by the Sith.\nAs the Emperor's Voice, the Human wielded the Emperor's own immense strength in the Force and was capable of utilizing Force powers such as Force lightning and physical illusions.\nThe Human male first appeared as \"The Emperor\" in Star Wars: The Old Republic, a video game released by BioWare and LucasArts in 2011, in the Jedi Knight-class mission \"Doomsday\" on Dromund Kaas, and he is voiced by Doug Bradley. However, a message from Servant One of the Emperor's Hand to the Sith Warrior confirms that the Human male whom Jedi Knight players face in \"Doomsday\" is actually only a Voice of the Emperor, acquired by the Hand after the death of the previous Voice during the Sith Warrior storyline on Voss. The Human also appears in the 2012 reference guide Star Wars: The Old Republic Encyclopedia, in pictures of the Hero of Tython's skirmish with the Emperor on Dromund Kaas.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3640_BBY",
  "/wiki/Dromund_Kaas",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Tenebrae",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Sith/Legends",
  "/wiki/Immortality/Legends",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Death/Legends",
  "/wiki/Unidentified_Emperor%27s_Voice_(Voss)",
  "/wiki/Emperor/Legends",
  "/wiki/Transfer_essence",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sith_Emperor%27s_ritual",
  "/wiki/Sith_magic",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Jedi/Legends",
  "/wiki/Dark_Temple",
  "/wiki/Servant_One",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Dark_Heart",
  "/wiki/Voss",
  "/wiki/Voss_(species)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sel-Makor",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Hand_of_the_Empire",
  "/wiki/File:HumanEmperorsVoiceDeath-SWTOR.png",
  "/wiki/Imperial_Guard",
  "/wiki/Tol_Braga",
  "/wiki/Fleet/Legends",
  "/wiki/Dromund_Kaas_operation",
  "/wiki/T7-series_astromech_droid",
  "/wiki/T7-O1",
  "/wiki/Mind_trick/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/3626_BBY",
  "/wiki/Mission_to_Kira_Carsen%27s_ship",
  "/wiki/Mindscape",
  "/wiki/Satele_Shan",
  "/wiki/File:Emperor_lightning_saber.png",
  "/wiki/Eye/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/2011",
  "/wiki/Doug_Bradley",
  "/wiki/Sith_Warrior",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/3645_BBY",
  "/wiki/Category:Images_of_the_Human_Emperor%27s_Voice",
  "/wiki/Battle_of_Ilum",
  "/wiki/Standard_year/Legends",
  "/wiki/Bas-Ton_(imposter)",
  "/wiki/The_Old_Republic:_Annihilation",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Standard_month/Legends",
  "/wiki/3641_BBY"
 ]
}