{
 "name": "Unidentified_Rebel_trooper_(Endor)",
 "display_name": "Unidentified Rebel trooper  (Endor)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Endor strike team",
      "Endor strike team"
     ]
    }
   ]
  }
 ],
 "content": "Prior to the Battle of Endor, one particular Rebel got separated from the Rebel strike team and was marooned on the forest moon.\nIn 4 ABY, the Rebel trooper was part of the strike team sent to destroy the Endor shield generator bunker. At some point, the trooper left the group to relieve himself and got lost, missing the battle itself. Having no idea who won, the trooper was stuck on Endor for the next thirteen months.\nIn 5 ABY, the Rebel trooper encountered an Imperial Unidentified scout trooper who had also been left behind. The two fought for 45 minutes before they agreed on a truce, though they hardly got along in any friendly capacity. The scout trooper threatened to bring the Rebel trooper in as his prisoner, but when he attempted to subdue the Rebel, he brought not only the Rebel, but himself into a trap created by the native Ewoks.\nThe Ewoks eventually came back to their trap, tying the scout trooper to a log and giving the Rebel trooper food nourishment. At the request of the scout trooper, the Rebel trooper got the Ewoks to release him upon returning to their village. While there, they were both given a peace pipe. The scout trooper claimed that he was a \"broken\" trooper, rethinking his orders, after which the Rebel trooper revealed how he had gotten left behind.\nThe Ewoks led them to the location of the shield generator…only to discover that it had, in fact, been destroyed, confirming to the two that the Rebels had won the battle. Resigned to being stuck on Endor forever, the scout trooper nearly gave up, though the Rebel trooper, spotted a left over AT-ST. While the pair checked the leftover vehicle's power cells, a Gorax attacked the Ewoks that had been leading them. The Rebel trooper used the walker's cannons to kill the beast, much to the chagrin of the scout trooper, who wanted to keep the energy in the power cells. During their argument about the \"circle of life\", the Rebel trooper spotted a huge structure on the radar, about the size of a small city and transmitting an Imperial code.\nWhen they arrived at the location of the signal, they discovered that it wasn't a city, but rather an Imperial Star Destroyer that had plummeted to the moon during the battle. The ship had a communication's substation and an operational power plant, and the Rebel trooper managed to contact a passing freighter on a nearby trade route. He also discovered that the signal was an automatic evacuation signal.\nThe next morning, the freighter arrived. The scout trooper, however, decided to stay behind, citing that the Rebel trooper was right about people like him not having a place in peaceful society. The two shook hands and said farewell, and the Rebel trooper boarded the freighter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Rebel_trooper",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Endor_strike_team/Legends",
  "/wiki/Marooned",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Unidentified_scout_trooper",
  "/wiki/4_ABY/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Standard_month/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Gorax/Legends",
  "/wiki/Star_Wars_Tales_22"
 ]
}