{
 "name": "Unidentified_Human_Sith_Lord",
 "display_name": "Unidentified Human Sith Lord",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "138 ABY",
      "Daluuj"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red; black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith",
      "Darth Krayt's Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "A Human male was a Sith Lord serving the One Sith and Darth Krayt's Galactic Empire in 138 ABY. After the Dark Lord of the Sith Darth Wyyrlok ordered the execution of the Final Protocol against the planet Dac—which was poisoned by Sith scientist Vul Isen—the Human Sith attempted to defend Isen's laboratory on the planet Daluuj when the former Jedi Cade Skywalker and his allies raided Isen's lair in an attempt to locate the \"Butcher of Dac.\" The Sith Lord engaged Skywalker in a lightsaber duel on a bridge, with Skywalker gaining the upper hand and slicing off the man's legs. He was interrogated by Skywalker, who, after finding that the Human had no information as to Isen's whereabouts, left the man to die when the explosives set by Skywalker's allies in the laboratory detonated.\nA Human male Sith Lord served the Dark Lord of the Sith Darth Krayt's One Sith Order and Galactic Empire, having killed numerous Jedi by the year 138 ABY. Earlier, in 137 ABY, the Sith Lord Darth Wyyrlok—who, as Krayt's Voice, commanded the Empire when Krayt was incapacitated—ordered the Final Protocol's execution, causing the extermination of the majority of the planet Dac's population. During these events, the Human Sith Lord was stationed on the Outer Rim planet Daluuj at the laboratory of the Givin scientist Vul Isen, who created the viral spores that poisoned Dac's waters.\nEarly in 138 ABY, the former Jedi Cade Skywalker and his allies assaulted Isen's laboratory, in search of the scientist who had been nicknamed the \"Butcher of Dac.\" The Sith Lord attacked Skywalker and engaged him in a lightsaber duel on the bridge leading to the laboratory, throughout which he taunted and demeaned the former Jedi. However, Skywalker evaded an attack from the Sith and cut off his legs. The wounded Sith Lord was interrogated by Skywalker about Isen's whereabouts, with Skywalker promising that the man would live if he gave them Isen's location. The Sith told him that the laboratory Skywalker had raided was indeed Isen's, but that the Givin scientist had abandoned it long ago, taking all evidence with him. He also revealed that Isen did not share his knowledge with anyone.\nWhen Skywalker instructed his crewmate Jariah Syn to detonate the explosives that he had set in the laboratory and began to flee with his former Jedi Master Wolf Sazen, the Human Sith cursed Skywalker for what he believed to be a breach of the Jedi's word. However, he was reminded by Skywalker that the condition for his life was only if the Sith told him of Isen's location, and the Sith perished in the explosion after the explosives detonated.\nThe individual was a Human male Sith Lord who had red and black tattoos that covered his body, and long, flowing black hair. He had a spike pierced through his left ear, and also had spike implants grafted on his skull. During combat, the Sith Lord used a lightsaber containing a red crystal. He spoke and comprehended both Galactic Basic Standard and Huttese, using the latter to call Skywalker a \"worm-eating liar.\" During his battle with Skywalker, he made it a point to insult the former Jedi, and also pontificated that he had slain Jedi more powerful than Skywalker. After being defeated by Skywalker, the Sith Lord divulged all the information he knew about Isen. He also cursed Skywalker when the former Jedi decided to leave him to die.\nThe Sith Lord was skilled in combat with a lightsaber, briefly engaging Skywalker in a duel, and was sensitive to the Force. He had killed numerous Jedi by the time he fought Skywalker.\nThe Human Sith Lord was created by John Ostrander, the writer of the Star Wars: Legacy comic series. He first appeared in the series' forty-eighth issue, which was also the first issue in the Extremes story arc. The cover for Extremes, Part 1 depicted the man wielding two lightsabers while combating Cade Skywalker. However, the story itself presented him using only one lightsaber. Jan Duursema, who penciled the Sith, later confirmed that he was a Human with spike implants grafted on his skull. Duursema later confirmed that all Sith who were tattooed in the Legacy comics held the title of Sith Lord and were Sith warriors in Darth Krayt's Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/138_ABY",
  "/wiki/Daluuj/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Legacy_(2006)_48",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Final_Protocol",
  "/wiki/Planet/Legends",
  "/wiki/Dac",
  "/wiki/Viral_spore",
  "/wiki/Sith/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Vul_Isen",
  "/wiki/Vul_Isen%27s_laboratory",
  "/wiki/Jedi/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Mission_to_Daluuj",
  "/wiki/Lord/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Cho_mok/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Death/Legends",
  "/wiki/Laboratory/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Standard_year/Legends",
  "/wiki/137_ABY",
  "/wiki/Voice",
  "/wiki/Genocide_on_Dac",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Givin/Legends",
  "/wiki/Water/Legends",
  "/wiki/Jariah_Syn",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Wolf_Sazen",
  "/wiki/Hair/Legends",
  "/wiki/Ear/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy:_Extremes",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Jan_Duursema",
  "/wiki/Sith_Warrior",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_122",
  "/wiki/Star_Wars:_Legacy_Volume_10:_Extremes",
  "/wiki/Dark_Horse_Comics",
  "/wiki/June_26",
  "/wiki/2012",
  "/wiki/July_4",
  "/wiki/Legacy_(2006)_49",
  "/wiki/Legacy_(2006)_47",
  "/wiki/Legacy_(2006)_34"
 ]
}