{
 "name": "Unidentified_Knight_of_Zakuul_(Iokath)",
 "display_name": "Unidentified Knight of Zakuul  (Iokath)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Empire",
      "Knights of Zakuul",
      "Knights of Zakuul"
     ]
    }
   ]
  }
 ],
 "content": "During the revolt against the Eternal Empire of the planet Zakuul by the Alliance, a male Human served in the Knights of Zakuul. In the year 3630 BBY, the AI SCORPIO seized control of both the Eternal Empire's automated Eternal Fleet and the Gravestone, the Alliance's flagship, having recognized both as being similar to her design. Using information pieced together from all three, she led the fleet and the Gravestone to the artificial habitat of Iokath, where they were initially constructed. Upon landing, Iokath's caretaker ARIES attacked Alliance and Eternal Empire members, and this Knight was among the few survivors. Hiding away with a few other Knights, the GEMINI droid captains of the Eternal Fleet warships, and officers of the Eternal Empire military, they were discovered by Eternal Empress Vaylin.\nThis Knight served in the Knights of Zakuul, an organization of force-sensitives that believed that the Force was only a tool to be used in the pursuit of justice, and served as warriors for the Emperor of the Eternal Empire of the planet Zakuul. In the year 3630 BBY, Eternal Empress Vaylin of the Eternal Empire and the mysterious droid SCORPIO, planned an assault on the Gravestone, the flagship of the Alliance that was rebelling against the Eternal Empire. During the operation SCORPIO, betrayed Vaylin and took revealed her true intentions-to use information pieced together from herself, the files of the Eternal Empire's automated Eternal Fleet, and the computer core of the Gravestone to take all three to their point of origin.\nThe point of origin was revealed to be an uninhabited artificial structure called Iokath that was constructed by the same species that had built SCORPIO, the Gravestone, and the Eternal Fleet. SCORPIO escaped to the surface in a starship, while the Eternal Fleet and the Gravestone docked on Iokath. Members of the Alliance and the forces of the Eternal Empire, including the Knight, were ejected from their ships and faced hostilities from ARIES, a droid who had become Iokath's self-appointed caretaker following the civil war that had resulted in the extinction of Iokath's creators. The Knight was among a group of Zakuulan Knights, Eternal Empire military officers, and GEMINI droids who took refuge from ARIES' forces in a room near the spire where the Eternal Fleet was docked.\nWhile there, the Knight knelt in the middle of the group and listened to an officer lament their situation, believing they would not survive. At that moment, Empress Vaylin arrived and took control of the group, though she was displeased to see that very few survived ARIES' attacks. A GEMINI droid expressed fear at the situation, and Vaylin destroyed it to motivate everyone else, taking the officer and another GEMINI to a console.\nThe Knight was watching the Eternal Fleet from a nearby balcony, and reported to Vaylin with some surprise that the fleet was back online after they reactivated it. Following the reactivation, the Knight, along with the officer and the GEMINI, made their way to the bridge of one of the warships. Vaylin followed, dragging half of a Purifier droid behind her. The Knight reported that half the fleet had been reactivated, and the officer reported that the rest could be towed. Vaylin ignored them and had the GEMINI slice into the droid to locate ARIES, using the information gained to bombard his base.\nThe Knight had fair skin, dark hair, and brown eyes, and was of the average size of a Knight of Zakuul. He expressed surprise when Vaylin's attempt to release the Eternal Fleet worked.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Human/Legends",
  "/wiki/Zakuulan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Knights_of_Zakuul",
  "/wiki/Emperor/Legends",
  "/wiki/Vaylin",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/War_against_Zakuul",
  "/wiki/Planet/Legends",
  "/wiki/Zakuul",
  "/wiki/Eternal_Alliance",
  "/wiki/Standard_year/Legends",
  "/wiki/3630_BBY",
  "/wiki/Artificial_intelligence/Legends",
  "/wiki/SCORPIO",
  "/wiki/Assault_on_the_Gravestone",
  "/wiki/Eternal_Fleet",
  "/wiki/Gravestone",
  "/wiki/Flagship/Legends",
  "/wiki/Iokath",
  "/wiki/ARIES",
  "/wiki/GEMINI",
  "/wiki/Droid/Legends",
  "/wiki/Eternal_Fleet_warship",
  "/wiki/Officer/Legends",
  "/wiki/Eternal_Empire_military",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Iokath_species",
  "/wiki/Ridala",
  "/wiki/Iokath_civil_war",
  "/wiki/Fleet_Spire",
  "/wiki/Unidentified_Eternal_Empire_officer_(Iokath)",
  "/wiki/Unidentified_GEMINI_unit",
  "/wiki/Unidentified_Purifier_droid",
  "/wiki/Purifier_droid",
  "/wiki/ARIES_base",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2016"
 ]
}