{
 "name": "Unidentified_Human_bounty_hunter_(Valin_Horn)",
 "display_name": "Unidentified Human bounty hunter  (Valin Horn)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Tall"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Daala's special-missions force",
      "Daala's special-missions force"
     ]
    }
   ]
  }
 ],
 "content": "A Human female bounty hunter was hired in 43.5 ABY by Galactic Alliance Chief of State Natasi Daala and partnered with the cyborg mercenary Vrannin Vaxx and Quarren bounty hunter Dhidal Nyz to capture the fugitive Jedi Knight Valin Horn, who had gone on a rampage through the galactic capital of Coruscant after coming down with an enigmatic psychosis. During the chase, however, they were fired upon by ex-smuggler Han Solo and his wife, Leia Organa Solo, in their starship, the Millennium Falcon. The bounty hunters' vehicle, a cargo hauler, was disabled, and the hunters were forced to give up the chase.\nA Human female bounty hunter took part in the manhunt for Jedi Knight Valin Horn in 43.5 ABY. Horn, who had recently developed an enigmatic madness which caused him to believe that everybody he knew had been replaced with an impostor, had been taken to the Jedi Temple to be studied. However, he had quickly escaped and embarked on a destructive rampage through the galactic capital of Coruscant. The Galactic Federation of Free Alliances issued a warrant for his arrest, and several beings—including Jedi, bounty hunters, and Galactic Alliance Security agents—joined the chase. The Human bounty hunter was among the many hunters hired by Chief of State Natasi Daala to be a part of the Chief of State's special-missions force. She was partnered with the cyborg mercenary Vrannin Vaxx and the Quarren bounty hunter Dhidal Nyz. The three hunters rode in the bed of a cargo hauler, which was piloted by another being.\nDuring the chase, Horn, who had been flying in an antique X-wing starfighter, was attacked by Jedi Grand Master Luke Skywalker and forced to eject from the fighter. The cargo hauler maneuvered underneath the falling Horn and caught him in the cargo bed. The bounty hunters trained their weapons on the fugitive, but as Nyz ordered Horn to surrender, Jedi Knight Jaina Solo—also hoping to capture Horn—leapt down towards the cargo bed from a speeder above them. While the three hunters were distracted by Solo, Horn grabbed his ejector seat and jumped off the side of the hauler, rocketing away.\nSolo landed in the cargo bed, and Nyz fired his electric net gun at her. The net caught her and disabled her, causing her to fall over the edge of the hauler. Annoyed by his rash action, the female bounty hunter began to criticize Nyz. Her denigration was cut short, however, as a racing speeder shot by them, causing the hauler's pilot to veer to one side. The cargo bed tilted sharply, and Nyz was thrown off of the vehicle. The female hunter fell, but she quickly went into an acrobatic roll and came to a safe stop at the cargo bed's low railing. As they began to accelerate back up to speed, they were fired upon by former smuggler Han Solo and his wife, Leia Organa Solo, in their starship, the Millennium Falcon. Vaxx was hit, and the cyborg was sent flying into the control cab of the hauler. Smoke began streaming out from the cab, and, with their vehicle disabled, the bounty hunters were forced to give up the chase.\nThe bounty hunter remained composed when under pressure, although she was easily annoyed with the incompetence of her colleagues. Nevertheless, she willingly worked with a team of bounty hunters during the hunt for Valin Horn. She was also very athletic, and, during the chase, when their vehicle veered off to one side, she managed to turn her fall into a somersault and quickly recover her balance. The woman was tall and had blonde hair.\nThe Human female wore a Bantha-hide jacket decorated with several claws and teeth of different colors and sizes, which were sewn onto the jacket. She also carried a Wookiee bowcaster as her weapon of choice during the hunt for Horn.\nThis bounty hunter made her first and only appearance in the first novel of the nine-part Fate of the Jedi series, Outcast, by Aaron Allston.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_human_bounty_hunter",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Daala%27s_special-missions_force",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/43_ABY",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Cyborg/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Vrannin_Vaxx",
  "/wiki/Quarren/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Dhidal_Nyz",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Laser/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Starship/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Cargo_hauler/Legends",
  "/wiki/New_Jedi_Temple",
  "/wiki/Jedi/Legends",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Pilot/Legends",
  "/wiki/Unidentified_pilot_(Valin_Horn)",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Airspeeder/Legends",
  "/wiki/Ejector_seat/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Bantha-hide_jacket",
  "/wiki/Wookiee/Legends",
  "/wiki/Bowcaster/Legends",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Aaron_Allston",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)"
 ]
}