{
 "name": "Unidentified_Imperial_officer_(Dennaskar)",
 "display_name": "Unidentified Imperial officer  (Dennaskar)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "This Imperial Officer was in charge of Dead Castle on Dennaskar around 3 ABY.\nThis officer was present for the attack on this planet, where he helped the Imperials wipe out the populace. After the planet's people had been wiped out, the officer was stationed in the planet's former seat of government. At some point, Darth Vader visited the planet to torture Tay Vanis. Vanis' mind was eventually destroyed, and he was forced into a persistent vegetative state. Vader kept the destroyed man in a small locked room within the castle, and the officer was one of the only men to know Vanis' location.\nAround 3 ABY, Luke Skywalker, Leia Organa, and C-3PO came to the planet searching for Tay Vanis. They were eventually able to meet up with LE-914, Vanis' droid, who led them to the castle. Skywalker was able to take the officer captive, and he led them to the small locked room. Upon unlocking the room, a pre-recorded hologram of Vader appeared to speak to the Rebels, to taunt them for having only found Vanis after he had already been tortured into a coma. As the Rebels listened to the message, the officer stole Organa's blaster, and turned it against her. However, Organa quickly grabbed Skywalker's weapon and shot the man through the forehead, killing him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dead_Castle",
  "/wiki/Dennaskar",
  "/wiki/Officer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Tay_Vanis",
  "/wiki/Persistent_vegetative_state",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/C-3PO/Legends",
  "/wiki/LE-914",
  "/wiki/Hologram/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars_(1977)_80"
 ]
}