{
 "name": "Unidentified_Clone_Captain_(Tranquility)",
 "display_name": "Unidentified Clone Captain  (Tranquility)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Green Company",
      "Green Company"
     ]
    }
   ]
  }
 ],
 "content": "A Clone Captain was a human male clone trooper officer who served in the Grand Army of the Republic during the pan-galactic Clone Wars between the Galactic Republic and the Separatist Alliance. By 22 BBY, the clone was stationed aboard the Venator-class Star Destroyer as part of Green Company with the military rank of Clone Captain. Following the capture of Separatist ally Viceroy of the Trade Federation Nute Gunray, a skirmish took place aboard the Tranquility as Separatist forces attempted to rescue the Viceroy or silence him.\nThe captain participated in the skirmish by securing the Star Destroyer's engine room alongside another clone trooper, but both failed to detect Separatist agent Asajj Ventress. After checking in with Clone Commander CC-1004, both he and the clone trooper moved to the prison level allowing Ventress to sabotage the reactor of the vessel and disorienting the crew. The skirmish ultimately culminated in the successful Separatist rescue of Gunray.\nCreated on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the clone trooper army, the clone was a clone trooper officer within the Grand Army of the Republic. The clone participated in the pan-galactic Clone Wars between the Galactic Republic and the Separatist Alliance, serving in Republic's Green Company of the 41st Elite Corps.\nIn 22 BBY, the clone held the military rank of Clone Captain and was stationed, along with his company, aboard the Venator-class Star Destroyer Tranquility, the flagship of Jedi General Luminara Unduli and her fleet group. Eventually, following the capture of Executive Separatist Council member Viceroy of the Trade Federation Nute Gunray on the planet Rodia by Republic Senator Padmé Amidala and her companions, Green Company was dispatched to retrieve the Viceroy on the surface and secure him aboard the Tranquility.\nWhile in transit, the Tranquility was attacked by Separatist Vulture droid starfighters and Droch-class boarding ships. 41st Elite Corps commanding officer Clone Commander CC-1004 \"Gree\" deployed Green Company to repel the Separatist attack in the main hangar. During this, the captain and another clone trooper travelled to the engine room to secure it, failing to detect Separatist agent Asajj Ventress who had infiltrated the ship and set up explosives. They did, however, encounter the WED-15 Treadwell droid 327-T, who was inspecting the room before they arrived. After confirming with his comrade if he witnessed anything and examining the room, the captain contacted Commander Gree to inform him that the engine room seemed secured, and acknowledged an order by Gree ordering the captain and the trooper to move to the prison level, where remaining Separatist forces were located.\nThe accompanying clone trooper then ordered 327-T to watch for intruders but when 327-T protested about how it was addressed, the captain told the trooper that droids did not like being called by their nicknames. With Ventress avoiding detection, she was able to sabotage the reactor and cripple the Tranquility, along with disorienting Republic forces. By the end of the skirmish, Ventress managed to successfully rescue Gunray from the grip of the Republic.\nAs a clone of the bounty hunter Jango Fett, the captain was a human male who stood at 1.83 meters tall. The Clone Captain was knowledgeable that droids did not like being called by their nicknames. The captain was also comfortable reporting that the engine room seemed cleared by conducting a visual check and without conducting a lockdown of the area as he reported in.\nThe clone was trained in combat like all fellow clone troopers.\nDespite being an officer, the clone did not personalize his standard phase I clone trooper armor or upgrade it with any additional equipment. As part of Green Company, the captain had the same standard green markings on his white clone trooper armor. He utilized a DC-15A blaster carbine.\nThe clone first appeared, albeit unnamed, in the ninth episode of the first season of Star Wars: The Clone Wars television series, \"Cloak of Darkness,\" which aired on December 5, 2008. Like all clone troopers in the series, the captain was voiced by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Clone_Captain_(Tranquility)",
  "/wiki/Unidentified_clone_trooper_captain_(Tranquility)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Green_Company",
  "/wiki/File:OnOurWay-CoD.ogg",
  "/wiki/Clone_trooper_officer",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galaxy",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/22_BBY",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Military_rank",
  "/wiki/Clone_Captain",
  "/wiki/Mission_to_Rodia",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Rescue_on_the_Tranquility",
  "/wiki/Viceroy",
  "/wiki/Captain",
  "/wiki/Star_Destroyer",
  "/wiki/Engine",
  "/wiki/Unidentified_clone_trooper_(Tranquility)",
  "/wiki/Agent",
  "/wiki/Asajj_Ventress",
  "/wiki/Clone_Commander",
  "/wiki/CC-1004",
  "/wiki/Clone_trooper",
  "/wiki/Prison",
  "/wiki/Reactor",
  "/wiki/File:LockItDown-CoD.ogg",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Jango_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/Army",
  "/wiki/The_galaxy",
  "/wiki/41st_Elite_Corps",
  "/wiki/Company",
  "/wiki/Tranquility",
  "/wiki/Flagship",
  "/wiki/Jedi_General",
  "/wiki/Luminara_Unduli",
  "/wiki/Luminara_Unduli%27s_fleet_group",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Rodia",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/Commanding_officer",
  "/wiki/Hangar",
  "/wiki/WED-15_Treadwell_droid",
  "/wiki/327-T",
  "/wiki/Commander",
  "/wiki/Droid",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Clone_trooper_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Cloak_of_Darkness",
  "/wiki/December_5",
  "/wiki/2008",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Bombad_Jedi",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Weapons_%26_Uniforms"
 ]
}