{
 "name": "Unidentified_Sith_Lord_(Darth_Bane%27s_first_Ruusan_victim)",
 "display_name": "Unidentified Sith Lord  (Darth Bane's first Ruusan victim)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1000 BBY",
      "Ruusan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith",
      "Brotherhood of Darkness"
     ]
    }
   ]
  }
 ],
 "content": "A Human male served as a Sith Lord in Dark Lord of the Sith Skere Kaan's Brotherhood of Darkness during the final years of the New Sith Wars. In 1002 BBY, the man underwent training at the Sith Academy on the planet Korriban, and was promoted with his fellow students to the rank of Sith Lord in 1000 BBY. While he was on the planet Ruusan, the man fought during the fifth battle of the Ruusan campaign and was heavily wounded after the forces of the Army of Light defeated the Sith. The Sith Lord Darth Bane, who did not participate in the battle, found the man dying and being comforted by the native Bouncers. After speaking with Bane about the preceding skirmish and the status of the Sith Order, the Sith Lord was killed when Bane used his boot to crush the man's skull against the rocks upon which he was propped.\nDuring the New Sith Wars, in the year 1002 BBY, a Human male underwent training as an apprentice at the Sith Academy on the planet Korriban. Two years later, the man was promoted to the rank of Sith Lord in Skere Kaan's Brotherhood of Darkness, due to the increasing need for Sith Lords to combat the Jedi Order's Army of Light. He, along with most of the other apprentices at the Academy, was sent to the planet Ruusan, and eventually participated in the campaign's fifth battle, which resulted in a loss for the Brotherhood. During the conflict, the Sith Lord's lightsaber was destroyed and he was grievously injured in his stomach area, although he managed to support himself by resting on some rocks. Four Bouncers—members of a telepathic species native to Ruusan—also began projecting thoughts of peace and serenity in the injured man's mind.\nThe man encountered the Sith Lord Darth Bane, who had been one of his fellow students on Korriban, after the latter arrived on Ruusan near the site of the battle. Realizing that a report from Kaan stating that Bane had perished was untrue, the man expressed his delight in being able to die in what he felt was a glorious fight, a feeling with which Bane did not agree. The man tugged at Bane's heel as he turned to leave, but Bane lifted his boot and stomped the man's head in the rocks that were propping him up, revealing to the man before killing him that he had claimed the title of \"Darth,\" which had been banned by Kaan in an attempt to prevent infighting in his organization. Bane went on to manipulate Kaan into destroying the Brotherhood of Darkness, and secretly established a new order of Sith Lords, limiting the Sith to a Master and an apprentice.\nThe Sith Lord was a light-skinned Human male who had a red circular tattoo which covered part of his forehead. He also had blue eyes, wore a set of Sith robes, and used a lightsaber during combat. The man believed that it was an honor to die as a result of participating in the conflict with the Jedi, and attempted to implore Bane into aiding him. In Bane's estimation, the man was so much of a lesser Sith that the former did not bother to learn the latter's name.\nWhile the Sith Lord was sensitive to the Force, he was one of the Korriban Sith Academy's lesser apprentices, which was noted by Darth Bane. While he was able to survive the fifth battle's conclusion, the man did not do so without receiving a mortal wound.\nThe Sith Lord was introduced in the second issue of the Star Wars: Jedi vs. Sith comic miniseries, written by Darko Macan. He was penciled in the comic by Ramón F. Bachs. The character was later featured in Drew Karpyshyn's novel Darth Bane: Path of Destruction, which expounded on the background of the titular character. The events of the Sith Lord's death at Bane's hands were identical in the comic and the novel. However, the novel presented a few differences, such as the length of the conversation between the Sith and Bane, and some differences in the physical condition of the Sith Lord.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Darth_Bane:_Path_of_Destruction",
  "/wiki/Jedi_vs._Sith_2",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/1000_BBY",
  "/wiki/Ruusan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Skere_Kaan",
  "/wiki/Standard_year/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/1002_BBY",
  "/wiki/Sith_training",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/Sith_Acolyte",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Fifth_Battle_of_Ruusan",
  "/wiki/Ruusan_campaign",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Death/Legends",
  "/wiki/Bouncer",
  "/wiki/Boot/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Sith_lightsaber/Legends",
  "/wiki/Telepathy/Legends",
  "/wiki/Species/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Sith_Master/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Sith_apparel",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Star_Wars:_Jedi_vs._Sith",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Darko_Macan",
  "/wiki/Ram%C3%B3n_F._Bachs",
  "/wiki/Drew_Karpyshyn",
  "/wiki/Darth_Bane:_Path_of_Destruction_(audiobook)",
  "/wiki/The_Essential_Guide_to_Warfare"
 ]
}