{
 "name": "Unidentified_Sith_Councilor_(crystal_vessel)",
 "display_name": "Unidentified Sith Councilor  (crystal vessel)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sith Council",
      "Sith Council"
     ]
    }
   ]
  }
 ],
 "content": "A Sith male Sith Lord served as a member of the Sith Empire's ruling council during the time leading up to the Great Hyperspace War of 5000 BBY. When his fellow Sith Lord Simus was killed that year in what the Sith Council assumed to have been a Galactic Republic attack, the Councilor expressed his outrage at the supposed perpetrators. Later, the Councilor participated in a private ceremony where the newly elected Dark Lord of the Sith, Naga Sadow, was branded with the emblem of the Dark Lords. When Sadow subsequently summoned the Sith Lords of the empire during the preparations for the upcoming invasion of the Republic, the Councilor was among the Lords that gathered at Sadow's fortress on the planet Khar Delba.\nA Sith Lord who ruled over a dozen worlds of the Sith Empire served as a member of its Sith Council by 5000 BBY. That year, when the explorers Gav and Jori Daragon of the Galactic Republic's Koros system arrived in Sith Space, the Sith Councilor's fellow Sith Lord Naga Sadow plotted to use their arrival to force the Sith Empire into a new phase of expansion via an invasion of the Republic. To that end, Sadow violently liberated the Daragon siblings from their imprisonment on the Sith capital planet Ziost, in the process planting as evidence Republic blaster weapons and murdering Simus—his former mentor who had survived a long-ago decapitation in the form of a disembodied head.\nSadow's actions led the Sith Council to believe the Daragons were Republic spies and that their liberation was a precursor to a Republic invasion of the Sith Empire. When, during a session of the Council held in Ziost's Sith Citadel, the Sith Lord Dor Gal-ram revealed that Simus had been murdered, his fellow Councilor expressed his outrage at the actions of the perpetrator—believed by the Council to have been Republic agents.\nSadow subsequently feigned shock at Simus's death and, in a speech delivered to the Sith Council, used the recent events as an argument for both crowning him as the new Dark Lord of the Sith of the empire and launching a conquest of the Republic. Being a part of the majority of the councilmembers that expressed its support for Sadow's candidature, the Sith Councilor affirmed the urgent necessity for the election of a new leader for the empire. After Sadow's rival, Ludo Kressh, and his supporters stormed out of the Council chamber in protest over Sadow's election, the Sith Councilor and his remaining peers all bowed to Sadow as their new Dark Lord. Meanwhile, Sadow instructed all of them to rally their warships and soldiers for an upcoming invasion of the Republic.\nLater, the Sith Councilor and one of his fellow councilmembers took part in the private ceremony of Sadow receiving the mark of the Dark Lord of the Sith. During the ritual, the Councilor held a crystalline vessel containing a pair of arthropods. His colleague then took the container and released the arthropods on Sadow's forehead, where the creatures burned the emblem of the Dark Lords into the new Sith ruler's skin. At the conclusion of the ceremony, both of the Sith Lords performing the ritual bowed to Sadow, with the Sith Councilor imploring that the Dark Lord act toward the protection of the Sith Empire from its enemies.\nThe Sith Lords loyal to Sadow engaged in the construction of starships for the upcoming offensive. After Sadow's forces crippled the fleet of Kressh and his supporters, the Dark Lord ordered his Massassi followers to rally all the loyalist Lords to his fortress on the planet Khar Delba. The Sith Councilor was among the Lords that arrived soon thereafter, kneeling to Sadow upon arrival. The Sith Lords then attended a meeting with Sadow concerning the planned invasion of the Republic, after which the Lords' fleets were summoned to the Khar Delba system. From there, the Sith invasion fleet subsequently launched its attack on the Republic. The Republic ultimately thwarted the Sith Empire's attempt at conquest and in return launched a counterinvasion of Sith Space that eventually saw the decimation of the Sith species.\nAs a Sith Lord of the Sith Empire and a member of the empire's Sith Council, the Sith Councilor was loyal to the Dark Lord of the Sith. He also held the long-lived fellow Sith Lord Simus in great esteem. The Sith Councilor was a male of the Sith species. He had red skin, brown hair which he wore in a ponytail, and a long brown beard. The Councilor had on his forehead a black tattoo depicting an abstract symbol.\nThe Sith Councilor wore blue or brown robes with bulky upper-torso armor complemented by a metallic belt and armored knee-pads. He also wore a metallic headdress and a pair of ornamental gauntlets, both inlaid with gemstones. The Councilor's beard was decorated with a small bone, and he was equipped with a Sith sword with a jagged blade.\nThe Sith Councilor first appeared in the third issue of Dark Horse Comics' Star Wars: Tales of the Jedi — The Golden Age of the Sith comic book mini-series. The issue was written by Kevin J. Anderson, penciled by Dario Carrasco, Jr., and published on December 11, 1996.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Sith_Council",
  "/wiki/Time/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/5000_BBY/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Simus",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/First_raid_on_the_Sith_Citadel",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Naga_Sadow%27s_Khar_Delba_citadel",
  "/wiki/Planet/Legends",
  "/wiki/Khar_Delba",
  "/wiki/Scout/Legends",
  "/wiki/Gav_Daragon",
  "/wiki/Jori_Daragon",
  "/wiki/Empress_Teta_system/Legends",
  "/wiki/Sith_Worlds",
  "/wiki/Prison/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Ziost/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Weapon/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Duel_between_Marka_Ragnos_and_Simus",
  "/wiki/Spy/Legends",
  "/wiki/Sith_Citadel_(Ziost)",
  "/wiki/Dor_Gal-ram",
  "/wiki/Ludo_Kressh",
  "/wiki/Ludo_Kressh%27s_faction",
  "/wiki/Warship/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Unidentified_Sith_Councilor_(Sith_arthropods)",
  "/wiki/Crystal/Legends",
  "/wiki/Sith_pincerbug",
  "/wiki/Arthropod/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Battle_of_Khar_Delba",
  "/wiki/Fleet/Legends",
  "/wiki/Massassi/Legends",
  "/wiki/Khar_Delba_system",
  "/wiki/Sith_invasion_fleet",
  "/wiki/Post%E2%80%93Great_Hyperspace_War_counterinvasion",
  "/wiki/Species/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Gemstone/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Sith_sword",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_3",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Golden_Age_of_the_Sith",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Dario_Carrasco,_Jr.",
  "/wiki/December_11",
  "/wiki/1996",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_4",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Fall_of_the_Sith_Empire_1",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Category:Images_of_the_unidentified_Sith_Councilor_(crystal_vessel)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Fall_of_the_Sith_Empire",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_5",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Fall_of_the_Sith_Empire_2",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Fall_of_the_Sith_Empire_5",
  "/wiki/The_Essential_Atlas",
  "/wiki/Marvel_Comics"
 ]
}