{
 "name": "Unidentified_Imperial_officer_(Terror)",
 "display_name": "Unidentified Imperial officer  (Terror)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "This Imperial officer served aboard the Super Star Destroyer Terror during the Galactic Civil War.\nWhile he was on duty, he stumbled across Rookie One and Ru Murleen, both of whom were members of the Rebel Alliance disguised as Stormtroopers, in a restricted area. He quickly realized the two were intruders due to their lack of security clearance and raised the alarm when Rookie One seals the door beside them.\nDuring the search for the two Rebels, he inspected a Stormtrooper guard about to doze off in the hangar. While the officer threatened the Stormtrooper to have him transferred to a refuse barge \"where he'll stay for the next 20 years\", behind their backs Rookie One and Ru Murleen exited the sewers of the Terror and gained access to the hangar.\nThe officer and the Stormtrooper barely had the time to dodge the stolen TIE Phantom that flew right over them on its way to the exit.\nThe officer was most probably killed in the explosion of the Terror, after the Rebels destroyed the ship's internal systems.\nThe officer was created for the LucasArts video game Star Wars: Rebel Assault II: The Hidden Empire, in which he is portrayed by Howard Swain.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Terror",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Rookie_One",
  "/wiki/Ru_Murleen",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Garbage_compactor/Legends",
  "/wiki/TIE_Phantom",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/Howard_Swain"
 ]
}