{
 "name": "Unidentified_Advanced_Recon_Commando",
 "display_name": "Unidentified Advanced Recon Commando",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Rancor Battalion",
      "Rancor Battalion"
     ]
    }
   ]
  }
 ],
 "content": "An Advanced Recon Commando was a human male clone trooper serving in Rancor Battalion, a part of the Grand Army of the Republic, during the Clone Wars between the Galactic Republic and the Separatist Alliance. In 22 BBY, the Advanced Recon Commando was stationed on the planet Kamino while his battalion oversaw the training of Republic clone cadets. He later participated in the Battle of Kamino in 21 BBY, where the clone directed Republic troops in fighting off the invading Separatist forces.\nThe commando wore white ARC trooper armor that featured red and gray highlights, a kama, and two pauldrons. As part of his equipment, the trooper wielded either two DC-17 hand blasters or a DC-15A blaster rifle. As a clone of Jango Fett, he stood at 1.83 meters. Additionally, the clone had received further training due to his ARC status.\nGrown on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the clone trooper army, the clone was an Advanced Recon Commando, or ARC trooper, in the Grand Army of the Republic after being trained in the ARC program. He participated in the pan-galactic Clone Wars between the Galactic Republic and the Separatist Alliance, serving in Republic's Rancor Battalion alongside Clone ARC Commanders Colt, Havoc, and Blitz.\nEarly during the Clone Wars, in 22 BBY, he was stationed on Kamino alongside Colt, Havoc, and Blitz, who oversaw the training of clone cadets. The commando walked with two other clone troopers in a hangar at Tipoca City where Domino Squad, Bravo Squad, and two other cadet units were present, and listened to speeches given by Master Chief Bric and Commander Colt.\nThe ARC trooper was later present above the arena housing the Citadel Challenge training course, observing the cadets' final exam. Alongside several other clone cadets, he witnessed Domino Squad fail to complete the challenge. However, after Jedi General Shaak Ti allowed the squad to try the final examination a second time, the commando saw the group succeed at the test.\nLater in the war, during 21 BBY, the Separatist Alliance launched an attack on Kamino. During the naval engagement, Separatist Munificent-class star frigates launched Trident-class assault ships disguised as debris into the oceans below. The assault ships then attacked the Tipoca City Military Complex, causing the city's forces to ready for battle. As such, the ARC trooper joined Commanders Colt, Havoc, and Blitz at the main hangar to defend it and direct Republic forces. As Havoc gave an assignment to troopers CT-1409 \"Echo\" and CT-5555 \"Fives,\" the commando was directing a number of other troops.\nWhen a Trident-class assault ship prepared to breach the hangar, the ARC trooper gave a hand signal to a clone armed with a Z-6 rotary blaster cannon, directing him to hold fire. After the hangar was breached by a second assault ship, Republic troops engaged the AQ-series battle droids that had deployed from the enemy craft, with the Advanced Recon Commando continuing to command Republic forces. Eventually, Separatist forces grew thin and were pushed back to the main hangar. With the deaths of Colt and Havoc, the Advanced Recon Commando remained in the hangar and was joined by Shaak Ti.\nThe commando and other clone troopers subsequently managed to destroy both Trident-class assault ships that had breached the main hangar, while Commander Blitz directed a trio of Advanced Recon Force Scout Troopers, ordering one to fire on an assault ship with a rocket launcher. The Separatist forces were ultimately defeated, and the ARC trooper was near Clone Marshal Commander CC-2224 \"Cody\" and Clone Captain CT-7567 \"Rex\" as the pair promoted Echo and Fives to ARC trooper status.\nAs a clone of the bounty hunter Jango Fett, the commando was a human male who stood at 1.83 meters tall.\nThe clone had received ARC training at one point prior to serving as an ARC trooper. During the Battle of Kamino, the ARC trooper fought on the front lines, commanding other troopers and engaging Separatist forces.\nAs an ARC trooper, the clone made use of white Phase I ARC Trooper Armor, which included a helmet with a rangefinder; a kama; a double pauldron; additional gray armor platings on the chest, arms, and legs; a survival pack; and two holsters for DC-17 hand blasters. Additionally, his ARC trooper armor featured red markings, and he utilized a DC-15A blaster rifle.\nThe Advanced Recon Commando first appeared, albeit unnamed, in the episode \"Clone Cadets,\" the first episode of the third season of the animated television series Star Wars: The Clone Wars. The episode aired on September 17, 2010. Although not established in any official source, Lucasfilm Story Group executive and Keeper of the Holocron database Leland Chee mentioned on Twitter in 2021 that the commando was named \"Hammer\" during the episode's production. Two digital cards released through the Star Wars: Card Trader game, the first released on October 12, 2018 and the second on February 21, 2019, used images of Clone ARC Commander Colt but referred to him as \"Clone ARC Commander Hammer.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Unidentified_Advanced_Recon_Commando",
  "/wiki/Unidentified_Advanced_Recon_Commando/Legends",
  "/wiki/Unidentified_Advanced_Recon_Commando_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Rancor_Battalion",
  "/wiki/Clone_trooper",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/22_BBY",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Planet",
  "/wiki/Battalion",
  "/wiki/Clone_cadet",
  "/wiki/Battle_of_Kamino",
  "/wiki/21_BBY",
  "/wiki/Troop",
  "/wiki/Confederacy_military",
  "/wiki/Commando",
  "/wiki/Color",
  "/wiki/ARC_trooper_armor",
  "/wiki/Kama",
  "/wiki/Pauldron",
  "/wiki/Trooper",
  "/wiki/DC-17_hand_blaster",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/Jango_Fett",
  "/wiki/ARC_program",
  "/wiki/Reproduction",
  "/wiki/DNA",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/Army",
  "/wiki/The_galaxy",
  "/wiki/Clone_ARC_Commander",
  "/wiki/Colt",
  "/wiki/Havoc_(ARC_trooper)",
  "/wiki/Blitz",
  "/wiki/Hangar",
  "/wiki/Tipoca_City",
  "/wiki/Domino_Squad",
  "/wiki/Bravo_Squad_(clone_cadets)",
  "/wiki/Cadet",
  "/wiki/Master_Chief",
  "/wiki/Bric",
  "/wiki/Clone_Commander",
  "/wiki/Citadel_Challenge",
  "/wiki/Squad",
  "/wiki/Jedi_General",
  "/wiki/Shaak_Ti",
  "/wiki/Time",
  "/wiki/File:ShaakTi-Kamino.ogg",
  "/wiki/ARC_Troopers",
  "/wiki/Naval_warfare",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Trident-class_assault_ship",
  "/wiki/Ocean",
  "/wiki/Assault_ship",
  "/wiki/Tipoca_City_Military_Complex",
  "/wiki/City",
  "/wiki/Surface_warfare",
  "/wiki/Commander",
  "/wiki/Republic_Military",
  "/wiki/Echo",
  "/wiki/CT-5555",
  "/wiki/Starship",
  "/wiki/Limb",
  "/wiki/Z-6_rotary_blaster_cannon",
  "/wiki/AQ-series_battle_droid",
  "/wiki/Death",
  "/wiki/Advanced_Recon_Force_Scout_Trooper",
  "/wiki/Missile_launcher",
  "/wiki/Clone_Marshal_Commander",
  "/wiki/CC-2224",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Phase_I_ARC_Trooper_Armor",
  "/wiki/Helmet",
  "/wiki/Rangefinder",
  "/wiki/Armor",
  "/wiki/Holster",
  "/wiki/Clone_Cadets",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/September_17",
  "/wiki/2010",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Holocron_continuity_database",
  "/wiki/Leland_Chee",
  "/wiki/2021",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/October_12",
  "/wiki/2018",
  "/wiki/February_21",
  "/wiki/2019",
  "/wiki/Category:Images_of_Unidentified_Advanced_Recon_Commando",
  "/wiki/Databank_(website)",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Supply_Lines",
  "/wiki/StarWars.com",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/19_BBY",
  "/wiki/The_Topps_Company,_Inc."
 ]
}