{
 "name": "Unidentified_Wyrd_second-in-command",
 "display_name": "Unidentified Wyrd second-in-command",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 19 BBY",
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wyrd"
     ]
    }
   ]
  }
 ],
 "content": "A female Tarasin served as the second-in-command of the Wyrd witch coven on the planet Cularin during the latter years of the Galactic Republic. Circa 19 BBY, the second-in-command assisted an effort by the Wyrd to corrupt Cularin's ch'hala tree and was slain by the coven's First Witch to invoke a rite that was intended to kill the ch'hala Heart Tree.\nA Force-sensitive female Tarasin lived during the waning years of the Galactic Republic and became a member of the Wyrd, a coven of dark side Force witches active on the planet Cularin. The Tarasin was younger than the First Witch of the Wyrd, the coven's aged leader, and was appointed as the Wyrd's second-in-command and the First Witch's assistant and designated successor.\nBy the later stages of the Clone Wars, the Wyrd had suffered various setbacks and were reduced in number. Circa 19 BBY, the second-in-command was among a group of the remaining Wyrd members who joined an effort by the First Witch to corrupt Cularin's ch'hala trees, a type of tree common across the world, in order to allow the Wyrd to gain control of the planet's ecology and thereby attain dominance on Cularin. To initiate the plan, the second-in-command accompanied the First Witch and the Wyrd's Inner Circle of senior witches to the Heart Tree, the planet's foremost ch'hala tree. There, under the protection of a contingent of the Wyrd elite guard, they commenced a ritual through which the witches sought to turn the Heart Tree to the dark side of the Force.\nAfter the witches had been performing their ritual for eleven hours, they fell under attack from a group of freelance agents and were forced to abandon the ritual, much to the distress of the second-in-command. As a final ploy to achieve victory for the Wyrd, the First Witch sought to kill the ch'hala by invoking the Path of Blood, an ancient dark side rite that drew power from the death of an individual. The second-in-command incorrectly believed that the First Witch planned to take her own life to call upon the rite and watched on eagerly as the First Witch brandished a meter-long black metallic rod, anticipating the First Witch's imminent demise. The First Witch instead stabbed her second-in-command in the breast to supplicate the Path of Blood and the Tarasin screamed loudly as she died. Her death triggered the discharge of an immense torrent of red-colored energy that tormented and sickened the Heart Tree. However, the ch'hala tree was saved after the Jedi Master Lanius Qel-Bertuk merged his consciousness with the tree to assist it in repelling the dark power unleashed by the Wyrd second-in-command's passing.\nThe second-in-command was ambitious and relished the prospect of ascending to the leadership of the Wyrd.\nThe Wyrd second-in-command was created by Ronald A. Heintz and appeared in A Plague of Darkness, a 2005 roleplaying adventure set within Star Wars Legends continuity which served as the first instalment of the Heart of Evil trilogy of RPGA's Living Force roleplaying campaign. In the adventure, the players roleplay as the freelance agents that challenge the Wyrd at the Heart Tree. It is possible for the player characters to kill the First Witch of the Wyrd during their initial attack on the witches gathered at the ch'hala tree, in which case the second-in-command becomes leader of the Wyrd and sacrifices another of the witches to invoke the Path of Blood. Otherwise, if the First Witch is not killed during the agents' opening assault then the First Witch murders her second-in-command to entreat the dark side rite.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Wyrd",
  "/wiki/A_Plague_of_Darkness",
  "/wiki/Witch/Legends",
  "/wiki/Coven/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ch%27hala_tree",
  "/wiki/Death/Legends",
  "/wiki/Heart_Tree",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/First_Witch_of_the_Wyrd",
  "/wiki/Aide/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Inner_Circle",
  "/wiki/Wyrd_elite_guard",
  "/wiki/Ritual_of_the_Power_of_the_Dark",
  "/wiki/Canon",
  "/wiki/Standard_hour/Legends",
  "/wiki/First_skirmish_at_the_Heart_Tree",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Path_of_Blood",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Breast/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/Ronald_A._Heintz",
  "/wiki/2005",
  "/wiki/Roleplaying_game",
  "/wiki/Heart_of_Evil_trilogy",
  "/wiki/RPGA",
  "/wiki/A_Hero_Seeks_Not_Vengeance",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Galactic_Standard_Calendar"
 ]
}