{
 "name": "Unidentified_Neimoidian_technician_(Harte_Secur)",
 "display_name": "Unidentified Neimoidian technician  (Harte Secur)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mottled green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation",
      "Trade Federation Droid Army",
      "Trade Federation Droid Army"
     ]
    }
   ]
  }
 ],
 "content": "A Neimoidian technician worked for the Trade Federation during the Invasion of Naboo in 32 BBY. He was part of a small task force sent to retrieve a stolen droid control program from a Research Center near the Naboo city of Harte Secur. After regaining the program, the technician was able to reactivate a portion of the Trade Federation Droid Army.\nA Neimoidian male technician was used by the Trade Federation during their invasion of the planet Naboo in 32 BBY. The technician was included in a specialist task force along with five droidekas and a bio cannon, which was charged with retrieving a droid control program that had been stolen by the Naboo and taken to a Research Center near the city of Harte Secur. The task force was deployed via a Neimoidian transport to a camp filled with battle droids deactivated by the loss of the program, where they met with the B1-Series battle droid OOM-9.\nTrade Federation Viceroy Nute Gunray ordered OOM-9 to retrieve the program and protect the technician. The Neimoidian was loaded inside OOM-9's personal Armored Assault Tank for protection while the droids fought through groups of Royal Naboo Security Forces to reach the research center. Once there, the technician retrieved the program and the task force returned to the camp, where the Neimoidian was able to reactivate the droids. The technician then remained inside the camp's command center while the Droid Army destroyed Harte Secur.\nThe Neimoidian technician had red eyes and mottled green skin.\nThe technician was capable of reactivating a portion of the Trade Federation Droid Army after reacquiring a droid control program.\nThe Neimoidian wore blue and gray robes along with a dark blue hat.\nThe Neimoidian technician was first mentioned in the Prima Games' strategy guide by Steven L. Kent—released on November 7, 2001—for the LucasArts video game Star Wars: Galactic Battlegrounds, released on November 11, 2001. He appears in the second level of the Trade Federation campaign, \"Behind the Lines.\" Losing the technician causes the player to automatically lose the level, even after they have retrieved the program.\nThe strategy guide compares the technician to the Jedi in the game, as the technician is the only unit able to move the droid control program, similar to how only Jedi and Sith can move holocrons. The guide also recommends garrisoning the technician inside OOM-9's AAT, which allows the droid control program to be collected by moving the AAT over it. In the level, if the player sends the technician near the program outside of the AAT, the program disappears, only reappearing once the technician returns to the camp.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Neimoidian_technician",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Trade_Federation_Droid_Army/Legends",
  "/wiki/File:We_tech_those.ogg",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Droid_control_program",
  "/wiki/Research_Center",
  "/wiki/Naboo/Legends",
  "/wiki/City/Legends",
  "/wiki/Harte_Secur",
  "/wiki/Technician/Legends",
  "/wiki/File:Tech_objective.ogg",
  "/wiki/Planet/Legends",
  "/wiki/Droideka/Legends",
  "/wiki/Bio_cannon",
  "/wiki/Capture_of_Harte_Secur",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Neimoidian_transport",
  "/wiki/Deactivated_Camp",
  "/wiki/Battle_droid/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/OOM-9/Legends",
  "/wiki/Trade_Federation_Viceroy",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Armored_Assault_Tank",
  "/wiki/Droid/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Command_center",
  "/wiki/Eye/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Hat/Legends",
  "/wiki/Prima_Games",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Steven_L._Kent",
  "/wiki/November_7",
  "/wiki/2001",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/November_11",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Category:Images_of_Unidentified_Neimoidian_technician_(Harte_Secur)",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns"
 ]
}