{
 "name": "Unidentified_Mirialan_ensign",
 "display_name": "Unidentified Mirialan ensign",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "61st Mobile Infantry",
      "61st Mobile Infantry"
     ]
    }
   ]
  }
 ],
 "content": "A Mirialan male served as an ensign in the Rebel Alliance's 61st Mobile Infantry during the Galactic Civil War, operating aboard the bridge of the CR90 corvette Thunderstrike. In 3 ABY, the Thunderstrike was infiltrated in the Elochar sector by some Imperial spies who captured the ensign and four other bridge crewmembers.\nThe rebel soldier Brand arrived at the bridge and the remaining bridge crew helped her defeat the spies by attacking them. Of the crew, two ensigns survived, including the Mirialan, and they then took to their stations at the bridge. The Mirialan argued to Brand that they needed to activate the corvette's shields, but he was overruled. The Thunderstrike escaped shortly after with its escort.\nDuring the Galactic Civil War between the Rebel Alliance and the Galactic Empire, a Mirialan served as an ensign in the Alliance's 61st Mobile Infantry, better known as Twilight Company. He was stationed aboard the bridge of the company's CR90 corvette, the Thunderstrike, and served under Commander Paonu, who led ship operations. In 3 ABY, the Thunderstrike and its escort, the Braha'tok-class gunship Apailana's Promise, rendezvoused with an Alliance flotilla in the Elochar sector for repairs. However, some Imperial spies were able to infiltrate the corvette by posing as survivors of a damaged rebel freighter.\nLieutenant Sairgon attempted to contain the spies from the bridge by locking the Thunderstrike down. When the infiltrators reached the bridge, the lieutenant prompted the rest of the flotilla through a message to flee before being killed. The Mirialan ensign and four others were then captured by the spies. After the rebel soldier Brand entered the bridge and fired at the infiltrators, the ensign and the other surviving bridge crew wrestled their captors. The bridge crew defeated multiple spies, who fired back at them, while Brand killed the others. By that time, however, the Mirialan and another ensign were the only surviving crew.\nBrand, assuming command as Paonu had been killed, ordered the pair to get to their stations, and one of them reported that the Imperial II-class Star Destroyer Herald, which had since arrived to deal with Twilight Company, was firing at the Thunderstrike and Apailana's Promise. Brand told the ensigns to get ready to jump the Thunderstrike into hyperspace. The Mirialan, while focusing on his control panel, argued that they needed to activate the corvette's shields. Brand overruled the ensign and insisted that the Thunderstrike could take a hit to escape immediately. She also sent coordinates to the Promise, and the two vessels fled into hyperspace under fire.\nThe ensign was a male Mirialan with yellow skin and black tattoos covering his face. When Brand insisted that the Thunderstrike needed to jump to hyperspace immediately, the Mirialan was more insistent on activating the corvette's shields first, focusing on his control panel as he argued his point to the soldier.\nThe Mirialan ensign appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Mirialan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Ensign",
  "/wiki/Galactic_Civil_War",
  "/wiki/Bridge_(starship)",
  "/wiki/CR90_corvette",
  "/wiki/Thunderstrike",
  "/wiki/3_ABY",
  "/wiki/Infiltration_of_the_Thunderstrike",
  "/wiki/Elochar_sector",
  "/wiki/Galactic_Empire",
  "/wiki/Spy",
  "/wiki/Rebel_trooper",
  "/wiki/Brand",
  "/wiki/Corvette",
  "/wiki/Deflector_shield",
  "/wiki/Apailana%27s_Promise",
  "/wiki/Company",
  "/wiki/Commander",
  "/wiki/Paonu",
  "/wiki/Starship",
  "/wiki/Braha%27tok-class_gunship",
  "/wiki/Flotilla",
  "/wiki/Trumpet%27s_Call",
  "/wiki/Lieutenant",
  "/wiki/Sairgon",
  "/wiki/Death",
  "/wiki/Time",
  "/wiki/Commanding_officer",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Herald",
  "/wiki/Hyperspace",
  "/wiki/Tattoo",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Rebel_Files"
 ]
}