{
 "name": "Unidentified_Pyke_courier_1",
 "display_name": "Unidentified Pyke courier 1",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pyke"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light blue and beige"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "A male Pyke courier worked for the Pyke Syndicate on the planet Tatooine around 9 ABY. He and three other Pykes encountered Marshal Cobb Vanth whilst in the marshal's territories. While Vanth tried to convince the Pykes to leave, the courier attempted to draw on the marshal, only to be gunned down with two of his colleagues.\nAround 9 ABY, the male Pyke worked as a courier in the Pyke Syndicate during its takeover of the desert planet Tatooine. He and three other Pykes went into Tatooine's Mos Pelgo territories, consulting with his comrades about their cargo of spice and credits over their landspeeder by some moisture vaporators. While they discussed what to do with the cargo, Marshal Cobb Vanth of Mos Pelgo approached the group. The courier reached for his blaster pistol when Vanth told him to think his decision through, the marshal gripping his own pistol.\nThe courier and his comrades stared at Vanth, who said he ran things in the territories and offered the Pykes a chance to return to the rest of their syndicate without any commotion. Nodding at his colleagues, the courier pretended to abide with the marshal's terms by turned from Vanth. The Pyke then attempted to draw his blaster on Vanth, but the marshal drew quicker and shot down the courier and two of his three comrades as they attempted to make a move on their new adversary. The courier dropped dead to the ground with a groan, and Vanth advised the Pyke's last remaining colleague to flee with a warning for the syndicate.\nA male Pyke with blue and beige skin, the courier faked his compliance with Cobb Vanth in an attempt to take the marshal by surprise, the effort leading only to his demise.\nThe Pyke courier wore brown and black clothing with a brown belt and boots and a dark helmet with an orange breath mask. He wielded a blaster pistol.\nThe Pyke courier appeared in \"Chapter 6: From the Desert Comes a Stranger,\" the sixth episode of the Disney+ series The Book of Boba Fett which was directed by Dave Filoni and released on February 2, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Pyke",
  "/wiki/Gender",
  "/wiki/Pyke_Syndicate",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Planet",
  "/wiki/Marshal",
  "/wiki/Cobb_Vanth",
  "/wiki/Mos_Pelgo_territories",
  "/wiki/War_for_Tatooine",
  "/wiki/Desert",
  "/wiki/Spice",
  "/wiki/Credit",
  "/wiki/Landspeeder",
  "/wiki/Moisture_vaporator",
  "/wiki/Freetown",
  "/wiki/Blaster_pistol",
  "/wiki/Pistol",
  "/wiki/Blaster",
  "/wiki/Death",
  "/wiki/Unidentified_Pyke_courier_2",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Helmet",
  "/wiki/Breath_mask",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Dave_Filoni",
  "/wiki/February_2",
  "/wiki/2022",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Boba_Fett",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor"
 ]
}