{
 "name": "Unidentified_lieutenant_(Accresker)",
 "display_name": "Unidentified lieutenant  (Accresker)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Officer Corps",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "This female individual was a lieutenant in the Galactic Empire. She was seen assisting an interrogation officer at Accresker Jail, most notably interrogating the female prisoner known as Joystick Chevron. Although the initial interrogation was unsuccessful, they used a Bor on the woman and she gave in, revealing that gundravian hookspores were growing in the prison.\nShortly after the attack on an EF76 Nebulon-B escort frigate, the prisoner known as \"Joystick Chevron\", who was hiding her identity from the Galactic Empire, was taken in for interrogation with the interrogation officer and the lieutenant. The two made Chevron explain her story and as she did, the lieutenant noticed a lot of anxiety spikes from her. She deduced many of Chevron's comments as lies and concluded that the prisoner was hiding something big. The interrogation officer decided to leave it until the next day to use a different and dismissed Chevron.\nOver twelve hours later, the lieutenant escorted Chevron to a cell when Captain-Inspector Magna Tolvan arrived. She told everyone in the room to leave. The lieutenant, however insisted that it was regulations for a prisoner being held to have custodial personnel supervising them. Tolvan therefore ordered her face the wall and hum to herself audibly to avoid hearing what Tolvan had to say to Chevron. The lieutenant did so until the conversation was over.\nFollowing another battle, Chevron was again taken in for interrogation. However this time the interrogation officer used a Bor named Bor Ifriem to penetrate her mind. Chevron was instantly taken over by the creature and said that she was thinking about her mother. The lieutenant concluded it to be true and the interrogation officer threatened to have Bor Ifriem delete her mother from her mind. Chevron gave in, revealing that there were gundravian hookspores, a highly infectious fungus, growing in the prison. The lieutenant was surprised to say that Chevron was right and Accresker command decided to immediately decommission Accresker Jail.\nThe lieutenant was a female human with brown eyes, brown skin and blue lips. Her hair was black and shaved on the sides. She also remembered the regulations, having to remind Magna Tolvan of one when she told everyone in the room to leave. When Magna Tolvan told her to face the wall and hum out loud, she did so accordingly.\nThe lieutenant was able to conclude when Chevron was lying and that the prisoner was hiding something big from her interrogators.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Lieutenant",
  "/wiki/Unidentified_interrogation_officer",
  "/wiki/Accresker_Jail",
  "/wiki/Prisoner",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Mairan",
  "/wiki/Gundravian_hookspore",
  "/wiki/Attack_on_an_EF76_Nebulon-B_escort_frigate",
  "/wiki/Standard_hour",
  "/wiki/Captain-Inspector",
  "/wiki/Magna_Tolvan",
  "/wiki/Attack_on_a_pirate_station",
  "/wiki/Bor_Ifriem",
  "/wiki/Lona_Aphra",
  "/wiki/Fungus",
  "/wiki/Accresker_command",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Doctor_Aphra_(2016)_20",
  "/wiki/Doctor_Aphra_(2016)_21",
  "/wiki/Doctor_Aphra_(2016)_22"
 ]
}