{
 "name": "Unidentified_wealthy_industrialist",
 "display_name": "Unidentified wealthy industrialist",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "During the formation of the Galactic Empire, an industrialist of considerable wealth placed a hit on the Sith Lord Darth Vader, as revenge for the latter murdering his only son. He sent out nine assassins, eight of which ended up dead at Vader's hand. After their failures, the industrialist went desperate and had the ninth assassin kill Vader.\nThe industrialist, shortly after the Declaration of a New Order, was forced into renegotiating contracts with various businessmen, with Darth Vader personally overseeing the arrangement. This resulted in them being forced into making concessions to members of a Nautolan-based company. His son, and only heir, attempted to stop the business transaction by shooting the representatives, but Vader used his lightsaber to deflect the shot, and killed him. The father was deeply angered at Vader for this, and decided to have Vader assassinated as revenge for his loss. Some time later, the industrialist was accompanied by eighteen hired guns to escort him through a swampy planet to find his newest contracted killer, due to his previous eight having failed to kill Vader, of which only three were confirmed dead. The assassin's associate denied him entry, although while he was begging to see him, his entire mercenary force was killed silently by the assassin himself. Upon finding that all of the force was dead, and the assassin demanding that he leave, the man begged to hire him, willing to pay any price to satiate his vengeance. Upon agreeing to the terms, the industrialist, in order to meet with the term of \"not seeing nor hearing the assassin again,\" had his eyes gouged out and heavily bandaged, and his ears meeting a similar fate, and then left for his mining facility, satisfied at the thought that his son would be avenged.\nEventually, Vader found the man after disposing of the assassin he hired, although the man had allegedly committed suicide. In reality, Vader arrived at the mining facility, acting as the assassin. When Vader entered the industrialist's office, he gave him, instead of his mask, the assassin's helmet. The industrialist immediately realized it was Vader, and he allowed Vader to kill him with his light saber, as he had failed to avenge his son.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Death/Legends",
  "/wiki/Unidentified_wealthy_industrialist%27s_son",
  "/wiki/Assassin/Legends",
  "/wiki/Unidentified_elite_assassin",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Nautolan/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Unidentified_assassin%27s_associate",
  "/wiki/Darth_Vader_and_the_Ninth_Assassin_1",
  "/wiki/Darth_Vader_and_the_Ninth_Assassin_5"
 ]
}