{
 "name": "Unidentified_Imperial_lieutenant_(Dac)",
 "display_name": "Unidentified Imperial lieutenant  (Dac)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Darth Krayt's Galactic EmpireImperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "This unnamed Imperial lieutenant was an Imperial swimmer pilot in the Imperial Army who served on Dac in 137 ABY during Darth Krayt's campaign against the Mon Calamari, one of whom betrayed the Empire by letting the Galactic Alliance Remnant steal an Imperial star destroyer from the orbital shipyards. He piloted the personal swimmer of Darth Azard and the Sith scientist Vul Isen. He was killed when a Mon Cal piloted his Krakana into the deployment hatch of the swimmer, destroying it .\nAt some point the unnamed lieutenant was trained to pilot Imperial swimmers in the Imperial Army. When the Galactic Empire fractured in two  he served the Sith, under Darth Krayt.\nIn 137 ABY, as response to a Mon Calamari aiding the Galactic Alliance Remnant in stealing an Advanced Star Destroyer from the orbital shipyards, Darth Krayt ordered the extermination and detainment of all Mon Calamari in the galaxy. When the genocide of the Mon Cal commenced on the planet of Dac, an Imperial Army aquatic unit was deployed under Darth Azard. When Vul Isen, a Sith scientist, created the Sea Leviathan creature to use against the Mon Calamari refugees and the Mon Calamari Rangers, him and Darth Azard personally lead the Leviathan to the refugee/ranger base in an Imperial swimmer, piloted by the lieutenant.\nWhen they were attacked by the Rangers, and their Imperial Knight military advisor, they decided to deploy the Shark underwater fighters held in the swimmer. To do so, they lowered the shielding around the deployment hatch. A Mon Cal piloting a Krakana underwater fighter went kamikaze and rammed the open deployment hatch, destroying the swimmer. The head of the swimmer broke off and landed on the sea floor. Though the scientist and Lord Azard survived, the lieutenant was slumped over the controls, and if he didn't die on impact, he was killed later when Vul Isen broke the glass window of the cockpit, flooding it and drowning the lieutenant if he survived the impact.\nThe lieutenant respected the two Sith that he piloted the swimmer for. He was cautious, reminding the Sith that to deploy the Sharks they would needed to lower the shielding around the hatch, making that part of the swimmer vulnerable to attack. His theory proved correct when a Mon Cal rammed the deployment hatch and destroyed the swimmer.\nThe Imperial lieutenant's lone appearance is in the 2009 comic Legacy  33, the second issue of Legacy's Fight Another Day story arc.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/137_ABY",
  "/wiki/Dac",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Darth_Azard",
  "/wiki/Aquatic_Terrain_Armored_Transport",
  "/wiki/Vehicle_Command_Crewer",
  "/wiki/Darth_Krayt",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Sith/Legends",
  "/wiki/Vul_Isen",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Fel_Empire",
  "/wiki/The_galaxy/Legends",
  "/wiki/Genocide_on_Dac",
  "/wiki/Sea_Leviathan",
  "/wiki/Mon_Calamari_Rangers",
  "/wiki/Imperial_Knight",
  "/wiki/Shark_underwater_fighter",
  "/wiki/Krakana_underwater_fighter",
  "/wiki/2009",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_33",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars:_Legacy:_Fight_Another_Day"
 ]
}