{
 "name": "Unidentified_clone_naval_commander_(Tranquility)",
 "display_name": "Unidentified clone naval commander (Tranquility)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Luminara Unduli's fleet group",
      "Luminara Unduli's fleet group"
     ]
    }
   ]
  }
 ],
 "content": "This clone navigation officer served as a Clone Commander in the Republic Navy during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The commander served aboard the Venator-class Star Destroyer Tranquility, the flagship of Jedi General Luminara Unduli and her fleet group.\nBorn on the planet Kamino as a clone of the bounty hunter Jango Fett, this clone navigation officer served the Galactic Republic, eventually taking part in the pan-galactic Clone Wars between the Republic and Separatist Alliance. This clone navigation officer had the rank of Clone Commander, serving aboard the Republic Navy flagship of Jedi General Luminara Unduli who led the 41st Elite Corps and her fleet group, the Venator-class Star Destroyer Tranquility,\nAfter Viceroy of the Trade Federation Nute Gunray was captured on the planet Rodia by Green Company of the 41st Elite Corps, Viceroy Gunray was brought to the Tranquility for transportation to Coruscant and to be interrogated. Senate Commandos had previously been dispatched to the Tranquility and provided additional security. Jedi General Unduli and padawan Ahsoka Tano interrogated Gunray in the ship's brig when Separatist forces launched a surprise attack to either free Gunray or silence him. Three Droch-class boarding ships and Vulture droid starfighters attacked the Tranquility and Separatist forces ultimately triumphed after Senate Guard Captain Faro Argyus betrayed the Republic and liberated Gunray with the help of Sith assassin Asajj Ventress.\nIn the aftermath of the attack, Unduli and Tano conversed with Anakin Skywalker and Yoda on the situation while the clone navigation officer spoke with Commander Gree nearby. Once Unduli finished conversing with the other Jedi, she moved towards the front of the bridge and ordered the clone navigation officer to get the starship underway, to which he acknowledged.\nAs a clone of the bounty hunter Jango Fett, this clone navigation officer was a human male who stood at 1.83 meters tall. He had naturally black hair, brown eyes, and tan skin.\nThis clone navigation officer was trained in naval warfare, excelling to the rank of Clone Commander.\nAs a clone navigation officer, the commander wore a blue variant of the standard Republic military uniform with a rank insignia plaque demonstrating his rank.\nThis clone navigation officer first appeared in \"Cloak of Darkness,\" which was the ninth episode of the first season of the animated TV series Star Wars: The Clone Wars. Like all the clone troopers in The Clone Wars, he was voiced by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_clone_naval_commander_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Luminara_Unduli%27s_fleet_group",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Clone_Commander",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Commander",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Tranquility",
  "/wiki/Flagship",
  "/wiki/Jedi_General",
  "/wiki/Luminara_Unduli",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Clone_navigation_officer",
  "/wiki/The_galaxy",
  "/wiki/Officer",
  "/wiki/Military_rank",
  "/wiki/41st_Elite_Corps",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Mission_to_Rodia",
  "/wiki/Rodia",
  "/wiki/Green_Company",
  "/wiki/Corps",
  "/wiki/Viceroy",
  "/wiki/Coruscant",
  "/wiki/Senate_Commando",
  "/wiki/Jedi",
  "/wiki/General",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Rescue_on_the_Tranquility",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Senate_Guard",
  "/wiki/Captain",
  "/wiki/Faro_Argyus",
  "/wiki/Treason",
  "/wiki/Sith",
  "/wiki/Assassin",
  "/wiki/Asajj_Ventress",
  "/wiki/Anakin_Skywalker",
  "/wiki/Yoda",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Republic_military_uniform",
  "/wiki/Rank_insignia_plaque",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_60",
  "/wiki/Weapons_%26_Uniforms"
 ]
}