{
 "name": "Unidentified_wounded_burglar",
 "display_name": "Unidentified wounded burglar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 44 BBY and 32 BBY",
      "Codia's second moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "A human male burglar was part of a group of thieves who destroyed the power core of a mining outpost on Codia's second moon while attempting to steal a shipment of diamonds. The core's destruction created unusual radioactivity that drove the Defel miner Rosack Denahst into a frenzy, and the miner fatally injured the burglar. The wounded man was then discovered by the Jedi Obi-Wan Kenobi and Qui-Gon Jinn but perished soon after.\nA human male working as a burglar was part of a group of thieves who attempted to steal a shipment of diamonds from a mining outpost on the planet Codia's second moon at some point between 44 BBY and 32 BBY. The group used a non-incendiary photonic charge to destroy the fuel rod of the outpost's power core, but the photonic burst interacted with the accelerite in the core and created unusual radioactivity that suppressed the entire light spectrum in the outpost. The radiation also drove the Defel miner Rosack Denahst into a frenzy, and after the thieves murdered six miners, Denahst slaughtered five of them.\nThe burglar was disembowelled by Denahst, but did not persih immediately, lying wounded near the outpost's entrance. There, he was discovered by the Jedi Qui-Gon Jinn and Obi-Wan Kenobi, who had been sent to investigate the darkness at the outpost. The burglar, whom the Jedi assumed to be a miner, muttered about Denahst's maddness and the threat he posed, but perished before revealing what he was talking about. Kenobi, who had knelt beside the burglar in his final moments, was taken aback by the death, but Jinn stayed focus on the task at hand and helping any other survivors, simply hoping that the man would become one with the Force. The Jedi later learned of the man's true occupation and repaired the power core, restoring Denahst's sanity.\nThe burglar had light skin.\nHe wore an orange jumpsuit with black boots.\nThe burglar was created for the second issue of the Star Wars: Obi-Wan comic series which was written by Christopher Cantwell and illustrated by Luke Ross. Prior to the comic's publication on June 29, 2022, pages including one of the burglar's speech bubbles were published in a preview on StarWars.com on June 15 of that year.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/44_BBY",
  "/wiki/32_BBY",
  "/wiki/Codia%27s_second_moon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Power_core",
  "/wiki/Unidentified_mining_outpost_(Codia%27s_second_moon)",
  "/wiki/Diamond",
  "/wiki/Radiation",
  "/wiki/Defel",
  "/wiki/Miner",
  "/wiki/Rosack_Denahst",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Thief",
  "/wiki/Planet",
  "/wiki/Codia",
  "/wiki/Non-incendiary_photonic_charge",
  "/wiki/Fuel",
  "/wiki/Accelerite",
  "/wiki/Death",
  "/wiki/The_Force",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Obi-Wan_2",
  "/wiki/Star_Wars:_Obi-Wan_(comic_series)",
  "/wiki/Christopher_Cantwell",
  "/wiki/Luke_Ross",
  "/wiki/June_29",
  "/wiki/2022",
  "/wiki/StarWars.com",
  "/wiki/June_15",
  "/wiki/Star_Wars",
  "/wiki/Padawan",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Reproduction",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Marvel_Comics"
 ]
}