{
 "name": "Unidentified_Imperial_lieutenant_(Imperial_Remnant)",
 "display_name": "Unidentified Imperial lieutenant  (Imperial Remnant)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Remnant"
     ]
    }
   ]
  }
 ],
 "content": "The Imperial lieutenant who was ordered to collect a blood sample from the Mandalorian Mirta Gev by the Council of Moffs was a Human female in service to the Imperial Remnant during the Second Galactic Civil War. At the behest of her Moff superiors, she boarded the Galactic Alliance Guard flagship Anakin Solo and, with the permission of the Sith Lords Darth Caedus and Tahiri Veila, took a sample of the prisoner Gev's DNA to add to the Moffs' genetic databank. In retaliation against Mandalorian aggression against the Remnant, the lieutenant was instructed to use the prisoner's blood to create a nanovirus. The strain was developed to target and kill Gev's grandfather, Boba Fett, as well as anyone who was connected to him by blood.\nIn 41 ABY, during the last phase of the Second Galactic Civil War, a Human female lieutenant of the Imperial Remnant was dispatched by the Moff Council to take a blood sample from Mirta Gev, a Mandalorian soldier who had been captured by the Sith Lord Darth Caedus during the Battle of Roche. After being escorted to the prisoner by a GAG trooper, she found Gev, who was in a heavily restrained and injured state, in the middle of being interrogated by Caedus and his apprentice, Tahiri Veila.\nAlthough the Dark Lord of the Sith was initially irritated by the lieutenant's arrival, the lieutenant hesitantly explained that the Moffs ordered her to collect a blood sample from Gev. Caedus ordered her to wait until the interrogation session was completed, and as she left to comply, Veila inquired if the lieutenant's intentions had something to due with the Moffs' nanokiller project. After receiving permission from Caedus, the lieutenant confirmed Veila's suspicions and revealed that the Moffs intended to add Gev's DNA to their genetic databank. The reason for doing so was to retaliate against the Mandalorians' aggression against the Imperial Remnant by creating a strain that was designed to kill anyone who was connected by blood to the Fett family. Since Gev was the granddaughter of Boba Fett, the lieutenant stated that the nanovirus would be easy to manufacture due to the close family relationship between Gev and Fett. She was fully confident that the nanovirus would be ready for deployment on the planet Mandalore in three days, or even just one day if she was allowed to have unlimited access to Gev.\nDarth Caedus' initial irritation with the lieutenant instantly changed to approval, and thus he commended the innovative idea of the Moffs. The revelation of lieutenant's purpose also aided in the progress of the Dark Lord's interrogation when Gev became horrified and fearful for her grandfather's safety. She grudgingly agreed to comply with Caedus' questioning, but ultimately failed to convince Caedus of her honesty. Hence, Caedus believed that she was only being half truthful with him, and thus he ordered the lieutenant to heal Gev's injured body. However, the rest of her answers were lies, and thus Caedus allowed the lieutenant to carry out her orders by extracting a sample of Gev's blood.\nShortly afterward, the lieutenant successfully developed the nanovirus. The Imperial Remnant then unleashed its new weapon on Mandalore. The deployment of the Fett-targeting strain prevented Boba Fett and his granddaughter from ever returning to the Mandalorian homeworld.\nThe Imperial lieutenant was a slender woman who wore a white-colored medic uniform with a Remnant insignia on the collar, thus identifying her as a military officer in the Imperial Remnant. She was loyal to the Council of Moffs and was willing to carry out her orders without question, especially with regard to the Moffs' nanokiller project. She was also very analytical in her work, which she demonstrated through her confidence in creating the nanovirus in an extremely short span of time.\nThe lieutenant was also polite and well-mannered to those of superior rank. Since the Remnant had allied itself with the Galactic Alliance, she was courteous to Darth Caedus, the Alliance's Chief of State, and his apprentice Tahiri Veila. Since Caedus was also the Dark Lord of the Sith who had established a reputation of awe and fear amongst his subordinates, the lieutenant took extra care to be even more respectful and compliant with his wishes. Hence, she was very fearful of the Dark Lord and did not wish to offend him in any way. She even hesitated answering Veila's question about the nanovirus and only did so after she received Caedus' permission to speak. The Dark Lord's calm demeanor somewhat eased the lieutenant's nervousness, but nevertheless she remained strictly formal and gracious when speaking to him. Furthermore, she also referred to him as \"Lord Caedus\" every time she addressed him, both out of respect and fear.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mirta_Gev",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Moff/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Guard",
  "/wiki/Flagship/Legends",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Tahiri_Veila",
  "/wiki/DNA/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Nanovirus",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Clan_Fett",
  "/wiki/41_ABY",
  "/wiki/Soldier/Legends",
  "/wiki/Battle_of_Roche",
  "/wiki/Trooper/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/White",
  "/wiki/Medic/Legends",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Imperial_crest/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Chief_of_State_(Galactic_Alliance)"
 ]
}