{
 "name": "Unidentified_priest_(Red_Nebula)",
 "display_name": "Unidentified priest  (Red Nebula)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Planet of the Red Nebula"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Red Nebula species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Priests of the Red Nebula"
     ]
    }
   ]
  }
 ],
 "content": "The Red Nebula priest resided in the temple in the Red Nebula which housed two crimson jewels important to the priest's religion.\nHe believed that the jewels protected their planet from the destruction which ravaged all other planets in the Red Nebula. Another group believed that the jewels should be destroyed as they were abominations to Cosmic Destiny. This group was exiled, but returned to the Red Nebula having captured a number of mercenaries on Terminus and forced them to attempt to steal the jewels from the temple.\nTwo of the mercenaries they captured were Han Solo and Chewbacca, and the pair were the first to enter the temple and encounter the priest. To prevent the jewels from being taken, the priest called upon the temple guardian to safeguard the sacred gems. However, the guardian was distracted by Chewbacca, who was similar in appearance to the guardian except for being much smaller.\nUsing the distraction to his advantage, Solo took the jewels and brought them back to the exiles' spokesman, Klysk. Klysk and the mercenaries took the jewels from Solo and left the smuggler and his partner stranded on the planet; the exiles then piloted their ship into the sun, intending to destroy the gems and themselves. However, Solo had hidden the real jewels and given fakes to the exiles, thereby saving the planet from destruction according to the priest's beliefs. In return for saving the jewels, the priest provided a spacecraft to Solo and Chewbacca to return to Terminus.\nYears later, Domina Tagge hired a group of bounty hunters to find the rumored crimson gems of the Red Nebula. They found the planet where the jewels were located and captured both the gems and the priest tending them. When Tagge's Mining Explorer left with the gems it was quickly confronted and boarded by Imperial troops, a firefight ensued between the crews and the Imperials captured one of the crimson jewels. In the confusion, the priest, who was dying of wounds he experienced during the fight, released the other crimson jewel. With one jewel exposed without its partner, it unleashed a deadly effect known as the Crimson Forever on the crew of the Mining Explorer. The effect was reversed when the jewel was reunited with its mate.\nThis priest appears to be Human, but with pointy ears. Leland Chee, on the StarWars.com Message Boards, stated his theory that \"all pointy-eared species are either Sephi or closely related to Sephi.\"\nThis priest shares many characteristics with Darth Vader's secretary.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Priest_(disambiguation)",
  "/wiki/Planet_of_the_Red_Nebula",
  "/wiki/3_ABY/Legends",
  "/wiki/Red_Nebula_species",
  "/wiki/Gender/Legends",
  "/wiki/Priests_of_the_Red_Nebula",
  "/wiki/Red_Nebula_temple",
  "/wiki/Red_Nebula/Legends",
  "/wiki/Great_Life_Jewels",
  "/wiki/Red_Nebula_exiles",
  "/wiki/Cosmic_Destiny",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Terminus/Legends",
  "/wiki/Attack_on_the_Red_Nebula_temple",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Red_Nebula_temple_guardian",
  "/wiki/Klysk",
  "/wiki/Nova_Prince",
  "/wiki/Sun_of_the_Planet_of_the_Red_Nebula",
  "/wiki/Starship/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Domina_Tagge/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Mission_to_the_Red_Nebula",
  "/wiki/Mining_Explorer",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Crimson_Forever",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Sephi/Legends",
  "/wiki/Darth_Vader%27s_secretary",
  "/wiki/Star_Wars_(1977)_50",
  "/wiki/StarWars.com",
  "/wiki/June_8",
  "/wiki/2007"
 ]
}