{
 "name": "Unidentified_Trandoshan_leader",
 "display_name": "Unidentified Trandoshan leader",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 32 BBY",
      "moon of Drazkel"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A Trandoshan was the leader of a criminal group that was active during the time of the Galactic Republic. In around 32 BBY, the Trandoshan criminals were present at the auction of the Jedi Padawan Eldra Kaitis, hosted by the crime boss Xev Xrexus. A group of bounty hunters serving the Sith apprentice Darth Maul took Kaitis from the auction's winner, but their vessel was sabotaged as they attempted to escape, crashing on the moon of Drazkel.\nXrexus offered the unsuccessful guests a chance to hunt down Kaitis and her supposed liberators themselves, and the Trandoshans were one such group that landed on the moon to do so. While tracking Kaitis, the Trandoshans encountered Maul's bounty hunter accomplice Cad Bane. The leader accepted Bane's challenge to a fair showdown, but the bounty hunter and his associates instead proceeded to kill the Trandoshans.\nDuring the time of the Galactic Republic, the Trandoshan led a group of other Trandoshan criminals. Shortly prior to the Invasion of Naboo in the year 32 BBY, the Trandoshans were invited to the space station hideout of Xev Xrexus, crime boss of the Xrexus Cartel, who was hosting an auction of the Jedi Padawan Eldra Kaitis. While the guests waited for the event to begin, a group of bounty hunters led by Cad Bane and working for the Sith apprentice Darth Maul, who had gained access to the auction by posing as members of the Haddrex Gang, walked past the Trandoshan group. The Trandoshan leader mocked the former Haddrex protocol droid FE-B3—who Bane's group had tortured into leading them to the auction—pointing out the droid's lack of photoreceptors. In response, Bane threatened the Trandoshan to stay out of their business, to the Trandoshan's shock.\nXrexus soon emerged to welcome the guests, and the auction itself began two hours later. The auction was ultimately won by the industrialist Jee Kra, who intended to leave immediately with Kaitis. However, Maul's group ambushed him at his starship, capturing Kaitis themselves. Xrexus had expected that outcome, disabling the stolen vessel, which fell toward the moon of Drazkel below.\nWith the wrecked starship's occupants still alive, Xrexus addressed the remaining guests, offering them the chance to pay to land on the moon and hunt down the survivors. The Trandoshans, alongside numerous other criminal groups, descended to the moon and embarked on a hunt for Kaitis and her captors. Maul took Kaitis, leading the hunters away from their vessels so that his accomplices could steal one.\nWhile traversing the moon's rocky terrain, the Trandoshan leader came across signs of recent passage, believing their group was close to Kaitis. However, they were instead confronted by Bane, who challenged the Trandoshan to instead face him. The Trandoshan accepted Bane's challenge, telling the group to lower their weapons and let Bane live if he survived. Despite the leader's arrogance, the supposed showdown never took place—the Trandoshan was attacked from above by the bounty hunter Vorhdeilo, while Bane and his associate Aurra Sing shot the remaining criminals dead.\nThe leader was a Trandoshan with orange eyes and green skin. The Trandoshan believed that Bane would be unable to survive their challenged showdown, but ordered the other Trandoshans to be fair and let the bounty hunter live in the event that he won. While aboard the Xrexus Cartel space station, the Trandoshan ridiculed the protocol droid FE-B3's lack of eyes.\nWhile hunting Eldra Kaitis on the moon of Drazkel, the Trandoshan recognized the sign of tracks on the ground, deducing that the group was close behind the Jedi.\nThe Trandoshan wore a black shirt, short gray pants, and an orange vest, with metal bands on both left limbs. The criminal carried a blaster rifle and had another blaster held in a holster. The group used a HCT-2001 Dragonboat-class Reugeot 905 to travel to the auction of Eldra Kaitis and landed the freighter on the moon of Drazkel to hunt down the Padawan.\nThe Trandoshan first appeared in the second issue of the comic series Star Wars: Darth Maul, written by Cullen Bunn, illustrated by Luke Ross, and published by Marvel Comics on March 22, 2017.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/32_BBY",
  "/wiki/Moon_of_Drazkel",
  "/wiki/Trandoshan",
  "/wiki/Color",
  "/wiki/Darth_Maul_(2017)_4",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Auction_of_Eldra_Kaitis",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Eldra_Kaitis",
  "/wiki/Crime_lord",
  "/wiki/Xev_Xrexus",
  "/wiki/Cad_Bane%27s_group",
  "/wiki/Bounty_hunter",
  "/wiki/Sith_apprentice",
  "/wiki/Maul",
  "/wiki/Jee_Kra",
  "/wiki/Starship",
  "/wiki/Skirmish_on_the_moon_of_Drazkel",
  "/wiki/Gender",
  "/wiki/Moon",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Cad_Bane",
  "/wiki/Death",
  "/wiki/Darth_Maul_(2017)_2",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Standard_year",
  "/wiki/Xev%27s_hideout",
  "/wiki/Xrexus_Cartel",
  "/wiki/Haddrex_Gang",
  "/wiki/Protocol_droid",
  "/wiki/FE-B3",
  "/wiki/Torture",
  "/wiki/Droid",
  "/wiki/Photoreceptor",
  "/wiki/Standard_hour",
  "/wiki/Currency",
  "/wiki/Thief",
  "/wiki/Vorhdeilo",
  "/wiki/Aurra_Sing",
  "/wiki/Eye",
  "/wiki/Space_station",
  "/wiki/Limb",
  "/wiki/Blaster_rifle",
  "/wiki/Blaster",
  "/wiki/Holster",
  "/wiki/HCT-2001_Dragonboat-class_Reugeot_905",
  "/wiki/Freighter",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Darth_Maul_(Marvel)",
  "/wiki/Cullen_Bunn",
  "/wiki/Luke_Ross",
  "/wiki/Marvel_Comics",
  "/wiki/March_22",
  "/wiki/2017",
  "/wiki/Category:Images_of_unidentified_Trandoshan_leader",
  "/wiki/Darth_Maul_(2017)_3",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Databank_A-Z",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious"
 ]
}