{
 "name": "Unidentified_Imperial_officer_(Metalorn)",
 "display_name": "Unidentified Imperial officer  (Metalorn)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "A Human male served as an officer under Imperial Governor Corwyth on the planet Metalorn during the Galactic Civil War. In the year 0 ABY, Princess Leia Organa of the Rebel Alliance infiltrated the factory planet in order to spread the seeds of rebellion among the uninformed worker populace, which had little knowledge of the outside galaxy and its current events.\nOrdered to find Organa, the officer used a tracking device implanted in a stolen blaster to track her to an ore processing center. When the conveyor bucket that the tracking device was broadcasting from appeared within the line of sight of the officer's stormtroopers, the officer ordered his men to open fire. After the smoke had cleared, they discovered that Organa had escaped, and all that was present in the conveyor bucket was the stolen blaster.\nDuring the reign of the Galactic Empire, a Human male served the Imperial forces as an officer on the planet Metalorn, located in the Mid Rim. The officer worked under the command of the planet's Imperial governor, Corwyth.\nUnder Corwyth, the smog-and-factory-covered Metalorn was kept isolated from outside influences, which left the local populace unaware of the Rebel movement fighting the rule of the Empire in the Galactic Civil War. In addition, Corwyth designed an elaborate security system centered around the use of tracking devices in electrical equipment and weapons. As such, if an individual ever stole a blaster, the Imperials could easily locate that person due to the tracking device built into the gun.\nIn the year 0 ABY, the Rebel princess from the planet Alderaan, Leia Organa, attempted to infiltrate Metalorn in order to bring the world out of the dark and take the planet's populace to the brink of rebellion. Not long into her mission, Organa encountered a lone stormtrooper, whom she dispatched; unaware of the tracking device in the trooper's blaster, Organa took the weapon for herself and proceeded with her mission.\nThe Imperial officer was tasked with tracking down the stolen blaster by using the device implanted inside of it, though he was unaware of the identity of the woman who had stolen it. Troopers chased Organa to an ore processing center, where she hopped onto an ore conveyor cart that carried her through the facility to a chamber designated Smelter Bay Five. The officer reached the chamber ahead of her and had his men prepare for her arrival, stationing them along a catwalk above the conveyor. His plan was to blast Organa as soon as she appeared. Meanwhile, the heightened activity was passed along as nothing more than a security test to the curious populace.\nWhile riding the conveyor, Organa discovered the security system and its relation to her weapon, and she ditched the moving cart while leaving the blaster behind. When the cart arrived in the officer's secured chamber, the troopers opened fire on his command. Once the smoke dissipated, the Imperials quickly discovered that the princess had escaped, much to the officer's frustration. The officer then reported back to Corwyth, who could only vent his grievances on his radio officer. Ultimately, Organa's mission was a success, persuading her old mentor Arn Horada to help spread a rebel movement through the planet's populace. The officer's failure culminated with Organa's escape from Metalorn.\nThe Imperial officer was loyal to the Empire and was able to effectively command stormtroopers. Upon learning that Princess Leia Organa was riding in an ore cart through the ore processing center, he ordered his men to lower the power settings on their weapons so as not to damage the surrounding valuable industrial equipment. The officer had light skin and blond hair.\nThe officer wore a standard-issue Imperial uniform on Metalorn and used a blaster pistol with a hooded barrel and an adjustable power setting as his sidearm.\nThe Imperial officer was created for the thirthieth issue of the Marvel Comics Star Wars series. The issue was written by Archie Goodwin, illustrated by Carmine Infantino and Gene Day, and released on December 30, 1979.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Imperial_officer",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_(1977)_30",
  "/wiki/Governor/Legends",
  "/wiki/Corwyth",
  "/wiki/Planet/Legends",
  "/wiki/Metalorn/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Mission_to_Metalorn_(Galactic_Civil_War)",
  "/wiki/Factory/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Ore_processing_center",
  "/wiki/Ore_conveyor",
  "/wiki/Officer/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Unidentified_stormtrooper_(Metalorn)",
  "/wiki/Trooper/Legends",
  "/wiki/Smelter_Bay_Five",
  "/wiki/Unidentified_radio_officer",
  "/wiki/Arn_Horada",
  "/wiki/Hair/Legends",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Barrel/Legends",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Archie_Goodwin",
  "/wiki/Carmine_Infantino",
  "/wiki/Gene_Day",
  "/wiki/December_30",
  "/wiki/1979",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Metalorn_system",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Death/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Orman_Tagge/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Yavin_Prime/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Galactic_Standard_Calendar"
 ]
}