{
 "name": "Unidentified_Keshiri_bartender",
 "display_name": "Unidentified Keshiri bartender",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  }
 ],
 "content": "A male Keshiri bartender tended a bar on the planet Kesh. Kind to his patrons, he always tried to have a decent meal to serve for the poor. He offered the Jedi Jelph Marrian food and advice when the Human entered his bar in 3960 BBY.\nA male Keshiri bartender lived on the planet Kesh, where he tended a bar near the capital city Tahv in 3960 BBY. He was generous and always tried to have a decent meal to offer slaves and the poor when they entered his bar. When a morose Human Jedi named Jelph Marrian entered the establishment, the elderly bartender sensed Marrian's sadness and guessed that the Human was concerned over a woman. The bartender poured him a mug of sweetwater and offered to leave the bottle should the Human need more. The Keshiri also served Marrian a bowl of porridge out of concern over his woe and gave him kind words and pieces of love advice, telling him that anything could happen when he involved himself with a woman.\nThe purple-skinned Keshiri bartender was pleasant and generous to his patrons, offering kind words in addition to food and beverages. When the impoverished or the enslaved entered his bar, he was quick to provide them with a meal and prompt to apologize when he believed they did not enjoy it. Perceptive to the emotions of others, the Keshiri was able to sense Marrian's solemn mood, discerning that the Human had strong feelings for a woman.\nThe bartender was created by John Jackson Miller for Lost Tribe of the Sith: Sentinel, the sixth eBook in the Lost Tribe of the Sith series. When doing revisions on the story for Star Wars: Lost Tribe of the Sith: The Collected Stories, Miller considered giving the character a name, but decided against it.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/Keshiri",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bartender/Legends",
  "/wiki/Unidentified_bar_(Kesh)",
  "/wiki/Planet/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jelph_Marrian",
  "/wiki/Human/Legends",
  "/wiki/3960_BBY",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Tahv",
  "/wiki/Slavery/Legends",
  "/wiki/Orielle_Kitai",
  "/wiki/Sweetwater",
  "/wiki/Porridge/Legends",
  "/wiki/John_Jackson_Miller",
  "/wiki/Lost_Tribe_of_the_Sith:_Sentinel",
  "/wiki/EBook",
  "/wiki/Star_Wars:_Lost_Tribe_of_the_Sith",
  "/wiki/Star_Wars:_Lost_Tribe_of_the_Sith:_The_Collected_Stories"
 ]
}