{
 "name": "Unidentified_Gran_registrar",
 "display_name": "Unidentified Gran registrar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "University of Bar'leth"
     ]
    }
   ]
  }
 ],
 "content": "A Gran individual worked as a registrar at the University of Bar'leth. On the day they enrolled at the university, Kho Phon Farrus approached the Gran's desk where they asked for Farrus' full name for the new student registration process. When Farrus provided their name, the Gran responded that there was no one with that name on record and that it was not the name on Farrus' Imperial I.D. Farrus told the Gran that the name on the I.D. was out of date and that they went by Kho now, but the Gran insisted that if their name did not match Farrus' chain code, they would be not be able to help. At that moment, Chelli Lona Aphra came to the desk and, despite not knowing Farrus, vouched for the new student by pretending to know Farrus through her cousin's friend. The Gran was skeptical and thought that Aphra was scheming. Aphra replied that she was not upto any scheme, and instead was fulfilling a promise that she would look out for Farrus. Aphra then added that Farrus had to tried to get the error on their I.D. corrected for a while, and that the Gran could take her word for it. With this, the Gran relented and registered Farrus and welcomed them to the university.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Gran",
  "/wiki/University_of_Bar%27leth",
  "/wiki/Standard_day",
  "/wiki/Gender",
  "/wiki/University",
  "/wiki/Kho_Phon_Farrus",
  "/wiki/Galactic_Empire",
  "/wiki/Chain_code",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_Gran_registrar",
  "/wiki/Doctor_Aphra_(2020)_19"
 ]
}