{
 "name": "Unidentified_Snivvian_Sith",
 "display_name": "Unidentified Snivvian Sith",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "138 ABY",
      "Cadomai Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Snivvian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith",
      "Cadomai Prime"
     ]
    }
   ]
  }
 ],
 "content": "A member of One Sith after the death of Darth Krayt, this Snivvian Sith complied with his superiors and proceeded to infiltrate the planetary governments; infiltrating the Snivvian government of Cadomai Prime. By that year Cadomai Prime was in desperate need of a new reliable trade route, after the Sith devastation of the Calamari system, which in turn drew a sizable criminal element to the collapsed area. A committee of three Snivvian politicians subsequently entered negotiations with a team of Gran representatives to this end; one of the Snivvian envoys was the secret Sith operative. However after an unsuccessful conference with the Gran, the Snivvian Sith was attacked by the renegade Sith Lord Darth Wredd, who was hunting down other Sith. After a short but fierce duel, Wredd emerged victorious, impaling the Snivvian with his lightsaber and casting his foe's body at the feet of his fellow politicians. As Wredd had scraped the Snivvian's face to reveal his Sith tattoos, it was only then that the Snivvian politicians learned that there had been a traitor in their midst.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/138_ABY",
  "/wiki/Cadomai_Prime/Legends",
  "/wiki/Snivvian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt",
  "/wiki/Planet/Legends",
  "/wiki/Hyperlane",
  "/wiki/Sith/Legends",
  "/wiki/Calamari_system",
  "/wiki/Gran/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Wredd",
  "/wiki/Duel_on_Cadomai_Prime",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sith_tattoo",
  "/wiki/Legacy_(2013)_6"
 ]
}