{
 "name": "Unidentified_Royal_Guard_(Onderon)",
 "display_name": "Unidentified Royal Guard  (Onderon)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Yinchorr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Emperor's Royal Guard",
      "Emperor's Royal Guard",
      "Dark Empire"
     ]
    }
   ]
  }
 ],
 "content": "A member of the Emperor's Royal Guard served the reborn Galactic Emperor Palpatine's Dark Empire. In 11 ABY, the Guardsman accompanied the Emperor to the planet Onderon during an attempted abduction of the Force-sensitive infant Anakin Solo and remained stationed at the Emperor's shuttle in the capital city of Iziz. When the shuttle came under attack by Jedi Master Luke Skywalker and his New Republic allies, the Guardsman engaged the young Jedi trainee Rayf Ysanna in one-on-one combat but lost. Wounded, he made his way to the Kira Fortress, where Palpatine had ventured to kidnap the Solo child.\nYet, by the time the Guardsman arrived at the fortress, the Emperor had already been killed. Instead, the Guardsman witnessed the New Republic's interrogation of the captive Emperor's physician, who admitted his involvement in a conspiracy against the Emperor on behalf of Guardsman Carnor Jax that had been instrumental in Palpatine's ultimate demise. The Guardsman escaped from Onderon and traveled to the Imperial Royal Guard Academy on the planet Yinchorr, where he revealed what he knew to fellow Royal Guards gathered there. A surprise attack by Jax's forces followed, resulting in the death of the Guardsman and nearly all of his kin, with the exception of one, Kir Kanos, who swore vengeance on all traitors to the Empire.\nDuring the Galactic Civil War, a Human male individual served the clone Galactic Emperor Palpatine's incarnation of the Galactic Empire and was a member of the elite corps known as the Emperor's Royal Guard. In 11 ABY, the Guardsman accompanied the ailing clone of Palpatine to the planet Onderon aboard the Emperor's flagship, the Eclipse II.\nThe Emperor, who inhabited his final clone body and had no other vessel to which he could transfer his spirit, hoped to use the newborn Force-sensitive son of Jedi Leia Organa Solo, Anakin, as his new vessel. At that time, the Solos were taking shelter with the Onderonian King Modon Kira at the Royal Kira Fortress, so the Emperor decided to follow them there. Palpatine boarded a Lambda-class T-4a shuttle, accompanied by his personal physician, two Dark Side Adepts, and several stormtroopers. To round out the entourage, the Guardsman was chosen to accompany his master, along with one other member of the Royal Guard.\nAfter the shuttle landed at the spaceport in the capital city of Iziz, the Emperor left on foot toward the Kira Fortress, accompanied only by his physician and the darksider T'iaz, while the Guardsman and the rest of the Emperor's entourage were left behind at the shuttle to create a ruse of the Emperor still being aboard. Soon enough, New Republic reinforcements, led by Jedi Master Luke Skywalker, arrived on Onderon to apprehend the Emperor. Believing that Palpatine was still aboard the shuttle, they assaulted the Imperial forces.\nThe Guardsman and his comrade engaged Skywalker and his young Jedi trainee Rayf Ysanna. The other Guard was killed by Skywalker, but the Guardsman who fought Ysanna was merely wounded by the young Jedi, who mistakenly believed that he had killed the Guard and so left him. After the Jedi learned that the Emperor was not aboard the shuttle, they immediately left for the fortress to confront Palpatine and assist Organa Solo.\nHaving regained consciousness, the Guardsman also made his way to the fortress, hoping to assist his master, but he was too late, as the Emperor had been killed. Of the two companions who had accompanied the Emperor to the fortress, T'iaz had been slain as well, but the Emperor's physician had been taken prisoner by Skywalker and his allies. From a hiding spot, the Guardsman listened in as Skywalker and his brother-in-law, Han Solo, interrogated the doctor.\nMuch to his shock, the Guardsman heard the physician's confession—the man had been bribed by the Royal Guardsman Carnor Jax and members of the Imperial Ruling Council to sabotage Palpatine's supply of clones, causing them to deteriorate quickly, and also to taint the DNA samples to ensure that a new supply of stable clones could not be produced. Having learned of such treachery from Jax, one of his own kind, the Guardsman was able to slip away from the fortress and leave Onderon. Pursued by Imperial forces loyal to Jax, the Guardsman was determined to reveal the truth to his brothers-in-arms.\nTen days after the Emperor's death, the man arrived at the Imperial Royal Guard Academy on the planet Yinchorr, where the surviving members of the Royal Guard had gathered to mourn Palpatine's passing. The bruised and battered Guardsman revealed his knowledge of Jax's treachery to the others, causing all present to swear revenge on the traitors. However, at that very moment, the training center was assaulted by Jax's loyalist stormtroopers. The Royal Guard put up a valiant fight, but nearly all of them, including the survivor of Onderon, were slaughtered by the enemy. The only survivor who was able to escape was a man named Kir Kanos, who ultimately avenged his betrayed brothers.\nThe Guardsman was fiercely loyal to his liege, Galactic Emperor Palpatine. Despite being wounded in battle with the young Jedi novice Rayf Ysanna, his first instinct was to come to Palpatine's aid. After learning of the physician's treachery, he made it his personal mission to inform his fellow members of the Royal Guard of what he had heard at the Kira Fortress. The Guardsman risked his own life to evade Carnor Jax's agents and managed to reach Yinchorr with his knowledge.\nA member of the elite Royal Guard, the individual was one of the two Guardsmen chosen to accompany Palpatine in his final mission to Onderon. Despite his skills, the Guardsman was outmatched by the Jedi trainee Rayf Ysanna in a duel. However, he later displayed great skill in fighting the forces that hunted him after his escape from Onderon.\nThe individual wore the standard crimson armor of the Emperor's Royal Guard. Around the time of his death, he wielded a double vibroblade and also made use of a blaster pistol.\nThe Royal Guardsman first appeared in the 1995 comic book Empire's End 2, written by Tom Veitch and illustrated by Jim Baikie. The comic depicted him and another Royal Guard in a single panel, engaged in battle with Luke Skywalker and Rayf Ysanna. The follow-up 1997–1998 series Star Wars: Crimson Empire, written by Mike Richardson and Randy Stradley and illustrated by Paul Gulacy, established a backstory for one of those Guardsmen, portraying his escape from Onderon with crucial information about Carnor Jax's betrayal.\nThe 1999 audio dramatization of Crimson Empire combined this Guardsman's story with that of Kile Hannad, another Guardsman from the comic-book version of the story. During the stormtrooper attack on Yinchorr, Hannad and Kir Kanos are the last two Guardsmen left standing, and Hannad sacrifices his life to allow Kanos to escape. However, the original comic-book version portrays Hannad as a separate character and shows that the survivor of Onderon has already been killed by the stormtroopers before Hannad makes his own last stand. This article assumes the comic's depiction of events to be correct.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Unidentified_Royal_Guard",
  "/wiki/Crimson_Empire_3",
  "/wiki/Crimson_Empire_(audio)",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/11_ABY/Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Transfer_essence",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Onderon/Legends",
  "/wiki/Battle_of_Onderon_(Galactic_Civil_War)",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Anakin_Solo",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Iziz/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Rayf_Ysanna",
  "/wiki/Kira_Fortress",
  "/wiki/House_of_Solo",
  "/wiki/Time/Legends",
  "/wiki/Fortress/Legends",
  "/wiki/Death/Legends",
  "/wiki/Emperor%27s_physician",
  "/wiki/Carnor_Jax",
  "/wiki/Imperial_Royal_Guard_Academy",
  "/wiki/Attack_on_the_Imperial_Royal_Guard_Academy",
  "/wiki/Kir_Kanos",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Corps/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Eclipse_II",
  "/wiki/Reproduction/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Onderonian/Legends",
  "/wiki/King/Legends",
  "/wiki/Modon_Kira_(Galactic_Civil_War)",
  "/wiki/Onderon_Royal_Family",
  "/wiki/Dark_Side_Adept",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Star_Wars:_Crimson_Empire_(TPB)",
  "/wiki/Iziz_Starport",
  "/wiki/Limb/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Darksider",
  "/wiki/T%27iaz",
  "/wiki/Ysanna/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Saboteur/Legends",
  "/wiki/DNA/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Crimson_Empire",
  "/wiki/General/Legends",
  "/wiki/Redd_Wessel",
  "/wiki/Color/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Double_vibroblade",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/1995",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Empire%27s_End_2",
  "/wiki/Tom_Veitch",
  "/wiki/Jim_Baikie",
  "/wiki/1997",
  "/wiki/1998",
  "/wiki/Star_Wars:_Crimson_Empire",
  "/wiki/Mike_Richardson",
  "/wiki/Randy_Stradley",
  "/wiki/Paul_Gulacy",
  "/wiki/File:WeThoughtYouDiedOnOnderon.ogg",
  "/wiki/1999",
  "/wiki/Kile_Hannad",
  "/wiki/Crimson_Empire_0",
  "/wiki/Star_Wars_Handbook_2:_Crimson_Empire",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_132",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Empire%27s_End",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Official_Star_Wars_Fact_File_33",
  "/wiki/Empire%27s_End_1",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Crimson_Empire_6"
 ]
}