{
 "name": "Unidentified_Ithorian_(Zallakesh_spaceport)",
 "display_name": "Unidentified Ithorian  (Zallakesh spaceport)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  }
 ],
 "content": "This Ithorian had two hostile confrontations with Prince Coby at the Zallakesh spaceport.\nWhile riding his beast of burden through the streets of the Zallakesh spaceport, this Ithorian was accidentally dismounted from it due to a collision with Prince Coby. Taking offense at this, the hot-tempered alien drew his blaster and began threatening Coby in an alien language. Shortly thereafter, the individual attempted to shoot down Coby's Blackhawk Destroyer as the boy attempted to pilot the out of control craft through the skies above the spaceport. As he took aim at the spacecraft, the Ithorian was tackled by spacecraft merchant \"Honest\" Tobar, causing his blaster to fire harmlessly into the sky.\nWhile hand held blasters are rarely seen in the Droids series, with even Stormtroopers being depicted as carrying Blaster staffs, this Ithorian seems to be an exception to the rule.\nUnlike other members of his species, this Ithorian has a single mouth on the front of his eyestalk as opposed to two on the sides of his neck.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Coby",
  "/wiki/Zallakesh",
  "/wiki/Blackhawk_Destroyer",
  "/wiki/Tobar",
  "/wiki/Blaster/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Blaster_staff",
  "/wiki/Ommatophora",
  "/wiki/Star_Wars:_Droids:_The_Adventures_of_R2-D2_and_C-3PO",
  "/wiki/Coby_and_the_Starhunters"
 ]
}