{
 "name": "Unidentified_stormtrooper_(Advisor)",
 "display_name": "Unidentified stormtrooper  (Advisor)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "During the Galactic Civil War, this stormtrooper advised high ranking Imperial commanders.\nDuring the Galactic Civil War, this stormtrooper served in the Imperial Army. He often advised Imperial commanders, sending messages to them at the beginning of battles. It is possible that he served in the Assault on Thyferra. If so, he was able to reconstruct communications leading to a pirate base on Ilum. Afterwords, he would have been given orders to interrogate the pirate leader.\nThe Stormtrooper had a very negative view of the Rebel Alliance, believing it to be nothing more than a group of scoundrels and dissidents. He also saw them as technologically inferior, going so far as to tell a commander to \"send them crawling back into their holes\". He had no qualms about using the Death Star. He had some knowledge of tactics, although he generally advised simple-minded, imperial tactics.\nThis character appears in Empire at War, sending messages to the player  at the beginning of tactical battles. He does not do this in story levels. He also appears in Star Wars: Empire at War: Forces of Corruption, though he'll only be seen if the player chooses Imperial Galactic Conquest. His quotes are the same, so he often refers to the Zann Consortium as rebels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Assault_on_Thyferra",
  "/wiki/Ilum/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Zann_Consortium/Legends",
  "/wiki/Star_Wars:_Empire_at_War",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary"
 ]
}