{
 "name": "Unidentified_clone_naval_commander",
 "display_name": "Unidentified clone naval commander",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Skywalker's fleet",
      "Skywalker's fleet"
     ]
    }
   ]
  }
 ],
 "content": "This clone navigation officer served as a Clone Commander in the Republic Navy during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The commander served aboard the Venator-class Star Destroyer Resolute, the flagship of Jedi General Anakin Skywalker during the Malevolence Campaign.\nBorn on the planet Kamino as a clone of the bounty hunter Jango Fett, this clone navigation officer served the Galactic Republic during the pan-galactic Clone Wars between the Republic and Separatist Alliance. This clone navigation officer had the rank of Clone Commander, and served aboard the Venator-class Star Destroyer Resolute, the Republic Navy flagship of Jedi General Anakin Skywalker.\nEarly during the Clone Wars, the Resolute took part in the Malevolence Campaign during the Battle of the Kaliida Nebula. The Resolute, alongside two other Venator-class Star Destroyers, pursued the fleeing Malevolence, laying down heavy turbolaser fire. While in the bridge during the engagement, Jedi General Obi-Wan Kenobi asked the clone navigation officer on the damage level of the enemy flagship. The officer was able to provide a brief report, and also comment on the enemy ship being so large that it could take all the fire Republic vessels could give it. Eventually, the Malevolence was destroyed when it was sabotaged by Skywalker, Kenobi, and the formerly imprisoned Senator Padmé Amidala. Once the ship was destroyed, the bridge crew celebrated.\nAs a clone of the bounty hunter Jango Fett, this clone navigation officer was a human male who stood at 1.83 meters tall. He had naturally black hair, brown eyes, and tan skin.\nThis clone navigation officer was trained in naval warfare, excelling to the rank of Clone Commander. The clone navigation officer was able to provide a damage level report of the Malevolence to his superior officer.\nAs a clone navigation officer, the commander wore a blue variant of the standard Republic military uniform with a rank insignia plaque demonstrating his rank.\nThis clone navigation officer first appeared in \"Destroy Malevolence,\" which was the fourth episode of the first season of the animated TV series Star Wars: The Clone Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_clone_naval_commander",
  "/wiki/Unidentified_clone_naval_commander/Legends",
  "/wiki/Unidentified_clone_naval_commander_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Skywalker%27s_fleet",
  "/wiki/Destroy_Malevolence",
  "/wiki/Clone_Commander",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Commander",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Resolute",
  "/wiki/Flagship",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Malevolence_Campaign",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Clone_navigation_officer",
  "/wiki/The_galaxy",
  "/wiki/Officer",
  "/wiki/Military_rank",
  "/wiki/Battle_of_the_Kaliida_Nebula",
  "/wiki/Star_Destroyer",
  "/wiki/Malevolence",
  "/wiki/Turbolaser",
  "/wiki/Bridge_(starship)",
  "/wiki/Jedi",
  "/wiki/General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Republic_military_uniform",
  "/wiki/Rank_insignia_plaque",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Storm_Over_Ryloth"
 ]
}