{
 "name": "Unidentified_radio_officer",
 "display_name": "Unidentified radio officer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish-brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "A radio officer served the Galactic Empire on the planet Metalorn during the year 0 ABY. Alongside Governor Corwyth, the radio officer oversaw the hunt for Princess Leia Organa when she infiltrated the planet in the name of the Rebel Alliance. Using a tracking device implemented in a blaster rifle Organa stole, the officer followed the princess' movements through one of Metalorn's factories.\nThe hunt ultimately proved fruitless as Organa managed to use the Empire's weapons detection system against them by placing the stolen gun in an ore conveyor to throw off her pursuers. Corwyth tried to blame the failure in capturing Organa on the security system, but when the officer tried to reason that the system itself worked as intended, Corwyth throttled the officer by the collar.\nA human male served the Galactic Empire as a radio officer on the planet Metalorn during the Galactic Civil War. Serving under Governor Corwyth, the officer worked from Monitor Control, a communications hub that oversaw Metalorn's security. Due to a combination of Corwyth's information control program and the House of Tagge weapons detection system, the factory world's populace knew nothing of the Empire's war against the Rebel Alliance.\nDuring the year 0 ABY, monitor control was paid a visit by Baron Orman Tagge. The visit happened to coincide with a rebel mission to infiltrate the planet and spread the seeds of rebellion.\nThe infiltrator, Princess Leia Organa, eventually stole an Imperial stormtrooper rifle, which triggered a condition red. Another officer reported the situation to Corwyth, who expressed outrage by the rebel attack. After the second officer got a bead on the stormtrooper's stolen rifle, Corwyth sent troops in pursuit. The radio officer then monitored both the movement of the troops and the blaster. Meanwhile, the heightened activity in the area was passed off as a drill to the curious populace.\nThe blaster's signal eventually made its way to an ore conveyor, prompting the radio officer to ask if he should order the conveyor to halt. The request was angrily vetoed by Corwyth, who believed such an action would be in the Rebellion's favor. The radio officer, however, believed that Organa was intending to sabotage something. Eventually, a platoon of soldiers had managed to reach the smelting bay ahead of the blaster's signal in order to cut the princess off. Corwyth was pleased with the development, but in his state of concentration, he failed to notice Baron Tagge slip from the room. Meanwhile, the waiting unit's ambush proved unsuccessful: Organa had learned of the rifle's tracking device and had ditched the weapon in the ore conveyor.\nFurious, Corwyth grabbed the radio officer by the collar as he attempted to downplay Organa's escape as an unprecedented move of using the Empire's technology against them. Corwyth demanded additional units to find Organa. By then, however, Organa had already completed her mission and bested Tagge in a brief duel. Afterwards, she escaped the planet.\nThe radio officer was a light-skinned human with reddish-brown hair and blue eyes. The officer dutifully followed the movements of Organa and Corwyth's men, and reported on the evolving incident as developments occurred. Corwyth derided the man as a fool, however, when the officer suggested a temporary halt to ore transportation in order to capture Organa.\nNevertheless, when Corwyth tried to blame the failure to capture Organa based on the weapon tracking system on Tagge's security measures, the officer reasoned that the system had indeed worked as intended. Corwyth wanted nothing to do with the contradiction to his word, however, and throttled the hapless officer.\nCreated for the comic book Star Wars  30, an issue of the Marvel Comics Star Wars series, the nameless radio officer played a supporting role in the story. A Princess Alone was written by Archie Goodwin and illustrated by Carmine Infantino and Gene Day, and was released on December 30, 1979.\nDuring one panel, the officer can be seen talking to Corwyth shortly before Corwyth angrily grabs the man. However, the speech bubble is drawn so that it emanates from an entirely different character. Given the sequence of events and action of the characters, this article treats the discrepancy as an illustrator's mistake.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_(1977)_30",
  "/wiki/Planet/Legends",
  "/wiki/Metalorn/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Corwyth",
  "/wiki/Comlink/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Homing_beacon",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Factory/Legends",
  "/wiki/Weapons_detection_system",
  "/wiki/Ore_conveyor",
  "/wiki/Subspace_transceiver",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Monitor_Control",
  "/wiki/Information_control_program",
  "/wiki/House_of_Tagge/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Orman_Tagge/Legends",
  "/wiki/Mission_to_Metalorn_(Galactic_Civil_War)",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Unidentified_stormtrooper_(Metalorn)",
  "/wiki/Rifle/Legends",
  "/wiki/Platoon/Legends",
  "/wiki/Smelter_Bay_Five",
  "/wiki/Blaster/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Archie_Goodwin",
  "/wiki/Carmine_Infantino",
  "/wiki/Gene_Day",
  "/wiki/December_30",
  "/wiki/1979",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/0_BBY/Legends",
  "/wiki/Death/Legends"
 ]
}