{
 "name": "Unidentified_Zabrak_(Force_user)",
 "display_name": "Unidentified Zabrak  (Force user)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Shon-Ju's Force school"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Shon-Ju"
     ]
    }
   ]
  }
 ],
 "content": "A female Zabrak Force-user was a student of the rogue former Jedi Shon-Ju in the year 21 BBY. Shon-Ju had been rejected from the Jedi Order and spent time in exile, learning new ways to use the Force. Shon-Ju then took this Zabrak and two other students and taught them to channel the Force through their hands.\nIn 21 BBY, Shon-Ju and his students pursued the mercenary Attuma Duum to the moon of Cavamina Minor in order to stop his crimes. The Jedi Order had also sent Aayla Secura to stop Duum. Secura was forced to flee Duum's forces and crash-landed on Cavamina Minor. Shon-Ju and his students assisted Secura by directly engaging Duum's mercenaries in combat; this Zabrak used a stick to subdue an Aqualish. Shon-Ju let Sabat, Duum's chief of security flee the scene. Secura then collapsed from her injuries and was taken to Shon-Ju's hideout. When the Twi'lek Jedi awoke, she was alone. She found Shon-Ju overlooking his students' training and questioned him about his life. Down below, the Zabrak student channeled the Force and struck a large rock as part of her training.\nSecura and Shon-Ju agreed to join forces and stop Duum. Although they destroyed Duum's operation, Shon-Ju betrayed Secura but was injured and forced to flee.\nThis student was trained in a particular way and was able to focus the Force in combat. Shon-Ju said his students were learning as much from him as he was from them. She wore Jedi-style robes.\nThis Zabrak Force-user appears in the 2010 graphic novella The Clone Wars: Deadly Hands of Shon-Ju. She is the only one of Shon-Ju's students without dialogue.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Zabrak",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Shon-Ju%27s_Force_school",
  "/wiki/Shon-Ju",
  "/wiki/The_Clone_Wars:_Deadly_Hands_of_Shon-Ju",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Time/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Unidentified_Ithorian_(Force_student)",
  "/wiki/Unidentified_male_(Force_user)",
  "/wiki/Hand",
  "/wiki/Mercenary/Legends",
  "/wiki/Attuma_Duum",
  "/wiki/Moon/Legends",
  "/wiki/Cavamina_Minor",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Sabat_(mercenary)",
  "/wiki/Shon-Ju%27s_castle",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Battle_of_Cavamina_Minor",
  "/wiki/Jedi_apparel",
  "/wiki/2010",
  "/wiki/Star_Wars_Annual_2011"
 ]
}