{
 "name": "Unidentified_Chalhuddan_youngling",
 "display_name": "Unidentified Chalhuddan youngling",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chalhuddan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Non-binary"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "A non-binary Chalhuddan youngling was a Jedi Initiate of the Jedi Order in 22 BBY. They were part of a group addressed by Anakin Skywalker regarding lessons learned on the way to becoming a Jedi Knight.\nA non-binary Chalhuddan youngling was trained by the Jedi Order in 22 BBY. In the weeks following the ceremony that elevated the human male Anakin Skywalker to the rank of Jedi Knight, the Chalhuddan was part of a group of ten Jedi Initiates that Skywalker addressed in a small training room within the Jedi Temple.\nOn the topic of what he had learned as a Jedi before becoming a Knight, Skywalker spoke of his upbringing on Tatooine and what he had learned from his mother, Shmi; his Jedi Master, Obi-Wan Kenobi; and his Gungan friend, Jar Jar Binks of Naboo. After he finished his speech, the young Chalhuddan raised their hand and was called upon. The youngling expressed that what Skywalker had said was a lot to remember, to the amusement of the Knight and the other younglings. Skywalker suggested that the younglings should remember the words of Qui-Gon Jinn: to feel, not think, and trust their instincts. For another thirty minutes, Skywalker answered questions and entertained the Initiates with acrobatic tricks until a Padawan arrived to gather the group.\nThe youngling was a Chalhuddan, a sentient species that was native to the Outer Rim planet Chal Hudda and experienced five distinct genders during their lifetimes. Due to the complexity of their language not having equivalents in Galactic Basic Standard, individuals of the species would be addressed with the personal pronoun \"they\" in the latter language. Chalhuddans also had two horns on their heads; the youngling's horns were just beginning to sprout at the time when they were addressed by Skywalker.\nMembers of the Jedi Order were Force-sensitive and learned the ways of the Force. The youngling was one such being.\nThe Chalhuddan youngling appeared in the 2022 novel Brotherhood, written by Mike Chen.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chalhuddan",
  "/wiki/Gender",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Initiate",
  "/wiki/22_BBY",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi_Knight",
  "/wiki/Standard_week",
  "/wiki/Anakin_Skywalker%27s_knighting_ceremony",
  "/wiki/Human",
  "/wiki/Imperial_Palace",
  "/wiki/Jedi",
  "/wiki/Tatooine",
  "/wiki/Parent",
  "/wiki/Shmi_Skywalker_Lars",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Gungan",
  "/wiki/Jar_Jar_Binks",
  "/wiki/Naboo",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Standard_minute",
  "/wiki/Padawan",
  "/wiki/Sentience",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Chal_Hudda",
  "/wiki/Language",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Time",
  "/wiki/Force-sensitive",
  "/wiki/The_Force",
  "/wiki/2022",
  "/wiki/Brotherhood",
  "/wiki/Mike_Chen",
  "/wiki/Brotherhood_(audiobook)",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Clone_Wars",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Leia,_Princess_of_Alderaan",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Children_of_the_Force"
 ]
}