{
 "name": "Unidentified_Klatooinian_don",
 "display_name": "Unidentified Klatooinian don",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tatooine Klatooinian family",
      "Jabba's criminal empire",
      "Fett gotra",
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "A male Klatooinian was the don of the Klatooinian family of the city Mos Espa on the planet of Tatooine. Serving under the crime boss Jabba the Hutt until his death, the Klatooinian split his family from the late Hutt's criminal empire when the majordomo Bib Fortuna claimed the throne, keeping an uneasy alliance with the new leader while also attempting and failing to replace him.\nThe ex-bounty hunter Boba Fett eventually seized the late Jabba's throne as the new Daimyo, but quickly saw challenge to his new position, the Pyke Syndicate notably making moves to take over. Fett gathered the leaders of Mos Espa's three ruling families for a banquet and asked for their support against the Pykes. The Klatooinian don questioned Fett's position and refused to risk his people for the Daimyo. However, the don agreed to Fett's suggestion that the families remain neutral during the Daimyo's feud with the Pykes. However, the Klatooinian don along with the two leaders betrayed Boba and joined the Pykes. After the battle of Mos Espa, the three were killed alongside Mok Shaiz and the Pyke boss by Fennec Shand.\nThe Klatooinian male was the don of the Klatooinian family of the city of Mos Espa on the desert planet Tatooine. He served as a captain under the crime boss Jabba the Hutt, making much money, until the Hutt's death in 4 ABY. After, Bib Fortuna, Jabba's majordomo, claimed the late Hutt's throne, prompting the Klatooinian don to quickly split his family from the late Jabba's criminal empire, alongside the Trandoshan family and Aqualish family. Furthermore, Mos Espa was split between the three families, the Klatooinians having the spaceport and upper sprawl. In his rule, Fortuna relied on uneasy alliances with the families, with each of the leaders attempting to take his place, only to be thwarted.\nAround 9 ABY, Boba Fett, a famed bounty hunter who had chosen to leave his career in the time after Jabba's death, attacked Fortuna's palace and murdered the ex-majordomo, claiming his throne as the new Daimyo of Tatooine. Fett's power grab did not come unchallenged, as the newly established crime lord faced two assassination attempts, as well as the Mayor of Mos Espa Mok Shaiz deciding to promise Fett's territories to the Pyke Syndicate.\nWith the Pykes mustering troops in the city and challenging his territory, Fett gathered the Klatooinian don and the other family leaders for a banquet. There, the Daimyo's partner, Master Assassin Fennec Shand, recounted the families' former positions in Jabba's empire and the power struggle that had come after the Hutt's death. Fett promised a relationship of mutual benefit with the families, and warned that the Pyke Syndicate's takeover was draining Tatooine's wealth. After Dokk Strassi, the Trandoshan family leader, insisted the families benefited from spice trade, the Pyke's major business, the Klatooinian don openly questioned Fett's right to be the Daimyo, asking what stopped the families from killing the crime lord.\nThe banquet was interrupted by Fett's rancor, which clawed at the floor beneath them from its dungeon. Fett calmed the rancor and invited the familiy leaders back to their chairs. The Daimyo proposed an alliance with the families against the Pyke Syndicate. The Klatooinian don was skeptical about risking the lives of his people for a feud which did not involve him, Strassi agreeing with him. Fett subsequently promised the families that he would get rid of the Pykes himself, asking only that they remained neutral for him. Strassi and Garfalaquox, the Aqualish don, accepted the Daimyo's terms, and the Klatooinian chose to abide as well. With the leaders in agreement, they all departed from Boba's palace in speeders.\nThe don's deal with Fett proved temporary, as he and the other two family leaders had a deal with the Pyke Syndicate, requiring Tatooine to be hospitable for the syndicate's business. While the leaders made their way to the Pykes' headquarters on Tatooine, the Mos Eisley spaceport's Desert Survey Office, the forces under the Mos Espa families and the Pykes prepared to overthrow Fett from his position of power over the city. As part of the attack, the families were the first to take action, the don's soldiers killing the pair of Gamorrean guards standing watch in the upper sprawl before moving into the city center. Over the course of the battle, the don's men saw casualties before the Pyke forces were called out of the city.\nBack at the Desert Survey Office, the Klatooinian and the other family dons were present with Mok Shaiz and the Pyke Syndicate's boss on Tatooine. The Pyke boss informed the other four that his forces were withdrawing to Mos Eisley in preparation to leave the planet. The leaders were displeased, with the Klatooinian berating the Syndicate official on his retreat plan, a confrontation Strassi back him up on. The boss, though, pointed out that Tatooine was no longer hospitable for his syndicate. As arguing continued, the group heard gunshots from outside. The boss and the family leaders raised their blasters when the attacker, Fennec Shand, shot down Garfalaquox from above. Before anyone could locate the sniper, the Klatoonian was also shot, being struck in the chest and spiraled to the floor dead. The assassin proceeded to kill the rest of the room's occupants before leaving.\nThe Klatooinian male had brown skin. He wished to take over the throne of the late Jabba the Hutt, attempting to overthrow Bib Fortuna to no avail. The Klatooinian later openly challenged Boba Fett's claim to the throne, asking what stopped the families of Mos Espa from killing the Daimyo. The don wished not to make sacrifices in supporting Fett against the Pykes, and instead sided with the Syndicate while pretending to abide with the Daimyo's terms of neutrality. His duplicity was not fruitful, a tough fact that angered the don as he was enraged when the Syndicate's boss on Tatooine chose to pull his people offworld, abandoning his crime family.\nThe Klatooinian wore red and yellow clothing and used a speeder. Different from the SE-14r light repeating blasters the other Mos Espa dons carried, the Klatooinian wielded a different model of blaster with a forward grip.\nThe don first appeared in the fourth episode of the 2022 Disney+ series The Book of Boba Fett. The character was performed on set by Ardeshir Radpour.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Klatooinian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Tatooine_Klatooinian_family",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Fett_gotra",
  "/wiki/Pyke_Syndicate",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Planet",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Death",
  "/wiki/Hutt",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Jabba_the_Hutt%27s_dais",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Daimyo",
  "/wiki/Pyke",
  "/wiki/Desert",
  "/wiki/Captain",
  "/wiki/4_ABY",
  "/wiki/Trandoshan_family",
  "/wiki/Aqualish_crime_family",
  "/wiki/Mos_Espa_spaceport",
  "/wiki/Upper_sprawl",
  "/wiki/Mayor",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/Mok_Shaiz",
  "/wiki/Master_Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Dokk_Strassi",
  "/wiki/Trandoshan",
  "/wiki/Spice",
  "/wiki/Boba_Fett%27s_rancor",
  "/wiki/Rancor",
  "/wiki/Garfalaquox",
  "/wiki/Aqualish",
  "/wiki/Speeder",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Desert_Survey_Office",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/Unidentified_Gamorrean_guard_1",
  "/wiki/Unidentified_Gamorrean_guard_2",
  "/wiki/Gamorrean",
  "/wiki/Security_guard",
  "/wiki/Unidentified_Pyke_boss",
  "/wiki/Clothing",
  "/wiki/SE-14r_light_repeating_blaster",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/2022",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Ardeshir_Radpour",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Krrsantan",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa"
 ]
}