{
 "name": "Unidentified_clone_trooper_(Haurgab)",
 "display_name": "Unidentified clone trooper  (Haurgab)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Hadde Base",
      "Haurgab"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "A clone trooper served the Grand Army of the Republic as a soldier during the Clone Wars, a conflict waged between the Galactic Republic and the Confederacy of Independent Systems. He was stationed on Haurgab—a planet in the Mid Rim—in the year 19 BBY during one of the war's many battles. There, along with the rest of the clone garrison on Haurgab, he fought against the planet's Separatist-aligned Maujasi. The trooper was killed when the base he was located in took a direct hit from a missile.\nThe clone trooper was one of many clones of the bounty hunter Jango Fett created on the planet Kamino to serve the Grand Army of the Republic. He, along with all of his clone brothers, fought in the Clone Wars, a conflict starting in 22 BBY, in which the Galactic Republic battled the Confederacy of Independent Systems for control of the galaxy. He participated in a battle on the Mid Rim planet Haurgab during this war. On Haurgab, as part of the Republic clone garrison stationed there, he fought against the Maujasi clans, Humans native to Haurgab who had allied themselves with the Separatists.\nThe trooper was in the mess hall at the Republic-controlled Hadde Base in 19 BBY, when a pro-Separatist group launched a missile strike from within the Republic-friendly city of Hadde. One missile directly hit the front entrance of the base, in which the mess hall was located, and the resulting explosion flung metal trays from a rack across the room, striking the trooper and one of his comrades. The impact cut off the top of the trooper's head, killing him instantly, while the other trooper lost one of his legs when a tray cut through it.\nThe trooper's death heavily impacted Republic clone commando RC-1262, nicknamed \"Scorch,\" who witnessed the event. Scorch believed no man should die while trying to get a bite to eat. He later took out his rage on those who launched the missile that killed the trooper, participating in the raid that captured and killed the ones responsible. Scorch then lined up the dead bodies of the enemy and sprayed them with blaster fire.\nLike all clones of the prime clone Jango Fett, the trooper stood 1.83 meters tall. He also shared much of the same main features of other clone troopers, such as their complexion and basic look.\nThe trooper first appeared in the fourth novel of the Republic Commando series, Order 66, written by Karen Traviss and released on September 16, 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kamino/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Hadde_Base",
  "/wiki/Haurgab",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Standard_year/Legends",
  "/wiki/Battle_of_Haurgab",
  "/wiki/Garrison/Legends",
  "/wiki/Maujasi",
  "/wiki/Trooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Huntmaster_missile",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Hadde_Maujasi_rebels",
  "/wiki/Missile/Legends",
  "/wiki/City/Legends",
  "/wiki/Hadde",
  "/wiki/Unidentified_clone_trooper_2_(Haurgab)",
  "/wiki/Limb/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/RC-1262/Legends",
  "/wiki/Raid_on_Hadde",
  "/wiki/Blaster/Legends",
  "/wiki/Prime_clone",
  "/wiki/Republic_Commando",
  "/wiki/Order_66:_A_Republic_Commando_Novel",
  "/wiki/Karen_Traviss",
  "/wiki/September_16",
  "/wiki/2008",
  "/wiki/Encyclopedia_(StarWars.com)"
 ]
}