{
 "name": "Unidentified_Wookiee_worker_1",
 "display_name": "Unidentified Wookiee worker 1",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alaris Prime colonists"
     ]
    }
   ]
  }
 ],
 "content": "A Wookiee worker traveled to the moon Alaris Prime during its colonization between 39 BBY and 36 BBY. Along with four other workers, the Wookiee gathered the resources food, carbon, nova crystals, and ore to sustain a base on the moon. The worker also helped defend the base from an attack from a group of gundarks, a predatory species on Alaris Prime.\nA Wookiee worker traveled to the moon Alaris Prime between the years 39 BBY and 36 BBY to take part in its Wookiee colonization effort. Together with two other Wookiees, the worker went to a base to gather resources under instructions from Jedi Master Qui-Gon Jinn, who had been sent by the Jedi Council to oversee the colonization effort.\nThe workers started by gathering food from muja fruit bushes near the command center, the only building in the base. The Wookiees eventually gathered enough food, which allowed for another worker to join them at the base. The first worker and the others continued harvesting the fruit, gaining enough supplies to bring an extra worker to the base. Following that, Jinn instructed the workers to perform a drill in case they were attacked by gundarks, a non-sentient species of predators on Alaris Prime, which involved the workers ceasing activity and taking shelter in the command center. Once the drill was completed, Jinn told the workers to focus their attention on gathering carbon, a resource collected from trees that could be turned into duraplast and used for building.\nLater, one of the Wookiee leaders of the colonists of Alaris Prime, Chewbacca, arrived at the command center. Simultaneously, four gundarks attacked the command center, forcing the worker and its fellow Wookiees to retreat into the building, as they had practiced in the drill. With help from Chewbacca and using the building's turret system, the workers fought off and killed the gundarks. Chewbacca then explored the nearby area, finding deposits of nova crystals, which could be used as a form of currency in the galaxy, and ore, a resource that could be processed into durasteel. The worker took part in gathering these resources.\nA brown-haired Wookiee, the worker was trained to gather food, carbon, nova crystals and ore.\nThe Wookiee worker wore an orange piece of clothing that covered its chest and part of its legs.\nThe Wookiee worker was first mentioned in Star Wars: Galactic Battlegrounds: Prima's Official Strategy Guide by Steven L. Kent,—released on November 7, 2001—before appearing in the LucasArts video game Star Wars: Galactic Battlegrounds, released on November 11, 2001. The worker appears in the second level of the Wookiee tutorial campaign, \"Gathering Resources,\" in which it is one of three generic worker units with which the player starts off and uses throughout the level. Carrying out Qui-Gon Jinn's order to collect resources is left to player discretion, so this article follows the order according to Jinn's instructions. The worker that this article refers to is the one who begins standing to the left of the command center when the level begins.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Wookiee_worker",
  "/wiki/Wookiee/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alaris_Prime_colonists",
  "/wiki/Moon/Legends",
  "/wiki/Alaris_Prime/Legends",
  "/wiki/Alaris_Prime_colonial_war",
  "/wiki/39_BBY/Legends",
  "/wiki/36_BBY/Legends",
  "/wiki/Unidentified_Wookiee_worker_2",
  "/wiki/Unidentified_Wookiee_worker_3",
  "/wiki/Unidentified_Wookiee_worker_4",
  "/wiki/Unidentified_Wookiee_worker_5",
  "/wiki/Foodstuff/Legends",
  "/wiki/Carbon/Legends",
  "/wiki/Nova_crystal/Legends",
  "/wiki/Ore/Legends",
  "/wiki/Unidentified_Wookiee_command_center",
  "/wiki/Attack_on_the_Wookiee_command_center",
  "/wiki/Gundark/Legends",
  "/wiki/Species/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Canon",
  "/wiki/Muja_fruit/Legends",
  "/wiki/Fruit/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Duraplast/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Turret/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Durasteel/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Steven_L._Kent",
  "/wiki/November_7",
  "/wiki/2001",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/November_11",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/The_New_Essential_Chronology"
 ]
}