{
 "name": "Unidentified_High_Hermit",
 "display_name": "Unidentified High Hermit",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Maryx Minor"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 BBY",
      "Maryx Minor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ancient Order of Pessimists"
     ]
    }
   ]
  }
 ],
 "content": "An unidentified male Human served as the High Hermit of the Ancient Order of Pessimists on volcanic planet of Maryx Minor.\nDeclared an Enemy of the Empire and pursued by the bounty hunter Boba Fett, the former Imperial officer Abal Karda fled to Maryx Minor and claimed sanctuary with the Ancient Order. Although the High Hermit was discouraged by Pessimists such as Mabob not to admit Karda, he judged that the fugitive was of fit mind to join them and allowed him to enter.\nHowever, the Hermit soon came to regret his decision, as Karda became increasingly unstable and eventually killed Mabob with his blaster. When Karda ordered the hermits to fight Boba Fett when the bounty hunter arrived, the High Hermit protested that theirs' was a peaceful order, but was powerless to refuse their unhinged guest.\nShortly after taking in Karda, the hermitage was infiltrated by Boba Fett and, soon after, Darth Vader. The two battled for possession of the box containing the severed head of Selestrine.\nAfter surviving the battle, the High Hermit experienced an epiphany and began preaching optimism, reasoning that the loss of only six hermits in the midst of a pitched battle between two of the galaxy's deadliest beings represented a positive result for the Order. However, the hermitage and all the hermits were soon killed by orbital bombardment from Vader's Star Destroyer.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Maryx_Minor/Legends",
  "/wiki/3_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Ancient_Order_of_Pessimists",
  "/wiki/High_Hermit",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Abal_Karda",
  "/wiki/Mabob",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Selestrine",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Boba_Fett:_Enemy_of_the_Empire",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}