{
 "name": "Unidentified_Duros_lieutenant",
 "display_name": "Unidentified Duros lieutenant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Security",
      "Galactic Alliance Security"
     ]
    }
   ]
  }
 ],
 "content": "A Duros male lieutenant served in Galactic Alliance Security in 43 ABY. After the failed arrest of psychotic Jedi Knights Yaqeel Saav'etu and Bazel Warv by Security Captain Atar, the Captain ordered that Jedi Knight Jaina Solo and Imperial Head of State Jagged Fel, who had helped to prevent the arrest, be barred from leaving the area. The lieutenant, along with a force of Security troopers in an assault speeder, blocked the limousine's path and confronted Fel's driver, Baxton. However, Atar soon arrived, and Fel, using his diplomatic immunity, requested permission to leave. Atar complied, and the Duros was forced to allow them to pass.\nA Duros male served as a lieutenant in Galactic Alliance Security on the galactic capital of Coruscant in 43 ABY. Around that time, several Jedi began to develop a psychosis that caused them to believe that everyone they knew had been replaced by impostors. When Jedi Knights Bazel Warv and Yaqeel Saav'etu were stricken with the psychosis, they were quickly captured outside of the Jedi Temple's speeder entrance by Han Solo; Leia Organa Solo; their daughter, Jaina Solo; and Imperial Remnant Head of State Jagged Fel. A nearby Security force under the command of Captain Atar attempted to apprehend the two Jedi, but Han, Jaina, and Fel had already taken Saav'etu and Warv to the Temple. Using Fel's diplomatic immunity, Jaina and Fel attempted to leave the scene in their limousine, and Atar, angered, ordered the Duros to prevent their departure.\nThe Duros lieutenant, along with a number of Security troopers, blocked the limousine's path in their Galactic Alliance Security assault speeder. In response, Fel sent his driver, Baxton, to ask the Security forces to move. The Duros lieutenant, whose orders to prevent Fel's and Solo's departure were very strict, confronted Baxton. He got into a heated argument with the driver and relentlessly refused to allow the speeder to pass. Journalist Javis Tyrr then arrived, and when it was discovered that he was using a cleaning droid to infiltrate the Jedi Temple for his show, Atar also arrived. The Captain reassured Solo that Tyrr wouldn't do anything illegal, but Fel requested that they be permitted to leave. Due to Fel's diplomatic immunity, Atar was forced to comply, and the Duros was ordered to move his forces out of the way.\nThe Duros lieutenant was mindful of his duties and took his orders very seriously. He was greatly aggravated when Baxton asked him to move and he argued extensively with the driver, refusing to allow the limousine by until Atar gave the order for him to let them pass.\nThis Duros lieutenant appeared briefly in Star Wars author Troy Denning's 2009 novel, Fate of the Jedi: Abyss, the third novel in the Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Duros",
  "/wiki/Duros/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/43_ABY",
  "/wiki/Force_psychosis",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Yaqeel_Saav%27etu",
  "/wiki/Bazel_Warv",
  "/wiki/Captain/Legends",
  "/wiki/Atar",
  "/wiki/Jedi/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Imperial_Remnant",
  "/wiki/Head_of_State/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/Lieutenant/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Galactic_Alliance_Security_assault_speeder",
  "/wiki/Pilot/Legends",
  "/wiki/Baxton",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Time/Legends",
  "/wiki/New_Jedi_Temple",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Limousine",
  "/wiki/Journalist/Legends",
  "/wiki/Javis_Tyrr",
  "/wiki/Lovolol_cleaning_droid",
  "/wiki/Javis_Tyrr_Presents:_The_Jedi_Among_Us",
  "/wiki/Star_Wars",
  "/wiki/Troy_Denning",
  "/wiki/2009",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)"
 ]
}