{
 "name": "Unidentified_Ugnaught_scrap_merchant",
 "display_name": "Unidentified Ugnaught scrap merchant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugnaught"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "During the reign of the Empire, an Ugnaught merchant operated a market stall selling droid parts on the Imperial refueling outpost, Horizon Base.\n3 years before the Battle of Yavin, the station was raided by the Spectres. One member of the group, astromech droid C1-10P, also known as \"Chopper\", noticed the Ugnaught trader was selling an ambulatory strut identical to his mismatched right leg. Against orders, Chopper abandoned his post at the ship and headed over to buy the leg. Chopper attempted to barter with the merchant, who offered to sell the strut for 500 credits. However, when Chopper revealed that he had no funds, the merchant ordered to leave. Chopper noticed his companions had escaped and that he was left behind, prompting him to steal the leg and attempt to escape. The merchant spotted the droid getting away with his merchandise and alerted a trio of stormtroopers, however, Chopper managed to escape with the strut aboard an Imperial cargo ship.\nThis Ugnaught merchant took pride in the quality of his goods but also admitted to his involvement in shady dealings. The merchant was a shrewd individual who was concerned with making profits. He was annoyed with Chopper for lacking sufficient credits to buy a droid leg and ordered him to leave. The merchant was upset by the loss of his merchandise and alerted several stormtroopers to recover it.\nThe Ugnaught merchant was a diminutive individual with a short white beard and little hair on his scalp. He had brown eyes and pink skin. While he spoke Galactic Basic Standard, he was also capable of understanding droid languages like binary.\nThe Ugnaught scrap merchant appeared in \"The Forgotten Droid,\" the seventeenth episode in the second season of the animated television series Star Wars Rebels. He was voiced by Star Wars veteran Dee Bradley Baker, who had voiced all the clone troopers in The Clone Wars television series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ugnaught",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Droid",
  "/wiki/Horizon_Base",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Heist_at_Horizon_Base",
  "/wiki/Spectres",
  "/wiki/Astromech_droid",
  "/wiki/C1-10P",
  "/wiki/Ambulatory_strut",
  "/wiki/Ghost",
  "/wiki/Credit",
  "/wiki/Stormtrooper",
  "/wiki/Class_four_container_transport",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Binary",
  "/wiki/The_Forgotten_Droid",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Clone_trooper",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/StarWars.com"
 ]
}