{
 "name": "Unidentified_Imperial_terminal_officer",
 "display_name": "Unidentified Imperial terminal officer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 BBY",
      "Nur"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "A human male with the military rank of captain served as a terminal officer in the Galactic Empire's Imperial Army and was stationed on Fortress Inquisitorius on the ocean moon Nur. He was on duty while the Imperial officer Tala Durith went to a terminal and secretly helped the Jedi Obi-Wan Kenobi infiltrate the fortress. The terminal officer noticed that Durith should not have been at that terminal and asked her for identification, leading her away. However, once the pair were out of sight of the rest of the room, Durith killed the other officer and returned to her terminal.\nDuring the time of the Galactic Empire, the human male served as an Imperial terminal officer by the year 9 BBY with the military rank of captain. He operated in a terminal room of Fortress Inquisitorius, the headquarters of the Empire's Jedi-hunting group, the Inquisitorius, on the ocean moon of Nur in the Outer Rim's Mustafar system. One day that year, the officer was patrolling the room when the Captain Tala Durith consulted a terminal, secretly helping the fugitive Jedi Obi-Wan Kenobi infiltrate the fortress through an underwater entry point.\nThe terminal officer consulted the computer terminals behind Durith until he realized that she did not belong on the terminal that she was operating. The officer confronted her, asking for some identification and leading her to an area behind some terminals. Once they were out of sight of the rest of the room, Durith attacked the terminal officer, kicking him and twisting his neck, killing the man. The treacherous officer then returned to her terminal to speak with Kenobi again, citing that she had some company.\nA human male with light skin, the terminal officer was suspicious of Tala Durith's presence and was quick to lead her away from a terminal.\nThe officer wore a gray-green Imperial officer's uniform, including an Imperial kepi with an officer's disk, black gloves and boots, and a black belt with a silver buckle and compartments. He carried four code cylinders, slotted in pairs above each breast, and a rank insignia plaque on his left breast displaying three red tiles followed by a blue tile in a horizontal row.\nThe terminal officer appeared in \"Part IV\" of the live-action Disney+ television series Obi-Wan Kenobi, directed by Deborah Chow and released on June 8, 2022. Credited as \"Fortress Inquisitorius Terminal Officer,\" the character was portrayed by David Will No. According to No, a more significant fight scene between him and Tala Durith was planned but it was changed on the day of filming.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/9_BBY",
  "/wiki/Nur",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Military_rank",
  "/wiki/Captain",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Ocean",
  "/wiki/Moon",
  "/wiki/Imperial_officer",
  "/wiki/Tala_Durith",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Fortress",
  "/wiki/Officer",
  "/wiki/Imperial_Era",
  "/wiki/Standard_year",
  "/wiki/Hunting",
  "/wiki/Inquisitorius",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Mustafar_system",
  "/wiki/Standard_day",
  "/wiki/Water",
  "/wiki/Death",
  "/wiki/Treason",
  "/wiki/Color",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Breast",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Part_IV",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/June_8",
  "/wiki/2022",
  "/wiki/David_Will_No",
  "/wiki/Part_I",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Andor_(television_series)",
  "/wiki/June_4",
  "/wiki/File:Imperial_Forces_Rank_Chart_-_Rogue_One.png",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/File:DaveWillNoInsta.png"
 ]
}