{
 "name": "Unidentified_Jedi_youngling",
 "display_name": "Unidentified Jedi youngling",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "A human male Jedi youngling came to be trained by the Jedi Order sometime before the end of the Clone Wars. In 19 BBY, he was present at the Jedi Temple on Coruscant when the newly appointed Sith Lord Darth Vader led an attack against the Jedi. The young boy was slain by Vader within the Jedi Council Chamber, becoming one of the first victims of the Great Jedi Purge.\nThe youngling was initiated into the Jedi Order at some point during the final years of the Republic Era and trained in the Jedi arts during the Clone Wars, a pan-galactic conflict between the Galactic Republic and the Confederacy of Independent Systems. He was taught within the Jedi Temple on Coruscant shortly before the end of the war. In 19 BBY, the Jedi Knight Anakin Skywalker was turned to the dark side by Darth Sidious, who convinced the young man that all Jedi had become enemies of the Republic. He ordered Skywalker, now under the moniker of Darth Vader, to kill all members of the Order within the Jedi Temple's walls.\nVader led the 501st Legion of the Grand Army of the Republic in a siege on the Temple, marching into the building and decimating the Jedi within. The youngling and several other initiates fled to the Jedi Council Chamber, hiding behind the chairs the Council members would sit in. Vader later entered the chamber, prompting the youngling, who recognized the Jedi hero, to reveal himself and ask Skywalker what they would do against the clone troopers that outnumbered them. To the child's shock, however, the Sith Lord ignited his lightsaber and proceeded to slaughter the younglings.\nVader's murder of the youngling and his comrades would be uncovered by Jedi Masters Yoda and Obi-Wan Kenobi. After Sidious declared himself leader of a newly christened Galactic Empire, Kenobi informed Skywalker's wife, Padmé Amidala, of the crimes her husband had committed. Initially refusing to believe that he was capable of killing children, Amidala later confronted Vader on Mustafar, where she discovered that the man she loved had indeed fallen to the dark side.\nThe youngling's death would go on to be one of many counted among the Great Jedi Purge, Sidious' quest to eradicate the galaxy of the Jedi Order, though some Jedi managed to survive. By 18 BBY, the renegade Padawan Ferren Barr had learned of Skywalker's betrayal, including his murder of the younglings, and kept files about the Purge within his R1-series astromech droid Endee. He later informed his disciples of the children's death at Vader's hand during the Invasion of Mon Cala.\nThe youngling was a human male child with blond hair and blue eyes. He had fair skin and, shortly before his death, red cheeks. He was trusting of Jedi Knight Anakin Skywalker, looking to the older individual to guide the younglings against the clone trooper threat.\nLike other Jedi initiates, the youngling dressed in standard Jedi apparel, including a sandy-colored tunic and a brown belt and boots. He also had a Padawan braid draped from his head. When he was threatened by Lord Vader on Coruscant, he held a lightsaber.\nThe youngling first appeared in the 2005 film Star Wars: Episode III Revenge of the Sith, the final installment of the Star Wars prequel trilogy. Although unnamed in Star Wars canon, he was identified as Sors Bandeam in the Legends continuity. He was portrayed in an uncredited performance by Ross Beadman, whose name served as the basis for the character's in-universe title.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Jedi_youngling",
  "/wiki/Sors_Bandeam",
  "/wiki/19_BBY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Order",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Clone_Wars",
  "/wiki/Imperial_Palace",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Siege_of_the_Jedi_Temple",
  "/wiki/Jedi",
  "/wiki/Jedi_Council_Chamber",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Youngling",
  "/wiki/Standard_year",
  "/wiki/Republic_Era",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Jedi_Knight",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Darth_Sidious",
  "/wiki/Treason",
  "/wiki/Darth",
  "/wiki/Death",
  "/wiki/Jedi_temple",
  "/wiki/501st_Legion",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_Initiate",
  "/wiki/Jedi_High_Council",
  "/wiki/Clone_trooper",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Galactic_Emperor",
  "/wiki/Galactic_Empire",
  "/wiki/Marriage",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Mustafar",
  "/wiki/Galaxy",
  "/wiki/18_BBY",
  "/wiki/Ferren_Barr",
  "/wiki/R1-series_astromech_droid",
  "/wiki/Endee",
  "/wiki/Ferren_Barr%27s_disciples",
  "/wiki/Limb",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Cloning",
  "/wiki/Trooper",
  "/wiki/Jedi_robes",
  "/wiki/Padawan_braid",
  "/wiki/Lord",
  "/wiki/Lightsaber",
  "/wiki/2005",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars_Legends",
  "/wiki/Ross_Beadman",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Unidentified_Jedi_youngling",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Darth_Vader_(2020)_7",
  "/wiki/Darth_Vader_(2020)_24",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Vader_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi"
 ]
}