{
 "name": "Unidentified_male_Imperial_Knight_(Attack_on_Emperor_Fel)",
 "display_name": "Unidentified male Imperial Knight  (Attack on Emperor Fel)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "130 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fel Empire",
      "Imperial Knights",
      "Imperial Knights"
     ]
    }
   ]
  }
 ],
 "content": "A Human male with brown hair and a goatee was an Imperial Knight serving Emperor Roan Fel of the Galactic Empire in 130 ABY. Shortly after Fel's forces defeated the Galactic Alliance at the Battle of Caamas and won the Sith–Imperial War, Fel was betrayed by his Sith allies. However, he received advanced knowledge of the betrayal and fled into exile. To cover his escape, he sent four Imperial Knights, including the brown-haired male, against the Sith Lord Darth Krayt. Krayt arrived at the New Imperial Palace on the Imperial throneworld of Coruscant and slew all four Knights, proclaiming himself the Emperor of a new Empire.\nA brown-haired Human male with a goatee was a member of the Imperial Knights in 130 ABY. The Imperial Knights were a Force-using order that had pledged loyalty to Emperor Roan Fel of the Galactic Empire, and in that year, the brown-haired male was involved in a deception orchestrated by Fel against the Sith Lord Darth Krayt. Following the conclusion of the Sith–Imperial War, Fel was informed by Nyna Calixte, the Director of Imperial Intelligence, that his Sith allies who had helped his Empire win the war against the Galactic Alliance were planning to betray him. Darth Krayt intended to kill Fel and seize the Imperial throne at an upcoming meeting of the Imperial Council of Moffs. Fel fled from the Imperial throneworld of Coruscant, but felt that it was necessary for his double to meet with Krayt in the New Imperial Palace in order to buy him time to escape.\nFel's cousin, the Imperial Knight Mohrgan Fel, volunteered to lead three other Knights against Krayt in order to further the deception. Mohrgan, the brown-haired male, and two females stood by the decoy Emperor as he and the Moffs discussed the end of the war and its consequences. When Krayt arrived with three of his fellow Sith Lords, he demanded Fel's life. Mohrgan called on his contingent to protect the Emperor, but Krayt drew two lightsabers and struck them all down, severing the brown-haired male's weapon arm before taking his life. He then slew the decoy Emperor and proclaimed himself Emperor of a new Empire. Fel and the remaining Imperial Knights were forced into exile.\nThe brown-haired male was a member of the Imperial Knights, an organization whose membership was limited to those who displayed potential in the Force. The Imperial Knights were said to be among the most talented and dangerous Force-users in the galaxy. Although Roan Fel kept the Imperial Knights from participating in the Sith–Imperial War, the brown-haired male fought against Darth Krayt after the war's end, where he and three of his brethren were quickly struck down by the Sith's dual lightsabers.\nThe brown-haired male was one of four unidentified Imperial Knights introduced in the first issue of the comic series Star Wars: Legacy, written by John Ostrander, penciled by Jan Duursema, and released in June 2006. The events of that issue were retold in Legacy's eighth issue, released in February 2007, wherein three of the Knights remained unidentified and one was dubbed Mohrgan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/130_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Imperial_Knight",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Battle_of_Caamas",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/One_Sith",
  "/wiki/Empire-in-exile",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Emperor/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Legacy_(2006)_8",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Morrigan_Corde",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Darth/Legends",
  "/wiki/Death/Legends",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Roan_Fel%27s_double",
  "/wiki/Time/Legends",
  "/wiki/Mohrgan_Fel",
  "/wiki/Unidentified_female_Imperial_Knight_(Attack_on_Emperor_Fel)",
  "/wiki/Unidentified_female_Imperial_Knight_2",
  "/wiki/Moff/Legends",
  "/wiki/Darth_Maladi",
  "/wiki/Darth_Nihl",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Cho_sun/Legends",
  "/wiki/Limb/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/June",
  "/wiki/2006",
  "/wiki/February",
  "/wiki/2007",
  "/wiki/Category:Images_of_Unidentified_male_Imperial_Knight_(Attack_on_Emperor_Fel)",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Art_of_War_(Star_Wars_Insider_89)",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Legacy_Era_Campaign_Guide"
 ]
}