{
 "name": "Unidentified_female_rebel",
 "display_name": "Unidentified female rebel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "The rebel was a human female who served in the Rebel Alliance during the Galactic Civil War, meeting Princess Leia Organa and working with General Carlist Rieekan. In 3 ABY, she was stationed at Echo Base, the Alliance's base on the planet Hoth.\nOne day, the rebel conversed in a mess hall with the special forces soldier Kryndal and an alien rebel on how the Alliance would win the war. First Sergeant Hazram Namir, who also sat at their table argued that the Alliance would have infighting after coming out victorious, the female rebel insisted that their leaders had good intentions, but the first sergeant insulted their passion, causing a fight between him and Kryndal.\nEscaping Hoth before the Empire took over the base, the female rebel later spoke with Namir from a rebel relay station when he tried to contact the Alliance High Command. She explained the situation of the High Command and confirmed the death of General Philap Bygar to Namir, telling the man that he and his soldiers were on their own.\nThe human female joined the Rebel Alliance by the time of the Galactic Civil War between the Alliance and the Galactic Empire. During her service, she met Princess Leia Organa and worked with General Carlist Rieekan. In 3 ABY, she served at Echo Base, the Alliance High Command's secret base on the ice planet Hoth. One day, the rebel sat at a table at the mess hall with the special forces soldier Kryndal, an alien rebel, and a number of other Echo Base personnel. The female rebel debated with Kryndal and the alien on how the Alliance would go about liberating the Core Worlds.\nAs Kryndal expressed his confidence in the Alliance winning the war and liberating the capital planet Coruscant, Hazram Namir, a First Sergeant from the Alliance's 61st Mobile Infantry who also sat at the table, began questioning the Alliance's after taking Coruscant. As the first sergeant mentioned the population of the capital planet to be ten billion, the female rebel told him that it was much more. After Namir continued, assuming that not many of Coruscant's populous opposed the Empire as there had not already been an uprising, she expressed that the situation there was not that simple.\nNamir continued to argue with Kryndal about what would happen at Coruscant after the war, coming to claim that the Alliance was a power grab from those who had missed the opportunity at the end of the Clone Wars. The female rebel denied that this was the case, and argued that rebel leaders like General Rieekan and Leia Organa were not trying to seize power. Namir, though, compared her and Kryndal's compassion for them to the praise given to Darth Vader by his stormtroopers. Kryndal then swung at the first sergeant, causing a fight to break out, where the female rebel punched Namir in the jaw.\nThe Empire attacked the rebel base shortly after. The female rebel escaped, being made aware of the death of General Philap Bygar who had expressed high hopes for Everi Chalis, an Imperial governor who had defected to the Sixty-First. Some weeks after the Battle of Hoth, Namir, who had taken charge of the Sixty-First following the death of their captain, attempted to contact the High Command from the company's CR90 corvette, the Thunderstrike. Stationed at a rebel relay station, the female rebel replied to the Thunderstrike, recognizing Namir and warning him that their channel may not be secure.\nNamir, having recognized the rebel too, told her that his company was going to be out of contact for some time, asking if there was any new orders from the High Command. She replied that the High Command had not regrouped, with the final orders still standing. The female rebel then asked if Chalis was still with the Sixty-First. After Namir confirmed this, she expressed Bygar's hopes for the ex-governor, but broke the news of the general's death. After the female rebel told Namir that the Thunderstrike was on its own, and the communications cut after the first sergeant, considered a captain by his soldiers, replied.\nThe rebel was a human female with blonde hair. She smiled amusingly when correcting Hazram Namir's statement about Coruscant's population. Having met some of the rebel leaders, she argued that they did not look to seized power. When she explained the state of the High Command after the Battle of Hoth, she scowled.\nThe female rebel appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Civil_War",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/General",
  "/wiki/Carlist_Rieekan",
  "/wiki/3_ABY",
  "/wiki/Echo_Base",
  "/wiki/Planet",
  "/wiki/Hoth",
  "/wiki/Standard_day",
  "/wiki/Rebel_Alliance_Special_Forces",
  "/wiki/Rebel_trooper",
  "/wiki/Kryndal",
  "/wiki/Unidentified_alien_rebel",
  "/wiki/First_Sergeant",
  "/wiki/Hazram_Namir",
  "/wiki/Battle_of_Hoth",
  "/wiki/Alliance_High_Command",
  "/wiki/Death",
  "/wiki/Philap_Bygar",
  "/wiki/Soldier",
  "/wiki/Galactic_Empire",
  "/wiki/Water",
  "/wiki/Core_Worlds",
  "/wiki/Coruscant",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Clone_Wars",
  "/wiki/Anakin_Skywalker",
  "/wiki/Stormtrooper",
  "/wiki/Everi_Chalis",
  "/wiki/Governor",
  "/wiki/Standard_week",
  "/wiki/Micha_Evon",
  "/wiki/Company",
  "/wiki/CR90_corvette",
  "/wiki/Thunderstrike",
  "/wiki/Hair",
  "/wiki/2015",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}