{
 "name": "Unidentified_Mon_Calamari_(Level_1782)",
 "display_name": "Unidentified Mon Calamari  (Level 1782)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "A male Mon Calamari lived on the planet Coruscant during the reign of the Galactic Empire. Shortly after the destruction of the planet Alderaan, the Mon Calamari lived in a camp on Level 1782 of Coruscant. There he encountered Anandra Milon and her brother Santigo Milon in a junkyard, two children originally from Alderaan who were on the run from the Empire. Anandra had come to Level 1782 on the advice of a Herglic who claimed she could find someone who would help her there, but at first raised a blaster at the Mon Calamari, and attempted to rob him. He recognized the two as fugitives due to them being from Alderaan, and invited them to follow him, which Santigo persuaded his sister to agree to. He then lead them to the camp, where he pointed out the many non-human species living there who had been persecuted by the Empire, as the people of Alderaan now were. The Milons, who had been expected at the camp, then accepted the offer of shelter. The Mon Calamari wore a visor, a workman's vest that was two sizes too large for him, and carried a hydrospanner.\nThe Mon Calamari first appeared in \"One Thousand Levels Down\", a short story by Alexander Freed which was published in Star Wars Insider 151 in 2014. The story did not name the Mon Calamari and was illustrated by Joe Corroney and Brian Miller.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Mon_Calamari",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Unidentified_fugitive_camp",
  "/wiki/Level_1782",
  "/wiki/Anandra_Milon",
  "/wiki/Santigo_Milon",
  "/wiki/Unidentified_Herglic_criminal",
  "/wiki/Blaster",
  "/wiki/Species",
  "/wiki/Clothing",
  "/wiki/Hydrospanner",
  "/wiki/One_Thousand_Levels_Down",
  "/wiki/Alexander_Freed",
  "/wiki/Star_Wars_Insider_151",
  "/wiki/2014",
  "/wiki/Joe_Corroney",
  "/wiki/Brian_Miller",
  "/wiki/Star_Wars_Insider"
 ]
}