{
 "name": "Unidentified_Imperial_commander_(Yavin_4)",
 "display_name": "Unidentified Imperial commander  (Yavin 4)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "A male Human individual served as an Imperial commander during the Galactic Civil War.\nAfter the Battle of Yavin, the Imperial commander was stationed in Outpost GRF-7493 on Yavin 4. In 1 ABY, during the Empire Day festivities, he met an Imperial spacer, sent to meet him from Dathomir by an Imperial data officer. The commander had the spacer speak to Lord Vader, so that he could complete the important mission. The Imperial handed Darth Vader some historical documents regarding the Jedi they had imprisoned After speaking for a short time, Lord Vader had the Imperial report back to the Imperial commander, who awarded him with an Imperial banner. The Imperial commander had one final task for the soldier, which involved interrogating the Jedi they had imprisoned for information. Fortunately, the interrogation was successful, and so they gained the information they were looking for. Following Empire Day, the commander left the facility to pursue other matters.\nThe Imperial commander was enthusiastically loyal toward Lord Vader, and the Empire he served. He had aspirations to serve aboard Darth Vader's flagship, the Executor.\nAn Imperial commander, who lacked an official name, appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Imperial commander was added to the game upon the release of the \"Publish 19\", on June 29, 2005. During the 2005 Empire Day live event from June 29 to July 11, 2005, he could be found at an outpost on Yavin 4 and was part of a quest titled, \"Happy Empire Day!,\" which sent players on an important mission throughout the galaxy. After the live event ended, the Imperial commander never reappeared in the game since the Empire Day event was discontinued until its complete overhaul in 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jedi_Prisoner",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Outpost_GRF-7493",
  "/wiki/Yavin_4/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Empire_Day/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Unidentified_Imperial_data_officer",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Executor/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_29",
  "/wiki/2005",
  "/wiki/July_11",
  "/wiki/2008",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}