{
 "name": "Unidentified_Mandalore",
 "display_name": "Unidentified Mandalore",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3954–3951 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Taung"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorian Neo-Crusaders"
     ]
    }
   ]
  }
 ],
 "content": "An unidentified Mandalore rose to power among the Mandalorian clans following the death of Mandalore the Ultimate at the hands of the Jedi Knight Revan at the final battle of the Mandalorian Wars. He was the last Taung to hold the title of Mandalore.\nDuring the Jedi Civil War, around the time of the Dark Lord of the Sith Darth Revan's capture in 3957 BBY, a Mandalorian soldier sent Revan's assassin droid HK-47, who he claimed as 'booty' and used to gain rank, to assassinate this Mandalore. However, the Mandalore managed to capture the droid, reprogramming it to kill the usurper, a task at which HK-47 succeeded, though the droid would later consider it his poorest performance. In 3956 BBY, he sent a team of Mandalorians to the Shadowlands of Kashyyyk, and ordered them to test the effectiveness of new stealth field generator technology.\nAt some time before 3951 BBY, he encountered Canderous Ordo, who had recovered Mandalore's Mask and sought to unify the clans. Already dying, the Taung did not survive this meeting. He proclaimed that Mandalore the Ultimate had usurped the title with Sith assistance, and that he was the true heir of Mandalore the Indomitable. He asked Canderous to adopt his clan and take his armor, in order to preserve their heritage. Ordo would do this, integrating this Mandalore's mask into his own helmet, subsequently becoming Mandalore the Preserver.\nAbel G. Peña has confirmed that this unidentified Mandalore, who is preceded by Mandalore the Ultimate, was intended to be the same Taung warrior that is mentioned in Canderous Ordo's biographical entry in the Knights of the Old Republic Campaign Guide. When asked if the two were in fact the same, Peña responded, \"Yes, that's him. I toyed with calling him dar'Mand'alor, loosely translating Mandalore the Unknown.\"\n]]",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3954_BBY",
  "/wiki/3951_BBY",
  "/wiki/Taung/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalore_the_Ultimate",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Battle_of_Malachor_V",
  "/wiki/Mandalorian_Wars",
  "/wiki/Mandalore_(title)",
  "/wiki/Jedi_Civil_War",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Capture_of_Darth_Revan",
  "/wiki/3957_BBY",
  "/wiki/Assassin_droid/Legends",
  "/wiki/HK-47",
  "/wiki/3956_BBY",
  "/wiki/Shadowlands/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Cloaking_device/Legends",
  "/wiki/Canderous_Ordo",
  "/wiki/Mandalore%27s_Mask",
  "/wiki/Mandalore_the_Indomitable",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Jedi_Council_Forums",
  "/wiki/November_28",
  "/wiki/2008"
 ]
}