{
 "name": "Unidentified_Imperial_shuttle_co-pilot",
 "display_name": "Unidentified Imperial shuttle co-pilot",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Shuttle 2743"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Gideon's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "A human male co-pilot served in the Galactic Empire, being aboard the DS-1 Death Star Mobile Battle Station when it destroyed the planet Alderaan in 0 BBY. After the Empire was fractured into remnants, he operated with a remnant led by Moff Gideon. Around 9 ABY, he and the primary pilot aboard the Lambda-class T-4a shuttle designated Shuttle 2743 were pursued by the Firespray-31-class patrol and attack craft Slave I while ferrying Doctor Pershing.\nThe Slave I immobilized the shuttle and clamped to it, the Mandalorian Din Djarin entering the vessel. The co-pilot held Pershing at gunpoint, and shot the other pilot when he attempted to resolve the confrontation. He then taunted the Alderaan survivor marshal Cara Dune until she shot him.\nDuring the time of the Galactic Empire, the co-pilot served on the Empire's DS-1 Death Star Mobile Battle Station. He stood witness as the Death Star destroyed the planet Alderaan in 0 BBY. The Death Star was soon destroyed that same year, and its successor, the DS-2 Death Star II Mobile Battle Station, met a similar fate in 4 ABY. The Empire then fractured into remnants, and the co-pilot served in one led by the Imperial Moff Gideon by around 9 ABY, during the reign of the New Republic.\nAt some point, the co-pilot was tasked with ferrying the clone engineer Doctor Pershing to Gideon's light cruiser aboard the Lambda-class T-4a shuttle designated Shuttle 2743 with another pilot. However, they were hunted by the Firespray-31-class patrol and attack craft Slave I, which chased the shuttle through space. Pershing asked what was going on, but the co-pilot told him to be quiet. The pilots attempted to outmaneuver the Slave I, but the attack craft soon immobilized Shuttle 2743 with an Ion cannon shot. The other pilot assess the losses from the shuttle's systems, and the Slave I's pilot, Boba Fett, ordered for Shuttle 2743's shields and transponders to be disabled, warning of a boarding party.\nPershing assumed the attackers were pirates and asked if they should fight, to which the co-pilot stated that he did not have a death wish. The Slave I then passed above Shuttle 2743's cockpit and clamped to the shuttle. The Mandalorian Din Djarin entered the cockpit shortly after, and co-pilot and his comrades got out of their seats, the other two raising their hands. The shuttle co-pilot introduced Pershing to Djarin, who had already met the doctor. As the Mandalorian exchanged with Pershing after, the co-pilot held his SE-14r light repeating blaster to Pershing's head. The New Republic marshal Cara Dune joined Djarin, and the co-pilot told her to stay back.\nThe other pilot attempted to resolve the confrontation, claiming he was not supporting his comrade, but the shuttle co-pilot promptly shot him, killing the pilot. Dune asked the co-pilot to drop his weapon, but the pilot denied her and summarized the importance of Pershing being alive. He also noticed a tear tattoo on the marshal, identifying her as an Alderaanian and taunting her about her homeworld's destruction and condemning the deaths of millions aboard both Death Stars. Dune asked him again to drop his blaster, but he continued, calling the riddance of Alderaan a small price to pay against \"terrorism.\" The marshal thus shot him in the face, and she and her associates used the shuttle to infiltrate Gideon's cruiser.\nThe Imperial shuttle co-pilot was a human male with light skin and brown eyes. He was loyal to the Empire, deeming the destruction of Alderaan and its entire population as justified in ridding the galaxy of \"terrorism\" but holding the destruction of both Death Stars as unforgivable war crimes. The co-pilot silenced Pershing when the doctor asked of the situation while Shuttle 2743 was pursued. When the doctor suggested fighting the attackers, the co-pilot remarked that he did not have a death wish.\nUpon Djarin's arrival, the co-pilot was the only Imperial aboard the shuttle to not raise his hands and instead used Pershing as a bargaining chip, stressing the value of the doctor. His zealous loyalty to the Empire also drove him to murder his fellow pilot when the man tried to bargain as well with the intruders. The co-pilot identified Cara Dune as Alderaanian from her tear drop tattoo, as well as a Rebel dropper, but foolishly chose to taunt her about her destroyed homeworld, which led to his death when the enraged Dune shot him in the face.\nThe co-pilot donned a black flight suit with the Imperial crest on his shoulders. He also wore an aviator hat with a built in comlink and black gloves. The co-pilot wielded an SE-14r light repeating blaster, which he used to hold Pershing at gunpoint.\nThe Imperial shuttle co-pilot appeared in \"Chapter 16: The Rescue\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Peyton Reed and released on December 18, 2020. Credited as \"Co-Pilot,\" he was played by Thomas E. Sullivan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_ABY",
  "/wiki/Shuttle_2743",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/The_Disaster",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/0_BBY",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Unidentified_Imperial_shuttle_pilot",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Operating_number",
  "/wiki/Firespray-31-class_patrol_and_attack_craft",
  "/wiki/Slave_I",
  "/wiki/Doctor",
  "/wiki/Pershing",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Starship",
  "/wiki/Pilot",
  "/wiki/Marshal",
  "/wiki/Carasynthia_Dune",
  "/wiki/Imperial_Era",
  "/wiki/Battle_of_Yavin",
  "/wiki/Standard_year",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Cloning",
  "/wiki/Engineer",
  "/wiki/Gideon%27s_light_cruiser",
  "/wiki/Shuttle",
  "/wiki/Realspace",
  "/wiki/Ion_cannon",
  "/wiki/Boba_Fett",
  "/wiki/Deflector_shield",
  "/wiki/Transponder",
  "/wiki/File:Pershing-captive-CH16.png",
  "/wiki/Pirate",
  "/wiki/Death",
  "/wiki/SE-14r_light_repeating_blaster",
  "/wiki/Alderaanian",
  "/wiki/Homeworld",
  "/wiki/Blaster",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/File:ShutUpPershing-CH16.png",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Flight_suit",
  "/wiki/Imperial_crest",
  "/wiki/Comlink",
  "/wiki/Glove",
  "/wiki/Repeating_blaster",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Peyton_Reed",
  "/wiki/December_18",
  "/wiki/2020",
  "/wiki/Thomas_E._Sullivan",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/The_Mandalorian:_The_Rescue",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Template:MandoDate",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Alphabet_Squadron_(novel)"
 ]
}