{
 "name": "Unidentified_Mandalorian_super_commando_1",
 "display_name": "Unidentified Mandalorian super commando 1",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "MandaloriansDeath Watch",
      "Death Watch",
      "Shadow Collective"
     ]
    }
   ]
  }
 ],
 "content": "This Mandalorian super commando was a member of Death Watch during the time of the Clone Wars and later sided with Darth Maul and his Shadow Collective.\nAfter building up an army of criminals including the Black Sun, Pyke Syndicate, and Hutt Empire, Darth Maul and his army of criminals attacked Sundari so the Death Watch could come in and stop them so they could take control of the planet. Maul was betrayed, and locked away in Sundari prison, but escaped and returned to Sundari Royal Palace with his brother Savage Opress and former Mandalorian Prime Minister Almec. Maul slayed the leader of the Death Watch at that time, Pre Vizsla, and took control of the band of warriors. This Mandalorian was one of the many who aligned with Maul after Vizsla's death.\nLater, he changed his armor to give it a red design to honor the new leader of the Death Watch. This Mandalorian super commando was stationed at the docks when Obi-Wan Kenobi arrived to rescue Duchess Satine Kryze. Kenobi disguised himself in his Rako Hardeen outfit and arrived in the Twilight. The Mandalorian first asked if Kenobi wanted the ship looked at since it was falling apart, but Kenobi did not want this so this Mandalorian then asked for his landing permit. Not having one, Kenobi said he left it in the ship and had this Mandalorian come in to get it. Once inside the ship, Kenobi knocked this Mandalorian unconscious and took his armor. Kenobi then used the armor of the commando to rescue the Duchess. However, he was caught by Maul and his men, and Maul executed Satine.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Mandalorian_super_commando",
  "/wiki/Mandalore/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Death_Watch/Legends",
  "/wiki/Shadow_Collective/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Pyke_Syndicate/Legends",
  "/wiki/Hutt_Empire",
  "/wiki/Takeover_of_Mandalore/Legends",
  "/wiki/Sundari/Legends",
  "/wiki/Sundari_prison",
  "/wiki/Sundari_Royal_Palace/Legends",
  "/wiki/Savage_Opress/Legends",
  "/wiki/Prime_Minister/Legends",
  "/wiki/Almec/Legends",
  "/wiki/Pre_Vizsla/Legends",
  "/wiki/Mandalorian_super_commando/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Duke/Legends",
  "/wiki/Satine_Kryze/Legends",
  "/wiki/Rako_Hardeen/Legends",
  "/wiki/Twilight/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Lawless"
 ]
}