{
 "name": "Unidentified_Kilji_vassal_(weapons)",
 "display_name": "Unidentified Kilji vassal  (weapons)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kilji"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kilji Illumine"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Nakirre",
      "Qilori"
     ]
    }
   ]
  }
 ],
 "content": "A Kilji vassal operated the Kilji Illumine war cruiser Whetstone's weapons under the command of their master and the ruler of the Illumine, Generalirius Nakirre. Around 18 BBY, Nakirre was killed by his Grysk ally named Jixtus, and the Whetstone's Pathfinder navigator, Qilori, became the Kilji vassals' new master. The weapons operator assisted his new master in destroying Jixtus's flagship, the massive FateSpinner.\nAround 18 BBY, a Kilji vassal operated the Kilji Illumine war cruiser Whetstone's weapons under the command of the Illumine's leader, Generalirius Nakirre. Following the warship's arrival at the Unknown Regions' Sunrise system, Nakirre was murdered by his Grysk ally Jixtus. As a result, a Kilji vassal informed navigator Qilori of the consequences of having no master: that the that the weapons operator and the other vassals aboard the Whetstone were not able to move or think, for the beliefs they followed prevented them from doing so.\nShortly after, Qilori announced his mastery over the Kilji, and the weapons Kilji inquired their new master on what weapons they wished to use to destroy Jixtus's flagship, the FateSpinner. Qilori then commanded the vassal to use all of them at point blank range as accurately as the other could. Shortly after, on the navigator's orders, the Whetstone's vassals removed the warship's peace-sealing, which sealed its weapons. The weapons then vassal fired at the FateSpinner, inducing its Grysk commander to self-destruct his ship, killing himself.\nThe Kilji was enlightened to the Kilji way of order and enlightenment, following his masters' commands blindly. The enlightened vassal possessed two hands.\nThe vassal appeared in the 2021 novel Thrawn Ascendancy: Lesser Evil, the final volume in the Star Wars: The Ascendancy Trilogy written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Kilji_vassal",
  "/wiki/Kilji",
  "/wiki/Kilji_Illumine",
  "/wiki/Nakirre",
  "/wiki/Qilori",
  "/wiki/File:Kiljiwarcruiserboom.ogg.ogg",
  "/wiki/Kilji_war_cruiser",
  "/wiki/Whetstone",
  "/wiki/Weapon",
  "/wiki/Commanding_officer",
  "/wiki/Generalirius",
  "/wiki/18_BBY",
  "/wiki/Death",
  "/wiki/Jixtus",
  "/wiki/Pathfinders_(Navigators%27_Guild)",
  "/wiki/Navigator",
  "/wiki/Senior_Captain_Thrawn%27s_last_stand",
  "/wiki/Flagship",
  "/wiki/FateSpinner",
  "/wiki/Vimsk",
  "/wiki/Kilji_vassal",
  "/wiki/Warship",
  "/wiki/Unknown_Regions",
  "/wiki/Sunrise_system",
  "/wiki/Gender",
  "/wiki/Grysk",
  "/wiki/Unidentified_Kilji_vassal_(Helm)",
  "/wiki/Kilji_way_of_order_and_enlightenment",
  "/wiki/Peace-sealing",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Suicide",
  "/wiki/Hand",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Ahsoka_Tano",
  "/wiki/Jedi_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Attack_on_Csilla",
  "/wiki/Standard_year"
 ]
}