{
 "name": "Unidentified_prostitute",
 "display_name": "Unidentified prostitute",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Arcan IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "A red-haired woman was a prostitute on the planet Arcan IV during the height of the Galactic Empire.\nThis woman was native to the Arcan IV and frequented the commercial district of the planet. During her rounds, she would would eventually make her way near Lemo and Sanda's den. However, she resented the pirate band for scaring away paying customers, especially since they had brought women with them and so had no need for her services. On one particularly slow night, the woman began to hope for a way to get back at the pirates for hurting her business. When Lando Calrissian, disguised as the pirate \"Captain Drebble\" stopped by her corner in a hover car to ask her for directions, she seized the chance to get back at the \"pirate\" for wronging her. Although Calrissian asked for the fastest route to the Arcan IV Spaceport, the prostitute gave him directions to lead him directly into oncoming traffic one of the busiest spacelanes on the planet. As Calrissian and his companion, Chewbacca departed thanking the woman, the prostitute smiled to herself, pleased with the trick she had pulled.\nHowever, moments after the \"pirates\" had left her street corner, the real pirates, Lemo and Sanda's gang, flew past the woman on their own vehicles, intent on murdering Calrissian and Chewbacca. The prostitute was puzzled by the event, having hoped that she was hurting the pirates not helping them capture their quarry. Luckily for Calrissian and Chewbacca, they were able to dodge the oncoming traffic and make their way back to their ship despite the woman's faulty directions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arcan_IV",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Prostitute/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lemo_and_Sanda%27s_den",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Barpotomous_Drebble/Legends",
  "/wiki/Hover_car",
  "/wiki/Arcan_IV_Spaceport",
  "/wiki/Chewbacca/Legends",
  "/wiki/Lemo_and_Sanda%27s_gang",
  "/wiki/Star_Wars_(1977)_79"
 ]
}