{
 "name": "Unidentified_Ishi_Tib_guild_master",
 "display_name": "Unidentified Ishi Tib guild master",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ishi Tib"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "The Ishi Tib was a guild master on the ringed space station Glavis Ringworld. Around 9 ABY, they hired the Mandalorian bounty hunter Din Djarin to bring in the Klatooinian Kaba Baiz. After Djarin took the severed head of Baiz to the guild master, the Ishi Tib insisted he joined them and their party for dinner, but the Mandalorian the guild master to give him information he was promised and left.\nThe Ishi Tib was a guild master, residing on the ringed space station of Glavis Ringworld during the reign of the New Republic. Around 9 ABY, they hired the Mandalorian bounty hunter Din Djarin to capture the Klatooinian Kaba Baiz dead or alive, as the Klatooinian owed credits to the guild master. The guild master had also promised the bounty hunter information on where to find the access shaft to Glavis's substrata. The Mandalorian ultimately killed Baiz and brought the his severed head to the Ishi Tib at a lounge where they sat with six other delicacies.\nThe guild master commended how fast Djarin had completed his job, the Mandalorian asking for his payment and the information he had been promised. The Ishi Tib insisted on the bounty hunter joining their meal, threatening to not reveal the information. Djarin, though, took back Baiz's head, claiming he could find another client to take the Klatooinian's bounty from. Giving in, the guild master revealed that the substrata could be access by the heat towers on Glavis's Kolzoc Alley. The Ishi Tib again asked Djarin to sit with their party, promising another job, but the Mandalorian recommended putting Baiz's head on ice and left.\nThe Ishi Tib had blue skin and brown eyes. They were insistent on Din Djarin feasting with them to give the bounty hunter another job, threatening to withdraw a promise of information. However, they ultimately caved when the Mandalorian threatened to give Kaba Baiz's head to other clients.\nThe Ishi Tib wore red and dark blue clothing.\nThe Ishi Tib appeared in \"Chapter 5: Return of the Mandalorian\" of the Disney+ series The Book of Boba Fett, which was directed by Bryce Dallas Howard and released on January 26, 2022. The character was portrayed vocally by Helen Sadler, with Safiya Fredericks being the performance artist.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ishi_Tib",
  "/wiki/Color",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Space_station",
  "/wiki/Glavis_Ringworld",
  "/wiki/9_ABY",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Klatooinian",
  "/wiki/Kaba_Baiz",
  "/wiki/Dismemberment",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Credit",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Death",
  "/wiki/Kolzoc_Alley",
  "/wiki/Water",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Bryce_Dallas_Howard",
  "/wiki/January_26",
  "/wiki/2022",
  "/wiki/Helen_Sadler",
  "/wiki/StarWars.com",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Boba_Fett",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_7:_In_the_Name_of_Honor"
 ]
}