{
 "name": "Unidentified_Kilmaulsi_thug",
 "display_name": "Unidentified Kilmaulsi thug",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kilmaulsi"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A member of the Kilmaulsi species was on the planet of Cato Neimoidia in 19 BBY shortly after the end of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The Kilmaulsi was associated with a member of the reptilian Chistori species who was also on the planet and accompanied it to accept a job being offered by the Human Ember Chankeli from the planet Telerath. Chankeli wanted a gang of slavers removed from her hometown and had advertised as such in a cantina nearby. Upon arriving at the location to take the job, the Chistori and the Kilmaulsi, who were accompanied by several Neimoidians, found two competitors for the task, one of whom was the former Jedi Dass Jennir, with whom the reptile had previously fought over the job. Determined not to be beaten a second time the Chistori and his comrades attacked but were all defeated with relative ease by Jennir and subdued. During the fight Jennir brought his foot down on the Kilmaulsi's leg, causing a loud snapping sound and a squawk. The Kilmaulsi wore purple armor and brown pants during the fight and had green skin and blue eyes.\nThe Kilmaulsi thug first appeared in 2009 in Dark Times: Blue Harvest, Part 2 the second of two mini-issues of the Star Wars: Dark Times comic book series which was designed as an introduction to the Blue Harvest story arc. The issue was written by Randy Stradley under the name Mike Harrison and illustrated by Douglas Wheatley.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kilmaulsi",
  "/wiki/Color/Legends",
  "/wiki/Dark_Times:_Blue_Harvest,_Part_2",
  "/wiki/Species/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cato_Neimoidia/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Unidentified_Chistori_thug",
  "/wiki/Reptile/Legends",
  "/wiki/Chistori",
  "/wiki/Human/Legends",
  "/wiki/Ember_Chankeli",
  "/wiki/Telerath/Legends",
  "/wiki/Musori%27s_slaver_gang",
  "/wiki/Slavery/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Dass_Jennir",
  "/wiki/Armor/Legends",
  "/wiki/Eye/Legends",
  "/wiki/2009",
  "/wiki/Star_Wars:_Dark_Times",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Dark_Times:_Blue_Harvest",
  "/wiki/Randy_Stradley",
  "/wiki/Douglas_Wheatley"
 ]
}