{
 "name": "Unidentified_Antarian_Ranger",
 "display_name": "Unidentified Antarian Ranger",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Antarian Rangers"
     ]
    }
   ]
  }
 ],
 "content": "There was a Human male Antarian Ranger on Telos IV some decades before the rise of the empire, he was a contact working with the failed Jedi, Dairoki.\nHis mission was to create confusion among the people of Telos IV by making them believe that the Antarian Rangers were involved with the death of one of Telos IV priest, Liora, who was actually killed by Dairoki himself, the murder was all just a plan to erupt a civil war on Telos IV ordered by Telos IV's ruler himself, Lord Crion. When the Jedi were sent to investigate the murder, the Ranger was ordered to sabotage their mission, he and a couple of insurgents destroyed the vehicle of Jedi Master Tahl, They confronted her but were defeated, only the ranger was able to escape, thanks to his training, this led Tahl to believe that the Rangers were indeed involved with the recent events, the next day he changed to civilian clothes to go unnoticed and informed Dairoki of the situation claiming that he never actually fought a Jedi before, Dairoki recommended using his Ranger uniform to which he neglected, then Dairoki told him about his next objective, and gave him a lightsaber the mission was to introduce the lightsaber in some skirmish between the Telos police and the insurgents so it would be found to make the conspiracy of the Rangers and the Jedi being involved in the revolution gain more strength. While the mission was successful, Dairoki didn't know that the insurgents were going to be hitting the royal palace, which resulted in the death of Nason, Crion's Daughter and Dairoki's lover, this caused Dairoki not only grief, but also a loss in credibility to his benefactor, Crion, when Dairoki explained the situation about the lightsaber to Crion, the lord replied that it would be useless if someone had seen him during the raid on the palace, Dairoki suggested that the Antarian Ranger made another appearance, but Crion said that since Tahl, who was the only person that could actually identify the Ranger, was called away by the Jedi Council, that the Ranger could just disappear and ordered Dairoki to get offworld, one way or another.\nWhile not at the same level of power of a Jedi, the Antarian Ranger showed being capable of withstanding against and escape one like Master Tahl back when she wasn't blind, he was also trusted enough by Dairoki to carry out important missions, like sneaking a lightsaber in one skirmish, being able to survive and escape, he was usually mostly successful in his objectives and was shown to be a good pilot when he escaped Tahl with a vehicle in a street with many obstacles.\nThe ranger was equipped with a variety of weapons and tools such as a couple of blaster pistols a speeder bike his Ranger uniform and a knife which he seemed skilled in throwing. He also got possession of a lightsaber given to him by Dairoki, though he didn't get to use the weapon since his mission was just to sneak it into an skirmish.\nThe Antarian Ranger appeared in 2011 in Jedi—The Dark Side 2 the second of 5 issues of the Jedi The dark side comic book series which was designed as a prequel to the Jedi Apprentice novel series of Jude Watson. The issue was written by Scott Allie and illustrated by Mahmud Asrar.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Antarian_Rangers/Legends",
  "/wiki/Telos_IV",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Jedi/Legends",
  "/wiki/Dairoki",
  "/wiki/Liora",
  "/wiki/Lord/Legends",
  "/wiki/Crion",
  "/wiki/First_Mission_to_Telos",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tahl",
  "/wiki/Lightsaber",
  "/wiki/Nason",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/WESTAR-34_blaster_pistol",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Knife/Legends",
  "/wiki/2011",
  "/wiki/Jedi%E2%80%94The_Dark_Side_2",
  "/wiki/Star_Wars:_Jedi%E2%80%94The_Dark_Side",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Jedi_Apprentice",
  "/wiki/Jude_Watson",
  "/wiki/Scott_Allie",
  "/wiki/Mahmud_Asrar",
  "/wiki/Jedi%E2%80%94The_Dark_Side_3",
  "/wiki/Jedi%E2%80%94The_Dark_Side_4"
 ]
}