{
 "name": "Unidentified_Gran_worker",
 "display_name": "Unidentified Gran worker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Koensayr Manufacturing"
     ]
    }
   ]
  }
 ],
 "content": "A Gran male was employed as a worker at the testing facility orbiting the planet of Bormus, where he was assigned to the BTL-B Y-wing starfighter, a new model of bomber. During the Clone Wars, Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, arrived at the facility to acquire several of the new fighters for Skywalker's squadron. The Gran initially refused their request due to a matter of procedure, but the worker gave in when Tano threatened to tell Supreme Chancellor Palpatine that he had delayed the Jedi.\nA Gran male worker was employed at the Bormus testing facility, a Koensayr Manufacturing space station orbiting the planet of Bormus. During the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the Gran was among the workers in the testing facility assigned to the BTL-B Y-wing starfighter, a new model of bombers currently under production in the BTL Y-wing starfighter line.\nAround 21 BBY, Jedi Knight Anakin Skywalker traveled to the facility with his Padawan, Jedi Commander Ahsoka Tano, to obtain several of the new starfighters for his squadron. Skywalker wanted to use the bombers for his upcoming attack on the Confederate Subjugator-class heavy cruiser Malevolence. The Gran, who assumed the Jedi's visit to be a surprise inspection, initially refused to allow them access to the new model of bombers because it violated procedure; the bombers were still under production, and the request for the starfighters to be cleared for use by the Republic was supposed to come directly from the office of Ask Aak, the senator of Malastare. However, when Tano threatened to call Supreme Chancellor Palpatine and tell him that their mission had to be postponed because of the Gran had delayed their efforts, the worker finally allowed the two Jedi to acquire a squadron of the starfighters.\nThe Gran worker closely followed his orders, and when Skywalker requested the use of some of the Y-wings, he denied the Jedi on the basis of procedure, as such a request was required to come directly from the office of Senator Aak. However, he also wished to stay out of trouble, and when Tano threatened to tell Palpatine that he was holding them up, he gave in and allowed the Jedi to acquire the fighters. The Gran had green eyes and brown skin.\nThis Gran's first and only appearance is in The Clone Wars: Procedure, a six-page comic in The Clone Wars web comic series which led into \"Shadow of Malevolence,\" the third episode in Season One of The Clone Wars television series. Pablo Hidalgo intended the use of a Gran at the facility to serve as an example of Senator Aak placing beings of his choice into influential situations. This is conjectural, however, as it was not confirmed in the comic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Gran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Koensayr_Manufacturing/Legends",
  "/wiki/The_Clone_Wars:_Procedure",
  "/wiki/Bormus_testing_facility/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bormus/Legends",
  "/wiki/BTL-B_Y-wing_starfighter",
  "/wiki/Bomber/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Shadow_Squadron/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/BTL_Y-wing_starfighter/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Battle_of_the_Kaliida_Nebula/Legends",
  "/wiki/Subjugator-class_heavy_cruiser/Legends",
  "/wiki/Malevolence/Legends",
  "/wiki/Ask_Aak/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars_Annual_2011",
  "/wiki/StarWars.com",
  "/wiki/Jedi_Council_Forums",
  "/wiki/October_7",
  "/wiki/2008",
  "/wiki/December_2",
  "/wiki/2013"
 ]
}