{
 "name": "Unidentified_clone_trooper_(Vassek_moon)",
 "display_name": "Unidentified clone trooper  (Vassek moon)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Third moon of Vassek"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicCC-3714's squad",
      "CC-3714's squad"
     ]
    }
   ]
  }
 ],
 "content": "This unidentified clone trooper was a clone trooper in the Grand Army of the Republic who served under promoted Jedi Knight Nahdar Vebb and Commander CC-3714 \"Fil\" during the Clone Wars. In 22 BBY, the trooper was a member of a squad of five clone troopers led on a mission by Fil to the third moon of Vassek, in the Outer Rim Territories. Accompanied by Vebb and Jedi Master Kit Fisto, the group searched for Trade Federation Viceroy Nute Gunray, who had been recently freed from Republic captivity.\nAfter fellow troopers Bel and Niner were ordered to stay with the ships, this trooper, along with two others, followed Fisto, Vebb, and Fil into a castle. Once inside, the team stumbled upon what they thought was Gunray guarded by a group of battle droids. After destroying the droids, the team found that \"Gunray\" was only a hologram, and that they had stumbled into a trap laid by Gunray and the Confederate Head of State Count Dooku, who had used a homing beacon to deceive the Jedi and make them believe that Gunray was hiding in the castle. Dooku himself appeared in hologram form, telling the group that while Gunray was unavailable, he will offer them an \"alternative prize\".\nUpon realizing that they had stumbled into the lair of Confederate General Grievous, the group set up a trap for the general. Once he arrived home, the Jedi engaged Grievous, while the clones used grappling hooks to hold him. The Jedi were able to sever Grievous in half, but the general dispatched them, and released himself from the clones. Grievous made a run for it, and this clone, as well as another, were ordered by Vebb to cut him off while the others gave chase. The troopers did as ordered, and fired at the general as he came towards them. Unfortunately, Grievous was too quick for their aim, and he attacked them both. By the time the rest of the group caught up, Grievous was gone, and the two clones were dead, visibly saddening Vebb.\nAfterwards, Bel and Niner would perish when a Magnaguard fired a rocket launcher at their shuttle, the final unnamed clone would fall into a carbonite pit, Fil would be killed by Grievous's pet roggwart, Gor, and Vebb would be murdered at the hands of Grievous himself, leaving Fisto as the only survivor of the mission.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Third_moon_of_Vassek",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/CC-3714%27s_squad",
  "/wiki/CC-3714",
  "/wiki/Lair_of_Grievous",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Nahdar_Vebb/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Jedi_Master",
  "/wiki/Kit_Fisto",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Viceroy/Legends",
  "/wiki/Nute_Gunray",
  "/wiki/Bel/Legends",
  "/wiki/Niner/Legends",
  "/wiki/Grievous%27s_Castle",
  "/wiki/Battle_droid/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Unidentified_clone_trooper_2_(Vassek_moon)",
  "/wiki/IG-100_MagnaGuard/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Roggwart/Legends",
  "/wiki/Gor/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_clone_trooper_(Vassek_moon)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}