{
 "name": "Unidentified_Neimoidian_(Kellux_system)",
 "display_name": "Unidentified Neimoidian  (Kellux system)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Before the Invasion of Naboo",
      "Kellux system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "A Neimoidian male served as a member of the Trade Federation prior to the Invasion of Naboo. He was part of a crew stationed aboard the Lucrehulk-class Battleship above the planet Kellux. He contacted their mysterious benefactor, Darth Sidious, asking for his help against the pirates that had deactivated their Vulture Droids and had captured them aboard their own ship. Sidious sent his apprentice Darth Maul, who arrived and proceeded to destroy the pirates' Orb-wings, before entering the Federation's ship hangar bay and heading to where the Neimoidians were being held. The captain warned the pirates that they had powerful allies, but the pirates began laughing at him, before suddenly a body hit the bridge's window and the Dark Lord of the Sith arrived. As he entered, Darth Maul not only killed the pirates but also the cowardly Trade Federation crew members that he had been sent to rescue. This Neimoidian however managed to avoid being cut down with the others and listened to the Sith Lord interrogating one of the mercenaries about the location of a Padawan that had been captured by the boss mistress Xev Xrexus. As he was about to thank Darth for saving him, the Zabrak struck him down in order for information about his existence and the secret auction to remain but mysteries.\nThe Neimoidian wore purple and blue robes.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Neimoidian",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Kellux_system",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Trade_Federation",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Darth_Sidious",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Sith_apprentice",
  "/wiki/Maul",
  "/wiki/Orb-wing",
  "/wiki/Hangar",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Padawan",
  "/wiki/Xev_Xrexus",
  "/wiki/Darth",
  "/wiki/Color",
  "/wiki/Robe",
  "/wiki/Darth_Maul_(2017)_1"
 ]
}