{
 "name": "Unidentified_male_Devaronian_minister",
 "display_name": "Unidentified male Devaronian minister",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "A male Devaronian served as a minister of the planet Devaron during the Clone Wars. He and a fellow minister met with Jedi Master Bolla Ropal to establish a Republic outpost on Devaron. Although the ministers did not want the war to come to Devaron, they allowed the base to be built. He was later present when the base came under attack from Confederate forces under the command of Duros bounty hunter Cad Bane.\nA male Devaronian dignitary was a minister of the planet Devaron. During the Clone Wars, he and another minister of Devaron met with Jedi Master Bolla Ropal, who wished to establish a Republic outpost on the planet. The ministers did not wish for the war to spread to Devaron, but after Ropal reassured them that the outpost would be used more for future production rather than waging war, they allowed the Jedi to establish the base.\nNevertheless, Duros bounty hunter Cad Bane, who had recently stolen a holocron from the Jedi Temple, led Confederate forces to Devaron to capture Ropal in hopes the Jedi could access the holocron. The Devaronian minister was present when the Confederate forces attacked Devaron shortly after the ministers' meeting with Ropal, catching the Republic forces off-guard and taking the Jedi captive.\nThe Devaronian minister had no wish for his planet to get involved in the Clone Wars, but when Ropal revealed that the proposed Republic base was to be used more for production rather than military matters, he and his fellow minister agreed to allow the base to be built. He had red skin.\nThis Devaronian's first and only appearance is in a comic of Season Two of The Clone Wars web comic series, The Clone Wars: Act on Instinct, in which he received a minor, non-speaking role.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Devaron/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Unidentified_female_Devaronian_minister",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bolla_Ropal/Legends",
  "/wiki/Temple_of_Eedit/Legends",
  "/wiki/Battle_of_Devaron/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cad_Bane/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mission_to_the_Jedi_Temple",
  "/wiki/Holocron/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/The_Clone_Wars:_Act_on_Instinct"
 ]
}