{
 "name": "Unidentified_pilot_(Lord_Junn)",
 "display_name": "Unidentified pilot  (Lord Junn)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  }
 ],
 "content": "This individual was a human who was a pilot of the Lord Junn. They assisted Princess Leia Organa's mission to rescue Alderaanians in the galaxy by flying members of the Melodic Order.\nThis pilot lived during the Imperial Era including the destruction of Alderaan and Battle of Yavin. After Princess Leia Organa and the Alderaanian starfighter pilot rescued the Melodic Order from traffickers on Naboo, the pilot was assigned to fly the Lord Junn's eponymous luxury yacht. With Uwa Pareece serving as co-pilot, he flew the Lord Junn to the Sullust system in the Outer Rim Territories.\nWhile Organa, Verlaine, and R2-D2 went to meet with the Alderaan Enclave on Sullust, the pilot and Pareece waited aboard the cockpit of the Lord Junn for Organa. When Organa told them to leave orbit and jump into hyperspace, Pareece refused to abandon Organa while the pilot reported that sensors were picking up an Imperial Sentinel-class landing craft. An Imperial platoon attacked the Alderaan Enclave but were defeated by a pack of rockrenders unleashed by R2 and Verlaine. This enabled the Alderaanians on Sullust to evacuate offworld aboard the Lord Junn and Mellcrawler.\nLater, the pilot and their co-pilot brought Organa's caravan to the planet Espirion where they discovered that an armada of Alderaanian refugee ships had converged on the planet, hearing of Organa's mission to unite the Alderaanian diaspora. An Imperial Star Destroyer later attacked the Alderaanian refugee fleet but was destroyed by the Alder-Espirion warship Espirion Multi.\nThe pilot of the Lord Junn was a bald human who wore a yellow visor covering their eyes. They were loyal to Organa referring to her as her highness. They were skilled enough to fly a luxury ship like the Lord Junn. They also knew how to operate the ship's sensors.\nThe pilot of the Lord Junn first appeared in the second issue of the 2015 Marvel Comics series Star Wars: Princess Leia. They were created by Mark Waid, drawn by Terry Dodson, inked by Rachel Dodson, and colored by Jordie Bellaire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Pilot",
  "/wiki/Lord_Junn",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mission_to_rescue_the_survivors_of_Alderaan",
  "/wiki/Alderaanian",
  "/wiki/The_galaxy",
  "/wiki/Melodic_Order",
  "/wiki/Imperial_Era",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Battle_of_Yavin",
  "/wiki/Starfighter",
  "/wiki/Naboo",
  "/wiki/Lord",
  "/wiki/Junn",
  "/wiki/Uwa_Pareece",
  "/wiki/Sullust_system",
  "/wiki/Outer_Rim_Territories",
  "/wiki/R2-D2",
  "/wiki/Alderaan_Enclave",
  "/wiki/Sullust",
  "/wiki/Cockpit",
  "/wiki/Orbit",
  "/wiki/Hyperspace",
  "/wiki/Sensor",
  "/wiki/Galactic_Empire",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Platoon",
  "/wiki/Rockrender",
  "/wiki/Mellcrawler",
  "/wiki/Espirion",
  "/wiki/Alderaan_Flotilla",
  "/wiki/Refugee",
  "/wiki/Starship",
  "/wiki/Dreed%27s_Star_Destroyer",
  "/wiki/Fleet",
  "/wiki/Alder-Espirion",
  "/wiki/Warship",
  "/wiki/Espirion_Multi",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/Gender",
  "/wiki/Princess_Leia_2",
  "/wiki/2015",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_Princess_Leia",
  "/wiki/Mark_Waid",
  "/wiki/Terry_Dodson",
  "/wiki/Rachel_Dodson",
  "/wiki/Jordie_Bellaire",
  "/wiki/Princess_Leia_3",
  "/wiki/Princess_Leia_4",
  "/wiki/Princess_Leia_5"
 ]
}