{
 "name": "Unidentified_Clan_Rook_warrior",
 "display_name": "Unidentified Clan Rook warrior",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "House Kast",
      "Clan Rook",
      "Clan Rook"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Mandalorian resistance",
      "Mandalorian resistance"
     ]
    }
   ]
  }
 ],
 "content": "A human female Mandalorian was a lead warrior of Clan Rook. She pledged her clan to the Mandalorian resistance led by Lady Bo-Katan Kryze during the Mandalorian Civil War. The warrior was equipped with gray Mandalorian armor with yellow and purple highlights and two blaster pistols.\nThe Mandalorian woman was a member of Clan Rook and served as a lead warrior for the Mandalorian clan. In 2 BBY, the Mandalorian Civil War broke out between the Mandalorians with Clan Wren rising up against the Galactic Empire–aligned Clan Saxon and Imperial Super Commandos. About a year later, Sabine Wren led the successful Mission to Mandalore, with the help of Clan Kryze, to rescue her father from Clan Saxon custody. The mission saw the destruction of Imperial superweapon \"the Duchess\" and the death of Governor Tiber Saxon. In response, the lead Clan Rook warrior pledged her own clan to Lady Bo-Katan Kryze and the Mandalorian resistance against the Galactic Empire along with several other Mandalorian factions.\nThe Mandalorian warrior was a human female who had brown eyes and dark skin. She spoke in a serious and confident manner, having committed her clan against the Galactic Empire. When Sabine Wren gave Bo-Katan Kryze the Darksaber, a symbolic weapon important in Mandalorian history, the lead warrior of Clan Rook gave a hopeful smile as she looked on.\nThe Clan Rook warrior carried two Mandalorian blaster pistols and a jetpack. Additionally, she wore a set of Mandalorian vambraces, a device designed to combat the skills of a Jedi.\nAs a warrior of Clan Rook, she wore a set of Mandalorian armor featuring the symbol of her clan in purple. This type of armor was made of beskar, a steel alloy commonly used by all Mandalorian clans. Her particular armor was grey with yellow and purple highlights, which was typical for members of her clan.\nFirst being shown in the second trailer for Season 4 of Rebels, Clan Rook and the warrior subsequently appeared in the premiere of the fourth season of Star Wars Rebels, titled Star Wars Rebels: Heroes of Mandalore, which aired in 2017. She appears alongside several other members of her clan in the final scene of the episode.\nAccording to Amy Beth Christenson, every designer had to draft several Mandalorian armor variations for the scene while ensuring each individual Mandalorian looked similar to their fellow clan members. The concept art for the lead Clan Rook warrior was drafted by Luke Harrington on May 3, 2016. Originally, the character had blue eyes instead of brown.\nShe is voiced by Bonnie Wild and credited as \"Lead Rook Warrior.\" Wild was a frequent sound editor and re-recording mixer for the series while working at Skywalker Sound.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/House_Kast",
  "/wiki/Clan_Rook",
  "/wiki/Mandalorian",
  "/wiki/Mandalorian_resistance",
  "/wiki/File:LeadRookWarrior.ogg",
  "/wiki/Mandalorian_clan",
  "/wiki/Lord",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Mandalorian_Civil_War_(Imperial_Era)",
  "/wiki/Mandalorian_armor",
  "/wiki/Blaster_pistol",
  "/wiki/Soldier",
  "/wiki/2_BBY",
  "/wiki/Clan_Wren",
  "/wiki/Skirmish_on_Krownest",
  "/wiki/Galactic_Empire",
  "/wiki/Clan_Saxon",
  "/wiki/Imperial_Super_Commando",
  "/wiki/Sabine_Wren",
  "/wiki/Mission_to_Mandalore",
  "/wiki/Clan_Kryze",
  "/wiki/Alrich_Wren",
  "/wiki/Superweapon",
  "/wiki/Arc_Pulse_Generator",
  "/wiki/Death",
  "/wiki/Governor",
  "/wiki/Tiber_Saxon",
  "/wiki/Eye",
  "/wiki/Darksaber",
  "/wiki/Jetpack",
  "/wiki/Clothing",
  "/wiki/Mandalorian_vambrace",
  "/wiki/Jedi",
  "/wiki/Armor",
  "/wiki/Beskar",
  "/wiki/Steel",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore",
  "/wiki/2017",
  "/wiki/Amy_Beth_Christenson",
  "/wiki/Luke_Harrington",
  "/wiki/May_3",
  "/wiki/2016",
  "/wiki/Bonnie_Wild",
  "/wiki/Skywalker_Sound",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Rebels:_Steps_Into_Shadow",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Mon_Mothma",
  "/wiki/Declaration_of_the_Rebel_Alliance",
  "/wiki/Battle_of_Yavin",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Legacy_of_Mandalore",
  "/wiki/The_Lawless",
  "/wiki/1_BBY",
  "/wiki/Databank_(website)",
  "/wiki/The_Mandalorian",
  "/wiki/Chapter_3:_The_Sin",
  "/wiki/The_Protector_of_Concord_Dawn"
 ]
}