{
 "name": "Unidentified_Kajain%27sa%27Nikto",
 "display_name": "Unidentified Kajain'sa'Nikto",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kajain'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light brown"
     ]
    }
   ]
  }
 ],
 "content": "A male Kajain'sa'Nikto bounty hunter fought against Din Djarin in an attempt to capture Grogu, on the desert planet of Tatooine. He was accompanied by three other hunters; Biran Redben, a helmeted humanoid male and a small alien of the same species as Scrapjaw Motito. They were unsuccessful in their attempt, and the male Nikto was knocked out by the Mandalorian.\nAround 9 ABY, this Nikto bounty hunter, alongside another helmeted hunter, placed a spring-loaded trap in a valley on Tatooine, in an attempt to capture Grogu from Din Djarin. As the Mandalorian approached the trap, both hunters pulled on the concealed rope, close-lining Din and Grogu off of their Zephyr-J speeder bike. The Mandalorian managed to survive the crash, using his jetpack to stabilize himself. Failing to incapacitate their target, the Nikto bounty hunter followed his helmeted accomplice, and opened fire on Din Djarin. Soon after, Biran Redben came running out from the back of a nearby boulder; engaging Din Djarin in melee combat, and disarming him of his blaster pistol. Attempting to aid their moustached comrade, who had just been sliced in the neck with a vibro-knife, the Nikto and his helmeted associate engaged the Mandalorian in hand-to-hand combat. This fight wouldn't last long; however, as Din Djarin used his whipcord thrower to grab the blaster rifle off of the Nikto's short alien accomplice, who was trying to blast the Mandalorian, and used it to knock him unconscious.\nThe male bounty hunter was a member of the Kajain'sa'Nikto, a subspecies of the sentient humanoid Nikto species. He had beige, leathery skin and brown eyes. The bounty hunter also had stubby, bone-like horns around his head and chin. Shortly before his skirmish with the Mandalorian bounty hunter Din Djarin, the Nikto showed some craftsmanship, as he was able to set up a make-shift trap by hand. He was also competent with a blaster rifle, as he didn't miss a single shot during his fight with the Mandalorian.\nDuring his skirmish with the Mandalorian bounty hunter Din Djarin, the Kajain'sa'Nikto wore a maroon jumpsuit; similar in appearance to a flight suit, with netting around his neck. He was also equipped with a white utility-belt, and utilized a scoped blaster rifle which fired red blaster bolts.\nThe male Kajain'sa'Nikto bounty hunter was created for, and first appeared in, \"Chapter 10: The Passenger,\" the second episode of the second season of The Mandalorian, which was released on November 6, 2020. While it is not directly stated in the episode that the Nikto is a bounty hunter, the audio description identifies him, and his friends, as hunters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Hunt_for_Grogu",
  "/wiki/Grogu",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Biran_Redben",
  "/wiki/Helmet",
  "/wiki/Unidentified_Kajain%27sa%27Nikto%27s_ally_2",
  "/wiki/Unidentified_Kajain%27sa%27Nikto%27s_ally_1",
  "/wiki/Species",
  "/wiki/Scrapjaw_Motito",
  "/wiki/Nikto",
  "/wiki/Mandalorian",
  "/wiki/9_ABY",
  "/wiki/Bounty",
  "/wiki/Hunter",
  "/wiki/Zephyr-J",
  "/wiki/Speeder_bike",
  "/wiki/Jetpack",
  "/wiki/The_Mandalorian%27s_IB-94_blaster_pistol",
  "/wiki/Vibro-knife",
  "/wiki/Whipcord_thrower",
  "/wiki/Blaster_rifle",
  "/wiki/Alien",
  "/wiki/Subspecies",
  "/wiki/Sentience",
  "/wiki/Humanoid",
  "/wiki/Leather",
  "/wiki/Eye",
  "/wiki/Bone",
  "/wiki/Flight_suit",
  "/wiki/Scope",
  "/wiki/Blaster",
  "/wiki/Rifle",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/The_Mandalorian",
  "/wiki/November_6",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Mandalorian_Mayhem",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Databank_(website)",
  "/wiki/Disney%2B",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Chapter_14:_The_Tragedy"
 ]
}