{
 "name": "Unidentified_clone_trooper_commander_(187th_Legion)",
 "display_name": "Unidentified clone trooper commander  (187th Legion)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "187th Legion",
      "187th Legion"
     ]
    }
   ]
  }
 ],
 "content": "This clone trooper commander was the commanding officer of High Jedi General Mace Windu's 187th Legion of clone troopers.\nA clone of the Mandalorian bounty hunter Jango Fett, the 187th Legion's commander was trained from birth to become the commander of a clone unit and to utilize clone airborne armor. He was assigned to the 187th Legion as their clone commander, and was specifically trained to be able to support his Jedi General in combat.\nAt the onset of the Clone Wars, immediately after the Battle of Muunilinst, the Confederacy of Independent Systems began using the planet of Dantooine as a staging ground against the Republic. Learning of this Separatist presence, Master of the Order Mace Windu dispatched an army of clone troopers to take back the planet. During the battle, the clone commander commanded the 187th Legion, and secured an important victory for the clone army, which allowed the Republic to take control of the planet.\nDuring the final stages of the war, the Confederacy of Independent Systems launched a full scale invasion on the Republic's capital. During this battle, the droid army began an assault on the Jedi Temple. The 187th Legion, alongside their Jedi General, fought to protect the temple. During the raid, the clone commander utilized a series of hand signals to efficiently control and direct his legion of clone troopers.\nAs a clone of Jango Fett, the 187th Legion's clone commander was a human male who stood at a height of 1.83 meters. He had short black hair, tan skin, and brown eyes. Being a member of the 187th Legion, the commander was considered to be a superior warrior, and was specifically trained to be able to assist High Jedi General Mace Windu in combat. During the Battle of Coruscant, the clone commander showed exceptional leading skills, as he was able to command his entire unit with a simple series of hand signals.\nThe 187th's clone commander wore standard phase II clone paratrooper armor, equipped with a beige kama. His armor was adorned with light blue and purple markings, and he wore a bandoleer over his chest plate which he used to carry a modified DC-17 hand blaster that fired red blaster bolts. During battle, he also utilized a DC-15A blaster rifle.\nThis clone commander was created for the 2006 Target exclusive \"Mace Windu's Attack battalion\" battle pack, where he appeared alongside Mace Windu and three other members of the battalion. In 2007, Star Wars Unleashed released a miniature pack of the 187th Legion, that featured the commander and three of his troopers. Finally, in 2010, Gentle Giant Studios released a mini-bust of the commander.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Clone_Commander_(187th_Legion)",
  "/wiki/Unidentified_clone_trooper_commander_(187th_Legion)",
  "/wiki/Canon",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Black",
  "/wiki/Brown",
  "/wiki/Tan",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/187th_Legion/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/High_Jedi_General/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Clone_trooper_armor/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Muunilinst/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Droid_Army",
  "/wiki/Jedi_Temple",
  "/wiki/Legion/Legends",
  "/wiki/Gender",
  "/wiki/Phase_II_clone_trooper_armor/Legends",
  "/wiki/Kama/Legends",
  "/wiki/DC-17_hand_blaster/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/DC-15A_blaster_rifle/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/2006",
  "/wiki/Battalion/Legends",
  "/wiki/2007",
  "/wiki/Star_Wars_Unleashed",
  "/wiki/2010",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/StarWars.com",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Saga_Collection",
  "/wiki/Databank_(original)"
 ]
}