{
 "name": "Unidentified_bartender_(Pagodon)",
 "display_name": "Unidentified bartender  (Pagodon)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tanned"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Boatman's Reach"
     ]
    }
   ]
  }
 ],
 "content": "A human male bartender worked in a public house on the ice planet Pagodon. In around 9 ABY, three trawlers began harassing a Mythrol in the bar, which the bartender watched but did nothing to prevent. A Mandalorian bounty hunter named Din Djarin then entered the bar, drawing the attention of the alpha trawler. After the trawler claimed that Djarin had spilled his drink, the bartender offered a new drink free of charge, but Djarin smashed the drink into one of the trawlers heads and quickly defeated the trio. The bounty hunter then revealed that the he was there to collect a bounty on the Mythrol, whom surrendered to him.\nA human male worked as a bartender in the public house at the settlement Ferryman's Reach on the ice planet Pagodon shortly after the fall of the Galactic Empire. In around 9 ABY, three trawlers led by a human began harassing a Mythrol in the bar while the bartender was working. The bartender and other patrons watched and did nothing as the trio threatened to cut off the Mythrol's gills and sell them at nearby port. Just as the lead trawler produced a knife and held it up to the Mythrol's face to begin cutting, a Mandalorian bounty hunter named Din Djarin entered the bar.\nDistracted by the new arrival, the lead trawler knocked his drink over, which he blamed Djarin for. Djarin in turn ignored him, making his way to the bartender. The trawler then abandoned the Mythrol and approached Djarin, again blaming the bounty hunter for spilling his drink. As the trawler was not speaking Galactic Basic Standard, the bartender translated for Djarin and then offered to replace the trawler's drink for free.\nAs the bartender poured the drink, the two other trawlers also approached the bar to surround Din Djarin. The bartender then tried to slide the drink down the bar to the lead trawler, but Djarin caught it mid slide and threw the contents into the face of a Quarren trawler before smashing the mug over the head of a second human trawler.\nAs the bartender watched in horror, the bounty hunter smashed the Quarren's head into the bar and drove the lead trawler's knife into his own back. When the Quarren attempted to flee the bounty hunter then killed it by slicing the trawler in half by closing the bar's telescoping door on it. Din Djarin then approached the Mythrol and revealed he was in the bar to collect a bounty on him. The Mythrol then surrendered and left the bar with Din Djarin.\nThe bartender made no attempt to stop the trawlers from terrorizing the Mythrol in his bar, but once Din Djarin entered he tried to stop a fight from breaking out between the bounty hunter and the trawlers. The bartender had white hair, tanned skin, and brown eyes.\nThe bartender wore a brown shirt under a brown overcoat.\nThe bartender appeared in Chapter 1 of the 2019 Disney+ television series The Mandalorian, which aired on November 12, 2019. He is portrayed by John Beasley.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_bartender",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Boatman%27s_Reach",
  "/wiki/File:Bartender-Fine.ogg",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Pagodon",
  "/wiki/9_ABY",
  "/wiki/The_Mythrol",
  "/wiki/Din_Djarin",
  "/wiki/Bounty_hunter",
  "/wiki/Unidentified_alpha_trawler",
  "/wiki/Mandalorian",
  "/wiki/Bounty",
  "/wiki/Mythrol",
  "/wiki/File:Bartender-Spilled.ogg",
  "/wiki/Bartender",
  "/wiki/Ferryman%27s_Reach",
  "/wiki/Galactic_Empire",
  "/wiki/Spaceport",
  "/wiki/Knife",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Quarren",
  "/wiki/Unidentified_Quarren_trawler",
  "/wiki/Unidentified_beta_trawler",
  "/wiki/Death",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/November_12",
  "/wiki/John_Beasley",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_(manga)",
  "/wiki/The_Mandalorian_1",
  "/wiki/Category:Audio_files_of_unidentified_bartender",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Score",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/StarWars.com",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}