{
 "name": "Unidentified_Jedi_Knight_(Dark_Holocron)",
 "display_name": "Unidentified Jedi Knight  (Dark Holocron)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Human male Jedi"
     ]
    }
   ]
  }
 ],
 "content": "A Human male served as a Jedi Knight at some point by 5000 BBY. Believing that learning the use of the dark side of the Force could help eradicate it, the Knight eventually had an argument with his former master, another Jedi. The Knight, succumbing to anger due to the corrupting influence of the dark side, ultimately slew his teacher, an act which came to be recorded in the Sith Empire's Dark Holocron.\nA Knight served the Jedi Order at some point by 5000 BBY. He was originally apprenticed to another Human male Jedi. At one point, the Jedi Knight came to believe that the dark side of the Force—the opposite of the light side wielded by the Jedi Order—could be eradicated by first learning to use it, which he then decided to do. The Jedi Knight's choices eventually led him to an argument with his Jedi teacher. During the confrontation, the Knight became agitated and, having by that point become corrupted by the dark side, he let his own anger control his actions. Drawing his lightsaber, the Knight ultimately cut down his former master.\nAn account of the Jedi Knight's fall to the dark side and his confrontation with his teacher, accompanied by imagery depicting the event, was recorded in the Dark Holocron of the Sith Empire. The holocron was recovered by Jedi Knight Odan-Urr in 5000 BBY, and it remained in Jedi possession for a thousand years. In 3997 BBY, when Jedi Knight Ulic Qel-Droma prepared to infiltrate the Krath cult of darksiders in order to defeat them, the long-lived Odan-Urr showed Qel-Droma the Dark Holocron's recording concerning the fallen Jedi Knight in an attempt to persuade Qel-Droma into abandoning his plan. Although Qel-Droma was stunned by the images of the Knight killing his master, he failed to see how the story related to him and continued with his intentions.\nThe Jedi Knight was a bald Human male. He was overconfident in his ability to withstand the corrupting influence of the dark side of the Force, which ultimately led to him succumbing to anger and killing his Jedi teacher.\nThe Jedi Knight wore a cape and an armored skirt as well as a pair of pants, boots, and gauntlets. He wielded an ornate lightsaber.\nThe Jedi Knight appeared in the fourth issue of Dark Horse Comics' Star Wars: Tales of the Jedi - Dark Lords of the Sith comic book mini-series. The issue was authored by Tom Veitch and Kevin J. Anderson, illustrated by Chris Gossett, and published on January 10, 1995.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Unidentified_Human_male_Jedi_Master_(Sith_holocron)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/5000_BBY/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Teacher/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Dark_Holocron",
  "/wiki/Padawan/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Odan-Urr/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Jedi/Legends",
  "/wiki/Millennium/Legends",
  "/wiki/3997_BBY",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Krath/Legends",
  "/wiki/Darksider",
  "/wiki/Cape/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Gauntlet/Legends",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_4",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_-_Dark_Lords_of_the_Sith",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tom_Veitch",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Chris_Gossett",
  "/wiki/January_10",
  "/wiki/1995",
  "/wiki/Category:Images_of_the_unidentified_Jedi_Knight_(Dark_Holocron)",
  "/wiki/Sith/Legends",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Fall_of_the_Sith_Empire_5",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Marvel_Comics"
 ]
}