{
 "name": "Unidentified_medic",
 "display_name": "Unidentified medic",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "A Human female medic worked alongside members of the New Republic in the medical wing of the former Imperial Palace on the galactic capital planet Coruscant in the year 9 ABY. She assisted former Emperor's Hand Mara Jade after the latter had awoken from a state of unconsciousness inflicted by a battle that had recently taken place. The medic made sure that Jade was feeling all right and that the latter's room in the palace was prepared for her.\nIn the year 9 ABY, a light-skinned Human female worked as a medic in the medical wing of the old Imperial Palace on the galactic capital planet Coruscant. Working alongside other members of the New Republic, the medic assisted former Emperor's Hand Mara Jade after the latter had awoken from an unconscious state caused by a recent battle. Assisted by an Emdee droid, the medic examined Jade's bandaged forehead with a medical scanning device since Jade had just awoken from neural reconstruction. As Jade was suffering from short-term memory loss, the medic assisted her by briefly telling the former Emperor's Hand what had happened during her stay in the hospital. The medic noted that Jade had been in a bacta tank and then had lain in a bed for just short of a month. After the medic informed Jade of what had happened, the former used a comlink to make certain that Jade's quarters in the palace were prepared for her. Shortly thereafter, Jade was taken to her room by Winter, a personal friend of New Republic official Leia Organa Solo.\nAt the time of Jade's visit to the hospital, the female medic was a middle-aged woman with fair skin who was professional in her work. She was willing to be thorough in her job such that she took good care of Jade, making sure that the latter's room was prepared for her, for example. At the time that she tended to Jade, the medic wore a green-and-white duty medic's tunic with a matching green-and-white hat and carried a comlink.\nThis medic first appeared in the 1993 novel The Last Command, written by Timothy Zahn. She later appeared in The Last Command 1, the first part of the 1997 comic book adaptation of The Last Command. The Last Command 1 was written by Mike Baron and released by Dark Horse Comics.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/The_Last_Command",
  "/wiki/Imperial_Palace_medical_wing",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/9_ABY/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Battle_for_the_Katana_fleet",
  "/wiki/Medic/Legends",
  "/wiki/Unidentified_2-1B_surgical_droid_(Imperial_Palace)",
  "/wiki/Bioscan/Legends",
  "/wiki/Brain/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Bacta_tank/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Winter_Celchu",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Color/Legends",
  "/wiki/Hat/Legends",
  "/wiki/1993",
  "/wiki/Timothy_Zahn",
  "/wiki/The_Last_Command_1",
  "/wiki/1997",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Mike_Baron",
  "/wiki/Dark_Horse_Comics",
  "/wiki/The_Last_Command_(unabridged_audiobook)"
 ]
}