{
 "name": "Unidentified_Tusken_Raider_youngling",
 "display_name": "Unidentified Tusken Raider youngling",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between c. 5 ABY and c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tusken Raider"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "A Tusken Raider tribe"
     ]
    }
   ]
  }
 ],
 "content": "A Tusken Raider male youngling was part of a tribe of Tuskens that was active in the Dune Sea on the planet Tatooine. The child watched over the fallen bounty hunter Boba Fett as he was held prisoner by the tribe, beating the man upon their first meeting. When Fett attempted to escape the tribe's camp, the young Tusken tried to stop him to no avail, and the older Tuskens recaptured the prisoner instead.\nLater, the Tusken youngling took Fett and a Rodian prisoner on a trip into the dunes with his pet massiff, where they observed the Kintan Striders Gang attacking a moisture farm. The child then forced his two prisoners to dig for black melons. However, a sand beast attacked the group and killed the Rodian. Attempting to fight the creature, the youngling found himself fleeing from his adversary before Fett was able to kill the beast himself. Fett was subsequently accepted into the tribe, and went on to teach the Tuskens various skills to fight against the intruding Pyke Syndicate.\nSometime after, the youngling alerted the tribe to Fett's return following the man's vision quest and watched his exchange with the Tusken chieftain and a Tusken warrior. The child was soon made to guide Fett to a nearby Tusken workshop where the former bounty hunter crafted his own gaderffii stick. However, while Fett later visited the boss of the Pyke Syndicate's Tatooine assets, the syndicate massacred the Tusken tribe. Upon discovering that the tribe had been destroyed, Fett cremated the bodies of the Tuskens and burned the child's small stick.\nThe Tusken Raider male child lived as part of a Tusken Raider tribe in the Dune Sea on the desert planet Tatooine. Around 4 ABY, after the famed bounty hunter Boba Fett was captured by Tuskens after his defeat at the Great Pit of Carkoon, the child, along with several other Tusken children, inspected the bound Fett before beating the prisoner with sticks. That night, the tied-up Fett was left by a fireplace, guarded by the youngling's pet massiff. When Fett freed himself from his bonds, a Rodian prisoner tied up beside Fett alerted the tribe, and the child ran at the escaped captive with his stick. Fett knocked down the Tusken child and took his stick, refraining from beating the startled Tusken before running from the camp as other Tuskens arrived. The Tusken Raiders were able to quickly recapture Fett.\nThe next morning, the child woke up Fett, untying him and the Rodian. He led the prisoners and the massiff across the dunes of Tatooine, tugging Fett as he stumbled to the ground due to how weak he had become. The group reached a moisture farm, finding it under raid from a group of Nikto speed bikers, the Kintan Striders Gang. The child therefore turned his group around and led them to a separate location to dig for black melons.\nOnce at the location, the Tusken youngling ordered Fett and the Rodian prisoner to dig for the melons. The Rodian complied immediately, although Fett had trouble understanding the Tusken's orders. After realizing what the child wanted, Fett proceeded to dig under the watchful eyes of the Tusken and the massiff. When Fett attempted to drink from one of the melons, the young Tusken lashed his stick at the man, who caught it and insisted he needed to drink. Taking the black melon from his prisoner, the youngling proceeded to dump the melon's milk out for his massiff. Later, as the child slept next to the massiff, he was awoken when the group was attacked by a sand beast that the Rodian prisoner had unburied. The Tusken stared in shock while the sand beast targeted the Rodian before launching the massiff over the youngling's head after the smaller creature attacked it.\nAs the sand beast killed the Rodian and held up Fett, the Tusken child attempted to fight the creature by stabbing it in the foot with his stick but was struck by the creature and thrown back. The sand beast was thus fixated on the youngling, who fled as the creature made chase. However, Fett pursued the beast and used his chains to strangle the creature to death. Seeing the creature dead, the youngling shouted in excitement. The Tusken child, Fett, and the massiff returned to the camp with the youngling carrying the severed head of the creature that had attacked them as a trophy, excitedly shouting. He took the trophy to the older Tuskens, who gathered around him as the child acted out the fight. The adult Tuskens congratulated the child with cheers and congratulatory pats.\nFett was accepted by the tribe and started living among them. Meanwhile, the Tuskens came into conflict with a repulsor train operated by the Pyke Syndicate by around 5 ABY, which fired on the tribe while it traveled through the Dune Sea. Fett constructed a plan to stop the train, which involved him teaching the members of the tribe various skills such as how to ride speeder bikes, and teaching the child to use a mirror to reflect the sunlight from Tatooine's two suns, as a signal to the rest of the tribe when the train was approaching.\nThe tribe later went to dig for more black melons in the dunes when the Pyke repulsor train returned. Alerted to the train's approach, the child began running towards his designated position atop one of the larger dunes. Running across the dunes, he used his mirror to signal more Tuskens who had been positioned further along the train's route to take the Pykes by surprise. Fett and a band of Tuskens were able to stop the repulsor train and send its Pyke personnel back to their superiors with a warning.\nLater on, the Tusken chieftain sent Fett on a vision quest, leading him to a wortwood tree. The next day, the youngling was sitting with his massiff, cracking the contents of some nuts into a bucket when the massiff alerted him to a new arrival. The youngling realized that it was Fett, carrying a large branch taken from the wortwood tree. He alerted the rest of the tribe to Fett's arrival before rushing to Fett himself and jumping excitedly. The youngling stayed and watched Fett exchange with the chieftain of the tribe and a Tusken warrior before being led into one of the tribe's tents. When Fett came back out, the youngling, being gestured over by the chieftain, led the man across the dunes to a workshop, where a Tusken craftsman helped Fett make a gaderffii stick from the wortwood branch.\nSometime after, Fett left the camp on a bantha to negotiate protection fees with the Pyke Syndicate's boss on Tatooine. The Tusken youngling watched Fett leave the camp for the Pyke's headquarters at the Mos Eisley spaceport, the man nodding at the child as he left. However, while Fett was away, the Pyke boss sent his forces to destroy the Tusken tribe. The Pykes massacred the Tuskens, including the youngling, and left behind the emblem of the Kintan Striders to frame them. After Fett returned, he cremated and mourned the fallen Tuskens and burned the youngling's small stick in a fire. Fett later enacted his revenge on the Kintan Striders around 9 ABY, believing them to be behind the massacre, but eventually came to learn that it was, in fact, the Pykes who were responsible. Fett ultimately fought and defeated the syndicate in a battle which forced the Pykes to abandon Tatooine altogether.\nThe youngling was at times sadistic, beating Fett when he was a defenseless prisoner as well as favoring pouring the contents of a black melon to his massiff and the ground instead of letting Fett quench his thirst. When Fett drank water from a black melon, the youngling became aggressive and attempted to beat the human with his stick. When the sand beast attacked the child and his prisoners, the child was shocked by the creature and froze, but went on to attack the beast when it lashed at the youngling's massiff. However, after Fett defeated the Tatooine sand beast and the child returned with its head, he retold the story to the other Tuskens triumphantly. After Fett had been accepted by the tribe, the child became excited whenever he returned to the camp, in one instance jumping with excitement when Fett returned from his vision quest. The Tusken youngling spoke in Tusken.\nThe youngling wore dark brown robes that covered his torso and a tan headwrap that covered his face. He also wore tan gloves, dark brown pants, and a tube-like accessory around his neck. On his chest, he wore a red pouch and a dirty white towel. The youngling used a stick similar in nature to the larger gaderffii staffs used by the adult Tuskens. During the attack on the Pyke Syndicate's repulsortrain, he utilized a small mirror to make signals to other Tuskens by reflecting sunlight.\nThe Tusken Raider child first appeared in the flashbacks of \"Chapter 1: Stranger in a Strange Land,\" the premiere episode of the Disney+ series The Book of Boba Fett, which was released on December 29, 2021 and directed by Robert Rodriguez. The child was portrayed by Wesley Kimmel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Tusken_Raider",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Wookieepedia:Featured_article_nominations/Unidentified_Tusken_Raider_youngling",
  "/wiki/5_ABY",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Tusken_Raider",
  "/wiki/Gender",
  "/wiki/Unidentified_Tusken_Raider_tribe",
  "/wiki/File:FettWater.ogg",
  "/wiki/Dune_Sea",
  "/wiki/Planet",
  "/wiki/Youngling",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Prisoner",
  "/wiki/Unidentified_Rodian_prisoner",
  "/wiki/Unidentified_massiff",
  "/wiki/Kintan_Striders_Gang",
  "/wiki/Unidentified_moisture_farm_(Tatooine)",
  "/wiki/Black_melon",
  "/wiki/Sand_beast",
  "/wiki/Death",
  "/wiki/Rodian",
  "/wiki/Skirmish_in_the_Dune_Sea",
  "/wiki/Pyke_Syndicate",
  "/wiki/Unidentified_Tusken_Raider_chieftain",
  "/wiki/Unidentified_Tusken_Raider_warrior_(Boba_Fett)",
  "/wiki/Gaderffii_stick",
  "/wiki/Unidentified_Pyke_boss",
  "/wiki/Massacre_of_a_Tusken_Raider_tribe",
  "/wiki/Cremation",
  "/wiki/File:FettDig.ogg",
  "/wiki/Desert",
  "/wiki/4_ABY",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Standard_day",
  "/wiki/Fire",
  "/wiki/Massiff",
  "/wiki/Nikto",
  "/wiki/Speeder_bike",
  "/wiki/Melon",
  "/wiki/Eye",
  "/wiki/Milk",
  "/wiki/Sleep",
  "/wiki/Tatooine_repulsor_train",
  "/wiki/Star",
  "/wiki/Raid_on_a_Pyke_repulsortrain",
  "/wiki/Wortwood_tree",
  "/wiki/Tree",
  "/wiki/Unidentified_Tusken_Raider_craftsman",
  "/wiki/Boba_Fett%27s_bantha",
  "/wiki/Desert_Survey_Office",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Attack_on_the_Kintan_Striders",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/Tusken",
  "/wiki/Color",
  "/wiki/Robe",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/Robert_Rodriguez",
  "/wiki/Wesley_Kimmel",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Sideshow_Collectibles",
  "/wiki/Art_Prints",
  "/wiki/Databank_(website)",
  "/wiki/Category:Audio_files_of_unidentified_Tusken_Raider_youngling",
  "/wiki/Category:Images_of_unidentified_Tusken_Raider_youngling",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld"
 ]
}