{
 "name": "Unidentified_stormtrooper_(Bogano)",
 "display_name": "Unidentified stormtrooper  (Bogano)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "A stormtrooper of the Galactic Empire was deployed to the planet Bogano between 0 ABY and 3 ABY during the Galactic Civil War. While attempting to smuggle native boglings off-world, the trooper was confronted by Rebel Alliance agents Leia Organa and Luke Skywalker. With a simple shove, the stormtrooper was able to subdue and disarm both opponents, but was unable to deliver a killing blow before a slumbering binog swatted the trooper across the Bogano landscape.\nA human soldier of the Galactic Empire, the stormtrooper served during the Galactic Civil War, a conflict between the Empire and the Alliance to Restore the Republic. Between 0 ABY and 3 ABY, the stormtrooper was deployed to the Outer Rim planet Bogano, where the Imperials encountered a native species known as boglings. Believing the creatures to have been previously undiscovered, the troopers began rounding the boglings up with the intent of selling them on the black market. Most of the soldiers were incapacitated, however, by rebels Leia Organa and Luke Skywalker, who had come to Bogano in the hope of establishing a base for the Alliance.\nThe last Imperial still standing, the stormtrooper approached the rebels from behind and knocked both of them to the ground, disarming them in the process. Taunting them from behind the scope of an E-11 medium blaster rifle, the trooper would have completed the Empire's objective had it not been for a nearby binog, a large amphi-mammalian native to the planet. The creature flicked the trooper with its massive tail, sending the screaming soldier flying off into the distance. With no more Imperial troubles, Organa and Skywalker determined that Bogano was not suitable for a rebel base and departed the planet, each carrying bogling stowaways in tow.\nThe stormtrooper believed that the Galactic Empire was incapable of failure and viewed those who opposed it with disdain. Nevertheless, the trooper conceded to opponents Organa and Skywalker that they were capable combatants during their skirmish on Bogano. A lack of situational awareness, however, led to the trooper's defeat.\nA soldier of the Imperial Military, the stormtrooper was able to ambush and disarm Luke Skywalker and Leia Organa with a single shove, defeating two Force-sensitive enemies, one armed with a lightsaber and the other a Defender sporting blaster pistol. Skywalker, in particular, was knocked unconscious by the push.\nThe soldier maintained standard issue stormtrooper armor, a white plastoid composite fitted over a black body glove. The trooper also wore a utility belt that carried a thermal detonator and was armed with an E-11 blaster rifle.\nThe stormtrooper appeared in \"The Princess and the Bog, A Twin Tale, Part 2,\" a comic story featured in the eighth issue of the Star Wars Adventures comic series. The story was written by Sam Maggs, illustrated by Liana Kangas, and published by IDW Publishing on August 18, 2021.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Planet",
  "/wiki/Bogano",
  "/wiki/0_ABY",
  "/wiki/3_ABY",
  "/wiki/Galactic_Civil_War",
  "/wiki/Homeworld",
  "/wiki/Bogling",
  "/wiki/Stormtrooper",
  "/wiki/Mission_to_Bogano_(Galactic_Civil_War)",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Luke_Skywalker",
  "/wiki/Death",
  "/wiki/Binog",
  "/wiki/Trooper",
  "/wiki/Soldier",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Species",
  "/wiki/Black_market",
  "/wiki/Scope",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Amphi-mammalian",
  "/wiki/Imperial_Military",
  "/wiki/Force-sensitive",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Satine%27s_Lament",
  "/wiki/Sleep",
  "/wiki/Stormtrooper_armor",
  "/wiki/Color",
  "/wiki/Plastoid",
  "/wiki/Body_glove",
  "/wiki/Utility_belt",
  "/wiki/Thermal_detonator",
  "/wiki/Blaster_rifle",
  "/wiki/The_Princess_and_the_Bog,_A_Twin_Tale,_Part_2",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_Adventures_(2020)_8",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Sam_Maggs",
  "/wiki/Liana_Kangas",
  "/wiki/IDW_Publishing",
  "/wiki/August_18",
  "/wiki/2021",
  "/wiki/Category:Images_of_Unidentified_stormtrooper_(Bogano)",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Battle_of_Yavin",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWars.com"
 ]
}