{
 "name": "Unidentified_Nightsister_(Shira)",
 "display_name": "Unidentified Nightsister  (Shira)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.70 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "55 kilograms"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Nightsisters"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Nightsisters"
     ]
    }
   ]
  }
 ],
 "content": "This individual was a Human female and a Nightsister from the planet Dathomir. Her name was unknown, and other people only referred to her as \"She\".\nThe Human female later known as \"She\" was born on planet Dathomir and was a member of the Nightsisters, a group of Force-sensitive women who wielded the dark side of the Force. About one hundred years before the Galactic Civil War, this witch somehow escaped a Jedi intervention on her homeworld. She managed to stow away in a starship that was stopping over on the planet. When the navigating crew finally noticed her presence on board, she was forced to use her powers on them. But the ship's captain briefly came back to his senses, and he programmed the navicomputer to hit the ground, hoping to bring the witch to her doom.\nThe Nightsister survived the crash on planet Shira, but she was unable to repair the starship and was condemned to stay on that jungle planet forever. In order to survive, she took advantage of her powers to subjugate the native K'aargs, a race of sentient reptiles. The lizard-like humanoids came to regard the witch as a deity whom they called the Goddess. When she was displeased with one of her new subjects' behavior, the Nightsister would turn them into a brainless servant ready to join the \"Chosen of the Goddess\". At some point during the Galactic Civil War, when archeologist Jonas Tylers landed on Shira to explore antique ruins, the Dathomiri witch finally saw a way out.\nAccording to human cultural standards, the stranded Nightsister had the looks of a \"beautiful young woman wearing a long black dress.\" Measuring 1.70 meters, she had a slender shape and angular features. Her skin was pale, and a long mane of black hair flowed down to her back.\nThis witch would generally fight with a weighted staff, and she was also trained for hand-to-hand combat and sword fighting. She was able to apply the dark side of the Force offensively, in the form of Force lightning. A strange and rare power, this witch could use metamorphosis and take the shape of other beings. It seems she also displayed talent with precognition, as she could sense incoming dangers or abnormal activities.\nThis unidentified Nightsister has only appeared in the French RPG magazine Casus Belli 109. In the original story, she was referred to as \"Elle\" , which is just a French pronoun meaning \"she\".\nThe story does not specify the time period in which it was set, but the presence of the Barabel pirate Vangar suggests it occurred during the Rebellion era.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Dathomir/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/Color/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Elle_(Casus_Belli)",
  "/wiki/Planet/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_intervention_on_Dathomir",
  "/wiki/Starship/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Shira_(planet)",
  "/wiki/K%27aarg",
  "/wiki/Sentience/Legends",
  "/wiki/Reptile/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Jonas_Tylers",
  "/wiki/Unarmed_combat",
  "/wiki/Sword/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Metamorphosis_(Force_power)",
  "/wiki/Precognition/Legends",
  "/wiki/Casus_Belli_109",
  "/wiki/Barabel/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Vangar",
  "/wiki/Rebellion_era",
  "/wiki/Casus_Belli",
  "/wiki/The_Courtship_of_Princess_Leia"
 ]
}