{
 "name": "Unidentified_Twi%27lek_male_server",
 "display_name": "Unidentified Twi'lek male server",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sanctuary"
     ]
    }
   ]
  }
 ],
 "content": "A Twi'lek male server worked for Madam Garsa Fwip at her cantina, the Sanctuary, on the planet Tatooine. Around 9 ABY, when the new crime lord Boba Fett and Master Assassin Fennec Shand visited the cantina, the Twi'lek server and a female colleague welcomed the pair and took their helmets to be cleaned. He was present at the Sanctuary when the Hutt twins visited the city of Mos Espa and later when the bounty hunter Krrsantan assaulted a group of Trandoshan gamblers. He perished within Garsa's Sanctuary when the Pyke Syndicate rigged a camtono to explode within the cantina.\nSometime around 9 ABY, a Twi'lek male server worked for the Twi'lek Madam Garsa Fwip's cantina, the Sanctuary, within the city of Mos Espa on the planet Tatooine. When the newly established crime lord Boba Fett and his partner, Master Assassin Fennec Shand, visited the cantina, the Twi'lek server and a Twi'lek female colleague welcomed the pair and offered to clean their helmets. While Shand initially refused, Fett accepted the offer and requested Shand's cleaned as well. The male took Shand's helmet while his female colleague took Fett's. When the crime lord and Fwip neared the end of their conversation, Fwip clapped to signal the servers to return with the helmets. After Fwip thanked Fett for his visit and departed, the male returned Shand's helmet to her and the female returned Fett's. As the servers left, Shand noticed that Fett's helmet had been filled with New Republic credits.\nDuring another visit from Fett and Shand, the server surveyed the cantina while the pair discussed an assassination attempt on Fett with Fwip. When drumming announced the arrival of the litter for previous crime lord Jabba Desilijic Tiure's Hutt cousins, twins brother and sister, the male server's attention was drawn to the cantina's entrance along with the Sanctuary's patrons. The Twi'lek was later present in the Sanctuary when the Wookiee bounty hunter Krrsantan assaulted a group of Trandoshan gamblers. The server witnessed Fwip attempt to calm the Wookiee down only for the hunter to rip an arm off one of the gamblers.\nOne night, as two Pyke Syndicate members entered the Sanctuary, the Twi'lek was present at the gambling table. When the Pykes took their seats, he approached the new patrons with his female colleague and offered to clean their helmets, but the two Twi'leks departed with the patrons' refusal. Upon returning to Fwip, his female colleague informed the Madam of the rejection, and the three Twi'leks then watched the Pykes leave the Sanctuary as a server droid informed them they forgot their camtono. The camtono exploded soon after, killing the server and others within the Sanctuary.\nThe Twi'lek male had green skin and brown eyes. He also had cone-shaped hearing organs, which were generally a characteristic of Twi'lek females. The server was obedient to Fwip, dutifully greeting visitors and offering helmet cleanings.\nThe Twi'lek server wore a black headwrap that covered the top of his head, his ears, and the base of his lekku. He had a necklace with two triangular plates resting against his chest. A brown band was on his left forearm, with bracelets around both wrists. He had brown pants with a white fabric wrapped around his waist and draped in front of his legs, which wore dark brown boots. A belt made of connecting circles was also on his waist.\nThe Twi'lek server appeared in the premiere of the television series The Book of Boba Fett, which aired on Disney+ on December 29, 2021. The Twi'lek was credited as a \"Twi'lek Server\" and was played by Marlon Aquino.\nAquino's audition for the Twi'lek was self-taped from home, and the audition was only communicated as a Disney project. He was informed after being accepted into the role that the project was Star Wars–related but not for which show. Rather than a script, Aquino was only given the Twi'lek's lines to prepare. When Aquino was finally made aware of the role he would be playing, he was initially unfamiliar with Twi'leks and researched the species online, which took him to Wookieepedia, the free-to-edit, unofficial online Star Wars encyclopedia.\nThe COVID-19 pandemic pushed the start of filming for Aquino's role back by about a month. The actor had to arrive at the set as early as six in the morning for makeup and prosthetics to be applied, which took around two and a half hours. It took around five people to apply the mask, prosthetics, costume, and multiple layers of paint. An oil was applied to Aquino's skin to help smooth out the paint and removal of the paint took an hour and a half. Aquino spent as many as ten hours on set a day. He described the lekku prosthetics as a load that took getting used to wearing, and the large size of Aquino's head increased the difficulty of taking the lekku prosthetics on and off. Aquino spoke on the Force Geeks Podcast about how he was surprised at the fan speculation of his character being trans based on his conal ears.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Twi%27lek",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/File:WaitForGarsa.ogg",
  "/wiki/Garsa_Fwip",
  "/wiki/Cantina",
  "/wiki/Planet",
  "/wiki/Crime_lord",
  "/wiki/Boba_Fett",
  "/wiki/Master_Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Unidentified_Twi%27lek_female_server",
  "/wiki/Helmet",
  "/wiki/Hutt",
  "/wiki/The_Twins_(Hutts)",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Bounty_hunter",
  "/wiki/Krrsantan",
  "/wiki/Trandoshan",
  "/wiki/Gambler",
  "/wiki/Death",
  "/wiki/Pyke_Syndicate",
  "/wiki/Camtono",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/File:HelmetCleaning.ogg",
  "/wiki/Time",
  "/wiki/New_Republic",
  "/wiki/Credit",
  "/wiki/Ambush_outside_of_the_Sanctuary",
  "/wiki/Drum",
  "/wiki/Litter",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Unidentified_Hutt_brother",
  "/wiki/Unidentified_Hutt_sister",
  "/wiki/Wookiee",
  "/wiki/Limb",
  "/wiki/Unidentified_Trandoshan_gambler",
  "/wiki/Standard_day",
  "/wiki/Gambling",
  "/wiki/Pyke",
  "/wiki/Unidentified_droid_server",
  "/wiki/Eye",
  "/wiki/Ear",
  "/wiki/Clothing",
  "/wiki/Lekku",
  "/wiki/Necklace",
  "/wiki/Breast",
  "/wiki/Bracelet",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Disney%2B",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/Marlon_Aquino",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Star_Wars",
  "/wiki/Species",
  "/wiki/Wookieepedia",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Category:Audio_files_of_Unidentified_Twi%27lek_male_server",
  "/wiki/Category:Images_of_unidentified_Twi%27lek_male_server",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Databank_(website)",
  "/wiki/August_1",
  "/wiki/2022"
 ]
}