{
 "name": "Unidentified_Arkanian_doctor",
 "display_name": "Unidentified Arkanian doctor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arkanian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "An Arkanian doctor worked in a medical facility in the city of Adascopolis on the planet Arkania. The doctor was given a blood sample by Jarael, a disguised Arkanian Offshoot—a genetically-altered Arkanian sub-species not allowed in the harshly-segregated city—and was instructed to analyze it. After suggesting a new product offered by Adascorp, the doctor realized the blood was of an Offshoot and hesitated to comply with Jarael's request. Noting the hesitation, Jarael bribed the doctor and appealed to his status as a man of medicine. The doctor agreed and left for several minutes to analyze the sample.\nWhen analyzed, the blood sample revealed that the source of the blood was from a former Adascorp scientist Gorman Vandrayk. Vandrayk, now known by the name Camper, was needed by Arkoh Adasca, chief executive of the House of Adasca and Adascorp, for a future operation. Adasca ordered Adascopolis forces to detain Jarael, knowing that she would be the best possible link to finding Vandrayk. The doctor was also instructed to stall Jarael to allow time for the Adascopolis forces to arrive. After the doctor failed to bluff his way into forcing Jarael to stay, the Arkanian Offshoot attempted to leave but was intercepted. To defend herself, Jarael took the doctor and threw him into the group of approaching guards.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Arkanian/Legends",
  "/wiki/Gender",
  "/wiki/Color/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/City/Legends",
  "/wiki/Adascopolis",
  "/wiki/Planet/Legends",
  "/wiki/Arkania/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Jarael",
  "/wiki/Arkanian_Offshoot/Legends",
  "/wiki/Bioengineering/Legends",
  "/wiki/Species/Legends",
  "/wiki/The_Adasca_BioMechanical_Corporation_of_Arkania",
  "/wiki/Gender/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Gorman_Vandrayk",
  "/wiki/Arkoh_Adasca",
  "/wiki/House_of_Adasca",
  "/wiki/Time/Legends",
  "/wiki/Knights_of_the_Old_Republic_16"
 ]
}