{
 "name": "Unidentified_stormtrooper_commander_(Tantive_IV)",
 "display_name": "Unidentified stormtrooper commander  (Tantive IV)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "501st Legion",
      "501st Legion"
     ]
    }
   ]
  }
 ],
 "content": "A Human male stormtrooper commander served as an officer in the Imperial Stormtrooper Corps's elite 501st Legion during the Galactic Civil War. He served on the Imperial Star Destroyer Devastator, under the command of the Dark Lord of the Sith Darth Vader. In 0 BBY, during a battle over the planet Tatooine, the Commander led a squad of Imperial troops to besiege the CR90 corvette Tantive IV, the consular ship of Senator Leia Organa. Once the Rebel starship had been secured, the Commander discovered that the stolen plans to the Imperial Death Star battlestation, for which the Empire was searching, were not in the ship's main computer and reported this to Vader. Vader ordered the Commander to continue searching for the plans and to bring him the ship's passengers alive.\nA Human male commander served as an officer of the Galactic Empire's Stormtrooper Corps during the Galactic Civil War. He was assigned to the 501st Legion, an elite stormtrooper unit unofficially known as \"Vader's Fist,\" under the direct command of the Dark Lord Darth Vader, Emperor Palpatine's enforcer. The Commander was part of the troop complement of the Imperial I-class Star Destroyer Devastator, Vader's flagship. At some point around 0 BBY, he acquired a facial scar from an energy beam that penetrated the shielding of his helmet.\nIn 0 BBY, after Rebel Alliance agents transmitted the stolen plans of the first Death Star superweapon to the CR90 corvette Tantive IV, consular ship of the Rebel-affiliated Senator Leia Organa, the Devastator pursued and captured the Rebel vessel over the planet Tatooine. This stormtrooper helped lead the 501st Legion as the assault commander during the boarding and securing of the Rebel starship. He reported the ongoing attempt to breach the Tantive IV's entry locks to Vader and escorted him to the main hangar of the Star Destroyer to board the captured vessel.\nStormtroopers captured Rebel Captain Raymus Antilles and took him to the assault commander, shortly before Vader boarded the ship accompanied by Commanders Praji and Jir, who also participated in the operation. When the Dark Lord arrived in the corridor where the prisoners were being held, the assault commander introduced the Rebel Captain to Vader. After consulting with one of the other commanders, the assault leader quickly returned to Vader, who was interrogating Antilles, and reported that the Death Star plans were not in the Tantive IV's main computer. Antilles denied Vader's accusations of intercepting illegal transmissions before dying by the Sith Lord's hand. The enraged Vader ordered the assault commander to search for the plans more thoroughly and to bring him the vessel's passengers alive. Although Organa was captured by stormtroopers just minutes later, the stormtroopers were unaware that the stolen plans were already on their way to Tatooine in an escape pod with Organa's droids, R2-D2 and C-3PO.\nWhen the stormtroopers took Antilles to the assault commander, the stormtrooper abused the captive Rebel by physically striking him and flouting his surrendering without putting up a fight. After killing Antilles, Vader whirled unexpectedly, and the nearby Imperial officers, including this individual, shrank under his baleful sculptured stare. The officers hastened to carry out Vader's orders—and to retreat from the Dark Lord's malevolent presence.\nThe character of the stormtrooper commander first appeared in the December 1976 novelization of Star Wars: Episode IV A New Hope, ghostwritten by Alan Dean Foster. In the novel, the Commander is described as an officer whose \"armored helmet  shoved back to reveal a recent scar, where an energy beam had penetrated his shielding,\" and he speaks a different line than his dialogue in the film.\nThe character's first live-action appearance occurred in the film A New Hope itself, in which he was portrayed by an uncredited extra. His scene was one of the last few of principal photography, filmed sometime between June 29 and July 16, 1976 in the United Kingdom. The character's line was performed by disc jockey Terence McGovern, said over a walkie-talkie and recorded by sound designer Ben Burtt. In the revised fourth draft script of A New Hope, as presented in Star Wars: Behind the Magic, the Commander is identified as \"Imperial Officer.\"\nIn the third episode of the film's radio drama, a character addressed as \"Commander\" can be heard in three scenes: first, hailing the Tantive IV from aboard the Devastator, in place of the character of Nahdonnis Praji; second, aboard the Tantive IV, presenting Antilles to Vader and reporting on the Death Star plans; and third, arguing with Vader about Senator Organa, in place of Daine Jir. However, in the radio drama, the \"Commander\" boards the Tantive IV before Vader, and in Star Wars Manga: A New Hope 1, Praji and Jir enter after Vader, revealing that the person who captured Antilles cannot be these two, and is in fact the character of the unidentified stormtrooper commander.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Devastator/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Battle_of_Tatooine_(Galactic_Civil_War)",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Stormtrooper_commander/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Tantive_IV/Legends",
  "/wiki/Consular_ship/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Computer/Legends",
  "/wiki/Legion/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Raymus_Antilles/Legends",
  "/wiki/Nahdonnis_Praji",
  "/wiki/Daine_Jir/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Star_Wars_(radio)",
  "/wiki/Officer/Legends",
  "/wiki/Star_Wars_(1977)_1",
  "/wiki/December",
  "/wiki/1976",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(novel)",
  "/wiki/Alan_Dean_Foster",
  "/wiki/June_29",
  "/wiki/July_16",
  "/wiki/Terence_McGovern",
  "/wiki/Ben_Burtt",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Manga:_A_New_Hope_1",
  "/wiki/Death_Star_(novel)",
  "/wiki/Star_Wars_Episode_IV:_A_New_Hope_(PhotoComic)",
  "/wiki/The_Rise_and_Fall_of_Darth_Vader",
  "/wiki/Star_Wars_(book-and-record)",
  "/wiki/William_Shakespeare%27s_Star_Wars:_Verily,_A_New_Hope",
  "/wiki/Star_Wars:_The_National_Public_Radio_Dramatization",
  "/wiki/The_Art_of_Star_Wars_Episode_IV:_A_New_Hope",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/ComicScan",
  "/wiki/Star_Wars_Galaxy_Collector_3",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/Star_Wars:_The_Card_Game_Core_Set",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary",
  "/wiki/Star_Wars:_Battlefront_II",
  "/wiki/The_Star_Wars_Trilogy_Special_Edition",
  "/wiki/George_Lucas",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film",
  "/wiki/November_2",
  "/wiki/2022",
  "/wiki/The_Sounds_of_Star_Wars",
  "/wiki/Dark_Lord:_The_Rise_of_Darth_Vader",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/A_New_Hope_Limited"
 ]
}