{
 "name": "Unidentified_Gungan_villager_(Otoh_Sancture)",
 "display_name": "Unidentified Gungan villager  (Otoh Sancture)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3000 BBY",
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Otoh Sancture"
     ]
    }
   ]
  }
 ],
 "content": "A Gungan villager lived in the city of Otoh Sancture on the planet Naboo in 3000 BBY. At that time, a war was raging between the various Gungan tribes, but Otoh Sancture, under the leadership of Boss Gallo, remained neutral in the conflict. During Otoh Sancture's Sacred Feast, the villager told Gallo of his duties in finding animals for the celebration, and the Gungan was later killed in an attack on the city by a tribe of bursas, a race of semi-sentient carnivores.\nIn the year 3000 BBY, a Gungan villager lived in the city Otoh Sancture on the planet Naboo. The villager lived under the rule of Boss Gallo, who maintained Otoh Sancture's neutrality in a war between the Gungan tribes at that time. At some point in the war, Otoh Sancture celebrated its annual Sacred Feast, a thanksgiving celebration to the Gungan deities known as the Guds, requiring Gallo to leave his city to hunt animals suitable for the feast. The Gungan villager told the Boss of his duties in finding animals shortly before his departure.\nWhile Gallo was away, Otoh Sancture was attacked by a tribe of bursas, a semi-sentient, carnivorous race of quadrupeds native to Naboo. The bursas had been sent by Rogoe, the Boss of the city Spearhead and the secret manipulator of the war, who wanted Gallo dead to ensure he could not take a side in the war and swing its tide. The Gungan villager cried out for help in the attack, which Gallo heard, but the Boss was unable to reach Otoh Sancture because of a river between his location and the city. The villager perished along with the rest of Otoh Sancture's residents.\nThe villager lived in Otoh Sancture until the individual's death and screamed for help during the bursa attack, which was loud enough to be heard by Gallo, even though the Boss was not in the city.\nThe Gungan villager's voice is heard in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds, in the first level of the Gungan campaign; \"Otoh Sancture.\" The game credits two actors as voicing Gungan villagers, Rob Paulsen and Grey DeLisle, but it is not stated which, if either, voiced this villager.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Otoh_Sancture",
  "/wiki/Unidentified_Gungan_villager_(Otoh_Raban)",
  "/wiki/Otoh_Raban",
  "/wiki/Naboo/Legends",
  "/wiki/3000_BBY",
  "/wiki/Gungan/Legends",
  "/wiki/City/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/War_of_the_Gungan_tribes",
  "/wiki/Boss/Legends",
  "/wiki/Gallo/Legends",
  "/wiki/Sacred_Feast",
  "/wiki/Hunting/Legends",
  "/wiki/Death/Legends",
  "/wiki/Destruction_of_Otoh_Sancture",
  "/wiki/Bursa_clan_(Otoh_Sancture)",
  "/wiki/Bursa/Legends",
  "/wiki/Species/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Deity/Legends",
  "/wiki/Gud/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Rogoe/Legends",
  "/wiki/Spearhead/Legends",
  "/wiki/2001",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Rob_Paulsen",
  "/wiki/Grey_Griffin",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/The_Essential_Atlas"
 ]
}