{
 "name": "Unidentified_female_Imperial_Knight_(sparring_session)",
 "display_name": "Unidentified female Imperial Knight  (sparring session)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire-in-exile",
      "Imperial Knights",
      "Imperial Knights"
     ]
    }
   ]
  }
 ],
 "content": "A blonde-haired, blue-eyed female Human was an Imperial Knight who served Emperor Roan Fel of the Empire-in-exile during the Second Imperial Civil War. In 137 ABY, she sparred with Fel on the Imperial fortress world of Bastion, and early in the following year, she was present at a ceremony honoring Imperial Knights who had fallen in combat with the Sith during a recent battle on Agamar.\nDuring the Second Imperial Civil War, a Human female with blonde hair and blue eyes was a member of the Imperial Knights, an order of Force-users who served Emperor Roan Fel of the Empire-in-exile. In 137 ABY, she dueled the Emperor in a sparring session on the Imperial fortress world of Bastion. The session was interrupted by a HoloNet call from Antares Draco, the leader of the Imperial Knights, whose hologram informed Fel of recent developments during a mission to Had Abbadon. Fel gave Draco new orders before bidding him farewell and continuing his sparring session with the blue-eyed female.\nLater in the year, Fel and a large group of Imperial Knights were attacked by a Sith strike force while on the planet Agamar negotiating an alliance with representatives of the Jedi Order. Although most of the Imperial Knights and Jedi escaped the planet, several were slain by the Sith. Early in 138 ABY, the Emperor hosted a remembrance ceremony on Bastion to pay tribute to the fallen Imperial Knights, as well as to Antares Draco, who had been captured by the Sith during a recent mission to Korriban. The blue-eyed female attended the ceremony.\nAs an Imperial Knight, the blue-eyed female was part of an organization whose membership was exclusive to those who were able to manipulate the Force. Imperial Knights were considered to be among the most talented and dangerous Force-users in the galaxy. The blue-eyed female used an Imperial Knight lightsaber while she sparred with Roan Fel, and although she wore casual attire while training with the Emperor, she dressed in standard Imperial Knight armor at the remembrance ceremony.\nThe blue-eyed Imperial Knight first appeared in two panels of the twenty-ninth issue of the comic series Star Wars: Legacy, which was written by John Ostrander, penciled by Jan Duursema, and released in 2008. She was not identified as an Imperial Knight until her next appearance, which came in the first issue of Legacy's followup miniseries, Star Wars: Legacy—War. Also penned by Ostrander and Duursema, that issue was released in 2010. The blue-eyed female's hair was colored brown in that issue, but Duursema confirmed on TheForce.net's Jedi Council Forums that the two characters were one and the same, and attributed the color difference to lighting. Ostrander later stated that he and Duursema had intended to develop the character further but were unable to do so before Legacy was canceled.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Empire-in-exile",
  "/wiki/Imperial_Knight",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Eye/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/137_ABY",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Fortress_world",
  "/wiki/Bastion/Legends",
  "/wiki/138_ABY",
  "/wiki/Imperial_Knight_remembrance_ceremony",
  "/wiki/Death/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/One_Sith",
  "/wiki/Operation:_Thunderstroke",
  "/wiki/Agamar/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Antares_Draco",
  "/wiki/Hologram/Legends",
  "/wiki/Mission_to_Had_Abbadon",
  "/wiki/Had_Abbadon/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mission_to_Agamar",
  "/wiki/New_Jedi_Order",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Mission_to_Korriban_(Second_Imperial_Civil_War)",
  "/wiki/Korriban",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Imperial_Knight_lightsaber",
  "/wiki/Imperial_Knight_armor",
  "/wiki/Legacy_(2006)_29",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/2008",
  "/wiki/Star_Wars:_Legacy%E2%80%94War",
  "/wiki/2010",
  "/wiki/TheForce.net",
  "/wiki/Jedi_Council_Forums",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Legacy_(2006)_46",
  "/wiki/Legacy_(2006)_45",
  "/wiki/Legacy_(2006)_48",
  "/wiki/January_3",
  "/wiki/2011",
  "/wiki/March_5",
  "/wiki/2012",
  "/wiki/July_12"
 ]
}