{
 "name": "Unidentified_Sabetue",
 "display_name": "Unidentified Sabetue",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sabetue"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Genderless"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  }
 ],
 "content": "A genderless Sabetue individual accompanied Kilmo on Corellia to purchase coaxium from one of Lady Proxima's White Worms, the human male Han Solo. When Solo attempted to scam the group, the Sabetue tried and failed to prevent the human from fleeing.\nA Sabetue individual was one of the rare genderless members of their species; their pure white skin distinguished them from a gendered Sabetue. They were tall, gaunt, and skeletal in appearance with clawed hands and feet.\nIn 13 BBY, they accompanied a male individual named Kilmo to purchase seven coaxium vials from a representative of the crime boss Lady Proxima on the planet Corellia. The human male scrumrat Han Solo, who was one of Proxima's White Worms, claimed his boss had not provided him with the agreed-upon number. The Sabetue was quick to realize that Solo was attempting a scam and flexed their claws, but Solo was not intimidated; instead, the human presented only six vials and tried to negotiate a price. Kilmo punched him twice as one of his henchman restrained Solo, but Solo struck the henchman and used his hunched position to evade the Sabetue's grab as he fled from the group.\nHiding under Kilmo's M-68 landspeeder, Solo observed the Sabetue walk past and noticed they were in need of a pedicure to address a split claw. It oozed as if they had recently torn it by attacking someone, and given the likely cause, he could not sympathize with the pain it must have caused them.\nThe unidentified Sabetue appeared in the 2018 novelization Solo: A Star Wars Story: Expanded Edition, an adaptation by Mur Lafferty of the 2018 Anthology film, Solo: A Star Wars Story.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Sabetue",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Kilmo",
  "/wiki/Corellia",
  "/wiki/Coaxium",
  "/wiki/Lord",
  "/wiki/Proxima",
  "/wiki/White_Worms",
  "/wiki/Human",
  "/wiki/Han_Solo",
  "/wiki/Species",
  "/wiki/Claw",
  "/wiki/Limb",
  "/wiki/13_BBY",
  "/wiki/Crime_lord",
  "/wiki/Planet",
  "/wiki/Scrumrat",
  "/wiki/M-68_landspeeder",
  "/wiki/2018",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Mur_Lafferty",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Standard_year",
  "/wiki/Galactic_Empire",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/10_BBY"
 ]
}