{
 "name": "Unidentified_Night_Wind_assassin",
 "display_name": "Unidentified Night Wind assassin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Order of the Night Wind"
     ]
    }
   ]
  }
 ],
 "content": "A human male assassin served the Order of the Night Wind during the New Republic Era. Normally only allowed to operate within Hutt Space, he and several other assassins were sent to Mos Espa around 9 ABY to ambush Boba Fett, the city's self-appointed Daimyo. Their mission turned to failure, however, after most of their force was defeated by Master Assassin Fennec Shand and Fett's Gamorrean guards.\nThe sole surviving member, the Night Wind assassin was questioned by the crime lord as to the identity of his employer, to which he claimed to have been sent by Mayor Mok Shaiz of Mos Espa. When confronted by Fett, however, Shaiz simply thanked the Daimyo for bringing a member of the Night Wind to justice and had the assassin executed on the spot.\nAround 9 ABY, the human male worked as an assassin in the Order of the Night Wind, an order of assassins who were only permitted to operate within Hutt Space. He and five other of the assassins were hired to eliminate Boba Fett, who had recently seized the position of Daimyo of the desert world Tatooine. After Fett and his master assassin, Fennec Shand, left the Sanctuary cantina in the city of Mos Espa, the six assassins ambushed the pair in the street, armed with plasma pikes and energy shields. The Night Wind assassins trapped their targets in a circular shield-formed enclosement which withstood an explosive counterattack from Fett, but they were soon flanked by the Daimyo's two Gamorrean guards, who were able to break the Night Wind's formation.\nFett, Shand, and their guards fought the assassins, killing three of them before the Night Wind assassin and his remaining two comrades chose to retreat and scrambled up a building. While Fett was able to destroy one of the fleeing assassins, Shand pursued the assassin and his last accomplice, who hopped across the buildings of Mos Espa. When Fett's master assassin caught up with the pair, they threw knives at her, forcing their adversary to jump off the building they were on to dodge the attack. The two assassins then continued to travel across more buildings until Shand once took them by surprise atop another building, engaging them in hand-to-hand. Fett's master assassin overpowered them, disarming the pair and using one of them batons to force them into surrender. Shand then kicked the assassin's comrade over the ledge, taking him prisoner alone.\nShand tied up the Night Wind assassin's wrists with a rope and took him back to Fett's palace, where he was taken before the Daimyo. Fett questioned the assassin, asking who had sent him. The captive remained silent, though, so the Daimyo had one of his Gamorrean guards put a blade to the prisoner's throat, only for him to curse Fett in huttese. Fett's 8D-series smelter droid 8D8 explained the assassin's affiliation with the Night Wind, claiming that he feared no man. Shand then wondered if the assassin feared a rancor and the captive looked up in fear before a trap door released under him, sending him into a dungeon. A large door near him began opening, and the assassin, believing a rancor was behind it, succumbed to his fear and claimed Mayor Mok Shaiz of Mos Espa had sent him to kill Fett.\nThe Night Wind assassin had been fooled, as there was no rancor behind the door. Fett and Shand took him to the Mos Espa City Hall with the Gamorreans. Entering the building, Shand pulled the prisoner to his knees while Fett spoke to the desk clerk. When Shaiz's majordomo stepped in and claimed the mayor was busy, the Daimyo forced his way into Shaiz's office, the assassin being pulled along with him. Pulling the captive to the floor once again, the Daimyo accused Shaiz of sending the assassin to kill him. Shaiz, identifying the prisoner as a Night Wind assassin, had one of his guards shoot the captive, giving the excuse that the Order of the Night Wind was not allowed to operate outside of Hutt Space.\nA human male, the Night Wind assassin had light skin and blue eyes. As a member of the Order of the Night Wind, he feared no man, even cursing at Boba Fett when there was a blade held to his throat. An exception, however, was a rancor, and the assassin quickly gave up information when he was tricked into believing a rancor was being released on him.\nThe assassin wore red clothing with silver armor over his chest, brown boots and a black hood. He also donned a thick black belt and vambraces, one of which produced an energy shield. The assassin wielded a plasma pike.\nThe assassin first appeared in the premiere episode of the Disney+ series The Book of Boba Fett, which was directed by Robert Rodriguez and aired on December 29, 2021. The character was portrayed by stunt performer Paul Darnell.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Order_of_the_Night_Wind",
  "/wiki/New_Republic_Era",
  "/wiki/Hutt_Space",
  "/wiki/Assassin",
  "/wiki/Mos_Espa",
  "/wiki/Ambush_outside_of_the_Sanctuary",
  "/wiki/Boba_Fett",
  "/wiki/City",
  "/wiki/Daimyo",
  "/wiki/Master_Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Gamorrean_Warrior",
  "/wiki/Crime_lord",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/Mok_Shaiz",
  "/wiki/Death",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Cantina",
  "/wiki/Plasma_pike",
  "/wiki/Ray_shield",
  "/wiki/Gamorrean",
  "/wiki/Knife",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Unidentified_Gamorrean_guard_2",
  "/wiki/Huttese",
  "/wiki/8D-series_smelter_droid",
  "/wiki/8D8",
  "/wiki/Rancor",
  "/wiki/Mayor",
  "/wiki/Mos_Espa_City_Hall",
  "/wiki/Unidentified_clerk",
  "/wiki/Unidentified_Twi%27lek_majordomo",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Vambrace",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Robert_Rodriguez",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/Paul_Darnell",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Databank_(website)"
 ]
}