{
 "name": "Unidentified_Clone_Captain_(Kamino)",
 "display_name": "Unidentified Clone Captain  (Kamino)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Kamino security",
      "Kamino security"
     ]
    }
   ]
  }
 ],
 "content": "A Clone Captain served in the Grand Army of the Republic's security force on the planet Kamino under Jedi General Shaak Ti and Chief Medical Scientist Nala Se during the Clone Wars. The clone trooper officer helped coordinate the hunt for the rogue Advanced Recon Commando CT-5555 \"Fives\" and medical droid AZI-3 in 19 BBY. After failing to apprehend the duo in their initial escape from the planet's capital, Tipoca City, the captain then attempted to capture the fugitives in the Genetic Records Hall, but was quickly thwarted once again.\nLater, the captain came to Nala Se's aid when she secretly confronted the fugitives in the Tipoca City embryo room by herself. As the rogue clone held Se hostage, the captain and his fellow security personel were forced to listen to Fives' allegations of conspiracy against the inhibitor chips planted in the clones. After consideration, General Ti ordered that Fives be transported to the planet Coruscant for testimony.\nA clone trooper officer who was assigned to the Galactic Republic's security force on the planet Kamino was a clone of the human male bounty hunter Jango Fett. Born and raised on that same world, the clone was created to serve in the Grand Army of the Republic, which fought against the Confederacy of Independent Systems during the Clone Wars. The trooper held the rank of Clone Captain and was subordinate to Jedi General Shaak Ti and Chief Medical Scientist Nala Se. In 19 BBY, when Advanced Recon Commando CT-5555 \"Fives\" went rogue and attempted to escape from Tipoca City, the Clone Captain and other members of Kamino security pursued him and his medical droid companion, AZI-3. The fugitive pair were attempting to investigate the death of CT-5385 \"Tup\" as Fives believed that it was potentially linked to a conspiracy against the Republic.\nLed by Shaak Ti and accompanied by Nala Se, the captain was the first to find the fugitives as they boarded a Kaminoan flight pod and fled the city. The captain complied with Ti's order to track the pod, but the Jedi Master soon sensed that all was not as it seemed and began to doubt that the fugitives' intentions were to leave the planet. The captain confirmed his superior's suspicions when he relayed to her that someone was accessing Jango Fett's genotype in the Genetic Records Hall. Ti told the security force to evacuate the hall quietly, but Fives was nevertheless able to recognize that something was amiss. The captain, Ti, Se, and security force clones arrived at the hall, but the fugitives escaped through an access hatch before they could be stunned and captured. Se then ordered the captain to station troops at all access points in the city's main hallway system, which was connected to the service tunnels through which the fugitives were traveling.\nLater, the captain and the Jedi came to Nala Se's aid when she secretly confronted Fives and AZI-3 about their knowledge of the inhibitor chips in the Tipoca City embryo room. Se was unable to discuss the true nature of the chips and instead attempted to allay Fives' concerns in private and without Ti's presence. Fives, however, was convinced that the chips should be removed to avoid further fatal malfunctions, as was the case with Tup. Before long, Se's comrades arrived at the embryo room, and the captain warned the fugitives not to move. In response, Fives positioned himself behind Se with a DC-15A blaster carbine pointed at her head and then relayed the information he had acquired about the biochips to his pursuers. In spite of Nala Se's protests, Ti consequently decided that it would be best for Fives and the evidence to travel to the planet Coruscant so that Supreme Chancellor Sheev Palpatine could be briefed on the situation.\nLike all clones of the human male Jango Fett, the Clone Captain stood at 1.83 meters tall. He obediently complied with orders from his superiors and commanded other clones during the pursuit of Fives and AZI-3.\nThe Clone Captain was equipped with Phase II clone trooper armor, which featured the gray markings of the Kamino security force, and a kama around his waist. His helmet sported an antenna and the Aurebesh letter Cresh was painted on his visor. In combat, he wielded dual DC-17 hand blasters.\nThe Clone Captain first appeared as an unnamed character in \"Fugitive,\" the third episode of the canon animated series Star Wars: The Clone Wars' sixth season, which first aired on February 15, 2014. Like all clones in the series, he was voiced by Dee Bradley Baker. He is identified as a captain in the script, according to Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Clone_Captain_(Kamino)",
  "/wiki/Unidentified_clone_trooper_officer_(Kamino_security)",
  "/wiki/Unidentified_Clone_Captain",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Kamino_security",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Planet",
  "/wiki/Jedi_General",
  "/wiki/Shaak_Ti",
  "/wiki/Chief_Medical_Scientist",
  "/wiki/Nala_Se",
  "/wiki/Clone_Wars",
  "/wiki/Clone_trooper",
  "/wiki/Clone_trooper_officer",
  "/wiki/Escape_from_Tipoca_City",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/CT-5555",
  "/wiki/Medical_droid",
  "/wiki/AZI-345211896246498721347",
  "/wiki/19_BBY",
  "/wiki/Capital",
  "/wiki/Tipoca_City",
  "/wiki/Clone_Captain",
  "/wiki/Genetic_Records_Hall",
  "/wiki/Captain",
  "/wiki/Tipoca_City_embryo_room",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/General",
  "/wiki/Coruscant",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Reproduction",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Trooper",
  "/wiki/Death",
  "/wiki/CT-5385",
  "/wiki/Commanding_officer",
  "/wiki/Kaminoan_flight_pod",
  "/wiki/City",
  "/wiki/Jedi_Master",
  "/wiki/The_Force",
  "/wiki/Gene",
  "/wiki/Stun",
  "/wiki/Jedi",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Color",
  "/wiki/Kama",
  "/wiki/Helmet",
  "/wiki/Aurebesh",
  "/wiki/Cresh",
  "/wiki/DC-17_hand_blaster",
  "/wiki/Fugitive",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_The_Lost_Missions",
  "/wiki/February_15",
  "/wiki/2014",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_Unidentified_Clone_Captain_(Kamino)",
  "/wiki/Orders",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Wrong_Jedi",
  "/wiki/A_Death_on_Utapau",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/April_19",
  "/wiki/2019"
 ]
}