{
 "name": "Unidentified_nurse_(Coruscant)",
 "display_name": "Unidentified nurse  (Coruscant)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "Heavy-set"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Coruscant medical facility"
     ]
    }
   ]
  }
 ],
 "content": "A Human female worked as a nurse at a medical facility on the galactic capital planet Coruscant during the Great Galactic War. She was present when Darth Malgus, a Sith Lord who had taken part in the Sacking of Coruscant—a Sith attack on the planet—arrived at the medcenter shortly after the battle in search of his Twi'lek lover, Eleena Daru, who was in the facility at the time. After Malgus demanded to see her, the nurse took him to find her.\nIn 3653 BBY, the final year of the Great Galactic War, a Human female nurse worked at a medical facility on the galactic capital planet Coruscant, which had fallen under control of the Sith Empire following the Sacking of Coruscant, an assault in which the Sith had captured the capital world. Shortly after the battle, a Sith Lord by the name of Darth Malgus, who had participated in the Sith's attack on the Jedi Temple during the conflict, went to the medical facility. Malgus was looking for his lover, the Twi'lek Eleena Daru, who was in the hospital after being seriously injured during the assault on the Jedi Temple. She had been denied treatment at Imperial hospitals because she was alien, as the Imperials despised non-humans. Malgus demanded that he be taken to his lover, and the nurse volunteered to do so. While the nurse took Malgus to Daru, she told him that she did not realize at first that Daru was Imperial, but that she would have treated Daru even if she knew. When they found Daru, another nurse named Tal refused to release the Twi'lek to Malgus. However, the female nurse convinced Tal to allow Malgus to take Daru, warning Tal that Malgus was a Sith.\nA Human female, the nurse was a heavyset woman, and to Darth Malgus, her blue medical uniform looked like a tent on her stout frame. She had freckles and red hair that she pulled back in a tight bun. She was willing to take Malgus to his lover, and she was not afraid to stand up to the Sith Lord by telling him that the people of the medical facility were not savages as Malgus seemed to believe. She placed no restrictions on the species or affiliation of her patients, as in the case of Eleena Daru.\nThe nurse made her first appearance in Paul S. Kemp's novel The Old Republic: Deceived, published in 2011.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Nurse/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Unidentified_nurse_(Executor)",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Unidentified_Coruscant_medical_facility",
  "/wiki/The_Old_Republic:_Deceived",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Darth_Malgus",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Sith/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Eleena_Daru",
  "/wiki/Time/Legends",
  "/wiki/3653_BBY",
  "/wiki/Standard_year/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Speciesism",
  "/wiki/Tal_(nurse)",
  "/wiki/Darth/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Paul_S._Kemp",
  "/wiki/2011",
  "/wiki/The_Old_Republic:_Deceived_(audiobook)",
  "/wiki/The_Essential_Atlas"
 ]
}