{
 "name": "Unidentified_female_Onderonian_fighter",
 "display_name": "Unidentified female Onderonian fighter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Onderon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Partisans"
     ]
    }
   ]
  }
 ],
 "content": "A human female fighter was part of Saw Gerrera's group of Partisans stationed on Onderon at around 19 BBY. While escorting a group of refugees off Onderon, her group was ambushed by CT-9904's Elite Squad, who were there to wipe out Gerrera and his Partisans. She refused to tell CT-9904 \"Crosshair\" where Gerrera was and was promptly shot and killed by the clone trooper.\nThis fighter was on the planet Onderon at around 19 BBY, helping Onderonian refugees to get off Onderon. Hoping wipe out Saw Gerrera and his Partisans, as well as to test out the newly formed Elite Squad's loyalties, Governor Wilhuff Tarkin sent CT-9904 \"Crosshair\" along with troopers including ES-01 and ES-04 to Onderon to find and kill Gerrera. The fighters were ambushed, causing the refugees to scream in fear. This fighter ordered the others to get the refugees onto a shuttle. This fighter held the troopers off and managed to board the shuttle.\nHowever, one of the troopers sniped the pilot of the shuttle, which crashed back to the ground. The door of the shuttle opened as the fighter and the refugees looked at their attackers with fear. She got off the shuttle along with the refugees and put her weapon down. Crosshair held a DC-17 blaster pistol at her chest, asking where Gerrera was. She put her hands up, claiming that she did not know where Gerrera was, telling the clone trooper that she would not tell him if she knew. Mid-sentence, Crosshair shot her in the chest, killing her, remarking that he believed her as her lifeless body fell to the ground.\nThis fighter first appeared in \"Replacements,\" the third episode of the 2021 web-TV series Star Wars: The Bad Batch. She was voiced by Gwendoline Yeo, who also voiced Nala Se in the same episode.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/19_BBY",
  "/wiki/Onderon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Partisans",
  "/wiki/Replacements",
  "/wiki/Saw_Gerrera",
  "/wiki/Refugee",
  "/wiki/Mission_to_Onderon_(Elite_Squad)",
  "/wiki/CT-9904%27s_Elite_Squad",
  "/wiki/CT-9904",
  "/wiki/Death",
  "/wiki/Clone_trooper",
  "/wiki/Planet",
  "/wiki/Onderonian",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/ES-01",
  "/wiki/ES-04",
  "/wiki/Shuttle",
  "/wiki/DC-17_blaster_pistol",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Gwendoline_Yeo",
  "/wiki/Nala_Se",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Clone_commando",
  "/wiki/War-Mantle",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}