{
 "name": "Unidentified_stormtrooper_(Level_1997)",
 "display_name": "Unidentified stormtrooper  (Level 1997)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Shortly after the destruction of Alderaan",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "A Human male stormtrooper served the Galactic Empire on the planet Coruscant during the Galactic Civil War. Shortly after the destruction of the planet Alderaan, he encountered a pair of Alderaanian fugitives on Coruscant's Level 1997 and attempted to apprehend them. The stormtrooper caught up with the elder of the two, Anandra Milon, on Level 1996 and, after a brief struggle with her, was thrown to his death from a catwalk by a Herglic criminal.\nA Human male served in the Imperial Stormtrooper Corps during the Galactic Civil War and was stationed on the planet Coruscant, the Imperial capital, shortly after the planet Alderaan was destroyed by the Empire in the year 0 BBY. In the days following Alderaan's destruction, Imperial stormtroopers on Coruscant began rounding up local Alderaanians living on Level 3204 and taking them in for questioning on suspicion of having ties to the Rebel Alliance.\nThe stormtrooper and a member of the Coruscant underworld police were patrolling Level 1997, an area with a seedy reputation, when they entered a cantina together and encountered Alderaanian child fugitives Anandra Milon and her younger brother, Santigo, who were on the run from the Imperial authorities. The two children fled from the Imperials down into Level 1996, and the stormtrooper alone gave chase. Taking a turbolift down to 1996, the trooper found Anandra waiting for him on a catwalk. As the trooper approached Anandra, he identified her by name via facial recognition, declared that she had been pre-convicted of juvenile noncompliance, and ordered her to surrender.\nAlthough the young girl pretended to comply with the stormtrooper's command at first, she quickly disarmed the trooper, sending his blaster rifle skidding across the catwalk and setting off a brief scuffle between the two. The trooper planted two solid kicks to Anandra's midsection, and she countered by jumping upon him, managing to knock off his helmet. Before the trooper could resume his attack, he was suddenly lifted into the air by a Herglic criminal, who had followed the trooper down from the cantina. The Herglic then threw the stormtrooper screaming from the catwalk to his death in the abyss of Level 1995 below.\nA middle-aged man at the time of his Coruscant service, the stormtrooper had a scarred face, which vaguely reminded Anandra Milon of her uncle. Upon entering the cantina with the Coruscant Underworld Police officer, the stormtrooper walked with confidence despite the unsavory reputation of Level 1997. Yet the trooper demonstrated more caution when attempting to apprehend Anandra alone, checking behind himself before cautiously approaching her. The trooper tried reasoning with Anandra at first, even sympathizing with her plight to a degree.\nThe stormtrooper carried an E-11 medium blaster rifle and wore stormtrooper armor, the helmet of which produced an electronic hiss that masked the man's tone when he spoke. He unsuccessfully attempted to apprehend Anandra Milon with stuncuffs.\nThe stormtrooper appeared without name in \"One Thousand Levels Down,\" a short story written by Alexander Freed and illustrated by Joe Corroney and Brian Miller. The story was published as part of Star Wars Insider 151 on July 22, 2014.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_stormtrooper",
  "/wiki/The_Disaster",
  "/wiki/Alderaan",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Planet",
  "/wiki/Galactic_Civil_War",
  "/wiki/Alderaanian",
  "/wiki/Level_1997",
  "/wiki/Stormtrooper",
  "/wiki/Anandra_Milon",
  "/wiki/Level_1996",
  "/wiki/Death",
  "/wiki/Herglic",
  "/wiki/Unidentified_Herglic_criminal",
  "/wiki/Capital",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/Standard_day",
  "/wiki/Level_3204",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Unidentified_Coruscant_underworld_police_officer",
  "/wiki/Coruscant_underworld_police",
  "/wiki/Unidentified_cantina_(Level_1997)",
  "/wiki/Santigo_Milon",
  "/wiki/Turbolift",
  "/wiki/Blaster_rifle",
  "/wiki/Stormtrooper_armor",
  "/wiki/Cantina",
  "/wiki/Level_1995",
  "/wiki/Time",
  "/wiki/Anandra_Milon%27s_uncle",
  "/wiki/Police_officer",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Armor",
  "/wiki/Stuncuffs",
  "/wiki/One_Thousand_Levels_Down",
  "/wiki/Alexander_Freed",
  "/wiki/Joe_Corroney",
  "/wiki/Brian_Miller",
  "/wiki/Star_Wars_Insider_151",
  "/wiki/July_22",
  "/wiki/2014",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider:_The_Fiction_Collection_Volume_1",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Titan_Magazines"
 ]
}