{
 "name": "Unidentified_clone_trooper_(Rex%27s_false_grave)",
 "display_name": "Unidentified clone trooper  (Rex's false grave)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "A clone trooper was present on Mandalore at the end of the Clone Wars. He fought in the Siege of Mandalore and was killed on the planet. When Order 66 was issued by Supreme Chancellor Palpatine after the siege's end, the Republic clone forces turned against their commander, Ahsoka Tano, who managed to escape execution with the help of another clone, Clone Commander Rex. Tano and Rex subsequently faked their deaths at each other's hands to cover their tracks, creating a false grave for Rex in which they buried the clone's body wearing Rex's armor.\nThe clone trooper was created on the planet Kamino by Kaminoan cloners as part of the Grand Army of the Republic. In the final days of the Clone Wars between the Galactic Republic and Confederacy of Independent Systems in 19 BBY, the trooper was part of the 332nd Division, a sub-unit of the 501st Legion dispatched to the planet Mandalore in order to assist former Jedi Padawan Ahsoka Tano and the Mandalore resistance in toppling the Shadow Collective and its leader, the renegade Sith Lord Maul. The clone trooper was killed at some point in the ensuing Siege of Mandalore.\nThe siege ended with a Republic victory, as Maul was successfully captured. However, shortly after the battle ended, Order 66 was issued: a secret Sith-engineered command which branded all Jedi as traitors and called for their immediate execution, which the clones were compelled to obey due to implanted inhibitor chips. Despite having left the Jedi Order, Tano was still considered a target and escaped the 332nd alongside Clone Commander Rex, who had his chip removed.\nIn order to fake their deaths and hide from the new Galactic Empire, Tano and Rex recovered the clone trooper's body, burying him in Rex's armor and erecting a gravestone with an inscription claiming that Rex himself was the clone buried there, supposedly having heroically taken down the traitor Tano at the cost of his own life. However, the stated identity of the clone's killer was as much of a lie as the rest of the grave. As the two fugitives parted ways to go into hiding, Tano abandoned her lightsabers atop the grave as a final touch to make the deception as convincing as possible. Before leaving, she rested her hand on the gravestone and allowed herself a moment to think about the man who was buried there and the men who were not.\nAs a clone of the bounty hunter Jango Fett, the trooper was a human male who stood 1.83 meters tall.\nThe clone trooper was mentioned in a flashback in the novel Ahsoka, written by E. K. Johnston and published in 2016. The description of the trooper being buried in Rex's armor conflicts with the animated series Star Wars Rebels, which had already shown Rex still in possession of several pieces of his armor, including his customized helmet, fifteen years after the end of the Clone Wars, even though the novel's wording implied that the trooper was buried in all of Rex's armor.\nIn 2020, the seventh and final season of Star Wars: The Clone Wars was released, containing an animated depiction of the Siege of Mandalore and Tano and Rex's escape from Order 66. However, \"Shattered\" and \"Victory and Death\"—The Clone Wars' very last episodes—depict a version of events contradictory to what was described in Ahsoka, specifically excluding the buried trooper. In the two episodes, Tano and Rex depart Mandalore aboard the Venator-class Star Destroyer Tribunal with Maul as their prisoner, en route to Coruscant. Order 66 is issued while they are in hyperspace and, in the ensuing skirmish, the Tribunal crashes into a moon after Maul destroys its hyperdrive. Tano and Rex go to the crash site and bury the dead, but do not dig a false grave for Rex or mark the graves with inscribed headstones.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_clone_trooper",
  "/wiki/Ahsoka_(novel)",
  "/wiki/The_Clone_Wars:_Season_Seven",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Mandalore",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Death",
  "/wiki/Planet",
  "/wiki/Order_66",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Clone_trooper",
  "/wiki/Commanding_officer",
  "/wiki/Ahsoka_Tano",
  "/wiki/Death_penalty",
  "/wiki/Clone_Commander",
  "/wiki/Rex",
  "/wiki/Burial",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Kaminoan",
  "/wiki/Standard_day",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Trooper",
  "/wiki/332nd_Division",
  "/wiki/501st_Legion",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Mandalore_resistance",
  "/wiki/Shadow_Collective",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Maul",
  "/wiki/Sith",
  "/wiki/Treason",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Ahsoka%27s_lightsabers",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/E._K._Johnston",
  "/wiki/2016",
  "/wiki/Clone_trooper_armor",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Armor",
  "/wiki/Helmet",
  "/wiki/4_BBY",
  "/wiki/Standard_year",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Shattered",
  "/wiki/Victory_and_Death",
  "/wiki/Retcon",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Tribunal",
  "/wiki/Prisoner",
  "/wiki/Coruscant",
  "/wiki/Hyperspace",
  "/wiki/Skirmish_aboard_the_Tribunal",
  "/wiki/Unidentified_moon_(Tribunal)",
  "/wiki/Hyperdrive",
  "/wiki/Ahsoka_(audiobook)",
  "/wiki/Databank_(website)",
  "/wiki/Battle_of_Coruscant",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_Lost_Commanders",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Reproduction",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/32_BBY",
  "/wiki/Star_Wars_Rebels:_Visual_Guide:_Epic_Battles",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars"
 ]
}