{
 "name": "Unidentified_Star_Tours_safety_spokesperson",
 "display_name": "Unidentified Star Tours safety spokesperson",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Star Tours"
     ]
    }
   ]
  }
 ],
 "content": "An unidentified safety spokesperson worked for the Star Tours spaceline around 4 ABY. A female of the Human species, she reminded travelers of the regulations when flying Star Tours. In performing that duty, she was a successor of the WA-7 service unit nicknamed Aly San San, who had filled the role for some time, starting around 1 BBY. Several Other spokespeople also reminded passengers of regulations in other languages than she used.\nAt some point, that spokesperson worked behind the embarkment desk where bookings for the Star Tours Flight 6311 could be made. By departure time, that flight was nearly fully booked, but a conflict suddenly broke out when a Jedi and a Stormtrooper started fighting for the last ticket. Stormtrooper reinforcements soon arrived, and the brawl degenerated under the helpless gaze of the spokesperson. However, when a group of other lightsaber-wielding individuals joined the Jedi in his fight against the Imperials, the desk lady armed herself with a blaster. She attempted to shoot one of the swordsmen, but was quickly disarmed. The turmoil attracted the attraction of Sith Lord Darth Vader and of a hooded Jedi Master, who started dueling. The spokesperson ducked behind her desk during the whole duel, and she only emerged when Vader chose to retreat, putting an end to the conflict. With a look of intense relief, the woman gave the last available flight ticket to the hooded Jedi.\nA female Human with a dark complexion, the spokesperson sported a very distinctive hairdo, which consisted in one single bun on the right side of her head. When appearing on the pre-boarding safety records, she wore a bright-red jacket and put on lipstick of the same color.\nThe safety spokesperson originated in the joint Lucasfilm Ltd.–Walt Disney Company attraction Star Tours, for Disney's Disneyland theme park in Anaheim, California. She was portrayed by Stephanie Taylor. Originally, it was the Missourian actress Jenifer Lewis who had been chosen to play the character. She did a three-hour recording session, but the footage featuring Lewis did not make it into the actual ride. Despite that, Lewis is often credited for portraying the Star Tours spokesperson, even though she explicitly denies it herself.\nOther actors were featured in the safety videos seen in Tokyo Disneyland and Disneyland Paris, speaking in Japanese and French, though droid Aly San San was shown using all language variations in the safety video for Star Tours: The Adventures Continue starting in 2011.\nFor the opening of a revamped Star Tours at Disneyland in Anaheim, a grand ceremony was held in the Tomorrowland section of the park. During that ceremony, the red-clad spokeswoman made an appearance, this time played by a Disneyland Tour Guide named Angela.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Tours/Legends",
  "/wiki/Star_Tours_(real-world)",
  "/wiki/4_ABY/Legends",
  "/wiki/Species/Legends",
  "/wiki/WA-7_service_unit",
  "/wiki/Aly_San_San/Legends",
  "/wiki/1_BBY",
  "/wiki/Unidentified_Star_Tours_safety_spokesperson_(Paris)",
  "/wiki/Unidentified_Star_Tours_safety_spokespeople_(Tokyo)",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Tours_Flight_6311",
  "/wiki/Jedi/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Hair/Legends",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Stephanie_Taylor",
  "/wiki/Star_Tours:_The_Adventures_Continue",
  "/wiki/2011",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Leland_Chee",
  "/wiki/StarWars.com",
  "/wiki/Convenient_Daily_Departures:_The_History_of_Star_Tours",
  "/wiki/June_4",
  "/wiki/June_9",
  "/wiki/April_5",
  "/wiki/2013"
 ]
}