{
 "name": "Unidentified_scout_trooper_(Endor)",
 "display_name": "Unidentified scout trooper  (Endor)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Shaved",
      "later Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Tempest Force",
      "Stormtrooper Corps",
      "Tempest Force"
     ]
    }
   ]
  }
 ],
 "content": "This particular scout trooper was part of the Imperial unit, assigned to guarding the Endor shield generator bunker, Tempest Force. The scout trooper was given the task of holding his position on the far side of the Endor while stationed there. After a year of not receiving any transmissions, he finally left his post, and met a Rebel trooper who had been left on Endor, learning that the Rebels had beaten the Empire at the Battle of Endor.\nThe scout trooper at some point prior to 4 ABY enlisted in the Stormtrooper Corps and became a scout trooper. Like other recruits, he was trained to take orders without any hopes or ideals.\nIn 4 ABY, the scout trooper was part of a group of Imperials selected to guard the Death Star II's shield generator, Tempest Force. At some point prior to the Battle of Endor, him and his squad were assigned to the far side of the moon, after which, they never received any more orders from their superiors. Unbeknownst to them, the Rebels had won the battle and the Empire had retreated from the moon.\nOver the next twelve months the trooper's squad-mates began began to die, leaving an impact on the scout trooper and causing him to finally abandon his position in 5 ABY. One month later, the trooper was riding his speeder bike when its battery died. He soon encountered a Rebel trooper who had also been left behind. The two fought for 45 minutes before they agreed on a truce, though they hardly got along in any friendly capacity. The scout trooper threatened to bring the Rebel trooper in as his prisoner, only when he attempted to subdue the Rebel, he brought not only the Rebel, but himself into a trap created by the native Ewoks.\nThe Ewoks eventually came back to their trap, tying the scout trooper to a log and giving the Rebel trooper food. The scout trooper demanded that the Rebel trooper talk the Ewoks into releasing him upon return to their village, which he did. After being released, they were both given a peace pipe and the scout trooper told the Rebel his history, after which, the Rebel told him his. The scout trooper then pulled out a drawing of the Death Star's shield generator, showing it to the Ewoks and asking them to take him there.\nThe Ewoks led the scout trooper and the Rebel to the location of the shield generator, where they discovered that it had been destroyed and that the Rebels had won the battle. Resigned to being stuck on Endor, the scout trooper nearly gave up, but the Rebel trooper spotted an abandoned AT-ST. While the pair checked the leftover vehicle's power cells, a Gorax attacked the Ewoks that had been leading them. The Rebel trooper used the walker's cannons to kill the beast, much to the chagrin of the scout trooper, who wanted to keep the energy in the power cells. The Rebel trooper then picked up a structure on the walker's radar, about the size of a small city and transmitting an Imperial code.\nWhen they arrived at the location of the signal, they discovered that it wasn't a city, but rather a Star Destroyer that had plummeted to the moon during the battle. The ship had a communication's substation and an operational power plant, and the Rebel trooper managed to contact a passing freighter on a nearby trade route. He also discovered that the signal was an automatic evacuation signal.\nThe next morning, the freighter arrived. The scout trooper, however, decided to stay behind, citing that the Rebel trooper, who had previously said that people like him didn't have a place in peaceful society, was right. The two shook hands and said farewell, and the Rebel trooper boarded the freighter.\nThe scout trooper later grew out his hair and watched the moon's sunsets from on top of an AT-ST.\nThis trooper was never given a name, though the Rebel trooper refers to him as \"Egg Man\" throughout the story. The trooper also uses the curse word \"frell\", from the television series, Farscape.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_scout_trooper",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Tempest_Force",
  "/wiki/Unidentified_Rebel_trooper_(Endor)",
  "/wiki/Marooned",
  "/wiki/Scout_trooper/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Endor/Legends",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Speeder_bike/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/All_Terrain_Scout_Transport/Legends",
  "/wiki/Gorax/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Frell_(expletive)",
  "/wiki/Star_Wars_Tales_22"
 ]
}