{
 "name": "Unidentified_female_Imperial_Knight_(Attack_on_Emperor_Fel)",
 "display_name": "Unidentified female Imperial Knight  (Attack on Emperor Fel)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "130 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Fel Empire",
      "Imperial Knights",
      "Imperial Knights"
     ]
    }
   ]
  }
 ],
 "content": "A brown-haired Human female was an Imperial Knight in the service of Emperor Roan Fel of the Galactic Empire in 130 ABY. When Fel's forces defeated the Galactic Alliance and won the Sith–Imperial War, Fel's Sith allies betrayed him. He discovered an impending murder attempt on him by the Sith Lord Darth Krayt, and fled into exile accordingly. Fel sent four Imperial Knights, including the brown-haired female, against Krayt to distract the Sith Lord while he fled; Krayt arrived at the Imperial Palace on the Empire's throneworld Coruscant and slew all four Knights, proclaiming himself the Emperor of a new Empire.\nIn 130 ABY, a Human female with brown hair was a member of the Imperial Knights, an order of Force-users loyal to Emperor Roan Fel of the Galactic Empire. In that year, she was an agent of deception in a ruse orchestrated by Fel against the Sith Lord Darth Krayt. When the Empire defeated the Galactic Alliance and won the Sith–Imperial War, Fel was informed by Nyna Calixte, the Director of Imperial Intelligence, that his Sith allies intended to betray him. Darth Krayt planned to murder Fel and seize the Imperial throne at an upcoming meeting of the Imperial Moff Council. Before Fel accordingly fled from the Imperial throneworld of Coruscant, he arranged for his double to meet with Krayt in the Imperial Palace and buy him time to escape.\nFel's cousin Mohrgan, an Imperial Knight, volunteered to lead three other Knights against Krayt in order to promote the deception. At the meeting, the brown-haired female, Mohrgan, another female and another male stood with the decoy Emperor as he discussed the fallout of the war with six Moffs. The meeting was interrupted by Krayt and three of his fellow Sith Lords, and Krayt demanded Fel's life. Mohrgan called on his contingent to protect the Emperor, but Krayt ignited two lightsabers and quickly slew them all despite their attempts at a defense. He then struck down the decoy Emperor and proclaimed himself the Emperor of a new Empire. Fel and the remaining Imperial Knights were forced into exile.\nAs an Imperial Knight, the brown-haired female was part of an order whose membership was limited to those who displayed potential in the Force. The Imperial Knights were said to be among the most talented and dangerous Force-users in the galaxy. At Roan Fel's behest, the Imperial Knights did not participate in the Sith–Imperial War; the brown-haired female did see battle with a Sith, however, just after the war's end. She and three of her brethren were quickly dispatched by Darth Krayt's dual lightsabers.\nThe brown-haired female was introduced in the comic series Star Wars: Legacy's first issue , along with three other unidentified Imperial Knights. The issue was written by John Ostrander and penciled by Jan Duursema. Its events were later retold in Legacy's eighth issue , wherein three of the Knights remained unidentified and one was dubbed Mohrgan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/130_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fel_Empire",
  "/wiki/Imperial_Knight",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Battle_of_Caamas",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/One_Sith",
  "/wiki/Death/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Empire-in-exile",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Imperial_Palace/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Attack_on_Emperor_Fel",
  "/wiki/Emperor/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Legacy_(2006)_8",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Morrigan_Corde",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Darth/Legends",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Roan_Fel%27s_double",
  "/wiki/Time/Legends",
  "/wiki/Mohrgan_Fel",
  "/wiki/Unidentified_female_Imperial_Knight_2",
  "/wiki/Unidentified_male_Imperial_Knight_(Attack_on_Emperor_Fel)",
  "/wiki/Moff/Legends",
  "/wiki/Darth_Maladi",
  "/wiki/Darth_Nihl",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/2006",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/2007",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Art_of_War_(Star_Wars_Insider_89)",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Category:Images_of_Unidentified_female_Imperial_Knight_(Attack_on_Emperor_Fel)",
  "/wiki/Legacy_Era_Campaign_Guide"
 ]
}