{
 "name": "Unidentified_Crimson_Dawn_assassin",
 "display_name": "Unidentified Crimson Dawn assassin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3 ABY and 4 ABY",
      "an astronomical object"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "A human female served as an assassin for the resurgent criminal syndicate Crimson Dawn during the Galactic Civil War. Between 3 ABY and 4 ABY, the assassin traveled with a number of other assassins to an astronomical object that housed the lair of Bokku the Hutt. At night time, the assassin, along with a male assassin attempted to make their way when they were attacked by the Sith assassin Ochi, with the male being killed. Ochi explained that he wanted to just talk with the assassin, but she and several other assassins began to surround Ochi as she revealed her alliegance to Crimson Dawn. Ochi killed several of the assassins as he attempted to escape but found himself surrounded again. The Sith assassin then revealed his alliegance to the Sith Lord Darth Vader, to which the Crimson Dawn assassins laughed.\nAs Ochi boasted about how strong Vader was, he asked the female assassin if she was stronger than a summa-verminoth, which had failed to defeat Vader, and she replied that she was. The female then told Ochi that whilst he may be able to kill a dozen of them, could he kill a hundred, a thousand, or even millions of them, and added that each individual was weak, but together they were impossibly strong. Ochi then expressed his intent to kill them, but the assassin told to not do that and join them instead, much to Ochi's confusion.\nAt this point, Ochi saw Vader approaching aboard a shuttle and told the assassins to surrender or die, but was left confused when Vader flew above him with no intention of helping him. The human assassin then informed Ochi that Vader had only arrived to test him, and again told Ochi to join them as there was no other way. In response, Ochi shot the assassin, killing her as he made his way to cover. The Sith assassin was eventually able to kill the Crimson Dawn assassins. Ochi was then joined by Vader, after his loyalty to the Sith Lord had been assured and the pair began to cut down a new batch of assassins who surrounded them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Crimson_Dawn",
  "/wiki/Galactic_Civil_War",
  "/wiki/Assassin",
  "/wiki/Lair_of_Bokku_the_Hutt",
  "/wiki/Time",
  "/wiki/Skirmish_with_Crimson_Dawn",
  "/wiki/Sith_assassin",
  "/wiki/Ochi",
  "/wiki/Death",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Unidentified_summa-verminoth_subspecies",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_Crimson_Dawn_assassin",
  "/wiki/Darth_Vader_(2020)_15",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}