{
 "name": "Unidentified_Pyke_courier_2",
 "display_name": "Unidentified Pyke courier 2",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pyke"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "The male Pyke courier was a member of the Pyke Syndicate who operated on the planet Tatooine around 9 ABY. He and three other Pykes encountered Marshal Cobb Vanth of the town Mos Pelgo while consulting their cargo in the Mos Pelgo territories. Vanth killed the guard's colleagues and let the guard flee on their landspeeder with their credits.\nAround 9 ABY, the male Pyke worked as a courier as part of the Pyke Syndicate. During the syndicate's takeover of the desert planet Tatooine, he and three other Pykes were in Tatooine's Mos Pelgo territories, the four consulting their cargo of spice and credits at their landspeeder by some moisture vaporators. While the Pykes spoke of what to do with the cargo, Marshal Cobb Vanth of Mos Pelgo interrupted the group. The marshal gripped his own pistol to keep the Pykes from making any sudden moves on him. The courier and his colleagues stared at Vanth, who stated that he was in charge of the territories and gave the Pykes a chance to peacefully withdraw and return to the rest of their syndicate.\nWith one of the Pykes, another courier, exchanging nods with a Pyke guard, the group attempted to fire at Vanth, the courier reaching for a weapon in the landspeeder. However, Vanth drew quicker and gunned down the Pykes, excluding the courier. Surrendering, the Pyke raised his hands and the marshal told the courier to warn his bosses that any spice runner passing into his territory will be lost forever. After Vanth had him leave his chest of spice, the Pyke claimed it was worth more than Mos Pelgo, but the marshal joked that he would therefore retire. Leaving the spice behind, the guard hopped into his speeder and left.\nA male Pyke, the courier attempted to take Cobb Vanth by surprise and kill him quickly, but chose to surrender when the marshal swiftly dropped the Pyke's three colleagues. After Vanth fined the courier of his chest of spice, the Pyke compared its value to the town that the marshal controlled.\nThe Pyke courier wore brown and black clothing with a brown belt and boots and a dark helmet with a silver breath mask. He had a weapon and drove a landspeeder.\nThe Pyke guard appeared in \"Chapter 6: From the Desert Comes a Stranger,\" the sixth episode of the Disney+ series The Book of Boba Fett which was directed by Dave Filoni and released on February 2, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pyke",
  "/wiki/Gender",
  "/wiki/Pyke_Syndicate",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/9_ABY",
  "/wiki/Marshal",
  "/wiki/Cobb_Vanth",
  "/wiki/Freetown",
  "/wiki/Mos_Pelgo_territories",
  "/wiki/Death",
  "/wiki/Landspeeder",
  "/wiki/Credit",
  "/wiki/War_for_Tatooine",
  "/wiki/Desert",
  "/wiki/Spice",
  "/wiki/Moisture_vaporator",
  "/wiki/Pistol",
  "/wiki/Unidentified_Pyke_courier_1",
  "/wiki/Pyke_guard",
  "/wiki/Speeder",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Helmet",
  "/wiki/Breath_mask",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Dave_Filoni",
  "/wiki/February_2",
  "/wiki/2022",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Boba_Fett",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor"
 ]
}