{
 "name": "Unidentified_Systech_Corporation_officer",
 "display_name": "Unidentified Systech Corporation officer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 3957 – 3956 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Systech Corporation"
     ]
    }
   ]
  }
 ],
 "content": "A low-ranking commercial officer for Systech Corporation became HK-47's fourth known owner after the previous owner was accidentally killed by the droid.\nAt first, the officer used HK-47 as a protocol and bodyguard droid to increase his importance in the perception of others, but in two months he found out about the droid's assassination protocols. After that, he sent HK on a mission to eliminate workers of a competitor company that was developing a product which, if launched onto the market, would ruin the officer's career.\nWhat the officer did not know was that the \"competing company\" was, in fact, another branch of Systech Corporation. By the time he realized this, HK-47 had already terminated 104 Systech employees with 15 more to go. HK assumed that, being the only officer remaining, his master would be promoted. Instead, he went insane and attacked the droid. While doing so, he pierced one of HK-47's actuators with a writing utensil, resulting in an electric shock that killed him and destroyed the droid's assassination protocols. HK deactivated himself which he did whenever one of his masters died. He assumed that while he was shut down Systech was dismantled and he was auctioned off to a former corporate property and eventually found himself in possession of a Ithorian known as Yuka Laka.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3957_BBY",
  "/wiki/3956_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Systech_Corporation",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/HK-47",
  "/wiki/Unidentified_Human_senator",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Assassin_droid/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Yuka_Laka",
  "/wiki/Revan/Legends",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Darth/Legends",
  "/wiki/Capture_of_Darth_Revan",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Civil_War"
 ]
}