{
 "name": "Unidentified_Chadra-Fan_youngling",
 "display_name": "Unidentified Chadra-Fan youngling",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "A Chadra-Fan male youngling was chased away by an Aleena vendor sometime between 5 BBY and 0 BBY on the planet Ord Mantell. The child later stole the human Jyn Erso's kyber pendant. After fleeing from Erso across rooftops, the child was eventually caught by Erso. When she realized the Chadra-Fan was only hungry, she gave him a fruit that she had purchased from the Aleena vendor. Sometime after 34 ABY, the pirate queen Maz Kanata recounted the youngling's encounter with Erso in a lesson of patience to a visitor of hers.\nSometime between 5 BBY and 0 BBY, a Chadra-Fan male youngling ran by the human Jyn Erso as he was chased by an Aleena vendor on the planet Ord Mantell. The child went to a nearby rooftop where he witnessed the vendor offer many fruits for Erso's kyber pendant, an offer that Erso declined and instead chose to pay for one fruit with a credit chip. As Erso left the vendor's stall, the child followed along the rooftops before sliding down a nearby pole and tricking Erso with misdirection. With Erso's attention diverted, the child stole her pendant and fled to the rooftops.\nEsro nearly caught the boy when he returned to the ground by rolling off a canopy into a vase, but he quickly climbed up a pole and returned to the rooftops. The child crossed a wooden plank connecting two rooftops and tossed it aside before the human could follow. He giggled in victory before Erso pole-vaulted across the gap and continued the chase. The Chadra-Fan dove down a vent and emerged onto the street, believing to have finally eluded his pursuer. He attempted to return to the vendor but was caught by Erso, who explained the importance of her necklace to the child. The child pointed at a bowl of fruit, and Erso realized the child was hungry. She took pity on the boy and gave him the fruit she had purchased earlier, which the Chadra-Fan thanked her for before running off.\nSometime after 34 ABY, the pirate queen Maz Kanata was looking for her dinner when an individual and the Flurrg Roz visited her. Kanata recounted various stories to her visitors as they related to her search. She stressed the significance of keeping an eye on important items and having patience when looking for them when lost before recounting the Chadra-Fan's encounter with Erso.\nThe Chadra-Fan had brown eyes, a pink nose, and two buck teeth. He had brown fur with tufts of tan fur at his wrists. He was clever, as remarked by Jyn Erso when he deceived her and stole her pendant. He was also easily humored, giggling while fleeing from Erso. The youngling was also willing to steal from others when desperate, taking Erso's pendant to pay for fruits when he was hungry.\nThe child wore a reddish-brown robe with a white vest and tan sash over it, along with black shoes.\nThe Chadra-Fan youngling first appeared in \"Jyn's Trade,\" the fourth episode of the second season of the Star Wars: Forces of Destiny animated micro–series. The episode premiered on the official Disney YouTube channel on March 19, 2018. The Chadra-Fan went uncredited in the episode itself, but the character was credited in Star Wars: Forces of Destiny: Volume 3, a compilation featuring all eight episodes of the second season released on May 18 in the same year. Identified as \"Child,\" he was voiced by Catherine Taber.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Chadra-Fan_(disambiguation)",
  "/wiki/Chadra-Fan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/File:DontComeBack.ogg",
  "/wiki/Aleena",
  "/wiki/Unidentified_Aleena_vendor",
  "/wiki/5_BBY",
  "/wiki/0_BBY",
  "/wiki/Planet",
  "/wiki/Ord_Mantell",
  "/wiki/Youngling",
  "/wiki/Thief",
  "/wiki/Human",
  "/wiki/Jyn_Erso",
  "/wiki/Jyn%27s_kyber_pendant",
  "/wiki/Fruit",
  "/wiki/34_ABY",
  "/wiki/Pirate_king",
  "/wiki/Maz_Kanata",
  "/wiki/File:JynsGivesFruit.ogg",
  "/wiki/Credit_chip",
  "/wiki/Necklace",
  "/wiki/Wood",
  "/wiki/Foodstuff",
  "/wiki/Flurrg",
  "/wiki/Roz_(Flurrg)",
  "/wiki/File:CleverBoy.ogg",
  "/wiki/Eye",
  "/wiki/Nose",
  "/wiki/Tooth",
  "/wiki/Hair",
  "/wiki/Limb",
  "/wiki/Robe",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Jyn%27s_Trade",
  "/wiki/Forces_of_Destiny:_Season_Two",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/March_19",
  "/wiki/2018",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Volume_3",
  "/wiki/May_18",
  "/wiki/Catherine_Taber",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Category:Audio_files_of_unidentified_Chadra-Fan_youngling",
  "/wiki/Category:Images_of_unidentified_Chadra-Fan_youngling",
  "/wiki/Saw_Gerrera",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Standard_year",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Reproduction",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/22_BBY",
  "/wiki/21_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Death",
  "/wiki/Shuttle_Shock",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_ABY",
  "/wiki/Databank_(website)",
  "/wiki/March_16"
 ]
}