{
 "name": "Unidentified_Republic_soldier_(Undercity)",
 "display_name": "Unidentified Republic soldier  (Undercity)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Republic Army"
     ]
    }
   ]
  }
 ],
 "content": "During the Jedi Civil War, a Human male Republic soldier was a crew member of the Hammerhead-class cruiser Endar Spire. When the ship was attacked and boarded by the Sith over the planet Taris, he fled the Endar Spire along with several others in an escape pod, crashing in the planet's Undercity. Following the crash, the soldier's companions were killed by rakghoul creatures, while he was wounded and contracted the rakghoul plague. Several days later, the man was found and cured by fellow Republic soldier Revan but was killed by rakghouls immediately thereafter.\nA Human male soldier served the Galactic Republic Army during the Jedi Civil War against the forces of the Sith Lord Darth Malak's Sith Empire. In 3956 BBY, the soldier served aboard the Hammerhead-class cruiser Endar Spire under the command of Jedi Knight Bastila Shan. That year, the Endar Spire was dispatched along with a Jedi battle fleet to engage Malak's invasion fleet at the planet Taris. A battle erupted in space above Taris, and the Endar Spire was boarded by the Sith, who attempted to capture Shan. However, she was able to flee the ship in an escape pod, and with their prey gone, the Sith were willing to destroy the Republic vessel. The soldier and several other crewmen managed to reach an escape pod and jettison shortly before the Endar Spire's destruction.\nAs the survivors' escape pod plummeted toward Taris, the soldiers picked up a signal from Shan's own pod. Just before they reached the planet's Undercity, the escapees tracked Shan's pod, seeing as it went down somewhere to the west. Soon, their own pod also crashed in the Undercity, and they lost the signal from Shan's craft. When the surviving soldiers emerged from their escape pod, they were attacked by vicious rakghoul creatures that killed everyone except for the soldier. The man was wounded and contracted the rakghoul plague, however, which would eventually turn him into a rakghoul as well. Feeling immense pain and terrified by the rakghouls roaming nearby, the soldier survived for several days near the downed escape pod.\nEventually, the man was found by fellow Republic soldiers Revan and Carth Onasi, two other survivors from the Endar Spire, who were searching for Shan. Still experiencing the effects of the plague, the man asked the two for help, and Revan gave him rakghoul serum, which he had just found while searching the remains of a Sith trooper nearby. The man injected himself with the serum and was immediately cured of the disease. Revan questioned him about Shan, and the man revealed to him what he knew about her pod's crash site. However, the soldier then believed that he heard the rakghouls moving closer—even though Revan heard nothing—and the man felt that the creatures were coming back to finish him. Frightened, the soldier bolted away but ran into a group of rakghouls and was killed by them.\nThe Republic soldier was deeply affected by the sight of his comrades getting slaughtered by rakghouls. He was very frightened of the creatures, which ultimately led to his demise when he tried to escape from them in a panic. The man had black hair, brown eyes and fair skin.\nThis Republic soldier appeared as a non-playable character in the 2003 video game Star Wars: Knights of the Old Republic. The player, controlling Revan, can meet him in the Undercity, though the nature of the encounter is such that it does not progress the game's storyline and is not necessary to complete the game. However, giving the rakghoul serum to the soldier rewards the player with light side points. Upon meeting the infected soldier, the player may also tell him to stay away or refuse to give the serum to him until he reveals some useful information. In both cases, the soldier will transform into a rakghoul and will attack Revan. The same also happens if the player has not obtained the serum yet but promises to find something to help. If the player approaches the soldier after Bastila Shan has already been rescued and gives him the serum, the option to ask him about Shan's pod will not be available, and the soldier will run away to his death immediately after injecting himself with the serum.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3956_BBY",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Army",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Jedi_Civil_War",
  "/wiki/Hammerhead-class_cruiser",
  "/wiki/Endar_Spire",
  "/wiki/Starship/Legends",
  "/wiki/Attack_on_the_Endar_Spire",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Planet/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Undercity_(Taris)",
  "/wiki/Soldier/Legends",
  "/wiki/Death/Legends",
  "/wiki/Rakghoul",
  "/wiki/Rakghoul_plague",
  "/wiki/Rakghoul_serum",
  "/wiki/Revan/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Carth_Onasi",
  "/wiki/Rescue_of_Bastila_Shan",
  "/wiki/Unidentified_Sith_trooper_(Rakghoul_serum)",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Chronicles_of_the_Old_Republic"
 ]
}