{
 "name": "Unidentified_stormtrooper_(Brighthome)",
 "display_name": "Unidentified stormtrooper  (Brighthome)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Brighthome"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Shortly after the recapture of Vader's starship in 19 BBY, a stormtrooper who was stationed aboard the Jedi space station Brighthome and led several other former clone troopers onboard against a perceived Jedi, who was in reality Sith apprentice Darth Vader. In the ensuing fight, all of the clone stormtroopers were killed. The trooper had slightly modified phase II clone trooper armor, as he had enlarged shoulder pad armor.\nIn 19 BBY, shortly after the recapture of Vader's starship, the stormtrooper, along with a contingent of other troopers and four ARC-170 starfighters, was deployed to the Brighthome, a Jedi outpost in the Mid Rim. He and his troops were tasked with collecting and archiving the artifacts within the space station. As two clone stormtroopers, Ding and Kicker were bickering at what lay ahead now that the Clone Wars was over, the stormtrooper was observing an unknown starship approaching via hologram, and told Ding and Kicker to focus as they were about to have company.\nThe vessel was in fact the starship of Sith apprentice Darth Vader, who had been dispatched by Imperial Emperor Darth Sidious to find a living Jedi and take their kyber crystal, and sought to get access to a Jedi databank. After Vader chose not to give the authorization codes for Brighthome and instead kill the stormtrooper force at the station, he engaged the four security ARC-170 starfighters, destroying them. After witnessing the feat by a display screen onboard the station, the stormtroopers remarked that they were astonished on the skills of the pilot. Before one could suggest, the stormtrooper stated to the others not to even mention that the pilot was a Jedi, as they were all dead. The trooper continued, and informed the others that whoever the pilot was, he managed to deactivate the station's security protocols and that he was going to dock. The trooper ordered the others that they had to defend the Brighthome and to head to the hangar deck immediately. As Vader was almost finished breaching a security door, the stormtrooper told the others to ready themselves and that he was about to breach.\nAs Vader bursted through the door, the stormtrooper ordered the others to eliminate the threat, and Vader used Force deflection to defend against the incoming lasers, while using the Force to kill several stormtroopers, despite being hit several times. The stormtrooper ordered the others to keep up the pressure and concentrate fire as Vader killed more stormtroopers and used the Force to collect a lightsaber from a wall in the room. As Vader cut through several more clone stormtroopers, the stormtrooper ordered the remaining troopers to fall back and regroup, before being sliced across the abdomen, killing him before he could complete his order. As the two survivors, Ding and Kicker, retreated, Vader accessed the databank, and order his droid to search the system for any Barash Vow-takers.\nAs the droid was conducting the search, Ding and Kicker threw a grenade at Vader, but it did not explode as Vader used the Force to hold back the explosion. As the search was complete and Vader learned of Jedi Master Kirak Infil'a, he Force choked Ding and Kicker, killing them and set off the grenade as he was leaving. As Vader left the Brighthome in his starship, the hangar exploded, damaging the station.\nAs a human male clone of the bounty hunter Jango Fett, the stormtrooper measured at 1.83 meters. After the execution of Order 66, the stormtrooper could not believe that Vader, unknown to him on who he was, could be a Jedi, as he believed that they had killed all of them. Unconcerned, the stormtrooper led his forces against the threat, and sought to defend the station despite the odds.\nDespite facing unfavorable odds and an unknown enemy, the stormtrooper held his ground and was able to order his fellow stormtroopers until his death.\nThe stormtrooper was equipped with a slightly modified set of phase II clone trooper armor. A cut on the helmet intersected the visor on the right side, and had large shoulder pad armor. He utilized a blaster rifle during combat.\nThe stormtrooper first appeared, albeit unnamed, in Darth Vader  2, a canon comic written by Charles Soule and penciled by Giuseppe Camuncoli that was released in 2017.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Brighthome",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Recapture_of_Vader%27s_starship",
  "/wiki/Jedi",
  "/wiki/Space_station",
  "/wiki/Clone_trooper",
  "/wiki/Sith_apprentice",
  "/wiki/Anakin_Skywalker",
  "/wiki/Attack_on_Brighthome",
  "/wiki/Stormtrooper",
  "/wiki/Death",
  "/wiki/Trooper",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Armor",
  "/wiki/Aggressive_ReConnaissance-170_starfighter",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Ding",
  "/wiki/Kicker",
  "/wiki/Clone_Wars",
  "/wiki/Starship",
  "/wiki/Hologram",
  "/wiki/Vader%27s_starship",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Kyber_crystal",
  "/wiki/Databank",
  "/wiki/Pilot",
  "/wiki/Hangar",
  "/wiki/Force_deflection",
  "/wiki/Laser",
  "/wiki/Force_power",
  "/wiki/The_Force",
  "/wiki/Lightsaber",
  "/wiki/Darth_Vader%27s_droid",
  "/wiki/Barash_Vow",
  "/wiki/Droid",
  "/wiki/Grenade",
  "/wiki/Jedi_Master",
  "/wiki/Kirak_Infil%27a",
  "/wiki/Force_choke",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Order_66",
  "/wiki/Blaster_rifle",
  "/wiki/Darth_Vader_(2017)_2",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/2017",
  "/wiki/Category:Images_of_Unidentified_stormtrooper_(Brighthome)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}