{
 "name": "Unidentified_clone_trooper_(332nd_Company)",
 "display_name": "Unidentified clone trooper  (332nd Company)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "aboard the Tribunal",
      "a moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "332nd Company",
      "332nd Company"
     ]
    }
   ]
  }
 ],
 "content": "A clone trooper was a member of the 501st Legion's 332nd Company during the end of the Clone Wars. After the end of the Siege of Mandalore, the trooper was onboard the Tribunal, a Venator-class Star Destroyer travelling from Mandalore to Coruscant, when Order 66 was issued, forcing the clones to turn against their Jedi Generals. He subsequently participated in the hunt for former Padawan Ahsoka Tano, who had been serving as the unofficial commander of the division during the Siege. After Tano released the rogue Sith Lord Maul, a prisoner on the ship, as a diversion, the clone trooper was injured by Maul when he used telekinesis to sever his arm in a closing blast door, allowing for the theft of his wrist comm to eavesdrop on the clones. He was then killed when the Star Destroyer crashed into a moon.\nIn 19 BBY, the clone trooper was a member of the 332nd Company that accompanied former Jedi Padawan Ahsoka Tano during the Siege of Mandalore. After the conclusion of the battle, the trooper, along with the rest of the company, left Mandalore aboard the Venator-class Star Destroyer Tribunal. Shortly afterwards, Darth Sidious issued Order 66, which forced the clones to turn on and kill their Jedi commanding officers. When the 332nd Company obeyed the order and attacked Tano, she barely escaped from the bridge of the Venator and made her way to the detention area to free Maul, who had been captured on Mandalore, in an attempt to distract the clones. Tano then set out to discover the cause of the clones' behavior, before capturing Clone Commander Rex to free him from it by removing his control chip.\nMaul went on to fight numerous clones and, eventually, he reached a hallway where the trooper and his comrades opened fire on him. The renegade Sith tore off pieces of the hallway with the Force and used them as shields from the clones' blaster fire, as well as throwing them at the clones to kill them. While slaughtering his way through the clones, Maul took out \"Ridge\" and another clone by impaling them with a piece of a wall. With only the trooper and two other soldiers alive, he reported to Rex, who was still mind-controlled at the time, about Maul's advance and that he was heading towards the hangar. Shortly after, Maul grabbed the two other clones' blasters and threw them away, leaving them unarmed. This clone, who still had his blaster, covered for the other troopers as they closed the blast door on Rex's orders. He kept firing at Maul as he ran toward the doors as well. He made it past the door, but, as it was closing, Maul grabbed his arm with the Force, holding it in place so the limb would be severed by the closing door.\nAnother clone took hold of his arm and tried to pull him back, but was unsuccessful. The trooper's arm was severed by the closing blast door, and Maul knelt to listen to the chatter on the wrist comm attached to the arm, including Rex attempting to get a response from the trooper regarding directing Maul's approach. Maul then stole the comlink and used it to avoid the clones on his way to the hyperdrive, which he destroyed, causing the Star Destroyer to crash on a moon, killing this trooper and everyone else who was still onboard the ship. The only survivors were Maul, who had escaped via a Nu-class attack/transport shuttle; and Tano and Rex, who survived by taking control of a BTL-B Y-wing starfighter/bomber. In the aftermath, Tano and Rex went to the ship's crash site, with Rex gathering supplies and Tano burying the dead clones, using their helmets on poles as memorials.\nAs a clone of Jango Fett, he stood 1.83 meters tall. The trooper was brave, continuing to fire on Maul as the Sith Lord slaughtered his way through his comrades. He was also anxious when he told the other two clones to seal the door, as he knew the former Sith would not hesitate to kill them. Like all of the other clones onboard the Star Destroyer, he was brainwashed by his control chip to obey Order 66.\nThis clone trooper wore Phase II clone trooper armor, painted in the markings of the 501st Legion and 332nd Company, including a helmet patterned after Ahsoka Tano's Togruta facial markings. He also carried a DC-15A blaster carbine.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_clone_trooper",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Tribunal",
  "/wiki/Unidentified_moon_(Tribunal)",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/332nd_Company",
  "/wiki/Shattered",
  "/wiki/501st_Legion",
  "/wiki/Clone_Wars",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Trooper",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Mandalore",
  "/wiki/Coruscant",
  "/wiki/Order_66",
  "/wiki/Skirmish_aboard_the_Tribunal",
  "/wiki/Jedi_General",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Commander",
  "/wiki/332nd_Division",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Prisoner",
  "/wiki/Starship",
  "/wiki/Clone_trooper",
  "/wiki/Telekinesis",
  "/wiki/Limb",
  "/wiki/Blast_door",
  "/wiki/Wrist_comm",
  "/wiki/Death",
  "/wiki/Star_Destroyer",
  "/wiki/Jedi",
  "/wiki/Company",
  "/wiki/Darth_Sidious",
  "/wiki/Commanding_officer",
  "/wiki/Bridge_(starship)",
  "/wiki/Prison",
  "/wiki/Clone_Commander",
  "/wiki/Rex",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Sith",
  "/wiki/The_Force",
  "/wiki/Blaster",
  "/wiki/Ridge",
  "/wiki/Soldier",
  "/wiki/Brain",
  "/wiki/Time",
  "/wiki/Hangar",
  "/wiki/Hyperdrive",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/BTL-B_Y-wing_starfighter/bomber",
  "/wiki/Helmet",
  "/wiki/Jango_Fett",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Togruta",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Clone_template",
  "/wiki/Planet",
  "/wiki/Victory_and_Death",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!"
 ]
}