{
 "name": "Unidentified_Clawdite_bounty_hunter",
 "display_name": "Unidentified Clawdite bounty hunter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Clawdite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dusky",
      "grayish green"
     ]
    }
   ]
  }
 ],
 "content": "A Clawdite shape-shifter bounty hunter took the identity of the Galactic Republic Clone trooper Sharp during the Clone Wars during the Mission to Kynachi in 22 BBY. The Clawdite joined Breakout Squad and Padawan Nuru Kungurama along with the crew of the vessel Hasty Harpy. After leaving Kynachi, they became trapped near a black hole with pirates, but managed to escape. He had been hired by Asajj Ventress to sabotage the mission.\nThe Clawdite and his squad were then sent on a mission to the planet Vaced to escort Kynachi's Commissioner, Langu Sommilor. After landing, Sommilor was assassinated by a Death Watch sniper. \"Sharp\" rescued Kungurama after the latter dueled the sniper at Shattered Rock canyon. The Hasty Harpy was shot down by the Death Watch's vessel, so Breakout Squad found other transportation to Bilbringi Depot to search for Kungurama's missing Jedi Master, Ring-Sol Ambase. They did not find Ambase, but they freed the depot from Techno Union Overseer Umbrag. They also once again met the Chiss Ambassador Veeren. As she left, her ship was destroyed by one piloted by Ambase, who fled after the incident. \"Sharp\" almost had his ruse revealed by a B1-Series battle droid, but he avoided exposure.\nOn the voyage back to Coruscant, he was forced to shoot Oveseer Umbrag, who had gotten ahold of Kungurama. Ventress later ordered him to help Umbrag escape. Soon after, in an incident in the Dacho District on Coruscant, the real Sharp discovered the ruse and tackled the Clawdite. The two fell through a skylight, and the fall killed the Clawdite.\nA Clawdite bounty hunter, who could shape-shift, took the identity of the Galactic Republic Clone trooper Sharp during the Clone Wars in 22 BBY. The Clawdite, a male individual, surreptitiously replaced Sharp during the Mission to Kynachi and took the Clone's place in Breakout Squad, while the Jedi General Ring-Sol Ambase and Sharp were captured and put in the hands of the Confederacy of Independent Systems' leader Count Dooku. Breakout Squad, the Clawdite, and Ambase's Padawan Nuru Kungurama joined with Captain Lalo Gunn and her navigation droid Cleaver and left Kynachi in Gunn's starship, the Hasty Harpy. The Clawdite took Sharp's place after Asajj Ventress captured him, and the Clawdite sabotaged the life pods during the mission.\nThis Clawdite joined Breakout Squad and Captain Gunn on its mission to Chiss space. The Clawdite sabotaged the navigation system, causing them to end up near a black hole and experience and their misadventures with the Black Hole Pirates. They eventually escaped the black hole and set a course back to Coruscant, the Republic capital planet.\nWhile en route to Coruscant, the Clawdite, still masquerading as Sharp, was conducting a systems check with Breaker on the Hasty Harpy. Breaker noticed a broadcast signal and thought the ship had a tracking device on it. Republic Supreme Chancellor Palpatine and Jedi Grand Master Yoda contacted the Hasty Harpy via Hypercomm and asked them to divert to Vaced to rendezvous and escort Kynachi's Commissioner, Langu Sommilor. The Hasty Harpy was five hours from Vaced, while Sommilor's ship was six hours away. The Clawdite took Sharp's place after Asajj Ventress captured him, and the Clawdite sabotaged the life pods during the mission.\nOnce they landed on Vaced, the Clone troopers and Kungarama disembarked the Hasty Harpy at Vaced Spaceport. They were confronted by a swoop gang looking to collect insurance payments, but Kungarama used a mind trick to force them to dispense. \"Sharp\" then offered to be a lookout, but Kungarama asked him to search the ship for a transmitter. Cleaver found the tracking device but it was forgotten in the following events. The Kynachi leader and his pilots soon landed nearby, but was hit by a sniper as he was disembarking. The Clones ran for cover while Kungarama chased after the sniper.\nThe Clones went back on the Hasty Harpy to rescue the Padawan after he fought the sniper, a Mandalorian Death Watch member. The Harpy was attacked by the Mandalorian's transport. The Harpy shot down the other vessel but was damaged in the process and crashed near Vaced's spaceport. Breakout Squad and Captain Gunn parted ways; the Republic troopers, along with the rogue swoop rider, Gizman, took the deceased Kynachi ambassador's ship. Kungarama had found a belt belonging to his Master, Ambase, which had an imagecaster with coordinates leading to Bilbringi Depot. The Clones arrived there and captured Techno Union Overseer Umbrag. After the facility was secured, Chiss Ambassador Veeren arrived. She revealed that it was she who had planted the tracking device Cleaver still carried on his chassis, and that it appeared someone was manipulating Breakout Squad. Kungarama was confused, but Veeren left just as quickly as she arrived. As her ship was preparing to jump to hyperspace, a Kuat Drive Yards Corona-class transport arrived. Veeren's shp fired on the Corona; return fire from the Kuat transport destroyed her ship. Kungarama Force sensed that his missing Master, Ambase, was onboard the Corona. Breakout Squad could only watch while Ambase's ship fled.\nA hidden battle droid then surprised them by shooting Chatterbox in the back. Kungarama bisected the droid with his lightsaber, then ordered the Clones to search the depot for more droids. \"Sharp\" offered to search the hatch. Once inside the empty corridor, he removed his helmet and reverted to his true form. He thought what would have happened if the droid had shot him instead. Taking a deep breath and replacing his helmet, he adopted his Sharp disguise again and returned to the others.\nAfter the battle, the Clawdite contacted Ventress, and gave her an update. She told him she would call again in an hour and signed off. Breakout Squad then boarded Summilor's freighter, bound for Coruscant. During the trip, Umbrag grabbed the young Jedi, forcing the Clawdite to shoot him. At Coruscant, Ventress made contact and ordered the bounty hunter to help the overseer escape, and cut him off before he could explain that Umbrag was dead. Kungurama directed the ship to the Dacho District, where it was damaged. The real Sharp had already arrived with Master Ambase, and when Sharp saw the Clawdite, he tackled the impostor and they fell through a skylight. Sharp fell on top of him, and the Clawdite died when he landed. His body was turned over to Republic Intelligence, but after five days he had not been identified.\nThe Clawdite used his natural shape-shifting abilities to impersonate a Clone trooper. \"Sharp\" often commented on how sharp his eyesight was, which was the basis for his nickname. During the mission to Vaced, the Clawdite's fellow Breakout Squad member Breaker noticed he was acting strange and thought he should go see the Clone counselors. The bounty hunter worried that Ventress would kill him if he failed.\nThe second \"Sharp\" was introduced in the second Secret Missions book. Subtle hints were dropped throughout The Clone Wars: Secret Missions 3: Duel at Shattered Rock that the \"Sharp\" traveling with Breakout Squad was not the real one; he was revealed to be a Clawdite shapeshifter during the book's denouement.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Clawdite/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Shape-shifters",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/CT-4012",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Mission_to_Kynachi",
  "/wiki/Breakout_Squad",
  "/wiki/Padawan/Legends",
  "/wiki/Nuru_Kungurama",
  "/wiki/Starship/Legends",
  "/wiki/Hasty_Harpy",
  "/wiki/Kynachi",
  "/wiki/Black_hole/Legends",
  "/wiki/Black_Hole_Gang/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Mission_to_Vaced",
  "/wiki/Planet/Legends",
  "/wiki/Vaced/Legends",
  "/wiki/Commissioner/Legends",
  "/wiki/Langu_Sommilor",
  "/wiki/Death_Watch/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/Shattered_Rock",
  "/wiki/Hudu_Shiv%27s_Pursuer-class_enforcement_ship",
  "/wiki/Bilbringi_Depot",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ring-Sol_Ambase",
  "/wiki/Techno_Union/Legends",
  "/wiki/Overseer_(CIS)",
  "/wiki/Umbrag",
  "/wiki/Chiss/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Sev%27eere%27nuruodo",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Dacho_District",
  "/wiki/Death/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/General/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Lalo_Gunn",
  "/wiki/2JTJ_personal_navigation_droid",
  "/wiki/Cleaver",
  "/wiki/Escape_pod/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Unidentified_Clawdite_bounty_hunter",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/The_Clone_Wars:_Secret_Missions_3:_Duel_at_Shattered_Rock",
  "/wiki/CT-8863",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Hypercomm/Legends",
  "/wiki/Vaced_Spaceport",
  "/wiki/Swoop/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Gizman",
  "/wiki/Imagecaster/Legends",
  "/wiki/Kuat_Drive_Yards/Legends",
  "/wiki/Corona-class_transport",
  "/wiki/Force_sense/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/The_Clone_Wars:_Secret_Missions_4:_Guardians_of_the_Chiss_Key",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Clone_counselors",
  "/wiki/The_Clone_Wars:_Secret_Missions_2:_Curse_of_the_Black_Hole_Pirates",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars:_Secret_Missions",
  "/wiki/The_Clone_Wars:_Secret_Missions_1:_Breakout_Squad"
 ]
}