{
 "name": "Unidentified_Gungan_villager_(Otoh_Raban)",
 "display_name": "Unidentified Gungan villager  (Otoh Raban)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gungan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Otoh Raban"
     ]
    }
   ]
  }
 ],
 "content": "A Gungan villager lived in the city of Otoh Raban on the planet Naboo in 3000 BBY. During a war between the Gungan tribes at that time, the villager witnessed the kidnapping of the city's leader, Boss Hoxie, by the Gungan warlord Rogoe. The villager later told Rogoe's rival, Gallo, about the Boss's abduction, and joined Gallo's cause when the latter rescued Hoxie.\nA Gungan villager lived in the city of Otoh Raban, under the leadership of Boss Hoxie, on the planet Naboo in the year 3000 BBY, During a war between the Gungan tribes at that time, the villager saw the kidnapping of Hoxie committed by the forces of the Gungan warlord Rogoe in order to cause Otoh Raban to continue fighting in the conflict in the absence of their leader. Later, the villager encountered Boss Gallo, a Gungan who was attempting to unite the tribes against Rogoe, and the villager told him of Hoxie's kidnapping, and also warned that Otoh Raban would keep fighting until their Boss was returned. Gallo agreed to rescue Hoxie to gain Otoh Raban's allegiance and, after following up rumors of a prison camp north of Otoh Raban that belonged to Rogoe, found Hoxie there and brought him back to his city. The villager thanked Gallo for rescuing Hoxie, and they, along with the rest of Otoh Raban, joined Gallo's crusade against Rogoe.\nThe Gungan villager lived under the leadership of Boss Hoxie and was willing to ask for Gallo's help in recovering Otoh Raban's leader during his capture. The villager was also convinced that Otoh Raban would remain in the war if Hoxie was not returned safely but was ready to join Gallo's cause as soon as the Boss was rescued.\nThe Gungan villager's voice is heard in the 2001 LucasArts video game Star Wars: Galactic Battlegrounds, and also in its 2002 expansion, Clone Campaigns. In the game's credits, two actors are credited as voicing Gungan villagers, Rob Paulsen and Grey DeLisle, but it is not identified which one, if either, voiced this villager.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Otoh_Raban",
  "/wiki/Unidentified_Gungan_villager_(Otoh_Sancture)",
  "/wiki/Otoh_Sancture",
  "/wiki/Naboo/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/File:GN2_TRECG_L26.ogg",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/City/Legends",
  "/wiki/Planet/Legends",
  "/wiki/3000_BBY",
  "/wiki/War_of_the_Gungan_tribes",
  "/wiki/Time/Legends",
  "/wiki/Kidnapping_of_Hoxie",
  "/wiki/Boss/Legends",
  "/wiki/Hoxie",
  "/wiki/Warlord/Legends",
  "/wiki/Rogoe/Legends",
  "/wiki/Gallo/Legends",
  "/wiki/Battle_of_the_Forest_Cities",
  "/wiki/Standard_year/Legends",
  "/wiki/Rogoe%27s_army",
  "/wiki/Gender/Legends",
  "/wiki/Rogoe%27s_stronghold",
  "/wiki/2001",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/2002",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Rob_Paulsen",
  "/wiki/Grey_Griffin",
  "/wiki/The_Essential_Atlas"
 ]
}