{
 "name": "Unidentified_Mandalorian_police_captain_(bank)",
 "display_name": "Unidentified Mandalorian police captain  (bank)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Mandalorians",
      "Mandalorian Guard",
      "Mandalorian Guard"
     ]
    }
   ]
  }
 ],
 "content": "This Mandalorian police captain served in the Mandalorian Guard of the New Mandalorian government during the Clone Wars. When the Shadow Collective launched their takeover of Mandalore, the Mandalorian police captain was stationed at the Mandalore Banking Center where he and his police officers engaged members of the Black Sun, Pyke Syndicate, and Savage Opress.\nThis male Mandalorian served as a captain in the Mandalorian Guard during the Clone Wars. In 19 BBY, the captain was stationed in the Mandalore Banking Center on Sundari, the capital city of the planet Mandalore. During this time, the Shadow Collective, led by Darth Maul, Savage Opress, and secretly allied with Death Watch, launched a takeover of Mandalore. During the takeover, gangsters attacked critical targets throughout the planet that were vital to Mandalore's security.\nOne target was the Mandalore Banking Center, and while the captain and a fellow Mandalorian Guard member were outside patrolling, a hover taxi carrying Minister Lom Pyke of the Pyke Syndicate and members of the Black Sun arrived. The captain ordered his subordinate to lock the vaults as the criminals were preparing to attack, and when Minister Lom told them to move aside, the captain ordered for several other guards to move in and called for additional reinforcements.\nOpress revealed himself and ignited his lightsaber to the captain and the other guards after the Minister Lom and the Black Sun Guards moved aside. The captain ordered his forces to attack the thugs, but Opress managed to deflect the laser bolts back to the Mandalorian police forces, killing all except the captain and a fellow officer. After this, the captain and the other survivor moved back as the criminal forces moved in.\nThe captain was a human male who was a Mandalorian with light skin. When faced against a group of armed criminals and Opress with a lightsaber, the captain did not retreat but rather stood his ground.\nThe captain was able to wield a WESTAR-35 blaster pistol and a shield simultaneously during combat.\nThe captain, as a member of the Mandalorian Guard, was outfitted with the standard armored uniform of the guard. Due to his rank, his helmet had a single viewport rather than two small ones and he had a rank insignia on his left shoulder armor plate. He utilized a WESTAR-35 blaster pistol and a shield during combat.\nThis Mandalorian police captain first appeared in \"Shades of Reason,\" the fifteenth episode of the fifth season of Star Wars: The Clone Wars and was released in January 26, 2013.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Unidentified_Mandalorian_police_captain",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Mandalorians",
  "/wiki/Mandalorian_Guard",
  "/wiki/Shades_of_Reason",
  "/wiki/Clone_Wars",
  "/wiki/Shadow_Collective",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Mandalorian",
  "/wiki/Law_enforcement_agency",
  "/wiki/Captain",
  "/wiki/Mandalore_Banking_Center",
  "/wiki/Black_Sun",
  "/wiki/Pyke_Syndicate",
  "/wiki/Savage_Opress",
  "/wiki/19_BBY",
  "/wiki/Sundari",
  "/wiki/City",
  "/wiki/Planet",
  "/wiki/Mandalore",
  "/wiki/Time",
  "/wiki/Maul",
  "/wiki/Death_Watch",
  "/wiki/Gangster",
  "/wiki/Hover_taxi",
  "/wiki/Minister",
  "/wiki/Lom_Pyke",
  "/wiki/Savage_Opress%27s_lightsaber",
  "/wiki/Black_Sun_Guard",
  "/wiki/Death",
  "/wiki/Lightsaber",
  "/wiki/WESTAR-35_blaster_pistol",
  "/wiki/Shield_(physical_armor)",
  "/wiki/Armor",
  "/wiki/Blaster_pistol",
  "/wiki/The_Clone_Wars:_Season_Five",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/January_26",
  "/wiki/2013",
  "/wiki/Officer"
 ]
}