{
 "name": "Unidentified_Verpine_smuggler",
 "display_name": "Unidentified Verpine smuggler",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 4 ABY",
      "above Abednedo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Verpine"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "A male Verpine operated as a smuggler during the Galactic Civil War. The smuggler was contacted by former Imperial forces on the planet Abednedo, who requested to be discreetly transported offworld. Instead, the Verpine contacted the New Republic, selling the Imperials out to the new government. The New Republic's Alphabet Squadron, led by Lieutenant Yrica Quell, were sent to investigate the claims. Quell met with the Verpine, who showed her the captives. Quell and her squadron attempted to escort the smuggler and his light freighter to the New Republic, but several TIE bombers attacked as they left Abednedo. Alphabet Squadron attempted to defend the smuggler, but one of the bombers collided into the freighter, destroying it and killing both the Verpine and the Imperial captives.\nDuring the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, the Verpine worked as a smuggler. In the weeks following the Imperial defeat at the Battle of Endor and the resulting Operation: Cinder campaign, the smuggler was approached by a number of Imperials on the planet Abednedo, who had survived the Empire's failed attack on Abednedo during Operation: Cinder, and wished for safe transport to flee the New Republic. However, the Verpine betrayed the Imperials, selling them out to the New Republic. After receiving a coded transmission regarding the presence of Imperial survivors from the Verpine, the New Republic sent the newly-created starfighter squadron nicknamed Alphabet Squadron to verify the information and locate the supposed holdouts.\nLed by Lieutenant Yrica Quell, Alphabet Squadron pilots Chass na Chadic and Kairos landed on Abednedo in the city of Neshorino. Quell and Chadic encountered the Verpine within the House of Strangers, the section of the city reserved for non-Abednedos, but Quell initially believed that he was a street trader. Speaking through a comlink via a broken protocol droid, the Verpine confirmed that Quell and Chadic were with the New Republic, and requested payment. When the New Republic pilots asked for proof of Imperial holdouts, the Verpine showed them one of the captured Imperial prisoners.\nThe Verpine offered to show the pilots the rest of the Imperials, and Quell chose to follow the smuggler while Chadic took the prisoner back to Kairos's U-wing. The smuggler escorted Quell to the light freighter where the remainder of the prisoners had been kept. While Quell, a former Imperial herself, was horrified at what the Verpine had done, she accepted the deal, asking what price he requested.\nHowever, while Chadic was returning the first prisoner to the U-wing, a number of Imperials attacked her. Kairos killed the Imperials, but the attack forced Alphabet Squadron to leave Abednedo. The Verpine agreed to fly the freighter full of prisoners back to the New Republic cruiser Lodestar, but required Quell to escort him. Shortly after the attack on Chadic and Kairos, the cavern where the Verpine's freighter was located also came under attack, and Quell protected the freighter in her X-wing.\nAs the ships left Abednedo, they were pursued by TIE bombers, and the rest of the Alphabet Squadron pilots helped to defend the Verpine's freighter. The pilots managed to destroy two of the TIEs, but one managed to escape, and headed for the freighter. Quell and fellow pilot Wyl Lark attempted to chase the fighter, but instead of firing on the freighter, the TIE chose to crash directly into it. Both the TIE bomber and the freighter were destroyed, killing the Verpine and all the Imperial prisoners aboard.\nA male Verpine, the smuggler chose to sell the Imperial holdouts of Abednedo out to the New Republic rather than discreetly transport them as they had asked. The Verpine saw the prisoners as merchandise, requesting that the New Republic pay for the transaction.\nThe Verpine spoke with the help of a broken protocol droid, whose voice was transmitted through a comlink that the smuggler held. The smuggler flew a battered and filthy Ghtroc 690 light freighter. While on Abednedo, the Verpine wore several layers of scarves.\nThe Verpine smuggler appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/4_ABY",
  "/wiki/Abednedo_(planet)",
  "/wiki/Verpine",
  "/wiki/Gender",
  "/wiki/Galactic_Civil_War",
  "/wiki/Smuggler",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/New_Republic",
  "/wiki/Alphabet_Squadron",
  "/wiki/Lieutenant",
  "/wiki/Yrica_Quell",
  "/wiki/Mission_to_Abednedo",
  "/wiki/Squadron",
  "/wiki/Light_freighter",
  "/wiki/TIE/sa_bomber",
  "/wiki/Freighter",
  "/wiki/Death",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Standard_week",
  "/wiki/Battle_of_Endor",
  "/wiki/Operation:_Cinder",
  "/wiki/Attack_on_Abednedo",
  "/wiki/Starfighter",
  "/wiki/New_Republic_pilot",
  "/wiki/Chass_na_Chadic",
  "/wiki/Kairos",
  "/wiki/City",
  "/wiki/Neshorino",
  "/wiki/House_of_Strangers",
  "/wiki/Abednedo",
  "/wiki/Merchant",
  "/wiki/Comlink",
  "/wiki/Protocol_droid",
  "/wiki/Pilot",
  "/wiki/Prisoner",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Cruiser",
  "/wiki/Lodestar",
  "/wiki/Cave",
  "/wiki/X-wing_starfighter",
  "/wiki/TIE_line",
  "/wiki/Wyl_Lark",
  "/wiki/Droid",
  "/wiki/Ghtroc_Industries",
  "/wiki/690_light_freighter",
  "/wiki/Scarf",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}