{
 "name": "Unidentified_heavy_Cip-Quad_gunner",
 "display_name": "Unidentified heavy Cip-Quad gunner",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "The Muunilinst 10",
      "The Muunilinst 10"
     ]
    }
   ]
  }
 ],
 "content": "As member of the Muunilinst 10, this ARC trooper lieutenant participated in the Mission to Hypori, where he was sent to rescue the surviving Jedi Knights from General Grievous.\nBorn on Kamino as a clone of the Mandalorian bounty hunter Jango Fett, this heavy Cip-Quad gunner was trained to become an elite ARC trooper lieutenant. He was also trained to utilize the reciprocating quad blaster, alongside specialized clone trooper armor to be efficient with it.\nDuring the Clone Wars, the Advanced Recon Commando heavy gunner, alongside his squad leader ARC-77, and eight other ARC trooper lieutenants, were tasked with recovering a group of Jedi led by Daakman Barrek. Reaching Hypori in a LAAT/i gunship, the ARC troopers approached a downed Acclamator-class assault ship in which the surviving Jedi were hiding. As soon as they debarked, Captain Fordo detected three life signs and had one of his troopers check in some nearby rubble, while another checked the rafters, as the rest of the squad made their way to the life signatures. When they arrived, they were met with the sight of a wounded Jedi Master, General Ki-Adi-Mundi, duelling General Grievous. The Muunilinst 10, along with the heavy Cip-Quad gunner, wasted no time in opening fire on the cyborg general, but Grievous was able to evade their shots. The gunner's captain, reacted by having his gunship pilot blast his way into the area, and open fire on the Kaleesh. While the cyborg fled the site, Fordo's men recovered the other surviving Jedi, Aayla Secura and Shaak Ti. Before his unit departed from the crash site, the clone heavy Cip-Quad gunner was ordered to take out several B2 super battle droids that were threatening the surviving Jedi. Knowing that the torso was the weakest part of the super battle droid's construction, the ARC lieutenant wasted little ammunition, and took out the droids with ease.\nDuring the Battle of Hypori, this Advanced Recon Commando heavy Cip-Quad gunner wielded a high-powered rapid-firing reciprocating quad blaster. The reciprocating quad blaster, often shortened to \"Cip-Quad\", was an experimental weapon developed during the Clone Wars by Merr-Sonn Munitions. It drew power from a power cell strapped to a soldier's back and was mounted on a specialized harness featuring microrepulsorlifts. The four barrels could be fired either one or two at a time depending on the rotation pattern selected, and were cooled on the recoil by coolant tanks located within the rig itself. The heavy Cip-Quad gunner was also outfitted with specialized Phase I clone trooper armor with an experimental Phase II AT-RT helmet, which included a heads-up display that was linked to the clone's harness, allowing him to make the best use out of his weapon. In addition, the trooper wore a skirt-like kama, a blue pauldron, a rangefinder attached to his helmet, and specialized boots with studs on the bottom. The ARC trooper's armor had blue markings, showing that he was a lieutenant.\nThis Advanced Recon Commando heavy Cip-Quad gunner was created for the 21st chapter of the animated television series, Star Wars: Clone Wars, where he appeared alongside nine other ARC troopers in their rescue of a Jedi task force. Hasbro created two action figures of the clone heavy Cip-Quad gunner. One was made in 2006 for Star Wars: The Saga Collection, and the other in 2008 for Star Wars: The Legacy Collection.\nIn Chapter 21 of Star Wars: Clone Wars, we see the Muunilinst 10 arrive at the location of the crashed Acclamator on Hypori. While all of the members of the unit are shown aboard their LAAT/i gunship, the heavy Cip-Quad gunner only appears at the end of the unloading sequence. The ARC heavy Cip-Quad gunner would disappear right after, and appear again in the fight against General Grievous. After that engagement, the gunner disappeared once more, and was never shown again in the episode.\nWhile the ARC lieutenant is shown carrying a reciprocating quad blaster in the show, all other artwork and toys of the trooper depict him with a Z-6 rotary blaster cannon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Advanced_Recon_Commando_(disambiguation)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/The_Muunilinst_10",
  "/wiki/Battle_of_Hypori/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Clone_trooper_lieutenant",
  "/wiki/Reciprocating_quad_blaster",
  "/wiki/Clone_trooper_armor/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Gunner/Legends",
  "/wiki/Squad/Legends",
  "/wiki/ARC-77",
  "/wiki/Lieutenant/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Daakman_Barrek",
  "/wiki/Hypori/Legends",
  "/wiki/Muunilinst_10_LAAT",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/Clone_trooper_captain",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Ki-Adi-Mundi/Legends",
  "/wiki/Supreme_Commander_of_the_Droid_Armies",
  "/wiki/Muunilinst/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Unidentified_Advanced_Recon_Commando_pilot",
  "/wiki/Kaleesh/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Merr-Sonn_Munitions,_Inc./Legends",
  "/wiki/Power_pack",
  "/wiki/Soldier/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Phase_II_clone_trooper_armor/Legends",
  "/wiki/AT-RT_driver",
  "/wiki/Kama/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/Rangefinder/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Clone_Wars_Chapter_21",
  "/wiki/Star_Wars:_Clone_Wars",
  "/wiki/Hasbro_Inc.",
  "/wiki/2006",
  "/wiki/Star_Wars:_The_Saga_Collection",
  "/wiki/2008",
  "/wiki/Star_Wars:_The_Legacy_Collection",
  "/wiki/Star_Wars",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Z-6_rotary_blaster_cannon",
  "/wiki/Databank_(original)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Clone_Wars_Campaign_Guide"
 ]
}