{
 "name": "Unidentified TIE/IN Interceptor pilot",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Dominus III"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "A Human served the Galactic Empire's as part of the Imperial Navy shortly after the Battle of Yavin.\nTwo months after the battle they served as a TIE/IN interceptor pilot on board a Star Destroyer which was sent to the Dominus sector to attack a Rebel scouting party which was attempting to find a new base for the Alliance. Once the Star Destroyer arrived in the system the pilot immediately launched from the Destroyer and flew out against the Rebels, who were piloting Incom Corporation T-65 X-wing starfighters. The pilot and a number of other Interceptors engaged the X-wings in a dog fight above the planet Dominus III. During the fighting one of the Rebel pilots, Leia Organa, and the Imperial pilot were caught in the blast of a missile, which caused enough to damage to force them to try and land on the planet.\nOrgana crashed first and quickly left her ship to chase the Interceptor to its crash site. Once the pilot crashed and attempted to leave his burning vehicle, she was ready for them and shot the Imperial in the chest, knocking them to the ground before they could shoot. Organa then shot the pilot several more times killing them. After the pilot's death Organa and the other rebel pilots, Wedge Antilles and Luke Skywalker who had landed on the planet to find Organa, burned the pilot's ship to prevent the Empire using the ship's transponder to find them.\nThe pilot appeared in the first issue of the comic book series Star Wars by Dark Horse Comics. The series was written in Brian Wood and illustrated by Carlos D'Anda, it was published on January 9 2013.",
 "base_url": "https://starwars.fandom.com/",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Dominus_III",
  "/wiki/Human/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Unidentified_Rebel_technician_(Redemption)",
  "/wiki/Star_Wars_(2013)_1",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Dominus_sector",
  "/wiki/Pilot/Legends",
  "/wiki/Incom_Corporation/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Transponder",
  "/wiki/Star_Wars_(Dark_Horse_Comics_2013)",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Brian_Wood",
  "/wiki/Carlos_D%27Anda",
  "/wiki/January_9",
  "/wiki/2013"
 ]
}