{
 "name": "Unidentified_Zabrak_fighter",
 "display_name": "Unidentified Zabrak fighter",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "An Iridonian Zabrak male was a fighter in a common house on Sorgan. In 9 ABY, he fought the former rebel shock trooper Carasynthia Dune, who defeated him by making him tap out the tether that connected the two fighters.\nAround 9 ABY, the male Zabrak fought Carasynthia Dune in a common house on Sorgan in an attempt to earn credits betted on his victory, connected to her by a tether. Initially gaining the upper hand in the brawl, he knocked Dune into the bar's counter, but was quickly countered by the former shock trooper. The Zabrak then pulled the tether in an attempt to close their distance. Dune used the opportunity to pull the fighter off-balance, and won the fight by strangling him with the tether until he tapped out. Following the match, he left his credits on her table while she spoke with Din Djarin, with Dune telling him to come back soon.\nThe Iridonian Zabrak fighter was a male with orange skin and blue eyes.\nWhile fighting Cara Dune, he initially gained the upper hand, but was eventually overpowered and lost the fight.\nThe Zabrak wore a sleeveless vest over a striped gray shirt, as well as fingerless gloves and brown pants.\nThe fighter was portrayed by Dave Reaves in Chapter 7 of the 2019 television series The Mandalorian, which aired on December 18, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Zabrak",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Zabrak",
  "/wiki/Iridonian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sorgan_Common_House",
  "/wiki/Sorgan",
  "/wiki/9_ABY",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Shock_trooper",
  "/wiki/Carasynthia_Dune",
  "/wiki/Credit",
  "/wiki/Din_Djarin",
  "/wiki/Limb",
  "/wiki/Clothing",
  "/wiki/Glove",
  "/wiki/Dave_Reaves",
  "/wiki/Chapter_7:_The_Reckoning",
  "/wiki/2019",
  "/wiki/The_Mandalorian",
  "/wiki/December_18",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Cast",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}