{
 "name": "Unidentified_Twi%27lek_female_server",
 "display_name": "Unidentified Twi'lek female server",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sanctuary"
     ]
    }
   ]
  }
 ],
 "content": "A female Twi'lek worked as a server in the Sanctuary, a cantina in Mos Espa owned by Garsa Fwip. When Daimyo Boba Fett and his assassin Fennec Shand visited the establishment, the server and her partner greeted them and took their helmets for cleaning. Once they were returned, Fett and Shand found that the crime lord's helmet had been filled with credits. She was present at the Sanctuary when the Hutt twins arrived in Mos Espa and later witnessed the gladiator Krrsantan assault a group of Trandoshan gamblers. She was killed within Garsa's Sanctuary when the Pyke Syndicate rigged a camtono to explode within the cantina.\nSometime around 9 ABY, the Twi'lek female server worked at the Sanctuary on the planet Tatooine under her Twi'lek boss, Madam Garsa Fwip. When the crime lord Boba Fett and his partner, Master Assassin Fennec Shand, visited the cantina, the Twi'lek server and a male colleague welcomed the pair and offered to clean their helmets. While Shand initially refused, Fett accepted the offer and requested Shand's cleaned as well. The female took Fett's helmet while her male colleague took Shand's. When the crime lord and Fwip neared the end of their conversation, Fwip clapped to signal both servers to return with the helmets. After Fwip thanked Fett for his visit and departed, the female returned Fett's helmet to him and the male returned Shand's. As the servers left, Shand took notice that Fett's helmet had credits inside.\nWhen Fett and Shand returned to the Sanctuary with two Gamorrean guards on the advice of Mayor Mok Shaiz, the server whispered to Fwip to note their arrival. Some time later, she greeted a group of gambling Trandoshans at the Sanctuary moments before Krrsantan assaulted them and ripped off the arm of one of them. Krrsantan subsequently paid his bill to the server.\nOne night as two Pyke Syndicate members entered the Sanctuary, the Twi'lek spoke briefly with Fwip after the latter noticed the Pykes entering. She then joined her male colleague and approached the Pykes after they sat down. Her colleague offered to clean their helmets, and the two Twi'leks departed after the patrons refused, meeting with Fwip where the female server informed the Madam of the refusal. The three Twi'leks watched the Pykes leave the Sanctuary as a server droid attempted to inform the Pykes of their forgotten camtono. Then, an explosion erupted within the Sanctuary, killing her.\nThe Twi'lek female had yellow skin.\nThe Twi'lek server wore a black headwrap that covered the top of her head and the base of her lekku. She wore a two-piece outfit similar to a dancing-girl costume, consisting of a metal top half and metal-and-fabric pants, revealing her midriff and back. She also wore a necklace and bracelets on both wrists.\nThe female Twi'lek server first appeared in \"Chapter 1: Stranger in a Strange Land,\" which released on Disney+ on December 29, 2021, and served as the premiere episode for The Book of Boba Fett. She was played by Andrea Bartlow.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Twi%27lek",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Cantina",
  "/wiki/Mos_Espa",
  "/wiki/Garsa_Fwip",
  "/wiki/Daimyo",
  "/wiki/Boba_Fett",
  "/wiki/Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Unidentified_Twi%27lek_male_server",
  "/wiki/Helmet",
  "/wiki/Credit",
  "/wiki/Hutt",
  "/wiki/Twin",
  "/wiki/Gladiator",
  "/wiki/Krrsantan",
  "/wiki/Trandoshan",
  "/wiki/Gambler",
  "/wiki/Death",
  "/wiki/Pyke_Syndicate",
  "/wiki/Camtono",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/Planet",
  "/wiki/Crime_lord",
  "/wiki/Master_Assassin",
  "/wiki/Gamorrean",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/Mok_Shaiz",
  "/wiki/Gambling",
  "/wiki/Limb",
  "/wiki/Unidentified_Trandoshan_gambler",
  "/wiki/Pyke",
  "/wiki/Unidentified_droid_server",
  "/wiki/Clothing",
  "/wiki/Lekku",
  "/wiki/Dancing-girl_costume",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Disney%2B",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Andrea_Bartlow",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor"
 ]
}