{
 "name": "Unidentified_Yinchorri_pilot",
 "display_name": "Unidentified Yinchorri pilot",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yinchorr"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Yinchorr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yinchorri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "This Yinchorri pilot was involved in a plot by the Galactic Empire to kill Princess Leia Organa by luring her into a trap on the planet Yinchorr.\nA short time before the Battle of Endor, this Yinchorri pilot, alongside his commander flew a shuttle to the Rebel fleet's location to pick up Princess Leia Organa. The Rebel leader was due to meet up with the Yinchorri Council of Elders to discuss the inclusion of the Yinchorri into the Rebel Alliance. However, unknown to Organa, the Council of Elders had been captured by Imperial Governor Marcellin Wessel, and Wessel blackmailed the remaining Yinchorri, claiming that he would release the council if they would turn over Organa to him.\nWhen the pilot arrived in the atmosphere of Yinchorr, he recognized two TIE fighters coming up from the planet to escort his craft to Wessel's location. The pilot informed his commander, who quickly restrained Organa. The commander told the pilot to land so that they could turn over the Rebel leader to the Imperials, but before the pilot could do so, the TIE fighters opened fire on the shuttle. Wessel had decided to simply kill Organa rather than capturing her, with the Yinchorri crew members as acceptable casualties. The Yinchorri commander was shocked by the betrayal, but Organa quickly took control of the situation, telling the pilot to fly evasive maneuvers while she took control of the blaster cannon.\nOrgana was able to shoot down one of the TIE fighters, but the other craft was able to shoot down the shuttle. Organa disabled the other TIE, but the Yinchorri pilot was unable to regain control of the craft. The shuttle plummeted to the ground, crashing violently in the desert. The entire Yinchorri crew was killed in the resulting explosion, with only Organa surviving the crash.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Yinchorri",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Unidentified_Yinchorri_commander",
  "/wiki/Yinchorri_shuttle",
  "/wiki/Alliance_Fleet",
  "/wiki/Council_of_Elders_(Yinchorri)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Marcellin_Wessel",
  "/wiki/Atmosphere/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/Star_Wars_(1977)_86"
 ]
}