{
 "name": "Unidentified_Rodian_outcast",
 "display_name": "Unidentified Rodian outcast",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Ragmar V"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A Rodian male was a member of a group of pariahs who lived on the Outer Rim planet Ragmar V during the final year of the Clone Wars. The Rodian was one of many outcasts who were preparing to fight the Jedi Padawan Joc Sah and his small force of clone troopers, who had arrived on the planet to create an outpost that would be used as a staging point for the next phase of the Clone Wars.\nGaan, the leader of the settlement, ordered that the outcasts take to the rooftops, while he would confront the Republic in the streets in order to kill the Jedi himself. Before the fight could begin, however, the clone trooper sergeant, Remy, received the command to execute Order 66; an order that branded the Jedi as traitors to the Galactic Republic, and that the Jedi were to be executed on sight immediately. The clone troopers opened fire on both Sah and Gaan, which prompted the settlers to attack the clone troopers. The Rodian was killed during the ensuing firefight by Remy.\nA Rodian male lived during the final decades of the Galactic Republic. At some point he joined a settlement of pariahs on the Outer Rim planet Ragmar V. He was still there by 19 BBY. During that final year of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the Republic armies arrived on Ragmar V, in order to construct an outpost that would be used as a staging point for an upcoming attack against the Separatists. The settlement's leader, a Human named Gaan, detested the Republic's presence, and ordered a Klatooinian to fire a missile launcher at a Low Altitude Assault Transport/infantry gunship that had just landed on a nearby mesa. The gunship's occupants, a Jedi Padawan named Joc Sah and the clone troopers under his command, survived the blast and started to make their way to the settlement.\nGaan rounded up the Rodian and a number of the other residents in a cantina and told them of the situation. Gaan explained they were going to make a stand against the Republic forces, with Gaan making a special note that he wanted to kill the Jedi himself. The criminals responded enthusiastically, ready to fight. The Rodian, the Klatooinian, a Bith, and a Human female all took positions on top of a building overlooking the main street and waited for Gaan's signal to fire.\nGaan met the Jedi and his clones in the street, but before the battle could even begin, the Jedi's clone trooper sergeant, Remy, received the command to execute Order 66 from the Republic's Supreme Chancellor Palpatine. Order 66 was an order that branded all Jedi as traitors to the Republic and that they were to be immediately executed. The clones opened fire on Sah, and Gaan mistakenly believed his men had opened fire without his signal. When he realized it was the clones, he killed one of them out of a brief flash of anger, as he had wanted to kill the Jedi himself. This action caused the clones to attack Gaan, forcing him to take cover with Sah.\nThe Klatooinian gave his own order to the settlers to fire upon the clones, and several clones were quickly dispatched as Remy and a few others took shelter. Remy returned fire and killed the Rodian with a single shot to the chest. Gaan and Sah finished off Remy and the rest of his clones, and then began preparing to fight a larger force that would arrive to ensure Sah's demise. The Rodian was the only casualty after the fight with Remy's men.\nA Rodian male, he had large black eyes and lumpy green skin, which were common traits among Rodians. The Rodian appeared to enjoy the idea of fighting the Republic troops, as he was just as enthusiastic about fighting them as the other outcasts when Gaan explained the battle plan.\nThe Rodian carried a small silver blaster pistol with him during the fight with Remy's troops, and had fired it at the clone troopers before he was killed. He also wore a blue colored uniform with gold trimmings that appeared military in nature, with a brown belt strapped around his waist that had several pouches.\nThe Rodian was created for the short story The Order of Outcasts, which was one of four stories compiled into the fifth volume of the Star Wars: Clone Wars Adventures trade paperback series. The Order of Outcasts was written by Matt Jacobs, was illustrated by Matthew and Shawn Fillbach, and was published on April 26, 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/19_BBY/Legends",
  "/wiki/Ragmar_V",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Unidentified_Ragmar_V_settlement",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Outcast",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Joc_Sah",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Gaan",
  "/wiki/City/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Remy_(clone_trooper)",
  "/wiki/Order_66/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Ragmar_V",
  "/wiki/Time/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Human/Legends",
  "/wiki/Unidentified_Klatooinian_outcast_1",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Klatooinian/Legends",
  "/wiki/Unidentified_Bith_outcast",
  "/wiki/Unidentified_red-headed_Human_female_outcast",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Uniform",
  "/wiki/Belt/Legends",
  "/wiki/The_Order_of_Outcasts",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_5",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Matt_Jacobs",
  "/wiki/Matthew_Fillbach",
  "/wiki/Shawn_Fillbach",
  "/wiki/April_26",
  "/wiki/2006",
  "/wiki/Category:Images_of_unidentified_Rodian_outcast",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Dark_Horse_Comics"
 ]
}