{
 "name": "Unidentified_female_(Mytar)",
 "display_name": "Unidentified female  (Mytar)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "A human female individual taught Gita how to hunt at some point. On one occasion, the female instructed Gita while on Mytar to wait for an animal to buck as the latter took aim at the creature. When Gita took her shot and failed to kill the animal, the female told her that the meat was going to spoil as the animal would run until it bled out and died. She told Gita to remember that they would be the ones hunted in battle, and stated that she must shoot to kill only. During the hunt for the Sith Lord Darth Vader at some point prior to the Battle of Hoth in 3 ABY, Gita remembered the female's words while taking aim at the Sith Lord. The female had blue eyes and light skin. While instructing Gita, the female wore light green clothing that covered her entire body except for her face.\nThe female appeared in a flashback in the fourth issue of the 2019 comic book series Star Wars: Target Vader, written by Robbie Thompson, illustrated by Stefano Landini, and published by Marvel Comics on October 9, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Gita",
  "/wiki/Hunting",
  "/wiki/Mytar",
  "/wiki/Death",
  "/wiki/Hunt_for_Vader",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Battle_of_Hoth",
  "/wiki/3_ABY",
  "/wiki/Sith_Lord",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Target_Vader_4",
  "/wiki/2019",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Target_Vader",
  "/wiki/Robbie_Thompson",
  "/wiki/Stefano_Landini",
  "/wiki/Marvel_Comics",
  "/wiki/October_9",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}