{
 "name": "Unidentified_medical_officer_clone_(Kaliida_Shoals_Medical_Center)",
 "display_name": "Unidentified medical officer clone  (Kaliida Shoals Medical Center)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Military",
      "Republic Military"
     ]
    }
   ]
  }
 ],
 "content": "An clone trooper officer served as a clone medical officer in the Republic Military during the Clone Wars between the Galactic Republic and the Separatist Alliance.\nGrown on the planet Kamino from the DNA of the bounty hunter and clone template of the clone trooper army Jango Fett, the clone was a clone medical officer. As a clone trooper officer and a medic, he participated in the pan-galactic Clone Wars between the Galactic Republic and the Separatist Alliance, serving aboard the Kaliida Shoals Medical Center, a Haven-class medical station that treated 60,000 wounded clone troopers. During the Malevolence Campaign conducted by the Separatists early in the war against the Republic Navy, the medical officer assisted the Kaminoan Chief Medical Scientist Nala Se, who oversaw the operations of the medical station, when the Malevolence targeted the station.\nThe medical station began to evacuate its patients, and after being briefed by Jedi General Obi-Wan Kenobi and Admiral Wullf Yularen, the officer asked Nala Se if she believed that the Republic forces could defeat the Malevolence if they reached the station in time. Nala Se responded that it was their only hope, and the two subsequently coordinated evacuation efforts. After the Malevolence arrived, it targeted the fleeing Pelta-class frigates first, and succeeded in destroying them. Jedi Generals Anakin Skywalker and Plo Koon arrived with Shadow Squadron to attack the Malevolence but lost nearly half of their starships as a result. Upon witnessing the actions, the medical officer clone remarked that it appeared as if Skywalker failed due to the loss of his ships, and stated to Nala Se that they should evacuate, although she rebuffed that she would be staying at the station.\nWhen Skywalker and his forces redirected their efforts to the mega-ion cannons of the Malevolence and critically damaged it, the officer and Nala Se looked upon the results of the battle. After a fleet of Republic Star Destroyers arrived and chased the Malevolence away, Skywalker and his squadron regrouped at the medical station, where he met the medical officer clone and Nala Se. At this time, Nala Se thanked Skywalker for his service, and briefly spoke to his Padawan Ahsoka Tano about her master as the officer looked on.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_medical_officer_clone_(Kaliida_Shoals_Medical_Center)",
  "/wiki/Unidentified_clone_chief_medic",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Military",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Clone_medical_officer",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/Clone_trooper",
  "/wiki/Army",
  "/wiki/Jango_Fett",
  "/wiki/Clone_trooper_officer",
  "/wiki/Medic",
  "/wiki/The_galaxy",
  "/wiki/Kaliida_Shoals_Medical_Center",
  "/wiki/Haven-class_medical_station",
  "/wiki/Trooper",
  "/wiki/Malevolence_Campaign",
  "/wiki/Navy",
  "/wiki/Officer",
  "/wiki/Kaminoan",
  "/wiki/Chief_Medical_Scientist",
  "/wiki/Nala_Se",
  "/wiki/Jedi_General",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Admiral",
  "/wiki/Wullf_Yularen",
  "/wiki/Pelta-class_frigate",
  "/wiki/Jedi",
  "/wiki/General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Plo_Koon",
  "/wiki/Shadow_Squadron",
  "/wiki/Starship",
  "/wiki/Mega-ion_cannon",
  "/wiki/Fleet",
  "/wiki/Star_Destroyer",
  "/wiki/Squadron",
  "/wiki/Time",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Destroy_Malevolence",
  "/wiki/Senate_Murders",
  "/wiki/Databank_(website)",
  "/wiki/Eye",
  "/wiki/Clone_Cadets",
  "/wiki/Advanced_Recon_Commando"
 ]
}