{
 "name": "Unidentified_Twi%27lek_Inquisitor",
 "display_name": "Unidentified Twi'lek Inquisitor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "14 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "During the reign of the Galactic Empire, a male Twi'lek Inquisitor served under Darth Vader. The Inquisitor accompanied Vader, Fifth Brother, and Iskat to hunt down former Jedi Master Eeth Koth.\nVader and the Inquisitors returned to the Inquisitorius Headquarters and the Twi'lek Inquisitor and Iskat toasted to another Jedi killed. While they discussed what Vader would do after the Jedi were completely gone, Vader approached them and attempted to kill Iskat. The Twi'lek Inquisitor held him off while she escaped and he followed her. Vader made chase and they attempted to kill him. They managed to knock him down, but he froze them with the Force and killed them.\nAs a member of the Inquisitorius, this Twi'lek was a former member of the Jedi Order who fell to the dark side of the Force.\nYears after Order 66, the Inquisitor was sent to a desert planet on a mission to hunt former Jedi Master Eeth Koth alongside Darth Vader, the Fifth Brother, and Iskat. Koth had been banished from the Jedi High Council and had avoided Order 66 and the initial onslaught of the Great Jedi Purge. Vader confronted Koth shortly after his wife Mira had given birth to their baby, and Koth pleaded to be spared as he was now only a priest for the Church of the Ganthic Enlightenment. When Koth was unable to persuade Vader, he told Mira and the newborn baby to escape as he dueled Vader. During the lightsaber duel, Vader ordered the three Inquisitors to recover the baby for Project Harvester.\nTo cover more ground while searching the city, the three Inquisitors decided to split up. While this Inquisitor and Fifth Brother were unsuccessful, their companion used the Force to detect ripples and locate the child. Just as Mira was about to board her father's shuttle, Iskat cornered her. Mira begged the Inquisitor to let her escape, and was allowed to board the shuttle as the Fifth Brother and the Twi'lek Inquisitor arrived. The Inquisitor asked why Mira and the child had been allowed to escape, commenting that Vader would find out. As the Twi'lek watched, Iskat used the Force to move the baby out of the shuttle, letting Mira live so that she could suffer from the loss of her child and not trust in anyone.\nThe three Inquisitors returned to find Vader still dueling Koth, and informed him that the baby had been captured, showing him the baby. Distracted by the Inquisitors and seeing his child, Koth was stabbed in the back and killed by Vader, who then took the baby from the Inquisitors. Vader and the Inquisitors left the planet, and returned to the Inquisitorius Headquarters on a Zeta-class shuttle. To celebrate the success of their mission, the Twi'lek Inquisitor and Iskat toasted to the death of Koth by drinking Dust Juice, a local beverage which they both found to be unappealing. Together they wondered what Vader would do once there were no Jedi left to kill, to which the the Inquisitor replied that he was sure that Vader would find someone else to kill. As the Inquisitor drank more Dust Juice, his companion turned around to see Vader's shadow looming over their table igniting his lightsaber.\nUpon witnessing Vader's action against the two Inquisitors, The Grand Inquisitor asked his master if what he was doing was a test or an indication of more training, to which Vader denied. Seeing Vader's blade, the Twi'lek Inquisitor ordered his fellow Inquisitor to run as he used his double-bladed spinning lightsaber to defend himself from his master's wrath, who was furious upon sensing their camaraderie, a weakness the Inquisitor believed supplied strength while expressing that Koth's death should have served as a lesson about attachments. As such lesson was apparently unsuccesful, Vader used the Force to slam the Inquisitor against the wall. Fearful of what Vader was going to do, the Inquisitor ran for his life along with his partner. Politely declining the help of the Grand Inquisitor and the other Inquisitorius, Vader started to chase the two Inquisitors.\nAfter asking his fellow Inquisitor if she knew why Vader was attacking them, the Twi'lek replied that he told her how he felt when she said that she couldn't believe that he got in Vader's way to save her, having rejected his offer to remain in the Inquisitorius, leading the Inquisitor to respond that he guessed that he had proven it to the Dark Lord of the Sith, to which Iskat said that it was a stupid idea as Vader would now come to take them out. With no other options, the two Inquisitors resolved to murder Vader and then escape from the Empire. Meanwhile, Vader and two Imperial shock troopers followed them aboard an EasyRide passenger airspeeder. The Inquisitors managed to destroy the airspeed, leading Vader to jump to another to then fall from it as the Inquisitors' blades destroyed it into another airspeeder.\nAboard another airspeeder accompanied by a droid, the Twi'lek told Iskat that Vader was still coming for them, so his partner promised him to kill Vader together. The Sith Lord launched them an airspeeder, but missed. The Inquisitors then performed the same attack and succeeded, knocking Vader into a building just as he jumped from his vehicle to kill them. Jumping into the building to kill their former master, after Iskat verified that Vader was still alive, the Inquisitor expressed his surprise that both of them had actually managed to beat the Emperor's enforcer. As his partner prepared to kill Vader assuring him that he deserved to die, Vader used the Force to make the Inquisitors kill themselves. As Iskat told him that she was sorry, he replied that it was all right as neither one of them expected to die on bed after the choices they made, telling her that at least they would be finally free. Vader then proceeded to use the Force to drive the Inquisitor's lightsabers into each other.\nAfter the chase, Vader reported the actions of the two Inquisitors to the Emperor in the Imperial Palace. When Palpatine asked him about evidence of Iskat's treachery, Vader told him that she ensnared the Twi'lek Inquisitor as part of her \"plan\" to build a coalition against them. The Emperor, however, was furious with Vader as during the chase, one of the airspeeders had crushed a Gran senator of the Imperial Senate, leading him to relocate the headquarters of the Inquisitorius off-world in Fortress Inquisitorius on the moon Nur.\nThe Inquisitor was a male black-skinned Twi'lek with orange eyes. Like most Inquisitors, he was cruel, showing no hesitation over kidnapping a child and celebrated the death of Koth. He appeared to have a friendly relationship with other Inquisitors, but was still fearful of Darth Vader; especially since he had developed feelings for Iskat. The Twi'lek Inquisitor's feelings for her prompted him to protect her when Vader tried to cut her down. His act subsequently made him an enemy of Vader but he worked around it and, with Iskat, he plotted to kill the Sith Lord so they could be free.\nThe Inquisitor wore a standard gray and black outfit, with the Imperial crest on his shoulder plates. He also utilized a facial apparatus during combat, as well as a double-bladed spinning lightsaber.\nThe Inquisitor first appeared in Darth Vader  19, a 2018 canon comic written by Charles Soule and illustrated by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Inquisitor_(disambiguation)",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/14_BBY",
  "/wiki/Coruscant",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitorius",
  "/wiki/Anakin_Skywalker",
  "/wiki/Imperial_Era",
  "/wiki/Fifth_Brother",
  "/wiki/Iskat",
  "/wiki/Hunt_for_Eeth_Koth",
  "/wiki/Jedi_Master",
  "/wiki/Eeth_Koth",
  "/wiki/Inquisitorius_Headquarters",
  "/wiki/The_Force",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Desert",
  "/wiki/Unidentified_planet_(Eeth_Koth)",
  "/wiki/Jedi_High_Council",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Mira_(Zabrak)",
  "/wiki/Reproduction",
  "/wiki/Eeth_Koth%27s_daughter",
  "/wiki/Priest",
  "/wiki/Church_of_the_Ganthic_Enlightenment",
  "/wiki/Lightsaber_duel",
  "/wiki/Lightsaber",
  "/wiki/Project_Harvester",
  "/wiki/Unidentified_city_(Eeth_Koth)",
  "/wiki/Mira%27s_father",
  "/wiki/Shuttle",
  "/wiki/Death",
  "/wiki/Planet",
  "/wiki/Zeta-class_shuttle",
  "/wiki/Dust_Juice",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Grand_Inquisitor",
  "/wiki/Rogue_Inquisitor_chase",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Imperial_shock_trooper",
  "/wiki/EasyRide_passenger_airspeeder",
  "/wiki/Imperial_Palace",
  "/wiki/Unidentified_Gran_senator",
  "/wiki/Imperial_Senate",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Moon",
  "/wiki/Nur",
  "/wiki/Sith_Lord",
  "/wiki/Imperial_crest",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/2018",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Darth_Vader_(2017)_20",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers",
  "/wiki/Tarkin_(novel)",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Darth_Vader_(2017)_18",
  "/wiki/Second_Sister",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Inquisitor",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/StarWars.com"
 ]
}