{
 "name": "Unidentified_Rodian_hermit",
 "display_name": "Unidentified Rodian hermit",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A Rodian hermit lived on the planet Tatooine during the Galactic Civil War. After the Battle of Yavin, he guided a young adventurer in becoming the Hero of Tatooine.\nA supporter of the Galactic Republic and the Jedi Order, the Rodian lived during the last years of the Old Republic. In his youth, he fought many campaigns against what he considered the forces of darkness. For his efforts, he was awarded with the Mark of the Hero, a ring believed to be of great power. However, the Rodian observed powerless the fall of the Republic and the rise of the Galactic Empire. Over the years, he witnessed the Empire bring ruthlessness and injustice to the galaxy and plunge its inhabitants into Dark Times. Despair and hopeless, the Rodian decided to go into exile on the planet Tatooine. He eventually made his home at the bottom of a cold squill-infested cave on the desert planet. There, the hermit lived in solitude, spending most of his time reading book and philosophizing about the state of the galaxy. However, despite his isolation, he kept himself informed of many problems of the inhabitants of Tatooine. By the time of the Battle of Yavin, the Rodian hermit had acquired the conviction that the galaxy was in need of heroes, individuals who could demonstrate their adherence to the light and inspire others to make the galaxy better.\nIn 1 ABY, the Rodian encountered a spacer who was exploring the cave. After a brief discussion, it appeared that both shared the same opinion about the Empire and the state of the galaxy. As the adventurer looked very eager to help, the hermit began to think that this individual could become one of the heroes he was looking for. In order to test the noble intentions of the spacer, he first tasked them with retrieving a squill skull in the depths of the cave. The adventurer survived their fight with the squills and returned successful to the Rodian with the skull. Impressed and very pleased, the hermit tasked the spacer with becoming the Hero of Tatooine, in hopes that the latter would take up his former duties and save the planet. The old man provided four tasks to help the inhabitants of Tatooine while displaying four qualities a hero must have: intelligence, courage, honor, and altruism. To earn the Mark of Intellect, the adventurer assisted the bounty hunter Tearfin in identifying a thief among a group of smugglers. To obtain the Mark of Honor, the spacer helped Roric and Helen Goldenfield to deal with pirates who harassed their ranch. To earn the Mark of Courage, the adventurer killed a ferocious bladeback boar. Finally, to earn the Mark of Altruism, the spacer rescued the family of a moisture farmer that had been kidnapped by Sennex slavers. After all tasks were completed, the spacer returned to the hermit who congratulated them for their bravery and heroism. The Rodian declared them the Hero of Tatooine and awarded them with his old ring, the Mark of the Hero, which was believed to be able to bring its bearer back from death.\nThe Rodian hermit appeared in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. The Rodian hermit was added to the game as part of the \"Hero of Tatooine\" questline, released with \"Publish 9\" on June 29, 2004.\nThe \"Hero of Tatooine\" questline was extensively revamped upon the introduction of the \"Publish 25,\" a.k.a. the \"New Game Enhancements,\" on November 15, 2005, but the role of the Rodian hermit in the quest was not altered.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Rodian",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Quest_of_the_Hero_of_Tatooine",
  "/wiki/Hero_of_Tatooine",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Mark_of_the_Hero",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Squill_(creature)",
  "/wiki/Squill_Cave",
  "/wiki/1_ABY/Legends",
  "/wiki/Mark_of_Intellect",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Tearfin",
  "/wiki/Smuggler/Legends",
  "/wiki/Mark_of_Honor",
  "/wiki/Roric_Goldenfield",
  "/wiki/Helen_Goldenfield",
  "/wiki/Sand_slum_pirates",
  "/wiki/The_Ranch",
  "/wiki/Mark_of_Courage",
  "/wiki/Bladeback_boar/Legends",
  "/wiki/Mark_of_Altruism",
  "/wiki/Moisture_farmer/Legends",
  "/wiki/Sennex",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_29",
  "/wiki/2004",
  "/wiki/November_15",
  "/wiki/2005",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}