{
 "name": "Unidentified_alpha_trawler",
 "display_name": "Unidentified alpha trawler",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "A human male trawler, along with a human companion and a Quarren companion, threatened a Mythrol in a public house on the ice planet Pagodon around 9 ABY. In Huttese, he threatened to sell the Mythrol's glands at the port, and commented that the Mythrol's musk must be sweet because of his youth. During this incident, a Mandalorian bounty hunter named Din Djarin arrived to collect a bounty on the Mythrol. The human, along with his two companions, threatened Djarin, claiming that he had made the alpha trawler spill his drink. A fight ensued, during which Djarin incapacitated all three of them.\nThe human male worked as a trawler on the ice planet Pagodon around 9 ABY. Within a public house at the settlment Ferryman's Reach, he harassed a young Mythrol alongside a Quarren and human. Speaking in Huttese, the trawler pointed out that they could sell the Mythrol's glands a a nearby port, and that the musk he produced would be sweet. Despite the Mythrol surrendering his credits on the table, the human prepared to him with a knife while the Quarren pulled him to his feet.\nBefore they could cut the Mythrol, they were interrupted by the Mandalorian bounty hunter Din Djarin's sudden entrance. Noticing the spilled drink on the table, he claimed the Mandalorian had spilled it while approaching him at the counter, signaling his companions.\nContinuing to threaten Djarin, the bartender translated his threats in Basic. The human then asked if the armor he was made of real beskar, as the other trawlers surrounded him. As the bartender slid another drink to the human, Djarin grabbed the cup and knocked them back, then slammed it into the other human trawler, knocking him out.\nHe proceeded to slam the Quarren's face into the counter, before the human trawler attempted to stab him with his knife. Djarin then grabbed his arm and redirected the blade into his back, incapacitating him. Djarin then caught the fleeing Quarren with his whipcord launcher and shot the entrance's controls, which promptly activated the door and sliced the trawler in half.\nThe human had light skin with a scar on the right side of his face, as well as a bald head and a dark brown beard. He ignored the Mythrol's offer of credits, as he found the Mythrol's glands to be far more profitable. Upon seeing Djarin, he used the spilled drink on the table as leverage to threaten him.\nWhen fighting Djarin, the human attempted to stab him with his knife, but was incapacitated when Djarin redirected the blade to his back instead.\nThe human carried a knife and wore a brown coat, brown pants and black gloves.\nThe trawler appeared in the first episode of the 2019 Disney+ television series The Mandalorian, which aired on November 12, 2019. Identified in the credits as \"Alpha trawler,\" he was portrayed by Tait Fletcher, who also played Paz Vizsla in costume in Chapter 3: The Sin, which aired on November 22, 2019. According to Fletcher, he did not know about his role as the trawler after he auditioned for it, but later received a call informing him that he received the role.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/File:Bartender-Spilled.ogg",
  "/wiki/Unidentified_beta_trawler",
  "/wiki/Unidentified_Quarren_trawler",
  "/wiki/The_Mythrol",
  "/wiki/Mythrol",
  "/wiki/Boatman%27s_Reach",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Pagodon",
  "/wiki/9_ABY",
  "/wiki/Huttese",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Bounty",
  "/wiki/Ferryman%27s_Reach",
  "/wiki/Port",
  "/wiki/Credit",
  "/wiki/Knife",
  "/wiki/Quarren",
  "/wiki/File:Trawler-Beskar.ogg",
  "/wiki/Unidentified_bartender_(Pagodon)",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Armor",
  "/wiki/Beskar",
  "/wiki/Whipcord_launcher",
  "/wiki/Glove",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/November_12",
  "/wiki/Tait_Fletcher",
  "/wiki/Paz_Vizsla",
  "/wiki/Chapter_3:_The_Sin",
  "/wiki/November_22",
  "/wiki/The_Mandalorian:_Season_1:_Volume_1",
  "/wiki/Star_Wars:_The_Mandalorian_(manga)",
  "/wiki/The_Mandalorian_1",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Score",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/StarWars.com",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/September_24",
  "/wiki/June_23",
  "/wiki/2021",
  "/wiki/February_10",
  "/wiki/2020"
 ]
}