{
 "name": "Unidentified_drummer",
 "display_name": "Unidentified drummer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "The Twins",
      "The Twins"
     ]
    }
   ]
  }
 ],
 "content": "A human male drummer served the Hutt siblings within the Hutt Clan syndicate known as \"the Twins\" around 9 ABY. He played the drums in front of the Twins' litter when they went to visit Daimyo Boba Fett about the territory they laid claim to. The drummer was also with the two Hutts when they visited Fett at his palace.\nAround 9 ABY, the human male served in the Hutt Clan criminal syndicate for two Hutt siblings known to many as \"the Twins.\" At that time, Boba Fett, an ex-bounty hunter, took over the territories of the late Jabba the Hutt, a cousin of the Twins. As relatives of Jabba, the Twins laid claim to his former territories, and traveled to the city of Mos Espa to confront Fett. While the Hutts were carried on a platform by a litter of slaves, flanked by the Wookiee gladiator Krrsantan, the drummer marched at the vanguard, rhythmically beating his drums. The drum beating caught the attention of Fett while he was at the Sanctuary cantina, the rest of the patrons also noticing the sound.\nWith the drummer at the head, the Twins' group stopped before the sanctuary entrance, where Fett and his guard awaited. When the Twins' declared their claim to Jabba's territory, the drummer walked forward and took out a document for Fett to observe. Rejecting the Hutts' claim, Fett claimed they would have to kill him for the land. Not wanting to start a war, the Twins chose to depart for the time being. The drummer began beating his drum again, waiting for the Twins' litter carried platform to turn around before moving to the front and leaving with them.\nThe Twins sent Krrsantan to assassinate Fett, but the Wookiee failed and was captured as a result. On top of that, the Hutts chose to leave Tatooine after finding out that Mayor Mok Shaiz of Mos Espa had sided with another syndicate, the Pyke Syndicate. The drummer joined the Twins and their litter in visiting the Fett's palace, formerly Jabba's palace. The man then stood there while the Hutts apologized to the Daimyo for the assassination attempt by giving him a rancor and informed him of their departure due to the arrival of another syndicate. Once finished, the Twins' litter began carrying them away, the drummer moving to their front and preparing to beat his drums.\nThe drummer was a human male with light skin, black hair and brown eyes. He maintained a monotone expression when doing his job.\nThe drummer wore white and beige clothing with brown boots, a red headscarf and red and white garments over his torso.\nThe drummer first appeared in \"Chapter 2: The Tribes of Tatooine,\" the second episode of the television series The Book of Boba Fett, which released on Disney+ on January 5, 2022. He was portrayed by Murphy Patrick Martin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/The_Twins_(Hutts)",
  "/wiki/Hutt",
  "/wiki/9_ABY",
  "/wiki/Daimyo",
  "/wiki/Boba_Fett",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Bounty_hunter",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Wookiee",
  "/wiki/Gladiator",
  "/wiki/Krrsantan",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Cantina",
  "/wiki/Assassination_attempt_on_Boba_Fett",
  "/wiki/Mayor",
  "/wiki/Mok_Shaiz",
  "/wiki/Pyke_Syndicate",
  "/wiki/Boba_Fett%27s_rancor",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Disney%2B",
  "/wiki/January_5",
  "/wiki/2022",
  "/wiki/Murphy_Patrick_Martin",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor"
 ]
}