{
 "name": "Unidentified_clone_naval_commander_(Kaliida_Shoals_Medical_Center)",
 "display_name": "Unidentified clone naval commander  (Kaliida Shoals Medical Center)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Republic Navy",
      "Galactic Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "A clone trooper officer served as a clone navigation officer with the military rank of Clone Commander in the Republic Navy during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The clone trooper officer was stationed on a medical Pelta-class frigate and participated in the evacuation of the Kaliida Shoals Medical Center shortly prior to the Battle of the Kaliida Nebula.\nGrown on the planet Kamino from the DNA of the bounty hunter and clone template of the clone trooper army Jango Fett, the clone was a clone navigation officer with the military rank of Clone Commander. As a clone trooper officer, he participated in the pan-galactic Clone Wars between the Galactic Republic and the Separatist Alliance, serving in the Republic Navy aboard a medical Pelta-class frigate. During the Malevolence Campaign waged by the Separatists early in the war against the Republic Navy, the officer and his frigate responded to the Kaliida Shoals Medical Center to evacuate the injured patients as the Separatist heavy cruiser Malevolence travelled to attack the space station.\nDuring the evacuation, the officer spoke with Kaminoan Chief Medical Scientist Nala Se, who oversaw the operations of the medical station and the evacuation process. The officer and Nala Se spoke via a holographic screen about the status of the evacuation, and from the frigate, the clone officer informed Se that the evacuation was slowly proceeding. Nala Se ordered the commander that the clones in stable condition should be moved first, while the more critically wounded would have to wait. The officer then asked about the clones in the bacta tanks, as some of those clones could not be moved. Nala Se acknowledged, and ordered the commander to guide the mobile patients to the transports, to which the officer confirmed. Eventually, the Battle of the Kaliida Nebula began when the Malevolence arrived and attacked the docked frigates that were departing first. The frigates were destroyed, and the Malevolence targeted the medical station until it was critically damaged by the newly arrived Shadow Squadron.\nAs a clone of the bounty hunter Jango Fett, the clone officer was a human male who stood at 1.83 meters tall. He had naturally black hair, brown eyes, and tan skin.\nThe clone navigation officer was trained in naval warfare, excelling to the rank of Clone Commander. The clone navigation officer was served as an officer aboard a Pelta-class frigate.\nAs a clone navigation officer, the commander wore a blue variant of the standard Republic military uniform with a rank insignia plaque demonstrating his rank.\nThe Clone Commander first appeared in \"Shadow of Malevolence,\" which was the third episode of the first season of the animated TV series Star Wars: The Clone Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_clone_naval_commander_(Kaliida_Shoals_Medical_Center)",
  "/wiki/Unidentified_clone_naval_officer_(Sanctuary_III)",
  "/wiki/Unidentified_clone_naval_commander_(disambiguation)",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Clone_navigation_officer",
  "/wiki/Military_rank",
  "/wiki/Clone_Commander",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Clone_trooper_officer",
  "/wiki/Pelta-class_frigate",
  "/wiki/Kaliida_Shoals_Medical_Center",
  "/wiki/Battle_of_the_Kaliida_Nebula",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/Clone_trooper",
  "/wiki/Army",
  "/wiki/Jango_Fett",
  "/wiki/The_galaxy",
  "/wiki/Malevolence_Campaign",
  "/wiki/Navy",
  "/wiki/Officer",
  "/wiki/Frigate",
  "/wiki/Heavy_cruiser",
  "/wiki/Malevolence",
  "/wiki/Space_station",
  "/wiki/Kaminoan",
  "/wiki/Chief_Medical_Scientist",
  "/wiki/Nala_Se",
  "/wiki/Hologram",
  "/wiki/Commander",
  "/wiki/Bacta_tank",
  "/wiki/Transport",
  "/wiki/Shadow_Squadron",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Republic_military_uniform",
  "/wiki/Rank_insignia_plaque",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Databank_(website)",
  "/wiki/Clone_Cadets",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Trooper"
 ]
}