{
 "name": "Unidentified_Squib_trader_(Kabal)",
 "display_name": "Unidentified Squib trader  (Kabal)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Squib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "A Squib female trader ran a dingy stall in the coastal community of Palisade on the Outer Rim world of Kabal. The trader had grease-stained fur and a clipped ear. In 0 ABY, the Squib was selling items including plastic sandals, starship parts, and dead appliances, as well as a quay \"pre-programmed prognosticator\" novelty toy. She bartered with the Tynnan thief Dawson, who was interested in securing the latter item from her. Offered a coil of golden wire in exchange for the toy, she rejected Dawson's offer and insulted him, much to the amusement of the red-haired aliens standing nearby. Dawson's companion Kels Turkhorn distracted the seller by throwing the quay into the air while she stole several power couplings from the stall. The Squib caught the toy; asking it whether or not was damaged, she and the aliens were amused at its negative response. Despite both he and Turkhorn leaving without the quay, Dawson later returned to the Squib to obtain it, receiving the quay in return for three blasting caps and a copper spindle.\nThe Squib trader made her first appearance in Daniel Wallace's short story \"Fair Prey,\" which was featured in Star Wars Gamer 1 and published on September 1, 2000.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Squib/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Fair_Prey",
  "/wiki/Palisade",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kabal/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Ear/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Plastic/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Quay_novelty_toy",
  "/wiki/Tynnan/Legends",
  "/wiki/Thief/Legends",
  "/wiki/Dawson_(Tynnan)",
  "/wiki/Gold/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Kels_Turkhorn",
  "/wiki/Power_coupling/Legends",
  "/wiki/Copper/Legends",
  "/wiki/Daniel_Wallace",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/September_1",
  "/wiki/2000",
  "/wiki/Star_Wars_Gamer",
  "/wiki/The_Essential_Atlas",
  "/wiki/Kabal_system",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/StarWars.com"
 ]
}