{
 "name": "Unidentified_Inquisitor_(T0-B1)",
 "display_name": "Unidentified Inquisitor  (T0-B1)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 19 BBY and 3 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    }
   ]
  }
 ],
 "content": "A humanoid male Force-sensitive served as an Inquisitor in the time following Order 66, hunting down the Jedi that remained. The Inquisitor wore a set of black armor with a cape and wielded a red-bladed lightsaber.\nAt some point, aboard his Star Destroyer, the Inquisitor intercepted a signal sent by T0-B1, a droid who wished to be a Jedi, and tracked his location to a deserted planet. Upon arriving, the Inquisitor, who had killed Jedi previously, killed the Jedi researcher Mitaka and decimated his laboratory. Having accomplished his mission, the Inquisitor left the Jedi's body buried in a pile of white stones.\nT0-B1, whom Mitaka had hidden in the laboratory's basement, rebuilt the damaged droids in the building and continued the research to revive life on the planet. When it was done, T0-B1 experienced a connection with the Force and used a kyber crystal stored within his body to construct a lightsaber. Moments later, the Inquisitor returned to the planet in his TIE fighter as storm clouds brewed in the atmosphere, emitting red lightning. TO-B1 confronted the Inquisitor, recognizing him as responsible for the professor's death, and the two faced in a lightsaber duel.\nThey clashed their blades briefly until T0-B1 had a vision in which he met Mitaka's ghost, who knighted him as a true Jedi. T0-B1 regained his senses and the two resumed the fight. The Inquisitor fought with firmness and aggression, eventually managing to cut off T0-B1's left arm. Surprised to discover the Jedi to be a droid, the Inquisitor was caught off guard, allowing T0-B1 to slash his helmet and expose his vile set of teeth. The Inquisitor screamed in pain as the group of small droids from the lab swarmed his feet. Infuriated, the Inquisitor cut down the droids, which motivated T0-B1 and his companion, C03, to merge into a powerful form. Together, the pair defeated the Inquisitor with a single slash and he fell to the ground, dead.\nThe Inquisitor was developed for \"T0-B1,\" a short film in the Star Wars: Visions series produced by Science SARU and directed by Abel Gongora. The character was designed by Takafumi Hori to be reminiscent of a medieval black knight with modern elements.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Inquisitor_(disambiguation)",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/19_BBY",
  "/wiki/3_BBY",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitorius",
  "/wiki/Force-sensitive",
  "/wiki/Inquisitor",
  "/wiki/Time",
  "/wiki/Order_66",
  "/wiki/Jedi_hunter",
  "/wiki/Jedi",
  "/wiki/Color",
  "/wiki/Armor",
  "/wiki/Cape",
  "/wiki/Lightsaber",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Star_Destroyer",
  "/wiki/T0-B1",
  "/wiki/Droid",
  "/wiki/Unidentified_planet_(Mitaka)",
  "/wiki/Mitaka",
  "/wiki/Planet",
  "/wiki/The_Force",
  "/wiki/Kyber_crystal",
  "/wiki/TIE_Advanced_v1",
  "/wiki/Lightsaber_duel",
  "/wiki/Force_spirit",
  "/wiki/Knighting_ceremony",
  "/wiki/Limb",
  "/wiki/Tooth",
  "/wiki/C03",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_Inquisitor_(T0-B1)",
  "/wiki/Justin_Leach",
  "/wiki/T0-B1_(short_film)",
  "/wiki/Science_SARU",
  "/wiki/Visions:_T0-B1:_The_Droid_Who_Became_a_Jedi",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Malachor",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Star_Wars:_The_Dark_Side"
 ]
}