{
 "name": "Unidentified_Koorivar_captain",
 "display_name": "Unidentified Koorivar captain",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Koorivar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "This Koorivar captain owned a YT-1000 freighter called the Reticent, which he used to ferry various goods across the galaxy. He had two Sy Myrthian crew including a navigator. Three years before the events of Berch Teller's insurgency, The Koorivar captain bought the freighter from a human information broker on Lantillies named Knotts, who was a member of Teller's rebel cell. Following the Battle in the Phindar system, Knotts sent the Koorivar captain and his ship as decoys to the Obroa-skai system to throw the Galactic Empire off Teller's scent. However, the Reticent and her crew were captured by Moff Wilhuff Tarkin and Darth Vader, who interrogated the captain and learned about Knotts and Teller's rebel cell.\nThe Koorivar captain lived during the Clone Wars and the Imperial Era. As a Koorivar, he was stigmatized by the Galactic Empire because his species supported the Confederacy of Independent Systems. The Koorivar captain had two Sy Myrthian crew including a navigator. Around 17 BBY, he and his crew acquired the YT-1000 freighter Reticent from a ship dealer on Lantillies using money loaned by the information broker Knotts, a former Republic Intelligence operative who had joined Berch Teller's rebel cell. The Koorivar captain and his crew worked as freelancers and itinerant merchants for Knotts for the next three years.\nIn 14 BBY, the captain and his crew were caught up in Teller's insurgent campaign against the Empire. Seeking revenge against Moff Wilhuff Tarkin for his role in the Antar Atrocity, Teller and his followers had stolen Tarkin's corvette Carrion Spike and used it to attack Imperial installations throughout the galaxy. Following the ordeal above Phindar, the Koorivar Cala, a follower of Teller, discovered that the Empire was tracking them using a paralight tracker.\nTeller had the Carrion Spike's hyperdrive computer transmit coordinates showing that the Carrion Spike was traveling to the Obroa-skai system. However, Teller arranged for Knotts to send a decoy ship. The information broker dispatched the Koorivar captain to travel from the Outer Rim world of Taris to the planet Thustra to pick up replacement parts for a fleet of Sephi flyers that were sold in bulk at the end of the Clone Wars to an Obroa-skai emergency medevac center. Unaware of Knott's connections to Teller's insurgents, the Koorivar captain accept the job. He and his crew's plan was to then travel to Taanab to buy foodstuffs.\nUpon arriving in the Obroa-skai system, the Reticent and her crew were caught up in a massive hyperspace accident. Believing that the insurgents were traveling to Obroa-skai, Moff Tarkin and Darth Vader deployed three interdictor vessels. However, one of the interdictors, an Immobilizer 418 cruiser's gravity well projector malfunctioned, causing an accident that killed 1,100 aboard the luxury liner Stellar Vista. Tarkin and Vader discovered that the Reticent was the first ship to emerge from hyperspace and detained the ship and her crew.\nThe Koorivar captain was stripped naked and shackled with magnetic cuffs to a containment field aboard the Imperial Star Destroyer Executrix. The magnetic cuffs monitored his life signs. Darth Vader initially tortured the captain using the dark side of the Force but Tarkin told him to give the captain a chance to speak. The captain said that he was nothing more that a merchant who had traveled to Obroa-skai on business. Vader retorted that it was the business of conspiracy and sabotage.\nThe Koorivar responded that he was only to here to buy and sell and asserted that not all Koorivar were Separatists. When Tarkin probed his remark, the captain replied that the Empire demanded retribution for the war and that it lumped the innocent with the guilty. Tarkin then quizzed the captain on whether he believed the Separatists were wrong to secede from the Galactic Republic. The captain responded that he moved around to keep from having to decide who was right and wrong. Tarkin remarked that the captain was a being without a homeworld and that the Koorivar species was once without a planet.\nWhen the merchant insisted he was telling the truth, Vader countered that he was lying and demanded that he confess to swearing allegiance to the Separatist Alliance and that his current allies were the ones seeking retribution. Tarkin then questioned the captain about the broker who provided him with the leads. The Koorivar revealed the identity of Knotts and confirmed that he had been working for the broker for three years. The captain also confirmed that Knotts loaned him and his crew credits to purchase the Reticent.\nThe captain also confirmed that Knotts had instructed him to travel from Taris to Thustra to deliver Sephi flyers to Obroa-skai. When questioned, the Koorivar confirmed that there had been no physical interaction with mnotts and that the supplies were available groundside on Thustra. The captain said that he tried to ignore Teller's propaganda holovids, leading Tarkin to remark that he was clueless. Vader then suggested torturing the Koorivar captain since he suspected that the captain was hiding something. Tarkin acquiesced to Vader's proposal and the captain was led screaming to the detention centre.\nAfter interrogating the captain and his Sy Myrthian crew, Vader was satisfied that the crew of the Reticent were not part of Teller's rebel cell. However, the Sy Myrthian navigator suffered heart failure from the harsh interrogation and torture. Based on the captain's information about Knotts, Tarkin discovered that Knotts was connected to the disaffected Republic Intelligence officer Berch Teller and his rebel cell. This information allowed the Imperials to recover the Carrion Spike and crush Teller's insurgents.\nThe Koorivar captain had a cranial horn like the rest of his species. While most of his species supported the Confederacy of Independent Systems, the Koorivar captain was disinterested in politics and was more concerned with making a living as an itinerant merchant. He had no home and traveled the galaxy on his starship Reticent. The Koorivar captain was terrified when interrogated by Lord Vader and Tarkin but maintained his story that he was a simple itinerant merchant who had no interest in politics. He was frightened when Lord Vader wanted to ascertain he was telling the truth through torture.\nThe unidentified Koorivar captain first appeared in James Luceno's 2014 Canon novel Tarkin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Koorivar",
  "/wiki/Gender",
  "/wiki/Captain",
  "/wiki/YT-1000_freighter",
  "/wiki/Reticent",
  "/wiki/The_galaxy",
  "/wiki/Sy_Myrthian",
  "/wiki/Navigator",
  "/wiki/17_BBY",
  "/wiki/Berch_Teller",
  "/wiki/Berch_Teller_campaign",
  "/wiki/Human",
  "/wiki/Lantillies",
  "/wiki/Knotts",
  "/wiki/Berch_Teller%27s_rebel_cell",
  "/wiki/Battle_in_the_Phindar_system",
  "/wiki/Obroa-skai_system",
  "/wiki/Galactic_Empire",
  "/wiki/Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Anakin_Skywalker",
  "/wiki/Clone_Wars",
  "/wiki/Imperial_Era",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Republic_Intelligence",
  "/wiki/Tarkin_(novel)",
  "/wiki/14_BBY",
  "/wiki/Antar_Atrocity",
  "/wiki/Carrion_Spike",
  "/wiki/Phindar",
  "/wiki/Cala",
  "/wiki/Paralight_tracker",
  "/wiki/Hyperdrive",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Taris",
  "/wiki/Thustra",
  "/wiki/Sephi_flyer",
  "/wiki/Obroa-skai",
  "/wiki/Taanab",
  "/wiki/Incident_in_the_Obroa-skai_system",
  "/wiki/Interdictor_vessel",
  "/wiki/Immobilizer_418_cruiser",
  "/wiki/Gravity_well_projector",
  "/wiki/Stellar_Vista",
  "/wiki/Containment_field",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Executrix",
  "/wiki/Torture",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Galactic_Republic",
  "/wiki/Propaganda",
  "/wiki/Holovids",
  "/wiki/James_Luceno",
  "/wiki/2014",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY"
 ]
}