{
 "name": "Unidentified_bald_pirate",
 "display_name": "Unidentified bald pirate",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Keyorin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lemo and Sanda's gang"
     ]
    }
   ]
  }
 ],
 "content": "A bald pirate was a member of Lemo and Sanda's gang sometime after the Battle of Endor. Alongside a Near-Duros, he was on Keyorin, the \"Hunter's World,\" when he spotted Han Solo, \"Captain Drebble,\" and his Wookiee companion alongside Han Solo. As the three exited Barpotomous Drebble's tavern, the pirate and his companion began to chase the trio down the street. The three Rebels were also being chased by bounty hunters under the employ of Barpotomous Drebble, and the two gang members were unable to catch the Rebels before they were stunned by Drebble's men. The bald pirate was able to convince Drebble to turn Solo and Chewbacca over to him, and he brought the two back to Lemo and Sanda.\nAfter hanging Solo and Chewie by energy binders, Lemo interrogated the two about the whereabouts of the Dancing Goddess, a statue that the gang had been searching for. Solo convinced the gang that \"Captain Drebble\" actually had the statue, and the group immediately left to confront Barpotomous and his prisoner \"Captain Drebble.\" However, at the same time, Solo and Chewie escaped from their energy binders and began to open fire on Lemo and Sanda's gang. In the brief firefight that ensued, Barpotomous Drebble's group caught the gang in a crossfire. As the gang was quickly destroyed, the bald pirate was killed by one of Drebble's Stenax.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Keyorin",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lemo_and_Sanda%27s_gang",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Unidentified_Near-Duros",
  "/wiki/Han_Solo/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Barpotomous_Drebble%27s_tavern",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Barpotomous_Drebble/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Lemo",
  "/wiki/Sanda",
  "/wiki/Energy_binders",
  "/wiki/Dancing_Goddess/Legends",
  "/wiki/Stenax",
  "/wiki/Star_Wars_(1977)_85"
 ]
}