{
 "name": "Unidentified_Galactic_Republic_captain",
 "display_name": "Unidentified Galactic Republic captain",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "44 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Judicial Forces",
      "Judicial Forces"
     ]
    }
   ]
  }
 ],
 "content": "A Human female had the rank of captain in the Judicial Forces of the Galactic Republic. In 44 BBY, she piloted a Consular-class cruiser to the negotiations on Troiken between the Stark Commercial Combine and Galactic Republic delegates, which ended with an attack by the Combine that began the Stark Hyperspace War. The Republic delegates retreated to the cruiser, which the captain tried to fly to safety, but the cruiser was damaged and exploded shortly after landing near Republic forces at Mount Avos. The captain was injured and recuperated while battles continued against the Stark forces. Eventually, the Jedi who had been part of the delegation planned to return to the Republic capital Coruscant to appeal for aid from the Senate. At a Troiken spaceport, the Jedi stole the Quicksilver, the personal ship of the Combine's leader, Iaco Stark, with the captain piloting it to Coruscant. While transporting the Jedi Adi Gallia and Senators Finis Valorum and Nute Gunray, the captain was killed by an electric shock from booby trap set up by Stark.\nA Human female served as a captain in the Judicial Forces of the Galactic Republic. In 44 BBY, she piloted a Republic delegation to the planet Troiken aboard a Consular-class cruiser, where they hoped to negotiate with the Stark Commercial Combine, who had been attacking transports carrying the healing substance bacta, which had become scarce. The delegation included Senator Finis Valorum, and Jedi Tyvokka, Adi Gallia, Plo Koon, Qui-Gon Jinn, and Obi-Wan Kenobi. Senator Nute Gunray of the Trade Federation was also in attendance, although he arrived on his own shuttle with a compliment of HKB-3 hunter-killer droids.\nThe negotiations ended abruptly when the Combine's leader Iaco Stark attacked the delegation and used a navigation computer virus to sabotage the incoming Republic fleet led by the rogue Militarist Senator Ranulph Tarkin, beginning the Stark Hyperspace War. Tyvokka was mortally injured by Gunray's droids during the ambush, and the Republic delegates escaped the chaotic scene and reatreated to the Consular-class cruiser. Valorum used the ship to send a transmission to coordinate a rendezvous with Tarkin, while the captain began preparing it for takeoff.\nAfter Gunray's shuttle was destroyed by the Combine, Jinn told the captain to activate the ship's shields and head to the rendezvous, as their presence was clearly known to the enemy. The captain expressed hope that they could escape, as the ship had suffered collateral damage from the destruction of the shuttle. Once the ship took flight, Jinn spotted another vessel, Blue 9, that he deduced had destroyed the Trade Federation shuttle, and asked the captain if they could outrun it. The captain explained that their ship and its shields were too damaged to do so, being a diplomatic vessel without weapons. Jinn decided to see what the other Jedi had to suggest. Together, the Jedi—aside from the newly deceased Tyvokka—used the Force to create the illusion to Blue 9's pilot that he was surrounded by enemy starfighters, causing him to cease pursuing the cruiser and eject.\nThe Consular-class cruiser crash landed at the rendezvous point near Mount Avos, where Tarkin's forces were escaping Stark's army by fleeing into the mountain's caves. Knowing the ship was about to explode, its passengers quickly fled, with Koon carrying the wounded captain. The Jedi continued to hold her as he took shelter behind some rocks from the inferno. The captain stood back up as the Jedi discussed their next moves with Tarkin, with Koon suggesting that they enter the caves for safety. The pilot spent the subsequent battle against the Stark forces recovering.\nWhen the Jedi began planning to ferry Valorum to the Galactic Senate on the Republic capital planet Coruscant to plea for support, Koon asked if the captain was sufficiently recovered, to which Gallia responded in the affirmative. Tarkin's aide Jace Dallin created a diversion for the Stark forces while all of the Jedi aside from Koon escaped through an access shaft, with Jinn and Gallia stealing a repulsorcraft to travel to a spaceport. They planned to steal one of the Stark Combine's ships, believing it would not be affected by the virus that had been unleashed on the Republic ships.\nKoon revealed to Gallia that Stark kept a personal ship, the Quicksilver, which the group could steal. The Jedi Tholme and Quinlan Vos, having arrived independently to Troiken, set off an explosion near the spaceport, allowing the captain, Gallia, Gunray, and Valorum to head for the Quicksilver while Jinn and Kenobi returned to Mount Avos. While killing the Twi'lek guarding the ship, Koon asked the captain how quickly she could start flying, to which she responded that it could be done as soon as Gunray was onboard. She also expressed confusion as to who had caused the explosion. The pilot quickly flew the Quicksilver away from Troiken to reach the Coruscant, seated next to Gallia in the pilot's chair.\nThe group hoped to analyze the Quicksilver's navigation computer to find a way to counteract the virus that had infected the Republic ships. However, as the ship neared Coruscant and the captain took the Quicksilver out of hyperspace, a booby trap activated, electrocuting the captain and killing her instantly. Valorum rushed in to see what happened and saw the captain's smouldering body, to which Gallia suggested that Stark had a hidden code in his ship that sprung the trap in its absence. Gallia, Gunray, and Valorum ran to the ships' escape pods and were able to land safely on Coruscant as the Quicksilver exploded.\nThe captain was willing to accept suggestions from the Jedi in order to escape the Stark Combine's forces. She served the Republic during the war at the cost of her own life. She had blonde hair, blue eyes, and light skin.\nThe captain was capable of flying a Consular-class cruiser and was able to quickly fly the Quicksilver after encountering it.\nThe captain wore the blue uniform of the Judicial Forces, and wielded a blaster during the Stark Hyperspace War.\nThe Republic captain first appeared in flashbacks the thirty-seventh issue of the 1998 Star Wars comic-book series. The issue, which was the second in the The Stark Hyperspace War arc, was written by John Ostrander, illustrated by Davidé Fabbri, and published by Dark Horse Comics on December 19, 2001.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/44_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Judicial_Forces/Legends",
  "/wiki/Star_Wars_(1998)_37",
  "/wiki/Pilot/Legends",
  "/wiki/Consular-class_cruiser",
  "/wiki/Troiken/Legends",
  "/wiki/Stark_Commercial_Combine",
  "/wiki/Stark_Hyperspace_War/Legends",
  "/wiki/Mount_Avos",
  "/wiki/Jedi/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Quicksilver_(Iaco_Stark)",
  "/wiki/Iaco_Stark",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Finis_Valorum/Legends",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/Death/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Tyvokka/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Trade_Federation_shuttle",
  "/wiki/HKB-3_hunter-killer_droid",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Republic_Outland_Regions_Security_Force",
  "/wiki/Militarists/Legends",
  "/wiki/Ranulph_Tarkin/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Blue_9",
  "/wiki/The_Force/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Second_Battle_of_Qotile",
  "/wiki/Aide/Legends",
  "/wiki/Jace_Dallin",
  "/wiki/Third_Battle_of_Qotile",
  "/wiki/Repulsorcraft/Legends",
  "/wiki/Tholme/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Escape_pod/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars_(1998)_38",
  "/wiki/Blaster/Legends",
  "/wiki/1998",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Republic:_The_Stark_Hyperspace_War",
  "/wiki/John_Ostrander",
  "/wiki/David%C3%A9_Fabbri",
  "/wiki/Dark_Horse_Comics",
  "/wiki/December_19",
  "/wiki/2001",
  "/wiki/Category:Images_of_Unidentified_Galactic_Republic_captain",
  "/wiki/Star_Wars_(1998)_39",
  "/wiki/Cloak_of_Deception",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Marvel_Comics"
 ]
}