{
 "name": "Unidentified_Kindalo_2",
 "display_name": "Unidentified Kindalo 2",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aleen"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kindalo"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3.1 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown",
      "white"
     ]
    }
   ]
  }
 ],
 "content": "A Kindalo resided in the Underworld on the planet Aleen. During the Clone Wars, C-3PO and R2-D2 stumbled upon them when they fell into the Underworld and although initially, the Kindalo saw them as intruders, he later realized they meant no harm and guided them towards Orphne, a mystical being who could help them get out.\nLike many other dwellers of the Underworld, the air on the surface was poisonous to him and so, there was a seal on the surface that separated the surface from the Underworld. However, sometime during the Clone Wars, the seal had been opened under mysterious circumstances and the Kindalo knew that they were in danger so in retaliation, this Kindalo along with the others produced groundquakes to make the Aleenas suffer as they believed that the Aleena attacked the seal. The Aleena, on the other hand were unable to close the seal as the air underground was toxic to them. So when a relief mission undertaken by clone commander Wolffe reached their planet, the Aleena were happy to see them. Wolffe was accompanied by protocol droid, C-3PO and astromech R2-D2.\nWhile the droids were inspecting the seal, the Kindalo caused another massive earthquake, causing the 3PO to fall into the seal, forcing R2 to follow.\nBoth droids then proceeded on, following the cave and eventually, running into the Kindalo. The Kindalo and three others of his kind surrounded the droids. One of the other Kindalo asked for why the droids had come. Then this Kindalo told them that they do not belong here and asked them to leave immediately. He explained that the surface air was toxic to them and they had to keep the seal closed. They revealed that they had caused the groundquakes as an act of revenge.\nBut then the Kindalo realized that the the droids were here to help and so this Kindalo directed them towards Orphne, who them claimed would help. The four Kindalo them watched them leave.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Aleen/Legends",
  "/wiki/Kindalo/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Orphne/Legends",
  "/wiki/Aleena/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-3636",
  "/wiki/3PO-series_protocol_droid/Legends",
  "/wiki/R2-series_astromech_droid",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Mercy_Mission_(episode)"
 ]
}