{
 "name": "Unidentified_Iktotchi_prophet",
 "display_name": "Unidentified Iktotchi prophet",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Unidentified world in the Inner Rim"
     ]
    },
    {
     "name": "Died",
     "values": [
      "C. 67 BBY; Saleucami"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Iktotchi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  }
 ],
 "content": "A Force-sensitive Iktotchi female was a prophet with keen precognitive abilities who gathered a following on Saleucami during the First Century BBY.\nThis prophet, who was native to the Inner Rim, settled, around the year 70 BBY, on Saleucami, where she gathered a large following. She was sought out, without her knowledge, by the Bith Sith Lord Darth Venamis, who kept her name on a list of potential Sith apprentices.\nAround the year 67 BBY, after Venamis was bested in a duel by the Muun Dark Lord Darth Plagueis, his list came to Plagueis's attention, who decided to seek out Venamis's candidates in order to determine if they would pose a threat to him and to the Grand Plan.\nPlagueis traveled to Saleucami and came before the prophet among a large crowd. There, the Iktotchi apparently foretold major events of the coming half-century with great accuracy. She told of terrible galaxy-spanning war fought between \"machines of alloy and machines of flesh\" that would cause the collapse of the Republic, catastrophe for the Jedi Order, and the formation of a New Order under \"a ruthless despot who serves the forces of entropy.\" She preached a message of embracing the coming darkness as the only means of survival and called upon the audience members to approach her and be touched by her in order to be set upon the path towards their recreation.\nWhen Plagueis approached her, she took his hands in hers and immediately divined that he was a well-educated and wealthy Muun. She sensed that \"he wore the darkness of the future\" and claimed that he was the one she had sought out. Plagueis, gripping her hands tightly, told the prophet that she posed a threat to his cause, and struck her dead with Force lightning through his grip. By killing her, the Dark Lord eliminated what he considered to be the preacher of an antiquated and dangerous message, the same message that had doomed the Sith of old, and a threat to the inevitable future.\nAfter her murder at Plagueis' hands, the prophet's visions of the future came to pass. In 22 BBY, the Clone Wars split the Republic, and three years later, Palpatine, Darth Plagueis's apprentice, reformed the Republic into the Galactic Empire, and subjugated countless species and worlds.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Unidentified_Iktotchi_prophet",
  "/wiki/Inner_Rim",
  "/wiki/67_BBY",
  "/wiki/Saleucami/Legends",
  "/wiki/Iktotchi/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Great_Peace_of_the_Republic",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Standard_year/Legends",
  "/wiki/70_BBY",
  "/wiki/Bith/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Venamis",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Contest_on_Sojourn",
  "/wiki/Muun/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Grand_Plan/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)"
 ]
}