{
 "name": "Unidentified_Aqualish_bounty_hunter_(Upper_City)",
 "display_name": "Unidentified Aqualish bounty hunter  (Upper City)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aqualish"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Davik Kang"
     ]
    }
   ]
  }
 ],
 "content": "In 3956 BBY, an Aqualish bounty hunter worked for the crime lord Davik Kang on the planet Taris. That year, Kang dispatched him and a Human bounty hunter to collect 100 credits from one of his debtors, an aged merchant. The merchant could not pay the full sum, and the bounty hunters intended to take him to Kang, who would kill the man as an example to other debtors. However, the merchant was rescued by the Galactic Republic soldier Revan, who killed both the Aqualish and his Human colleague.\nDuring the Jedi Civil War, an Aqualish male bounty hunter worked for the crime lord Davik Kang on the planet Taris. In 3956 BBY, the Aqualish and a Human bounty hunter were sent by Kang to collect a 100-credit debt from an elderly merchant, who had failed to pay it on time. The two bounty hunters confronted the merchant in the Upper City and tried to extort the money from him. The merchant, however, had only half the necessary sum, which he offered as a down payment and asked for more time to find the rest. The bounty hunters did not agree to the man's terms and prepared to take him to Kang, who would kill him as an example to others who did not pay their debts. Frightened, the merchant cried for help.\nFortunately for the merchant, his cry was heard by the Galactic Republic soldier Revan, who was searching for the Jedi Knight Bastila Shan on Taris. Trying to help the man, Revan intervened and told the bounty hunters to release him. The Aqualish and his partner, viewing Revan as an unwanted witness, attacked him. However, Revan killed the two, rescuing the merchant.\nThe Aqualish was loyal to Kang and followed his employer's orders to the letter. Despite the merchant's pleas to accept a down payment and give him more time, the bounty hunter was intent to take him to Kang, who would kill the man. The day he died, the Aqualish was carrying a blaster and fifty credits. The bounty hunter had blue eyes.\nThis Aqualish bounty hunter appears as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic. This article follows the canonical light side walkthrough, although the player, controlling Revan, can deal with the bounty hunters in the game in several ways. The player may simply attack them out of spite or opt not to intervene in the argument. In the latter scenario, the bounty hunters take the merchant to Kang. Should the player approach the bounty hunters while wearing Sith trooper armor, they mistake Revan for a Sith and remind him that Kang has made a deal with the Sith, according to which both sides do not interfere in each other's business. If Revan continues to impersonate the Sith and orders the Aqualish and his fellow bounty hunter to release the merchant, they attack him, stating that they take orders from Kang only.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3956_BBY",
  "/wiki/Taris/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Davik_Kang",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Crime_lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Unidentified_Human_bounty_hunter_(Upper_City)",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Unidentified_Taris_merchant",
  "/wiki/Merchant/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Time/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Upper_City",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Blaster/Legends",
  "/wiki/Eye/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sith_trooper_armor/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Sith/Legends",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}