{
 "name": "Unidentified_Imperial_guard",
 "display_name": "Unidentified Imperial guard",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "A Human male worked as a guard and an officer in the Imperial Military during the Galactic Civil War. In 1 ABY, the man was on leave on the planet Kashyyyk shortly before the Dark Lord of the Sith, Darth Vader, ordered a blockade of the planet. While off duty, the guard paid a visit to a trading post near the city of Rwookrrorro and bullied the shopkeeper, Saun Dann, into giving away some of his goods for free. Having successfully pressured Dann, the guard left the trading post with an extorted high-tech groomer tucked in his belt.\nA Human male served as a guards and an officer in the Imperial Military, the armed forces of Emperor Palpatine's Galactic Empire. In 1 ABY, the Dark Lord of the Sith, Darth Vader, suspected Rebel Alliance activity on the world Kashyyyk—then known as \"Wookiee Planet C\" to the Imperials—and ordered martial law to be declared there. A blockade was set up around the planet and a curfew was imposed. The officer was on leave on the Wookiee homeworld when the blockade started, still wandering about in his in black uniform.\nWhile off duty, the Imperial decided to visit \"Trading post Wookiee Planet C,\" a local shop located near Rwookrrorro, the capital city of Kashyyyk. When the shopkeeper, Saun Dann, saw him looking at the merchandise, he was frightened and thought the officer wanted to see his identification. Dann reached into his pocket to pull out his ID, but the guard stopped him, stating that he was off-duty and only wished to look around the shop. The salesman then attempted to sell him a micro-sized aquarium. The black-clad guard inspected the fish inside for a moment before putting the container on the counter, and then bluntly commented that he hated fish, which made Dann more nervous. The old man then retrieved what appeared to be a hair trimmer, which he gave to the Imperial in hopes that he would be interested in it.\nThe situation was becoming tense when a beeping sound was issued by a wallscreen. While Dann spoke with the caller, a female Wookiee named Mallatobuck, the guard continued browsing the goods for sale. The Imperial had been fooled: unbeknownst to him, Saun Dann was really a member of the Rebel Alliance, and Mallatobuck was the wife of Chewbacca, one of the Rebellion's heroes the Empire sought to apprehend. The Imperial did not notice Dann looking back to see if he was paying attention to him, nor did he realize that the video conversation was a secret message about Chewbacca and his friend, Han Solo.\nWhen the conversation was over, Saun Dann returned to the guard, who told him he was unimpressed with the last item he had been offered to buy. Feeling challenged, the shopkeeper picked up the manual for the groomer and started demonstrating it as he talked. The Imperial finally took the groomer from Dann's hands and put it in his belt. When the old man asked him if he wished to pay or trade for it, the guard answered that he would simply take it. Without any further ado, he walked away with the extorted merchandise, leaving a confused and mumbling Saun Dann alone in his shop.\nThe Imperial guard was a Human of average size and build, with brown hair, a bushy mustache and brown eyes. He stared at Saun Dann with cold, intimidating looks and spoke with a deep, growling voice in a military fashion, using short sentences. He would take advantage of his status as an Imperial guard, ready to bully the shopkeeper to obtain what he wished. He was rather blasé about the exotic items Dann attempted to sell him, remaining calm and uninterested the entire time. When the shopkeeper left him on his own for a moment, the officer started browsing the merchandise with obvious nonchalance. The mustachioed guard also loathed fishes.\nWhen in service, the guard wore a black double-breasted tunic and a swooping, black-tinted blast helmet made of plastoid composite alloy. On both outside panels of his tunic, there were pockets containing code cylinders, devices that allowed officers access to computer systems and secure areas. His belt was also equipped with an officer's disc, which contained additional coded information. The guard's issued uniform did not fit him exactly, as the sleeves were a bit too short.\nThis Imperial guard appeared in the 1978 Star Wars Holiday Special, in which he was portrayed by American actor Lev Mailer. In an interview with the fan site Starwarsholidayspecial.com, Mailer explained that he and Art Carney—who portrayed Saun Dann—chose to play their scene like a classic \"The Bully and The Idiot\" routine, with Carney playing the idiot to his bully. The Holiday Special aired only once on television and was almost unanimously panned. In an article published in the 106th issue of the Star Wars Insider magazine, Star Wars author Alex Newborn credited the Imperial characters as contributing factors to the program's lack of cohesion, calling them \"ineffectual Imperial antagonists\". However, unlike other actors who starred in the show, Mailer didn't express regrets for participating in the Holiday Special, stating it was \"kind of a fun little show\" and had \"a certain charm.\"\nIn the show's credits, Mailer's character was credited as \"Imperial Guard #1,\" but the Emperor's Royal Guards, also known as \"Imperial Guards,\" first appeared in Star Wars: Episode VI Return of the Jedi, five years after the Holiday Special. Furthermore, the bully wears the distinctive helmet and black uniform of the Imperial Navy troopers who first appeared in Star Wars: Episode IV A New Hope in 1977. However, the Navy troopers had a wide range of duties, serving notably as guards aboard Imperial battlestations such as the first Death Star. The presence of two code cylinders in the small pockets of his tunic also indicates that the black guard was an officer and not just an enlisted soldier, since such devices were issued only to officers. The mustachioed guard did not wear any rank indicator plaque. While officers with code cylinders and no plaque never appeared in the Star Wars trilogy, some were seen in the 1995 video game Star Wars: Rebel Assault II: The Hidden Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/Trading_post_Wookiee_Planet_C",
  "/wiki/City/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Saun_Dann",
  "/wiki/Groomer",
  "/wiki/Belt/Legends",
  "/wiki/Security_guard/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Blockade/Legends",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Identichip/Legends",
  "/wiki/Aquarium/Legends",
  "/wiki/Wallscreen",
  "/wiki/Mallatobuck/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Time/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Plastoid/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Imperial_officer%27s_disc",
  "/wiki/1978",
  "/wiki/Lev_Mailer",
  "/wiki/Starwarsholidayspecial.com",
  "/wiki/Art_Carney",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars",
  "/wiki/Alex_Newborn",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/1983",
  "/wiki/Imperial_Navy_trooper",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1977",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Battlestation",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Code_cylinder/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Rank_insignia_plaque/Legends",
  "/wiki/Original_trilogy",
  "/wiki/1995",
  "/wiki/Star_Wars:_Rebel_Assault_II:_The_Hidden_Empire",
  "/wiki/I_Have_a_Bad_Feeling_About_This!",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Imperial_Sourcebook",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee",
  "/wiki/October_12",
  "/wiki/2006",
  "/wiki/Chewbacca%27s_home",
  "/wiki/Heir_to_the_Empire",
  "/wiki/Star_Wars:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/November_11",
  "/wiki/2008",
  "/wiki/June_25",
  "/wiki/2017",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_94",
  "/wiki/October_10",
  "/wiki/2009",
  "/wiki/Databank_(original)"
 ]
}