{
 "name": "Unidentified_stormtrooper_(Kejim_Outpost_Fuel_Valves)",
 "display_name": "Unidentified stormtrooper  (Kejim Outpost Fuel Valves)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "12 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Remnant"
     ]
    }
   ]
  }
 ],
 "content": "This stormtrooper was stationed at Kejim Outpost in 12 ABY. On the day that Kyle Katarn and Jan Ors infiltrated the outpost, the stormtrooper was ordered to guard a chamber that housed fuel valves and two containers of an unidentified flammable substance alongside two other stormtroopers. Additionally, this chamber was connected to the base's communications array by a bridge that spanned a deep pit.\nA short time before Katarn reached the chamber, the stormtrooper warned his fellow stormtroopers to direct their blaster fire away from the fuel valves. When Katarn opened the door, the containers inexplicably exploded, causing damage to the valves and killing the stormtrooper, as well as one of the other two stormtroopers guarding the chamber.\nDespite this, Katarn continued down the bridge and took out another stormtrooper stationed at the other end. A pair of ceiling valves at the bridge's entrance then collapsed diagonally, forcing the mercenary to keep running. When Katarn narrowly reached the end, a racing fireball followed and the bridge exploded in a significant, loud explosion, completely dismantling it. Katarn barely survived the dangerous collapse.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/12_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Kejim_Outpost",
  "/wiki/Kyle_Katarn",
  "/wiki/Jan_Ors",
  "/wiki/Mission_to_Kejim",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars:_Jedi_Knight_II:_Jedi_Outcast"
 ]
}