{
 "name": "Unidentified_Imperial_lieutenant_(Sovereign)",
 "display_name": "Unidentified Imperial lieutenant  (Sovereign)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Officer Corps",
      "Imperial Military",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "In 18 BBY, a human male lieutenant of the Galactic Empire served aboard the Sovereign, and reported to Governor Wilhuff Tarkin.\nIn 18 BBY, the human male lieutenant served aboard the Imperial I-class Star Destroyer Sovereign when Governor Wilhuff Tarkin was assigned the military aspects of dealing with rising tensions with the Outer Rim world of Mon Cala. The lieutenant was on the bridge when he received an update on the status of negotiations Ambassador Telvar was conducting with the King of Mon Cala Lee-Char. The lieutenant relayed to Governor Tarkin that Telvar would be returning to the Sovereign shortly, and when Tarkin questioned the status of the negotiations, the lieutenant continued by stating that, in Telvar's words, \"negotiations unproductive, but ongoing.\" Governor Tarkin acknowledged, and responded to the lieutenant that a diplomatic solution was preferable. When a crew member informed Tarkin that a Zeta-class shuttle was inbound and that the transponder identified the vessel as the Infernum, Governor Tarkin cleared it to continue to the planet. When the lieutenant asked if Tarkin was familiar with the vessel, Tarkin responded that he was, and that it represented an entirely different form of diplomacy.\nWhen Telvar's Lambda-class T-4a shuttle exploded, the lieutenant informed Tarkin that their sensors had picked up an explosion shortly after takeoff, and that it appeared to be a total loss. Tarkin questioned on what type of explosion, and the lieutenant replied that they were still gathering data. Tarkin then ordered the lieutenant to inform Major Rantu that he was to employ landing craft when he gave the signal, and also ordered the lieutenant to inform Colonel Bergon and Commander Jordo that they were to begin their phases of the operation.\nAfter the planet-wide invasion began, and the Battle of Dac City had commenced, King Lee-Char his military forces evacuated all civilians from surface cities. By the time evacuations were half-completed, King Lee-Char contacted the Sovereign to protest the military invasion, exclaiming that they were not responsible for the death of Ambassador Telvar and that further Imperial attacks would be met with an aggressive defense. After the conversation ended with no success of ending the conflict, Tarkin ordered the lieutenant to contact Rantu and inform him that he is to expect a large-scale counterattack from native forces and that it would occur when the civilian population have been fully evacuated. When the lieutenant asked if he should also inform Rantu on the nature of the attack, Tarkin replied by stating that he did not know what tactic the natives would employ, but that the Empire was fully aware of their military capabilities. Mon Cala forces would deploy enormous oceanic creatures throughout the planet, jumping above the water and crashing down near the surface cities, destroying them and all Imperial forces.\nThe Imperial lieutenant first appeared, albeit unnamed, in the 2018 canon comic Darth Vader  13, written by Charles Soule and pencilled by Giuseppe Camuncoli.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Imperial_lieutenant",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/18_BBY",
  "/wiki/Sovereign",
  "/wiki/Governor",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Lieutenant",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Mon_Cala",
  "/wiki/Bridge_(starship)",
  "/wiki/Ambassador",
  "/wiki/Telvar",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/Zeta-class_shuttle",
  "/wiki/Infernum",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Major",
  "/wiki/Rantu",
  "/wiki/Colonel",
  "/wiki/Bergon",
  "/wiki/Commander",
  "/wiki/Jordo",
  "/wiki/Battle_of_Dac_City",
  "/wiki/King",
  "/wiki/Mon_Cala_planetary_defense_services",
  "/wiki/Death",
  "/wiki/Ocean",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_13",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Darth_Vader_(2017)_14"
 ]
}