{
 "name": "Unidentified_Trandoshan_hunter_(Kashyyyk)",
 "display_name": "Unidentified Trandoshan hunter  (Kashyyyk)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "A Trandoshan male hunter operated during the Clone Wars. During that time, the Trandoshan hunter kidnapped the young Force-sensitive Wookiee Yiprukk from his family in the city of Rwookrrorro on the planet Kashyyyk. The Wookiees of Rwookrrorro managed to disable the hunter's starship, preventing his escape, and he fled with his captive into the lower levels of the forest.\nA group of individuals visiting Kashyyyk were tasked with rescuing Yiprukk, venturing into the forest below Rwookrrorro. The individuals managed to locate the Trandoshan hunter, who did not believe that the Wookiees would let him go. The group successfully managed to rescue Yiprukk from the Trandoshan.\nThe Trandoshan hunter was first mentioned in the 2020 roleplaying game sourcebook Collapse of the Republic, in an adventure seed for Fantasy Flight Games' Star Wars Roleplaying system. The player characters can either make a deal to help the Trandoshan offworld in return for Yiprukk—which they do not necessarily have to honor after rescuing the Wookiee—or alternatively fight and potentially kill the hunter. If the Trandoshan is left alive and armed, he assists the players against a terentatek that attacks shortly afterward, and can be left behind to distract the creature. This article does not assume which method the players use to rescue Yiprukk, only that the scenario is completed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Trandoshan_hunter",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Clone_Wars",
  "/wiki/Time",
  "/wiki/Hunting",
  "/wiki/Force-sensitive",
  "/wiki/Wookiee",
  "/wiki/Yiprukk",
  "/wiki/City",
  "/wiki/Rwookrrorro",
  "/wiki/Planet",
  "/wiki/Kashyyyk",
  "/wiki/Starship",
  "/wiki/Forest",
  "/wiki/Roleplaying_game",
  "/wiki/2020",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars_Roleplaying",
  "/wiki/Death",
  "/wiki/Terentatek"
 ]
}