{
 "name": "Unidentified_Advanced_Recon_Commando_(intelligence_officer)",
 "display_name": "Unidentified Advanced Recon Commando  (intelligence officer)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Special Operations Brigade",
      "Republic Intelligence",
      "Grand Army of the Republic",
      "Special Operations Brigade",
      "Republic Intelligence",
      "Special Operations Brigade",
      "Republic Intelligence",
      "Republic Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "An Advanced Recon Commando served as a clone intelligence officer for the Grand Army of the Republic during the Clone Wars. When the war was initiated in 22 BBY between the Galactic Republic and the Confederacy of Independent Systems, the ARC trooper joined the Grand Army's Special Operations Brigade and, within six months, was authorized to deliver briefs from within the headquarters of Republic Intelligence. The officer gave one such briefing to two squads of clone commandos, tasking them with a mission to Ord Mantell in order to retrieve a package for Supreme Chancellor Palpatine from a group of Trandoshan bounty hunters. Although the package was recovered successfully, all of the men were killed during the course of the operation, excluding Sergeant RC-1013.\nAn Advanced Recon Commando was a Human male clone of the Mandalorian bounty hunter Jango Fett. Bred on the planet Kamino, he served as part of the Grand Army of the Republic's elite special forces. Following the Battle of Geonosis and the start of the galaxy-spanning Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the ARC trooper—along with the rest of his ARC comrades—became a part of the Republic's Special Operations Brigade as an intelligence officer.\nBy six months into the war's first year, the ARC trooper had become authorized to issue briefings at the headquarters of Republic Intelligence. It was in that capacity that he met with two squads of clone commandos at Republic Intelligence headquarters, where he tasked them with a mission to the Mid Rim world of Ord Mantell. The officer explained that a diplomatic package bound for Supreme Chancellor Palpatine from Malastare diplomats had been intercepted and stolen by a gang of Trandoshan bounty hunters, who were aiming to sell it to the Confederacy of Independent Systems. Because of its importance, the ARC trooper tasked the two squads to travel to Ord Mantell and reacquire the package from the Trandoshans, in order to deliver it to the Republic capital of Coruscant. The package was successfully recovered and the Trandoshan mercenaries killed. However, all of the commandos in both squads perished during the mission, with the exception of clone commando RC-1013.\nAs a clone of Jango Fett, the ARC officer stood at 1.83 meters in height. Many ARC troopers were personally trained as an ARC trooper by Fett and possessed the Mandalorian's ruthlessness and efficiency. These troopers were trained to be self-sufficient, although they were not entirely independent, and were also taught to rely on themselves, although they were not completely independent. The ARC officer wore a set of Phase I class armor, equipped with a blast-dampening kama and a rank-signifying pauldron; the armor itself was adorned with yellow markings. He expected both squads of commandos to risk their lives in order to ensure a successful retrieval of the diplomatic package.\nThe ARC intelligence officer was introduced in the short story The Package, which was one of four comics compiled in the third volume of the Star Wars: Clone Wars Adventures trade paperbacks. The character was created by Ryan Kaufman and drawn by Matthew and Shawn Fillbach.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Advanced_Recon_Commando_(disambiguation)",
  "/wiki/Wookieepedia:AgriCorps",
  "/wiki/Wookieepedia:AC/Unidentified_Advanced_Recon_Commando_(intelligence_officer)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Special_Operations_Brigade/Legends",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Intelligence_officer/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Army/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Republic_Intelligence_headquarters",
  "/wiki/Officer/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Clone_commando/Legends",
  "/wiki/Mission_to_Ord_Mantell_(Clone_Wars)",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/The_Package",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Death/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/RC-1013",
  "/wiki/Mandalorian/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Special_forces/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Malastare/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/ARC_trooper_armor/Legends",
  "/wiki/Kama/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Color/Legends",
  "/wiki/The_Package_(comic)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_3",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Matthew_Fillbach",
  "/wiki/Shawn_Fillbach",
  "/wiki/Databank_(original)",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/The_Essential_Atlas",
  "/wiki/Orders",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_4",
  "/wiki/The_Clone_Wars_Campaign_Guide"
 ]
}