{
 "name": "Unidentified_Imperial_advisor_(purple_robe)",
 "display_name": "Unidentified Imperial advisor  (purple robe)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "DS-2 Death Star II Mobile Battle Station over Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Coming from the bureaucracy of the Galactic Empire, a human male came to serve as an advisor to Galactic Emperor Sheev Palpatine. Totally subservient to the Emperor, he accompanied him when Palpatine boarded the DS-2 Death Star II Mobile Battle Station above the moon of Endor in 4 ABY. The advisor perished when the battle station was destroyed by the Alliance to Restore the Republic.\nA human male served as an advisor to Galactic Emperor Sheev Palpatine during the rule of the Galactic Empire. Having all come from the bureaucracy that made the Emperor's will reality, the Emperor's advisers ranked amongst the most powerful individuals in the galaxy. When Palpatine traveled to join his apprentice Darth Vader aboard the DS-2 Death Star II Mobile Battle Station battle station in 4 ABY, the advisor was one of six who accompanied him.\nThe group landed in one of the station's hangars in a Lambda-class T-4a shuttle while it was still in construction in orbit over the moon Endor. Vader and Moff Tiaan Jerjerrod awaited their arrival in the hangar with a large number of Imperial personnel, and upon disembarking the shuttle, Palpatine and Vader led the advisors and a group of Imperial officers through the other personnel, with this advisor walking alongside Janus Greejatus as he conversed with an officer at the rear of the group.\nServing as dignitaries and attendants, the six advisors remained on the Death Star to serve Palpatine as required. Not long after their arrival, the Death Star was attacked by the Alliance to Restore the Republic as part of a trap set up by the Emperor; however, Palpatine was ultimately killed during the battle. The advisor and his five colleagues then perished when station was then destroyed.\nThe advisor fair skin and, like all of Palpatine's advisors, was totally subservient to the Emperor.\nThe advisor wore purple robes with a red trim and lining. His outfit also included a hat, which, other than in the color of the trim, was identical in design to that of fellow advisor Janus Greejatus, whose hat was from the planet Coruscant.\nThe advisor was created for the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi, although he was referred to prior to the film in the Star Wars Legends novelization written by James Kahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Imperial_advisor_(purple_robe)",
  "/wiki/Unidentified_Imperial_Advisor_(purple_robe)",
  "/wiki/Unidentified_Imperial_Advisor",
  "/wiki/4_ABY",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Endor",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Moon",
  "/wiki/Battle_station",
  "/wiki/Battle_of_Endor",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial_Era",
  "/wiki/Emperor%27s_adviser",
  "/wiki/The_galaxy",
  "/wiki/Sith_apprentice",
  "/wiki/Anakin_Skywalker",
  "/wiki/Advisor",
  "/wiki/Space_station",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Moff",
  "/wiki/Tiaan_Jerjerrod",
  "/wiki/Shuttle",
  "/wiki/Imperial_officer",
  "/wiki/Janus_Greejatus",
  "/wiki/Officer",
  "/wiki/Death_Star",
  "/wiki/Death",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Hat",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Episode_VI:_Return_of_the_Jedi_(novel)",
  "/wiki/James_Kahn",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}