{
 "name": "Unidentified_Mon_Calamari_soldier",
 "display_name": "Unidentified Mon Calamari soldier",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "61st Mobile Infantry",
      "61st Mobile Infantry"
     ]
    }
   ]
  }
 ],
 "content": "A Mon Calamari soldier served in the New Republic's 61st Mobile Infantry during the Galactic Civil War. During the 61st's deployment to the planet Troithe around 5 ABY, the soldier and half a dozen other infantry met with some New Republic pilots. During their discussions, the Mon Calamari expressed desire for the late Emperor Palpatine to have lived and faced a trial for his crimes.\nDuring the Galactic Civil War, the Mon Calamari served as an infantry soldier in the New Republic's 61st Mobile Infantry. Around 5 ABY, the 61st fought against the Galactic Empire's forces on the ecumenopolis planet Troithe. One night, the Mon Calamari soldier and half a dozen other 61st infantry met with pilots from the New Republic's Alphabet Squadron at a spaceport where a refugee camp was located. The soldiers ate Imperial rations handed out by the pilot Nath Tensent, and the Mon Calamari lingered next to Sergeant Zab for most of the conversations that ensued.\nWhen the soldiers discussed what they would do to the body of the late Emperor Palpatine, who had perished during the Battle of Endor in 4 ABY, if it had been recovered, the Mon Calamari wished that the Emperor had survived and faced a trial for his crimes so that other Imperials would fear the New Republic's justice. In reply, Sergeant Vitale claimed that the Imperials put on trial after might just argue that they were not as bad as Palpatine.\nThe Mon Calamari had only one eye, the other side of the soldier's face instead having an eye socket the size of a fist. The infantry soldier wished for Emperor Palpatine to have been tried and executed as a fear tactic against other Imperials.\nThe Mon Calamari soldier appeared in the 2020 novel Shadow Fall, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mon_Calamari",
  "/wiki/New_Republic",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Galactic_Civil_War",
  "/wiki/Troithe_operation",
  "/wiki/Planet",
  "/wiki/Troithe",
  "/wiki/5_ABY",
  "/wiki/Soldier",
  "/wiki/New_Republic_pilot",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Infantry",
  "/wiki/New_Republic_soldier",
  "/wiki/Galactic_Empire",
  "/wiki/Troithe_garrison",
  "/wiki/Ecumenopolis",
  "/wiki/Standard_day",
  "/wiki/Alphabet_Squadron",
  "/wiki/Spaceport",
  "/wiki/Pilot",
  "/wiki/Nath_Tensent",
  "/wiki/Sergeant",
  "/wiki/Zab",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Emperor",
  "/wiki/Gender",
  "/wiki/Eye",
  "/wiki/2020",
  "/wiki/Shadow_Fall",
  "/wiki/Alexander_Freed",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}