{
 "name": "Unidentified_Imperial_security_guard",
 "display_name": "Unidentified Imperial security guard",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Ginger"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "A human male Imperial officer served as a security guard in Fortress Inquisitorius on the ocean moon Nur by 9 BBY. The lead security on his level, he held the military rank of lieutenant. The officer operated at a security gate and stood at ease when the Inquisitor Third Sister passed through. Later on, the security officer stopped the Imperial officer Captain Tala Durith when she tried to pass through, demanding for identification. The guard inspected her code cylinder and found that Nur was not Durith's sector. However, Durith pressured the security officer in to letting her through regardless by threatening to report him to the Grand Inquisitor for insolence and claiming she was working with classified information.\nDuring the time of the Galactic Empire, the human male served as an Imperial security officer by the year 9 BBY and held the military rank of lieutenant. He operated at Fortress Inquisitorius, the headquarters of the Empire's Jedi-hunting group the Inquisitorius, on the ocean moon of Nur in the Outer Rim's Mustafar system. There, the Imperial officer was the lead security guard for his level of the fortress, below the sea level of Nur, and stood at the control station of a security gate. One day that year, the Inquisitor Third Sister arrived at Fortress Inquisitorius and passed through the security gate while the security officer was on duty, the officer standing at ease at the gate's control station as she passed.\nSome time later, the guard was posted at the gate when the Imperial officer Tala Durith arrived at the fortress, secretly working with the fugitive Jedi Obi-Wan Kenobi to break out the Leia Organa, the ten-year-old daughter of Imperial Senator Bail Organa who had been imprisoned by the Third Sister. As Durith approached the security officer's gate, the guard asked for identification. Durith ignored the security guard, so he left his terminal and told her she needed clearance, his visitor replying that she had officer class C.\nThe security guard persisted and took Durith's code cylinder for inspection and found that Nur was not in her sector. The security officer thus informed Durith that he couldn't let her through, only for the latter officer to ask about his position and assert herself as his commanding officer. She further claimed that she would inform the Grand Inquisitor of his insolence as her supposed mission involved classified information. The security guard stiffened and swallowed, resigning to Durith's demands and letting the officer to pass through the gate while he stood at ease.\nA human male, the security guard had light skin, blue eyes and ginger hair. He was assertive of the identification protocols to Tala Durith, persistently refusing to let her pass without clearance. He was also submissive to higher-ranking individuals, immediately complying with Durith's correction to call her \"sir\" and stiffening when she implied repercussions from the Grand Inquisitor.\nThe guard wore a black Imperial officer's uniform, including an Imperial kepi with an officer's disk, black gloves and boots, and a black belt with a silver buckle and compartments. The officer bore two code cylinders, slotted above each breast, and a rank insignia plaque on his left breast displaying three blue tiles in a horizontal row.\nThe security guard first appeared in \"Part III\" of the live-action Disney+ television series Obi-Wan Kenobi, directed by Deborah Chow and released on June 1, 2022. He was portrayed by actor Joss Glennie-Smith, who was not credited as the actor until the character's appearance in the following episode \"Part IV,\" directed again by Chow and released week later on June 8.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Military",
  "/wiki/Imperial_officer",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Ocean",
  "/wiki/Moon",
  "/wiki/Nur",
  "/wiki/9_BBY",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/Inquisitor",
  "/wiki/Reva_Sevander",
  "/wiki/Security_officer",
  "/wiki/Officer",
  "/wiki/Captain",
  "/wiki/Tala_Durith",
  "/wiki/Code_cylinder",
  "/wiki/Sector",
  "/wiki/Grand_Inquisitor",
  "/wiki/Imperial_Era",
  "/wiki/Standard_year",
  "/wiki/Jedi",
  "/wiki/Hunting",
  "/wiki/Inquisitorius",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Mustafar_system",
  "/wiki/Fortress",
  "/wiki/Standard_day",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Prison",
  "/wiki/Commanding_officer",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Breast",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Part_III",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/June_1",
  "/wiki/2022",
  "/wiki/Joss_Glennie-Smith",
  "/wiki/Part_IV",
  "/wiki/June_8",
  "/wiki/Part_I",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Andor_(television_series)",
  "/wiki/June_4",
  "/wiki/File:Imperial_Forces_Rank_Chart_-_Rogue_One.png",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith"
 ]
}