{
 "name": "Unidentified_Imperial_officer_(Avenger)",
 "display_name": "Unidentified Imperial officer (Avenger)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Navy",
      "Death Squadron",
      "Death Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A Human male served in the Imperial Navy during the Galactic Civil War, and was an officer by 3 ABY. That year, he was Captain Lorth Needa's first officer aboard the Imperial II-class Star Destroyer Avenger, attached to the Imperial Dark Lord of the Sith Darth Vader's personal Star Destroyer fleet Death Squadron. At that time, the Avenger aided Death Squadron's galaxy-wide search for the Alliance to Restore the Republic's headquarters, which led to the discovery of a hidden base on the planet Hoth. Following the subsequent Battle of Hoth, the Avenger took part in the pursuit of the YT-1300 light freighter Millennium Falcon from the Hoth system. When the pursuit led to the Anoat system, the Imperial officer stood alongside Needa at the viewport of the Avenger's command bridge. After the Falcon seemingly disappeared from the Avenger's sight, Needa requested the officer prepare a TIE/sh VIP shuttle to take him to Darth Vader's flagship, the Executor-class Star Dreadnought Executor, where the captain would personally apologize to the Sith Lord for his failure.\nA Human male was an officer of the Imperial Navy during the Galactic Civil War, a conflict between the Galactic Empire and the Alliance to Restore the Republic. During the year 3 ABY, he served as the first officer for Captain Lorth Needa, the commanding officer of the Imperial II-class Star Destroyer Avenger, attached to the Imperial Dark Lord of the Sith Darth Vader's personal Star Destroyer fleet, Death Squadron.\nIn that same year, the Imperial-class Star Destroyers of Death Squadron deployed Viper probe droids throughout the galaxy in search of the Alliance's headquarters. The Avenger was part of the search, and sent probe droids to the Tokmia and Allyuen systems alongside another Imperial II-class Star Destroyer, the Stalker. Death Squadron was near the Qeimet system at the time one of the Stalker's probe droids discovered the Alliance's hidden base on the planet Hoth. Death Squadron made a series of jumps through hyperspace in order to reach the Hoth system, resulting in the subsequent Battle of Hoth. During the battle, the Imperial Blizzard Force made a ground assault on the planet while the Star Destroyers of Death Squadron waited to intercept Alliance GR-75 medium transports and other Rebel ships evacuating the planet. The Avenger performed well during the battle, where it attacked evacuating Alliance transports. Following the battle, which resulted in an Imperial victory and the Alliance being forced to evacuate their headquarters, the Imperial officer was stationed on the Avenger's command bridge when the warship was charged with pursuing the fugitive YT-1300 light freighter Millennium Falcon through the Hoth system.\nDuring the pursuit of the Millennium Falcon, the freighter managed to outmaneuver the Avenger, causing it to almost collide with another pursuing Star Destroyer. The Avenger chased the Falcon into the Hoth asteroid field, where the Star Destroyer lost track of the fugitive Alliance ship after its crew unknowingly took cover in the mouth of a space slug housed in one of the asteroids. Upon Darth Vader's command, the Avenger traveled into the asteroid field to search for the Falcon, where it suffered significant damage. Eventually, the Millennium Falcon reappeared, and the Avenger spotted the ship during its attempted escape. Needa had a priority signal sent to the Sith Lord's flagship, the Executor-class Star Dreadnought Executor, with the message that the Falcon was about to be captured.\nThe Imperial officer was standing next to Needa at the viewport of the Avenger's bridge when the pursuit of the Falcon reached the neighboring Anoat system. The freighter moved into what Needa assumed was attack position, and charged the bridge as alarms were set off throughout the Avenger. The Imperial officer, Needa and the rest of the command crew dove for cover before the Falcon veered away at the last moment, and seemingly disappeared from the Star Destroyer's sensors. Unbeknownst to Needa and his crew, the Millennium Falcon simply landed on a blind spot of the Avenger's conning tower. Needa ordered the Imperial officer to track the ship, believing it might come for another pass, before the Avenger's logistics officer, Commander Nemet, reported that the Falcon was no longer on the Star Destroyer's sensors, and said there was no trace of the ship. Seconds later, the Avenger's communications officer, M'Kae, reported that Lord Vader demanded an update on the pursuit of the Falcon. Needa ordered the Imperial officer to prepare a TIE/sh VIP shuttle for his visit to the Executor, where he would take full responsibility for the loss and apologize to the Sith Lord. He gave the officer one last request to continue searching the area for the Falcon—again to no avail, before traveling to the Star Dreadnought to meet with Vader, where the Dark Lord executed the captain for his failure.\nThe Imperial officer took cover along with Captain Needa and the rest of the command crew when the Millennium Falcon flew toward the Avenger's bridge. He was fair-skinned and had gray hair.\nThe Imperial officer made his first appearance in The Empire Strikes Back Storybook, released in April 1980, shortly before the actual film Star Wars: Episode V The Empire Strikes Back, where he was portrayed by an uncredited extra, standing on the Avenger's command bridge alongside Captain Needa during the Hoth campaign. While not credited in the film itself, actor Mike Reynell, listed as a \"deck officer\" in a film callsheet, has been credited as playing the role by the fan website Aveleyman. He is not featured in the film's novelization, in which it is unclear who it is to whom Needa is speaking when he gives the request to prepare his shuttle for his rendezvous with Darth Vader.\nIn the comic Star Wars  42, the Imperial officer has the line \"We're going to collide!\" when the Millennium Falcon is charging the Avenger's bridge, a line given to Commander Nemet in the same scene of the novelization. The Empire Strikes Back Storybook gives the line instead to Captain Needa. This article assumes Nemet's line from the novel is the canon version of events.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Death_Squadron/Legends",
  "/wiki/File:Needa-ShuttleReady.ogg",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Lorth_Needa/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Avenger/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Hoth_system/Legends",
  "/wiki/Anoat_system/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Viewport/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Officer/Legends",
  "/wiki/TIE/sh_VIP_shuttle",
  "/wiki/Darth/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/File:Needa-NoShip.ogg",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Tokmia_system",
  "/wiki/Allyuen_system",
  "/wiki/Destroyer/Legends",
  "/wiki/Stalker/Legends",
  "/wiki/Qeimet_system",
  "/wiki/Droid/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Blizzard_Force/Legends",
  "/wiki/Ground_warfare",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Hoth_asteroid_field",
  "/wiki/Starship/Legends",
  "/wiki/Exogorth/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Asteroid_belt",
  "/wiki/Sensor/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Nemet/Legends",
  "/wiki/Standard_second",
  "/wiki/Communications_officer",
  "/wiki/M%27Kae/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Star_Dreadnought/Legends",
  "/wiki/Death/Legends",
  "/wiki/Hair/Legends",
  "/wiki/The_Empire_Strikes_Back_Storybook",
  "/wiki/April",
  "/wiki/1980",
  "/wiki/Mike_Reynell",
  "/wiki/Deck_officer/Legends",
  "/wiki/File:CallSheet35.png",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Shuttle/Legends",
  "/wiki/Star_Wars_(1977)_42",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Canon",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(junior_novelization)",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(PhotoComic)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Cine-Manga)",
  "/wiki/Star_Wars_Manga:_The_Empire_Strikes_Back_3",
  "/wiki/LEGO_Star_Wars_II:_The_Original_Trilogy",
  "/wiki/LEGO_Star_Wars:_The_Complete_Saga",
  "/wiki/The_Empire_Strikes_Back_Notebook",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Reflections_II:_Expanding_the_Galaxy",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/The_Empire_Strikes_Back_(TCG)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Atlas",
  "/wiki/Hoth_Limited",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/June_13",
  "/wiki/2022"
 ]
}