{
 "name": "Unidentified_Erighal_Mid_Captain",
 "display_name": "Unidentified Erighal Mid Captain",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Erighal family",
      "Erighal family"
     ]
    }
   ]
  }
 ],
 "content": "A male Erighal Mid Captain participated in the Hoxim incident above Hoxim after the Agbui deceived the Erighal family, the Pommrio family and the Xodlak family, making the families believe there was a Nyix mine that could bring glory to each of the families.\nIn 18 BBY, the Erighal family was deceived by the Agbui, a group of cultural nomads, to believe Hoxim had a mine filled with Nyix, however, that was a deception which was engineered by the Agbui and Jixtus to provoke a Civil war in the Chiss Ascendancy.\nWhen Senior Captain Lakinda of the Xodlak family was summoned by Councilor Lakuviv through a family emergency, which ordered all Xodlak officers, including the warriors and officers of the Chiss Expansionary Defense Fleet to go to Celwis for an emergency, which consisted on claiming Hoxim's mine for the Xodlak. The Xodlak, Erighal and Pommrio family were all deceived by the Agbui. However, none of them knew it. When Senior Captain Mitth'raw'nuruodo, Thrawn, was informed of Lakinda's departure, by Mid Captain Apros. He asked the Mid Captain if Csilla or Naporar were alerted, Apros denied that, confirming that the event only involved the Pommrio, Erighal and Xodlak.\nThrawn pointed out an invasion or natural disaster wasn't possible. As there wasn't any official alerts, Apros suggested they might fear the Vagaari as there were rumors that they were allied with the Paataatus and were looking to attack the Ascendancy, Thrawn said the rumors were unfounded and it was highly unlikely. He then asked Apros how many of the gunboats they had dealt with they could carry. Apros said 8 or 9, Samakro pointed out that if they wanted to get Captain Fsir's freighter, they would only carry five gunboats. Apros then gave an Agbui piece of jewelry, he then left the conference room to prepare the Grayshrike for battle. Samakro told Thrawn all of the families that were participating in family emergencies were allied to various ruling families, as Thrawn was unaware of that, due to his lack of political knowledge, Samakro continued telling him that the Xodlak are allied with the Irizi family, the Pommrio with the Plikh family and the Erighal with the Dasklo family.\nShortly afterwards, Apros contacted Lakinda telling her that the Grayshrike and the Springhawk needed information, they continued, Lakinda explained that she couldn't tell the nature of her mission, as it was \"family business\", however Thrawn pointed out if it was related with Alien jewelry. Lakinda was shocked, and Apros continued by telling her that an species, the Agbui had been handing out jewelry in Celwis, however, they claimed that they did it, but it was done by the Magys and their refugees, which came from Sunrise.\nXodlak realized the Agbui were trying to provoke a civil war, Apros, Thrawn, and Lakinda made a plan. Afterward, Lakinda asked Apros and Thrawn, that if they could prevent a civil war by killing her, that they did so. The Midsummer and the Apogee arrived at the planet. While the Midsummer scanned for nearby ships, the officers of the ship asked Lakinda what their mission was. Although Lakinda refused to talk about it briefly, she ultimately said they were there to locate some nyix mines and assess their values. The sensors officers said shortly after that there was contact with 6 groups, separated in two groups of three, Pommrio and Erighal.\nThe Xodlak commander activated her communications and heard the Erighal commander claim the world and its resources for the Erighal family. Shortly after, the Pommrio Mid Captain challenged said claim. Then Lakinda stepped in and challenged both claims, however, before the discussions went deeper, the Sprinhawk popped into view, which was being attacked by some gunboats. Dalvu told Thrawn all family ships were there. The sensors officer informed Lakinda that there were fourteen gunboats. Lakinda then recommended the other families to assist the heavy cruiser.\nLakinda then recommended the Erighal and Pommrio ships to leave, as she believed that if those gunboats had done that much damage to the Sprinhawk, they would completely destroy the Pommrio and Erighal ships. However, the Erighal Mid Captain rejected her offer the right of way, the Pommrio added that they wouldn't leave if a Expansionary Defense Fleet ship and crew was in danger. He continued by saying that if they left, the heavy cruiser would be destroyed. Lakinda accepted their posture and said they would need a joint battle front, anchored by her frigate and two cruisers. She continued by saying that the Erighal was in the center, so the Pommrio and Xodlak would join them and form up on the Erighal. The Erighal accepted the idea of a joint battle front, however, he said he didn't agree on her leading it. Lakinda said she was a Senior Captain and asked the other commanders their ranks, as the commanders were both Mid Captains, Lakinda's lead was accepted.\nLakinda proposed a modified double—wing formation, her frigate on the center, the Xodlak cruiser to starboard, the Pommrio cruiser in portside and patrol ships filling in the wings. The patrol ships stayed far enough back to be partially shielded, however, forward enough to deliver laserfire. Once the gunboats split their attack formation, all ships would be on their own, however she suggested all patrol ships to stay with the larger warships.\nThe other families accepted the Xodlak's plan, however they insisted that if they noticed she was tilting the operation to her family's favor, they'd cease her command, and withdraw their support. The battle ensued, the gunboats were controlled remotely from a freighter, Lieutenant Commander Laknym previously had some uncertainties as they were firing on their families' ships, however thanks to Samakro's talk, about Thrawn being horrible at politics and not understanding them at all, his uncertainties were put aside, and he began to fire on his family's ships. The gunboats began to fire on the three families' joint forces.\nAs all ships fired on the gunboats, and the gunboat returned fire, Lakinda ordered the patrol ships to stay as sheltered as possible, however, the Erighal rejected her order telling her that the Erighal do not hide like children, they engage the enemy fully. The Pommrio added that they didn't abandon others that fought in their steads. Lakinda accepted their comments, and continued fighting the \"alien\" gunboats. As each gunboat was destroyed, a panel on the freighter went dark, and an officer left their post, after only 8 gunboats remained Brisch contacted Thrawn telling his superior that Lakinda said they had a problem.\nShortly afterward, Lakinda told her first that she needed him to take command, she added that she was going to attempt getting a message to the Springhawk. The officer asked his superior why would she need to get a message to Thrawn's ship, Lakinda answered telling him that they had gone partially dormant and that they had already dealt with this gunboats for some time, so they could provide her some information. The Xodlak first told her that he didn't think a private conversation was a good idea while they were in a precarious relationship with the Erighal and Pommrio, Lakinda dismissed the officer's comments and proceeded to talk with the Springhawk.\nShe began the conversation saying they had a problem, when the families saw that the entire thing was setup, it would spark a huge degree of embarrassment. And once it went into the public, it'd cause an uproar with anger, recriminations, which would cause massive efforts to find someone to blame— She broke off and added that the end result wouldn't be much better than physical blows. And that, that had to be prevented. She added one final comment, that someone had to crash the Watith freighter onto the mine, she added that she was aware of its difficulty, but it was necessary. She tried to leave the room, to find her second officer, escorted with two warriors.\nAfter Lakinda was arrested by the Xodlak warriors, the other officers took the lead of the Xodlak ships, which made one of Thrawn's advantages be lost. If any adjustments were needed, Lakinda was expected to perform them, however, as she wasn't commanding the ships, they wouldn't be performed. The freighter command room was aware of Lakinda's message. No one spoke for some time, however, Laknym broke the silence. He told the rest that Lakinda was no longer in command of the Xodlak Task Force, Thrawn asked him if she had been injured, Laknym said that she was no longer in command, and that there was no time to discuss it further. As they were engaged in combat. Thrawn replied to Laknym's comments, confirming they were in combat with the same ships that attacked. And also saying that may Warrior's fortune smile on Laknym's efforts.\nThrawn ended the communication with the freighter and welcomed Mitth'ali'astov and Che'ri, which were gathering around Thrawn's command chair, he asked Samakro if he was ready to receive a confirmation from the latter. The thrusters were primed and the acceleration vector and profile had been triple-checked. Thrawn was please about that and asked Brisch to signal the Grayshrike. Thrawn turned back to the ozyly-esehembo or \"Skywalker\" and the Skywalker's caregiver. He said they had a problem and that he hoped they could help fix it, Thalias assured they would do the best they can, they moved to the navigation station, however the Senior Captain of the Mitth stopped them and told them to go to the weapons station. Thalias was confused and asked Thrawn why the weapons station, she added that none of them new anything about defense or offense. Thrawn denied that, saying Che'ri had some experience with decoys and decoy deployment. Thrawn ordered the remotely controlled gunboats to disengage the families and retreat, after all the gunboats could retreat, Thrawn evacuated the freighter, and activated the thrusters, the desk of the weapons station started to vibrate, which alerted the Skywalker.\nThe freighter was still linked to the Springhawk, however, its thrusters were at full power and was trying to get away, the hatch connected to the freighter was sealed, and shortly afterward, the freighter was released. Thrawn ordered Afpriuh to prepare the lasers, he then showed Afpriuh where to shoot with his questis, after he shot on those spots, Thrawn ordered to convert that into a pattern of near-misses, which would make people believe that the targeting systems weren't still fully functional. Thrawn then explained the specific shot's purpose, which was to make the gunboats and freighters to fall on specific locations in the surface of Hoxim to destroy the mine. The Caregiver, Mitth'ali'astov, interrupted her captain's explanation asking if the freighter was piloted, however, Thrawn denied that, telling her that Afpriuh had fired on the maneuvering jets that had released bursts of compressed gas. He then added that he expected the Chiss warships that observed the operation thought the same as Thalias did, that the freighter was being piloted, which would also make the observers to think that the two remaining gunboats were no longer performing evasive maneuvers as the Springhawk had previously failed to reach them with the ships' offensive material. Thrawn took Che'ri with Afpriuh, where he signaled her to put her hand above Afpriuh's, as her Third Sight allowed her to see the future, Thrawn believed her to know when to use the tractor beam on it's edge at the freighter to move it slightly to portside, assuring the destruction of the mine. After Che'ri and Afpriuh successfully completed their task, Thalias joined Che'ri and some warriors as they got the Skywalker to the medcenter to find anything the operation may have caused the young girl. Che'ri's performance had assured the Hoxim incident's true engineers wouldn't be revealed. Ending the mine, and the tension between the Pommrio, Erighal and Xodlak families.\nThe Erighal family commander was a male Chiss that was loyal to his family. Defending its interests in a Nyix mine in Hoxim.\nThe Erighal commander first appeared on the 2021 novel Thrawn Ascendancy: Greater Good and its audiobook adaptation by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Special:Upload",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Erighal_family",
  "/wiki/Hoxim_incident",
  "/wiki/Hoxim",
  "/wiki/Agbui",
  "/wiki/Pommrio_family",
  "/wiki/Xodlak_family",
  "/wiki/Nyix",
  "/wiki/Mining",
  "/wiki/18_BBY",
  "/wiki/Jixtus",
  "/wiki/Senior_Captain",
  "/wiki/Irizi%27in%27daro",
  "/wiki/Councilor_(Chiss_Ascendancy)",
  "/wiki/Xodlak%27uvi%27vil",
  "/wiki/Family_emergency",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Celwis",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Core_name",
  "/wiki/Mid_Captain",
  "/wiki/Csap%27ro%27strob",
  "/wiki/Csilla",
  "/wiki/Naporar",
  "/wiki/Vagaari",
  "/wiki/Vagaari_pirate_operations",
  "/wiki/Paataatus",
  "/wiki/Gunboat",
  "/wiki/Ufsa%27mak%27ro",
  "/wiki/Captain",
  "/wiki/Fsir",
  "/wiki/Freighter",
  "/wiki/Nyix_brooch",
  "/wiki/Grayshrike",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Irizi_family",
  "/wiki/Plikh_family",
  "/wiki/Dasklo_family",
  "/wiki/Springhawk",
  "/wiki/Magys",
  "/wiki/Sunrise",
  "/wiki/Midsummer",
  "/wiki/Apogee",
  "/wiki/Elod%27al%27vumic",
  "/wiki/Lieutenant_Commander",
  "/wiki/Laknym",
  "/wiki/Alien",
  "/wiki/Brisch",
  "/wiki/Mitth%27ali%27astov",
  "/wiki/Che%27ri",
  "/wiki/Sky-walker",
  "/wiki/Questis",
  "/wiki/The_Force",
  "/wiki/Tractor_beam",
  "/wiki/2021",
  "/wiki/Book",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Standard_year",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Attack_on_the_Paataatus"
 ]
}