{
 "name": "Unidentified_Zabrak_Eclipse_dealer",
 "display_name": "Unidentified Zabrak Eclipse dealer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Beige"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Coruscant Hotel and Casino"
     ]
    }
   ]
  }
 ],
 "content": "A Zabrak female served as a dealer for the holographic card game Eclipse in the Coruscant Hotel and Casino on the planet Cantonica. During the year 34 ABY, the Zabrak oversaw a game with four players, one of which was the slicer known as \"DJ.\" Unbeknownst to the dealer, DJ had uploaded a virus into the Eclipse table that rigged the game in his favor after he bet and lost a sizable fortune. After several more hands, during which the Zabrak witnessed a conversation between DJ and Canto Bight Police Department detectives, DJ left the table with his winnings, but not before handing the dealer a healthy tip.\nA Zabrak female worked at the Coruscant Hotel and Casino, located in the city of Canto Bight on the planet Cantonica, as a dealer for the holographic card game Eclipse.\nDuring the year 34 ABY, the Zabrak found herself dealing a game with four players, which included an Ithorian, a Twi'lek, the protocol droid O1-MG, and the slicer known as \"DJ.\" Playing with stolen money, DJ proved to be a loose gambler, much to O1-MG's frustrations. Although the Zabrak concurred with the droid's calculated statistical advice, DJ ignored them and continued to bet aggressively until he lost a sizable fortune. Undeterred, DJ gave both the Zabrak and a waitress hefty tips, leaving himself with a single chip.\nO1-MG was eventually forced from the table by two Canto Bight Police Department detectives, Oosha Choi and Pol Ipol, who then took the droid's and the Twi'lek gambler's places at the table. The detectives bet the minimum with Choi telling the dealer to ignore anything they say outside of \"hit\" or \"stay,\" the primary play words in Eclipse. However, the cops, more interested in DJ, momentarily forgot to participate in the game.\nNeither detective managed to win a hand, and ended up with losses. At some point, Detective Ipol tired of DJ's attitude towards their private business and attempted to drag him away, only to be stopped by the Zabrak's boss and the casino's owner, Jorka Edy. The cops were forced to leave, and DJ remained at the Zabrak's table for several more hands, raking in a small fortune. However, DJ's gains were ill-gotten: he had rigged the table by uploading a virus into the system back when he lost his first fortune.\nKnowing he'd be caught soon, DJ began to leave, but not before giving the dealer another tip. Unaware of the fact that her table had been scammed, the Zabrak thanked DJ for playing.\nA beige-skinned Zabrak with red eyes, the dealer was fair to the point of trying to give DJ advice on his odds with his seemingly poor betting strategies. However, upon seeing DJ win several other hands, the Zabrak became impressed by his apparent \"skill,\" unaware that he was running her table with a virus. As DJ left, the dealer admitted to her excitement over the game, despite it being an acknowledgement her bosses preferred she not make.\nWhen detectives Choi and Ipol joined the game, the dealer wished them good luck, but she had to remind them to actually play the game when they got caught up in their conversation with DJ.\nThe Zabrak Eclipse dealer first appeared in the 2018 one-shot comic book Star Wars: The Last Jedi – DJ – Most Wanted 1, a tie-in story for the film Star Wars: Episode VIII The Last Jedi, written by Ben Acker and Ben Blacker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zabrak",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Coruscant_Hotel_and_Casino",
  "/wiki/Hologram",
  "/wiki/Eclipse_(gambling)",
  "/wiki/Planet",
  "/wiki/Cantonica",
  "/wiki/Standard_year",
  "/wiki/34_ABY",
  "/wiki/Slicer",
  "/wiki/DJ",
  "/wiki/Canto_Bight_Police_Department",
  "/wiki/Detective",
  "/wiki/City",
  "/wiki/Canto_Bight",
  "/wiki/Ithorian",
  "/wiki/Twi%27lek",
  "/wiki/Protocol_droid",
  "/wiki/O1-MG",
  "/wiki/Currency",
  "/wiki/Gambling",
  "/wiki/Droid",
  "/wiki/Oosha_Choi",
  "/wiki/Pol_Ipol",
  "/wiki/Jorka_Edy",
  "/wiki/Eye",
  "/wiki/2018",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Last_Jedi_%E2%80%93_DJ_%E2%80%93_Most_Wanted_1",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Ben_Acker",
  "/wiki/Ben_Blacker",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens"
 ]
}