{
 "name": "Unidentified_female_Yuuzhan_Vong_Shaper",
 "display_name": "Unidentified female Yuuzhan Vong Shaper",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong",
      "Argazdan Redoubt"
     ]
    }
   ]
  }
 ],
 "content": "This unidentified female Yuuzhan Vong Shaper appeared in the far reaches of the Argazdan Redoubt during the Kanz Disorders, several decades prior to 3970 BBY.\nFollowing the devastating Cremlevian War, the Yuuzhan Vong were forced to leave their uninhabitable galaxy and depart into the Intergalactic Void between the galaxies. In the hopes of discovering a new home, the Yuuzhan Vong dispatched scouts into the known galaxy around the time of the Old Sith Wars. This female Shaper was testing a new hyperdrive analog which would allow the Yuuzhan Vong's Koros-Strohna vessels to travel at light speed.\nHowever, her starship's drive analog malfunctioned, leaving her and her vessel trapped in stasis and lost in the far reaches of the Kanz sector for centuries. During the last decades of the Kanz Disorders, Argazdan Redoubt patrols discovered her and her asteroid-like starship. Argazdan scientists were able to revive the pilot, who had been frozen in stasis.\nDuring her time in custody, she revealed her origins and her expertise in \"shaping\" to her Argazdan captors. She became fluent in Argazdan, though her captors were unable to understand her original language. They were fascinated by the extra-galactic nature of her origins. Reflecting the Yuuzhan Vong's hatred of droids and technology, she refused to use any mechanical technology.\nAround 3670 BBY, the ruling Argazdan Regent Torphceris's grip over the Redoubt was threatened by the Jedi Order and the Galactic Republic under the Lorrdian Jedi Master Mari-Elan Nora. In desperation, he betrayed his \"beliefs\" in Vianism by making a pact with the female Shaper. Due to her grotesque scars and tattoos, she was referred to among Argazdan and Lorrdian circles as the \"demon\".\nUnder her tutelage, Torphceris ordered the construction of massive pits on Lorrd through the use of Lorrdian slave labor. At the alien's insistence, the pits were constructed entirely by hand without the use of any technological implements, leading to the deaths of thousands of Lorrdian slaves. At the bottom of the pit, she created an amphibious \"living superweapon capable of living for millennia\".\nDuring the Liberation of Lorrd, several Argazdans fled to the chambers within the slave pit and disappeared, presumably eaten by the monster. Several Jedi and Republic soldiers sent to apprehend them also disappeared. Master Nora sensed something evil in the Pits and ordered them filled and their existence played down in official documents. Following that incident, the female Shaper disappeared.\nDuring the Republic Classic era, the Lorrdian playwright Pordi zet Chatc's described her role in the construction of the Slave Pits in his play Torphceris. In that play, she was portrayed as a villain while her Argazdan accomplices were depicted as cowards willing to surrender their beliefs for power. During the Galactic Civil War, Tash Arranda and her Lorrdian friend Kal zet Berri heard about her during a play at the Performance Square.\nLater, they ventured to the Slave Pits where they encountered the unscrupulous Doctor Raygar and the Imperial Agent Diamond who were interested in the \"living superweapon\". During a brief confrontation at the bottom of the Pits, the belligerents encountered the monster which attempted to kill them. However, Raygar dispatched the beast with a thermal detonator; allowing his foes to escape and also destroying any potential superweapon the Galactic Empire could have used against the Rebel Alliance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Argazdan_Redoubt",
  "/wiki/Shaper_caste",
  "/wiki/Kanz_Disorders/Legends",
  "/wiki/3970_BBY",
  "/wiki/Cremlevian_War",
  "/wiki/Yuuzhan_Vong_galaxy",
  "/wiki/Intergalactic_Void",
  "/wiki/Galaxy/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Time/Legends",
  "/wiki/Old_Sith_Wars",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Koros-Strohna",
  "/wiki/Starship/Legends",
  "/wiki/Suspended_animation/Legends",
  "/wiki/Kanz_sector",
  "/wiki/Yorik-stronha",
  "/wiki/Shaping_protocol",
  "/wiki/Argazdan_(language)",
  "/wiki/Yuuzhan_Vong_(language)",
  "/wiki/Extra-galactic",
  "/wiki/Droid/Legends",
  "/wiki/3670_BBY",
  "/wiki/Argazdan_Regent",
  "/wiki/Torphceris",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lorrdian/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mari-Elan_Nora",
  "/wiki/Vianism",
  "/wiki/Slave_Pits_of_Lorrd",
  "/wiki/Lorrd/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Liberation_of_Lorrd",
  "/wiki/Republic_Classic_era",
  "/wiki/Pordi_zet_Chatc",
  "/wiki/Torphceris_(play)",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Tash_Arranda/Legends",
  "/wiki/Garik_Loran",
  "/wiki/Performance_Square",
  "/wiki/Doctor/Legends",
  "/wiki/Raygar",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Facet_Anamor",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Death_in_the_Slave_Pits_of_Lorrd",
  "/wiki/StarWars.com"
 ]
}