{
 "name": "Unidentified_Savrip_Warmaker",
 "display_name": "Unidentified Savrip Warmaker",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mantellian Savrip"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "This Savrip Warmaker served as the tribal leader of a group of Mantellian Savrips who fought against the Imperial garrison on Ord Mantell.\nAt some point during the Galactic Civil War, a group of rebels led by Princess Leia Organa believed that the Mantellian Savrips had an old decryption module vital to their plans to keep the Galactic Empire away from their hidden base. So the princess sent C-3PO and a team of rebel troopers to make contact with them. However, on their way to the Savrip lair, the rebel squad was ambushed by a patrol of stormtroopers. Later, the Savrip Warmaker and a group of Savrip warriors joined the attack, killing both imperial troopers and rebels, believing the rebels were also Imperials. The Savrips found a damaged C-3PO, which they dismembered and took its parts to their lair.\nWhen Luke Skywalker, Han Solo, Chewbacca, and R2-D2 arrived on Ord Mantell, in order to retrieve the decryption module, they meet with Leia, who told them what happened. So, they went to search for the rebel troopers that survived the ambush, in order to get more information on C-3PO's whereabouts. After rescuing the rebels and following a trail, left by the protocol droid's limbs, the rebel heroes found the Savrip lair, where Threepio's remains were located. However, the Savrip Warmaker found them and ordered his warriors to attack the intruders, believing they were also Imperials. During the waves of assaults, Luke managed to repair C-3PO. The droid told the Savrip leader to stop his attack and explained to him that, in fact, they were rebels who were fighting the Empire and came to Ord Mantell in order to get an decryption module. Realizing that he did a mistake, he apologized to the Heroes of Yavin, and agreed to help them, by telling them where the module was located.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Mantellian_Savrip/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Echo_Base/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Rebel_trooper/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Warrior",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Star_Wars:_Assault_Team"
 ]
}