{
 "name": "Unidentified_Givin_Jedi",
 "display_name": "Unidentified Givin Jedi",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Givin"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "In 22 BBY, a Givin Jedi was an active member of the Jedi Order and an officer in the Grand Army of the Republic. In the early months of the Clone Wars, the Givin was sent to the planet Kamino to help defend the Republic Grand Army's developing clone troopers from an impending invasion by the forces of the Confederacy of Independent Systems. Prior to the Confederacy's assault, the Givin and other Jedi listened to a mission briefing given by Jedi Knight Obi-Wan Kenobi and the holographic form of Jedi Master Oppo Rancisis.\nA Givin with sunken black eyes and a white, hairless exoskeleton was a member of the Jedi Order in 22 BBY. During the opening months of the Clone Wars, the Givin was an officer in the Grand Army of the Republic, and two months into the war, the Givin was one of several Jedi who were withdrawn from their commands and sent to defend the planet Kamino from the invading Confederacy of Independent Systems. Kamino was home to over one million developing clone troopers of the Republic Army, and when intelligence uncovered by Jedi Master Quinlan Vos and Jedi Knight Aayla Secura revealed that it was the Confederacy's next target, the Jedi High Council gathered Jedi there to repulse the invaders.\nIn Kamino's capital of Tipoca City, the Givin stood with a group of fellow Jedi and listened to a pre-battle briefing led by Jedi Knight Obi-Wan Kenobi. Kenobi and Master Oppo Rancisis, the latter joining the group via hologram, outlined a defensive plan that involved Jedi manning Delta-7 Aethersprite-class interceptors and intercepting incoming Confederate starfighters while other Jedi remained planet-side to supervise ground defenses. Confederate forces attacked shortly thereafter, but the Jedi and clone troopers were able to repel them and ultimately force a Confederate retreat.\nThe Givin Jedi appears in two panels of the 2003 comic book Republic 50 during Obi-Wan Kenobi's mission briefing. The comic does not make clear what role, if any, the Givin plays in the battle, nor does it give an indication of the character's sex.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Givin/Legends",
  "/wiki/Color/Legends",
  "/wiki/Exoskeleton",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Army/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Confederacy_military/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/First_Battle_of_Kamino",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Oppo_Rancisis/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Tipoca_City/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Delta-7_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Ground_warfare",
  "/wiki/Cloning/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/2003",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Republic_50",
  "/wiki/Gender/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}