{
 "name": "Unidentified_Killik_Sith_warrior",
 "display_name": "Unidentified Killik Sith warrior",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alsakan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "By 27",
      "000 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Killik"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith"
     ]
    }
   ]
  }
 ],
 "content": "A Killik male Sith individual resided on the planet Alsakan long prior to 27,000 BBY. Fleeing persecution, he fled to the world Sarafur, where he came to reside in a building used by a native species for bathing in sulfurous mineral waters. After the Killik's death, his abode became his tomb and a site strong in the dark side of the Force. At one point, the Alsakani dark side adept Jilst Bindalin stored a stolen artifact in the Sith's tomb, and the structure was later explored by a group of treasure hunters.\nA Force-sensitive Killik male was a member of a hive-minded, insectoid species that originated on the Core Worlds planet Alderaan. The Killiks were transplanted off their homeworld by the powerful Celestials, and ultimately both species disappeared from the known galaxy by 30,000 BBY. The Force-sensitive Killik resided on the Core Worlds planet Alsakan at some point long before 27,000 BBY. He was a member of the Sith tradition of Force-users, which originally arose among the Outer Rim Territories planet Korriban's Sith species—whom the Killiks attempted to conquer around 30,000 BBY.\nAt some point long before Alsakan was settled by Humans, the Killik Sith warrior faced persecution on the planet. He fled to the Outer Rim world Sarafur, which at one point served as a Killik colony. The Sith took up refuge in a city of a native species there, coming to reside in a building used by the natives to bathe in sulfurous mineral waters. Eventually, eons before the reign of the Galactic Empire, which began in 19 BBY, the Sarafur's native species went extinct, and at some point the Killik Sith warrior died, with the building he used to reside in becoming his tomb. The structure eventually became buried under tons of collapsed walls and columns.\nAfter the Killik Sith's death, his tomb became a beacon in the dark side of the Force. The structure became inhabited by dark side spirits, and both individuals attuned to the Force and those who were not were affected by a dark and sinister presence. By the time of the existence of the Empire, a legend told of a lone Sith guardian who was waiting to unleash his wrath upon any trespassers of his abode in the ruins of his adopted people. In addition, an old Shistavanen tale recounted the Killik Sith warrior's flight from Alsakan to Sarafur. The Alsakani dark side adept Jilst Bindalin at one point learned of the latter legend and located the Sith's tomb. After stealing an artifact, Bindalin took it to Sarafur. He stored it in the Killik's tomb as a form of petty vengeance and was subsequently never seen again.\nAt some point by 3 ABY, a group of treasure hunters arrived on Sarafur during a search for the artifacts known as the Tessents. The group explored the Killik Sith's tomb, discovering a Sith holocron there.\nThe Killik Sith warrior was introduced in the roleplaying adventure \"Race for the Tessent,\" which was published for use with Wizards of the Coast's Star Wars Roleplaying Game in the ninth issue of the Star Wars Gamer magazine on February 22, 2002. The adventure describes the Sith as an \"artisan\" but does not provide elaboration for the choice of placing that descriptor in quotation marks.\nInstead of featuring a set plot, \"Race for the Tessent\" presents several settings in the Moddell sector, Sarafur being one of them, that the player-characters may visit during their search for one of the Tessent artifacts. For each of the settings, the adventure also suggests possible circumstances for a Tessent being hidden there, with the section dedicated to Sarafur noting how at some point Jilst Bindalin could have stolen the Alsakan Tessent and brought it to the Killik Sith warrior's tomb on the planet. This article assumes that as much of the information presented in the adventure as possible without contradictions is canonical with respect to the Star Wars Legends continuity and therefore assumes that the Alsakan Tessent was instead hidden on the planet Ast Kikorie.\nAdditionally, \"Race for the Tessent\" appears to give contradictory information regarding the dating of the Killik's flight from Alsakan. The adventure establishes that the Sith left the planet long before Humans had colonized it, yet it also states that Humans drove the Killik off Alsakan. In line with the assumptions this article makes that are outlined above, it is also assumed both that the latter statement is in error and that the Sith's tomb was inhabited by dark side spirits instead of being deserted.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Alsakan/Legends",
  "/wiki/27,000_BBY/Legends",
  "/wiki/Killik/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sarafur",
  "/wiki/Killik_Sith_warrior%27s_tomb",
  "/wiki/Unidentified_Sarafur_species",
  "/wiki/Sulfur/Legends",
  "/wiki/Mineral/Legends",
  "/wiki/Water/Legends",
  "/wiki/Death/Legends",
  "/wiki/Burial/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_Side_Adept",
  "/wiki/Jilst_Bindalin",
  "/wiki/Treasure_hunting/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Hive_mind/Legends",
  "/wiki/Insectoid/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Celestial/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/30,000_BBY",
  "/wiki/The_Force/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Korriban",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Battle_of_Korriban_(Killik_Invasion)",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Colonist/Legends",
  "/wiki/Human/Legends",
  "/wiki/City/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/19_BBY/Legends",
  "/wiki/Force_ghost",
  "/wiki/Time/Legends",
  "/wiki/Shistavanen/Legends",
  "/wiki/Race_for_the_Tessent",
  "/wiki/Canon",
  "/wiki/3_ABY/Legends",
  "/wiki/Tessent",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Star_Wars_Gamer_9",
  "/wiki/Star_Wars_Gamer",
  "/wiki/February_22",
  "/wiki/2002",
  "/wiki/Moddell_sector/Legends",
  "/wiki/Alsakan_Tessent",
  "/wiki/Ast_Kikorie/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/26,000_BBY",
  "/wiki/The_Unknown_Regions",
  "/wiki/Slavery/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Star_Wars_(1977)_69",
  "/wiki/Battle_of_the_City_of_Bone",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_History_of_the_Mandalorians",
  "/wiki/Star_Wars_Insider_80",
  "/wiki/StarWars.com"
 ]
}