{
 "name": "Unidentified_border_officer",
 "display_name": "Unidentified border officer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Milvayne"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Milvayne Authority"
     ]
    }
   ]
  }
 ],
 "content": "A human male border officer was a member of the Milvayne Authority law enforcement agency, working at a spaceport on the planet Milvayne. In 3 ABY, he asked the rogue archaeologist Chelli Aphra and the assassin droid Triple-Zero for identification and authorization documents. When Aphra attempted to bribe him, he objected and was subsequently tortured by Triple-Zero into opening the gate out of the spaceport, before being killed by the droid.\nThe individual worked as a border officer in the law enforcement agency known as the Milvayne Authority in 3 ABY. He checked identification and authorization documents of travelers at a spaceport on the planet Milvayne. During that time, the border officer welcomed the rogue archaeologist Chelli Aphra and the assassin droid Triple-Zero to Milvayne and asked them to provide their own identification and authorization documents. When he questioned Aphra's attempt to bribe him with credits from Milvayne, Triple-Zero tortured him in return, asking that the border officer open the gate out of the spaceport. The droid then killed him after the gate was opened.\nLater on, the Galactic Empire's Coalition for Progress reviewed the live feed being broadcast from Triple-Zero's eyes to the citizens of Milvayne. The death of the border officer was among the moments reviewed by the Imperial officers on board their propaganda flagship, the Enduring Pride. Triple-Zero also witnessed the murder of the border officer once again when the droid was looking back through his memories sometime after.\nThe border officer was a human male with light skin. When Aphra and Triple-Zero approached him, he showed a lack of interest in Aphra's bribe and cared only about whether she had produced the necessary identification.\nThe border officer wore a brown tunic with black shoulder pads and beige sleeves. He also wore a white helmet with a yellow visor and had a white comlink attached to his chest.\nThe border officer first appeared in the comic Doctor Aphra  26, written by Simon Spurrier, illustrated by Emilio Laiso, and published by Marvel Comics on November 14, 2018.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3_ABY",
  "/wiki/Milvayne",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Milvayne_Authority",
  "/wiki/Police_officer",
  "/wiki/Law_enforcement_agency",
  "/wiki/Unidentified_spaceport_(Milvayne)",
  "/wiki/Planet",
  "/wiki/Archaeologist",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Assassin_droid",
  "/wiki/0-0-0",
  "/wiki/Identichip",
  "/wiki/Torture",
  "/wiki/Spaceport",
  "/wiki/Death",
  "/wiki/Droid",
  "/wiki/Time",
  "/wiki/Officer",
  "/wiki/Credit",
  "/wiki/Galactic_Empire",
  "/wiki/Coalition_for_Progress",
  "/wiki/Chase_on_Milvayne",
  "/wiki/Eye",
  "/wiki/Imperial_officer",
  "/wiki/Propaganda",
  "/wiki/Flagship",
  "/wiki/Enduring_Pride",
  "/wiki/Clothing",
  "/wiki/Helmet",
  "/wiki/Comlink",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Doctor_Aphra_(2016)_26",
  "/wiki/Simon_Spurrier",
  "/wiki/Emilio_Laiso",
  "/wiki/Marvel_Comics",
  "/wiki/November_14",
  "/wiki/2018",
  "/wiki/Doctor_Aphra_(2016)_29",
  "/wiki/Doctor_Aphra_(2016)_30",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Accresker_Jail",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/Standard_year",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth"
 ]
}