{
 "name": "Unidentified_Falleen_mercenary",
 "display_name": "Unidentified Falleen mercenary",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Falleen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A female Falleen mercenary with black hair and green skin worked with Vect Nokru, a human male mercenary, and another mercenary in 9 BBY. They were hired by the Third Sister, an Imperial Inquisitor, to kidnap Leia Organa, Princess of Alderaan. Having caught Leia in the forests of Alderaan, they imprisoned her on their ship and brought her to Daiyu. Just as expected by the Third Sister, former Jedi Master Obi-Wan Kenobi came to rescue Leia. At first, the mercenaries managed to capture Kenobi, but the Jedi was able to escape by taking out the mercenaries with a spice he had obtained earlier.\nIn 9 ABY, the human male mercenary Vect Nokru, a female Falleen and another mercenary were hired by the Imperial Inquisitor known as the Third Sister to kidnap Leia Organa, Princess of Alderaan. The actual goal of the Inquisitor was to lure former Jedi Master Obi-Wan Kenobi into a trap. After traveling to the Core Worlds planet Alderaan, the group waited for Leia in the forests and successfully captured her after having shot an Alderaan guard in a short chase. The Falleen mercenary then pulled a bag over Leia's head. Holding her hostage aboard their ship, the mercenaries took Leia to the planet Daiyu.\nAfter their arrival on Daiyu, the group waited for Obi-Wan Kenobi, who had been asked by male Alderaanian Senator Bail Organa to save his daughter, to arrive. Once Kenobi had entered their hideout, the three ambushed him and managed to pin the former Jedi against the wall while threatening him with their blasters. The Falleen mercenary then took Kenobi's lightsaber and handed it to Nokru, who was having a talk with Kenobi about how the former Jedi had become vulnerable. However, Kenobi was able to escape by taking out the mercenaries with a spice he obtained earlier. After Kenobi's and Leia's escape, the Falleen cleaned her blaster while Nokru was approached by the Third Sister to put a bounty on Kenobi and inform all bounty hunters on the planet about Kenobi's presence. The former Jedi and Leia were ultimately able to escape from Daiyu.\nThe mercenary had green, scaled skin and black hair worn in a ponytail.\nThe Falleen mercenary was equipped with a blaster. She wore a dark blue top, a brown sleeveless jacket, gray pants, and a belt with a holster for her blaster. The crew of the three mercenaries also had a starship.\nThe Falleen first appeared in \"Part I,\" the first episode of the live-action series Obi-Wan Kenobi, which premiered on May 27, 2022. She is portrayed by Amy Sturdivant.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Falleen",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Unidentified_Falleen_mercenary",
  "/wiki/Falleen",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hair",
  "/wiki/Vect_Nokru",
  "/wiki/Human",
  "/wiki/Mercenary",
  "/wiki/Unidentified_mercenary_(Vect)",
  "/wiki/9_BBY",
  "/wiki/Reva_Sevander",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitor",
  "/wiki/Kidnapping_of_Leia_Organa",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alderaanian_monarchy",
  "/wiki/Alderaan",
  "/wiki/Starship",
  "/wiki/Daiyu",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Spice",
  "/wiki/File:Falleen_Mercenary_chasing_Leia.png",
  "/wiki/9_ABY",
  "/wiki/Core_Worlds",
  "/wiki/Planet",
  "/wiki/Alderaan_guard",
  "/wiki/Hostage",
  "/wiki/Alderaanian",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Blaster",
  "/wiki/Lightsaber",
  "/wiki/Jedi",
  "/wiki/Bounty",
  "/wiki/Bounty_hunter",
  "/wiki/Part_I",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/May_27",
  "/wiki/2022",
  "/wiki/Amy_Sturdivant",
  "/wiki/Category:Images_of_unidentified_Falleen_mercenary",
  "/wiki/Part_II",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Databank_(website)"
 ]
}