{
 "name": "Unidentified_Keshiri_Sith",
 "display_name": "Unidentified Keshiri Sith",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "43.5 ABY",
      "Sinkhole Station",
      "the Maw"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith",
      "Lost Tribe of Sith strike team",
      "Lost Tribe of Sith strike team"
     ]
    }
   ]
  }
 ],
 "content": "A female Keshiri Sith was a member of the Lost Tribe of Sith from the planet Kesh. She was chosen to be a member of the Sith strike team sent to hunt down Ship, a Sith Meditation Sphere, and kill Luke Skywalker in 43 ABY. After the strike team recovered Ship from a planet in the Maw, the Meditation Sphere transported the strike team to Sinkhole Station, where the group of Sith ambushed Skywalker and his son, Jedi Knight Ben Skywalker. After breaking into the station's control room, the female Keshiri attacked Luke, but Ben quickly sliced off her hand with his lightsaber. She attempted to attack Ben with her own lightsaber, but Ben used the Force to pull her onto his lightsaber blade, killing her.\nA Force-sensitive female Keshiri Sith was born on the Wild Space world of Kesh. She was trained in the ways of the dark side of the Force with the Lost Tribe of Sith—descendants of a group of Sith who had crash-landed on Kesh during the days of the Sith Empire. In 41 ABY, Ship, a Sith Meditation Sphere, arrived on Kesh and began to help them form a new armada. Two years later, after the members of the Tribe felt Jedi Grand Master Luke Skywalker's presence in the Force when he touched an Aing-Tii relic, the Codex, Ship abruptly left Kesh to follow a call through the Force. The female Keshiri was chosen by Grand Lord Darish Vol and Lady Olaris Rhea to be a member of Rhea's strike team sent to recover Ship and eliminate Skywalker.\nAboard the captured warship Eternal Crusader, the Keshiri Sith served under Rhea as the strike team tracked Ship to a planet in the Maw. There, the team encountered Abeloth, a being who was very strong in the Force and controlled the world's deadly plant-life. Still, many of the strike team's members were killed before Ship returned to them, but the female Sith was among the approximately fifteen survivors. Meanwhile, Abeloth had discovered Skywalker and his son, Jedi Knight Ben Skywalker, at Sinkhole Station, a space station in the Maw. Ship transported the female Keshiri and the other Sith to Sinkhole Station, where they ambushed the Skywalkers. The Keshiri Sith was part of the initial attack group who cut into the station's control room, where the Skywalkers had just returned from going beyond shadows—the state of being Force-sensitives entered after separating their minds from their bodies.\nAs the team broke into the control room, the Keshiri Sith threw her parang at Luke, who, with warning from his son, managed to dodge the blade. She tried to pull the weapon back to her with the Force but also sensed Ben moving to attack her, and attempted to counter him while still catching the parang. The complex move failed, and Ben quickly cut off her hand with his lightsaber. She then slashed her own lightsaber at Ben's neck, but he used the Force to pull her body onto his blade, killing her.\nThe Keshiri Sith was strong-willed, as that was one of the criteria for being chosen as a member of the Lost Tribe's strike team.\nThe female Keshiri was Force-sensitive, and she trained in the ways of the Sith with the Lost Tribe on Kesh. In battle she utilized a lightsaber, as well as a parang. She was also the first Sith in the strike team to attack Skywalker during the battle; however, the Jedi's son was able to overcome her defenses instantly, slicing off her hand and stabbing her.\nThe female Keshiri Sith appeared briefly as an unnamed character in the 2009 novel Fate of the Jedi: Abyss, Troy Denning's first installment—and the third novel overall—in the Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/43_ABY",
  "/wiki/Sinkhole_Station",
  "/wiki/The_Maw/Legends",
  "/wiki/Keshiri",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Lost_Tribe_of_Sith_strike_team",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Planet/Legends",
  "/wiki/Ship_(Sith_Meditation_Sphere)",
  "/wiki/Sith_Meditation_Sphere",
  "/wiki/Death/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Abeloth%27s_planet",
  "/wiki/Sith/Legends",
  "/wiki/Skirmish_at_Sinkhole_Station",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Cho_mai/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Shiak",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Wild_Space/Legends",
  "/wiki/Sith_training",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/41_ABY",
  "/wiki/Sith_armada_(Lost_Tribe_of_the_Sith)",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Aing-Tii/Legends",
  "/wiki/Relics",
  "/wiki/Codex",
  "/wiki/Grand_Lord",
  "/wiki/Darish_Vol",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Olaris_Rhea",
  "/wiki/Warship/Legends",
  "/wiki/Eternal_Crusader",
  "/wiki/Abeloth",
  "/wiki/Plant/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Beyond_shadows",
  "/wiki/Parang/Legends",
  "/wiki/2009",
  "/wiki/Troy_Denning",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Fate_of_the_Jedi:_Omen"
 ]
}