{
 "name": "Unidentified_Mimbanese_worker",
 "display_name": "Unidentified Mimbanese worker",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mimbanese"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gideon's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "A Mimbanese worker served as a mechanic for the Magistrate Greef Karga while also being a spy for Moff Gideon's remnant of the Galactic Empire. After being ordered to repair the Mandalorian Din Djarin's gunship, the Razor Crest, the worker was instructed by Gideon's remnant to plant a tracking beacon in the starship. The Mimbanese complied and informed an Imperial comms officer when the job had been done.\nAround 9 ABY, the Mimbanese worker served Magistrate Greef Karga at his city on the planet Nevarro as a technician, even being called by Karga as one of \"his best men.\" Simultaneously, however, the worker operated as a spy for Moff Gideon, the leader of a remnant of the Galactic Empire. When the Mandalorian bounty hunter Din Djarin arrived to meet with Karga and the city Marshal Cara Dune, Karga ordered the Mimbanese and another worker to repair the Mandalorian's gunship, the Razor Crest. The Mimbanese worker acknowledged Karga's orders, beginning to work immediately, and looked back towards Djarin and his foundling, Grogu, as they entered the city.\nThe Mimbanese made contact with Gideon's remnant, confirming the presence of Grogu, which Gideon had been searching for. The worker was made to place a tracking beacon on the Razor Crest during repairs, and after the work was finished, Djarin departed Nevarro. The Mimbanese soon contacted Gideon's remnant again, informing a comms officer that a tracking beacon had been placed aboard the Razor Crest. The Imperial officer promised that the worker would be rewarded during the \"new era.\"\nThe Mimbanese worker had red skin and blue eyes. The worker compliantly followed orders from both Greef Karga and Moff Gideon's remnant, giving the latter updates.\nThe Mimbanese wore a headset and leather straps around the head and also donned a yellow jacket. The worker also possessed tools which were carried at the beginning of the repairs.\nThe Mimbanese worker appeared in \"Chapter 12: The Siege\" of Jon Favreau's Disney+ series The Mandalorian, directed by Carl Weathers and released on November 20, 2020. Credited as \"Alien Worker,\" the worker was played by Ryan Powers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Mimbanese",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Chapter_12:_The_Siege",
  "/wiki/Technician",
  "/wiki/Magistrate",
  "/wiki/Greef_Karga",
  "/wiki/Spy",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Galactic_Empire",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Gunship",
  "/wiki/Razor_Crest",
  "/wiki/Homing_beacon",
  "/wiki/Starship",
  "/wiki/Unidentified_Imperial_comms_officer",
  "/wiki/9_ABY",
  "/wiki/Nevarro_City",
  "/wiki/Planet",
  "/wiki/Nevarro",
  "/wiki/Bounty_hunter",
  "/wiki/City",
  "/wiki/Marshal",
  "/wiki/Carasynthia_Dune",
  "/wiki/Foundling",
  "/wiki/Grogu",
  "/wiki/Imperial_officer",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Jon_Favreau",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Carl_Weathers",
  "/wiki/November_20",
  "/wiki/2020",
  "/wiki/Ryan_Powers",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two"
 ]
}