{
 "name": "Unidentified_Twi%27lek_refugee",
 "display_name": "Unidentified Twi'lek refugee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nar Shaddaa refugees"
     ]
    }
   ]
  }
 ],
 "content": "A male Twi'lek refugee lived in the Refugee Sector of the moon Nar Shaddaa during the Dark Wars, a series of conflicts between the Galactic Republic and remnants of the Sith Lord Darth Revan's Sith Empire. At some point, he encountered the former Sith trooper Atton Rand, who hunted Jedi on behalf of the Sith Empire, as Rand was making his living as a smuggler on Nar Shaddaa. When the Jedi exile Meetra Surik visited Nar Shaddaa in 3951 BBY during her search for Jedi Master Zez-Kai Ell, the Twi'lek approached her and gave her a warning to not trust Rand, who was now a companion of hers, stating that he was a killer. Surik would later confront Rand with that information.\nDuring the time of the Dark Wars, a series of conflicts between the Galactic Republic and remnants of Darth Revan's Sith Empire, a male Twi'lek refugee lived in the Refugee Sector of Nar Shaddaa, the largest moon of the planet Nal Hutta. Prior to this, the Twi'lek had come in contact with a male Human named Atton Rand who claimed to be a soldier displaced by the Jedi Civil War.\nIn 3951 BBY, when Meetra Surik, a former Jedi Knight and exile of the Jedi Order, visited the Refugee Sector in her search for Jedi Master Zez-Kai Ell, she was approached by the Twi'lek. He warned her not to trust her companion, Atton Rand, claiming that they had crossed paths before during the Jedi Civil War years earlier. He told her that Rand had come to Nar Shaddaa claiming to be a refugee of the war, and informed Surik that Rand was a murderer, as opposed to a soldier. Surik was skeptical, but the Twi'lek stated that she could believe him or not. He had warned her about Rand and left the rest up to her. Surik would later use that information to confront Rand, who admitted to murdering Jedi for the Sith during the Jedi Civil War. Surik forgave Rand and offered to train him in the ways of the Jedi, which he accepted, becoming a Jedi Sentinel.\nThe Twi'lek had orange skin and blue eyes and did not speak Galactic Basic Standard, though he understood it. His feelings for Atton Rand were of distrust, and he made it a point to inform Surik of his beliefs about Rand.\nThe Twi'lek refugee appears in the 2004 role playing video game Star Wars: Knights of the Old Republic II: The Sith Lords developed by Obsidian Entertainment and published by LucasArts for the Xbox and PC. The game was later released for the PC in 2005. The character appears in a brief cut scene as the player walks through the refugee sector of Nar Shaddaa. Speaking with him is necessary if the player wishes to gain enough influence with Atton Rand to train him as a Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Refugee/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Refugee_Sector",
  "/wiki/Moon/Legends",
  "/wiki/Dark_Wars",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Sith_trooper_(Sith_Empire)",
  "/wiki/Atton_Rand",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Meetra_Surik",
  "/wiki/3951_BBY",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Time/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Human/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedi_Sentinel/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/2004",
  "/wiki/Video_game",
  "/wiki/Obsidian_Entertainment",
  "/wiki/LucasArts",
  "/wiki/Xbox",
  "/wiki/Personal_computer",
  "/wiki/2005",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}