{
 "name": "Unidentified_Mon_Calamari_pilot",
 "display_name": "Unidentified Mon Calamari pilot",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "A Mon Calamari pilot flew an A-wing for the Rebel Alliance during the Battle of Endor in 4 ABY.\nThis pilot was first revealed in a San Diego Comic Con 2011 teaser video promoting the deleted scenes included with the Blu-ray release of the six Star Wars films. The character is only seen for a moment, he is dressed in the same uniform as the A-wing pilots seen in Return of the Jedi.\nThe actual deleted material runs over two minutes and consists of someone off-screen telling the puppeteer what to \"say\" to the camera, and him repeating with the puppet.\nThe puppeteers are addressed as \"Tim\" and \"Simon\"; presumably Tim Rose and Simon Williamson, who also portrayed Gial Ackbar and Max Rebo, respectively.\nThis Mon Calamari pilot is wearing a green A-Wing flight suit, but is flying a B-Wing. The cockpit visible behind the puppet in the deleted scene is noticeably different from the A-Wing cockpits seen in the film.\nHasbro released an action figure of this character, named as \"Rebel Pilot \", in February 2012 as part of The Vintage Collection — part of the Star Wars Legends continuity. The card art shows him piloting an A-Wing, as consistent with his flight suit rather than what appeared on screen. The Rebel Starfighters Owners' Workshop Manual from 2019 finally named the pilot Ika Sulko and made him part of the current Star Wars canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ika_Sulko",
  "/wiki/Unidentified_Mon_Calamari_pilot",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/RZ-1_A-wing_interceptor/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_Mon_Calamari_pilot",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Complete_Saga",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Tim_Rose",
  "/wiki/Simon_Williamson",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Max_Rebo/Legends",
  "/wiki/Hasbro_Inc.",
  "/wiki/2012",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Rebel_Starfighters_Owners%27_Workshop_Manual",
  "/wiki/2019",
  "/wiki/StarWars.com"
 ]
}