{
 "name": "Unidentified_Advanced_Recon_Force_Scout_Trooper_commander",
 "display_name": "Unidentified Advanced Recon Force Scout Trooper commander",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Unidentified Galactic Republic regiment",
      "Unidentified Galactic Republic regiment"
     ]
    }
   ]
  }
 ],
 "content": "This Advanced Recon Force Scout Trooper served as a commander early during the Clone Wars. The Clone Commander, along with a fellow lieutenant, was tasked with tracking down Jabba Desilijic Tiure's son, Rotta who was kidnapped by bounty hunters.\nGrown on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the clone trooper army, this clone was a Clone Commander and ARF trooper in the Grand Army of the Republic during the Clone Wars who served in a regiment.\nAfter Jabba Desilijic Tiure's son, Rotta, was kidnapped by alleged bounty hunters, the commander was dispatched along with an ARF trooper lieutenant in a Nu-class attack/transport shuttle to track down the bounty hunters and Rotta.\nAfter tracking bounty hunters dispatched by Jabba himself to the B'omarr Order Monastery on the planet of Teth, the commander ordered the lieutenant to contact Jedi General Mace Windu, where the commander then informed him on the situation. The commander told Windu that the monastery was too heavily fortified for them to do anything by themselves, and received the order to stay hidden and to await further orders. Once Jedi General Anakin Skywalker and the 501st Legion arrived in the Teth system, the ARF troopers made their way to Skywalker's Acclamator-class transgalactic military assault ship with their Nu-class transport. Landing in the hangar, the lieutenant reported to General Skywalker that there were at least two droid battalions protecting the monastery, and that landing on the monastery would not be possible.\nAs a clone of Jango Fett, the commander was a human male that stood at 1.83 meters tall, had natural black hair, and tan skin.\nAs an ARF trooper and commander, this clone was specialized in stealth and reconnaissance, and was one of the best scouts in his regiment. He was able to understand enemy capabilities and deduce not to attack, and was able to, along with the lieutenant, pilot a Nu-class transport.\nThe commander was equipped with green camouflaged clone trooper armor. As a commander, he sported yellow markings on his helmet.\nThe ARF Clone Commander first appeared, albeit unnamed, in the animated theatrical film Star Wars: The Clone Wars which was released on August 15, 2008 in the United States and was directed by Dave Filoni. In the DVD and Disney+ subtitles, this character is mistakenly identified as Rex.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Advanced_Recon_Force_Scout_Trooper_commander",
  "/wiki/Unidentified_Advanced_Recon_Force_trooper_commander",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Unidentified_Galactic_Republic_regiment",
  "/wiki/File:MonasteryOnTeth-TCWf.ogg",
  "/wiki/Advanced_Recon_Force_Scout_Trooper",
  "/wiki/Clone_Wars",
  "/wiki/Clone_Commander",
  "/wiki/Unidentified_Advanced_Recon_Force_Scout_Trooper_lieutenant",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Rotta",
  "/wiki/Bounty_hunter",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Jango_Fett",
  "/wiki/Clone_template",
  "/wiki/Clone_trooper",
  "/wiki/Army",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Nu-class_attack/transport_shuttle",
  "/wiki/B%27omarr_Order_Monastery",
  "/wiki/Teth",
  "/wiki/Lieutenant",
  "/wiki/Jedi_General",
  "/wiki/Mace_Windu",
  "/wiki/Jedi",
  "/wiki/General",
  "/wiki/Anakin_Skywalker",
  "/wiki/501st_Legion",
  "/wiki/Teth_system",
  "/wiki/Acclamator-class_transgalactic_military_assault_ship",
  "/wiki/Transport",
  "/wiki/Droid",
  "/wiki/Battalion",
  "/wiki/Hair",
  "/wiki/Scout",
  "/wiki/Pilot",
  "/wiki/Clone_trooper_armor",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/August_15",
  "/wiki/2008",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars_home_video_releases#Star_Wars:_The_Clone_Wars_film",
  "/wiki/Disney%2B",
  "/wiki/Rex",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/StarWars.com"
 ]
}