{
 "name": "Unidentified_outpost_supervisor",
 "display_name": "Unidentified outpost supervisor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gran"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mining corporation"
     ]
    }
   ]
  }
 ],
 "content": "A Gran worked as supervisor of a outpost on the planet Codia's second moon at some point between 44 BBY and 32 BBY. After a group of burglars destroyed the outpost's power core while attempting to steal a shipment of diamonds, the core produced unusual radioactivity that supressed the entire light spectrum in the outpost and drove the Defel miner Rosack Denahst insane.\nThe supervisor stayed to investigate the power failure, and witnessed the thieves kill six miners before the criminals themselves were killed by Denahst. After this, the Gran lost their sight, but eventually encountered the Jedi Qui-Gon Jinn and Obi-Wan Kenobi, who had been sent to investigate. The Gran and the Jedi pieced together what had happened and after an attack by Denahst, the Gran and Kenobi worked together to repair the core, restoring the Defel's sanity and power to the base.\nA Gran worked for a Mining corporation as supervisor of the company's outpost on the planet Codia's second moon where they mined for diamonds on the brighter side of the tidally locked moon. At some point between 44 BBY and 32 BBY, the outpost's power core was destroyed by a group of burglars who hoped to steal a shipment of diamonds from the outpost. The core's destruction not only caused a power outage, but also supressed the entire light spectrum within the outpost due to unusual radioactivity produced by a reaction between the primarily solid accelerite core and the non-incendiary photonic charge used by the thieves.\nWhile most of the outpost's miners escaped to the outpost's barracks, the supervisor remained behind to investigate the outage and witnessed the thieves murder six of the miners. Five of the thieves were then slaughtered by an unseen assailant, after which the suppression of the light spectrum meant that Gran could see no more.\nBelieving that they had gone blind, the supervisor remained in the outpost and eventually encountered the Jedi Obi-Wan Kenobi and Qui-Gon Jinn near the slaughtered thieves, blindly opening fire on them before Jinn used the Force to disarm the Gran. The supervisor then questioned if the Jedi were responsible for the ongoing incident, but after learning that the Jedi were there to investigate, the supervisor exchanged information with them, and the Gran realized that it had been the Defel miner Rosack Denahst who had slaughtered the thieves.\nAfter the Jedi deduced that the radiation must have driven the light-sensitive Defel mad, the Gran asked that they kill the frenzied miner. As the Jedi refused, Denahst attacked, first killing a surviving thief who had been with the Jedi, and then lifting the Gran into the air as the supervisor tried to reason with him. Kenobi used the Force to stun Denahst, and the Defel dropped the Gran, after which Jinn incapacitated the miner with a mining cart. With the threat temporarily ended, the Gran suggested that they could reconstitute and reignite the power core's fuel rod to nullify the radiation and clear Denahst's mind.\nThe Gran then led Kenobi to the power core, using only the memory of the outpost's layout to navigate the darkness and leading the Jedi by voice. At the core, the supervisor instructed Kenobi from the control room to reassemble the fuel rod then reinsert it into the core's upper conduit. After Kenobi did as instructed and lifted the reassembled rod to the conduit, the Gran raised the temperature in the chamber to just above accelerite's melting point so that the shards of the rod would fuse, but without going high enough to kill Kenobi or detonate the rod. The plan worked successfully, but Kenobi did not exit the core before it reignited and so was temporarily blinded.\nNever the less, the station's power and Denahst's sanity were restored, and the Gran later visited a recovering Kenobi with the Defel in the outpost's medical center. Denahst thanked Kenobi, but admitted he would be haunted by what he had done while frenzied. The Gran comforted the Defel and stated that he was not to blame for his actions, pointing out that he had only killed the murderous thieves, but Denahst claimed he would still carry the guilt for the rest of his life.\nThe outpost supervisor remained behind to investigate during the outage, and upon encountering the Jedi initially believed they might be responsible for the death of the thieves, although when the Gran learned that Denahst was responsible they were shocked and pitied the miner. However, the supervisor quickly declared the Defel lost and asked that the Jedi destroy him. When Denahst attacked the Gran, the supervisor tried to reason with him and after the Defel was incapacitated, they suggested a plan that could save the Defel.\nKenobi considered the Gran brave for then leading him through the outpost while effectively blind, using only the memory of the layout. Once the power was restored to the facility and Denahst recovered, the Gran tried to comfort the miner and claimed that the Defel was not to blame for his actions while frenzied, also stating that it was only murderous thieves who he had killed. The Gran had pink skin and brown eyes. When shocked by the revelation of Denahst's identity, the Gran exclaimed in Native Gran rather then Galactic Basic.\nThe supervisor wore a red tunic over a brown shirt and pants, with golden bracers, a brown and gold belt, and brown boots. The Gran used a DH-23 blaster pistol in combat.\nThe supervisor was created for the second issue of the Star Wars: Obi-Wan comic series which was written by Christopher Cantwell, illustrated by Luke Ross, and published on June 29, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Unidentified_outpost_supervisor",
  "/wiki/Gran",
  "/wiki/Color",
  "/wiki/Unidentified_mining_corporation",
  "/wiki/Unidentified_mining_outpost_(Codia%27s_second_moon)",
  "/wiki/Planet",
  "/wiki/Codia",
  "/wiki/Codia%27s_second_moon",
  "/wiki/44_BBY",
  "/wiki/32_BBY",
  "/wiki/Thief",
  "/wiki/Power_core",
  "/wiki/Diamond",
  "/wiki/Radiation",
  "/wiki/Defel",
  "/wiki/Rosack_Denahst",
  "/wiki/Death",
  "/wiki/Miner",
  "/wiki/Jedi",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mission_to_Codia%27s_second_moon",
  "/wiki/Moon",
  "/wiki/Accelerite",
  "/wiki/Non-incendiary_photonic_charge",
  "/wiki/The_Force",
  "/wiki/Unidentified_thief_(Codia%27s_second_moon)",
  "/wiki/Stun",
  "/wiki/Fuel",
  "/wiki/Eye",
  "/wiki/Native_Gran",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Clothing",
  "/wiki/Bracer",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/DH-23_blaster_pistol",
  "/wiki/Obi-Wan_2",
  "/wiki/Star_Wars:_Obi-Wan_(comic_series)",
  "/wiki/Christopher_Cantwell",
  "/wiki/Luke_Ross",
  "/wiki/June_29",
  "/wiki/2022",
  "/wiki/Padawan",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Reproduction",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Marvel_Comics"
 ]
}