{
 "name": "Unidentified_Pyke_capo",
 "display_name": "Unidentified Pyke capo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pyke"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light blue and beige"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "A male Pyke worked as a capo for the Pyke Syndicate around 9 ABY. When the syndicate attempted to seize the city of Mos Espa from Daimyo Boba Fett, he led a number of Pyke foot soldiers on Fett's position. They were soon met by a Twi'lek majordomo who read out the Daimyo's terms with much prompting from the capo. With the terms being a threat to the Pykes, the capo attempted to kill the majordomo when Fett and the Mandalorian Din Djarin arrived and gunned him and many of his men down.\nAround 9 ABY, the Pyke male worked as a capo for the Pyke Syndicate. During the syndicate's takeover of the desert planet Tatooine, he was deployed as part of an attack on the city of Mos Espa to usurp Daimyo Boba Fett from his rule there. With the three ruling families of the city turning on Fett's forces, the capo led a force of Pyke foot soldiers to the street leading to the Sanctuary, a cantina which the Pykes had bombed and had since become Fett's hideout. The group of Pykes positioned themselves behind cover in nooks or balconies.\nAfter a short wait, the Pykes were met by a Twi'lek majordomo, who exited the ruins of the Sanctuary with what he claimed was terms of surrender from Fett. The capo and a number of his men walked up to the majordomo and he ordered the majordomo to read the terms, calling the Twi'lek a tail-head. The majordomo laughed off the nickname and begun speaking about the Obsidian Cliffs of the Pyke homeworld Oba Diah until the capo once against demanded for him to read the terms.\nThe majordomo began reading the terms but paused when he got to Fett's offer, attempting to change the topic. Prompted to continue by the capo, the Twi'lek read Fett's offer, which threatened the deaths of the Pykes if they did not clear off of Tatooine. The capo scowled and exchanged looks with his men before raising his blaster at the majordomo to execute him. That was when Fett and the Mandalorian Din Djarin flew out on jetpacks and gunned down the Pyke, engaging his men thereafter in a battle that eventually drove the syndicate out of Mos Espa.\nA Pyke male, the capo had light blue and beige skin with black eyes. He was insistent on the Twi'lek majordomo to read out Boba Fett's terms, angrily snapping at the Twi'lek when the majordomo went on a tangent. The capo scowled at Fett's threat to his syndicate, choosing to try and shoot the majordomo as a response.\nThe Pyke capo wore black clothing with grey armor with yellow markings, including the symbol of the Pyke Syndicate on his shoulder pads. He also had brown boots and wielded a blaster.\nThe Pyke capo appeared in and \"Chapter 7: In the Name of Honor\" of the Disney+ series The Book of Boba Fett, which was directed by Robert Rodriguez and released on February 9 2022. He was played by the stunt performer Andreas Saenz-Hudson. In the character's scene, he wears the costume of a Pyke foot soldier with a yellow mask in the shots when he is hit by a blaster bolt.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Pyke",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Pyke_Syndicate",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Daimyo",
  "/wiki/Boba_Fett",
  "/wiki/Pyke_guard",
  "/wiki/Unidentified_Twi%27lek_majordomo",
  "/wiki/Majordomo",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/War_for_Tatooine",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Fett_gotra",
  "/wiki/Capo",
  "/wiki/Sanctuary",
  "/wiki/Cantina",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/Twi%27lek",
  "/wiki/Obsidian_Cliffs",
  "/wiki/Homeworld",
  "/wiki/Oba_Diah",
  "/wiki/Blaster",
  "/wiki/Jetpack",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Boot",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Robert_Rodriguez",
  "/wiki/February_9",
  "/wiki/2022",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Death",
  "/wiki/Databank_(website)"
 ]
}