{
 "name": "Unidentified_Aeosian_Queen",
 "display_name": "Unidentified Aeosian Queen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aeos Prime"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aeosian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "An Aeosian female served as the queen of her species on her homeworld of Aeos Prime. In the war against the Empire, her planet housed a rebel base, which was later attacked by the First Order during its war against the Resistance. Not long after the attack, the queen met with representatives of the Colossus space station, including Kazuda Xiono and Griff Halloran, who wished to find a safe haven on Aeos Prime. The queen was initially hesitant to allow outsiders on her world due to the First Order attack, but eventually allowed the station to remain on the planet.\nIn the days of the Galactic Civil War, in which the Alliance to Restore the Republic fought the Galactic Empire, the Aeosian queen allowed a rebel outpost to exist on her planet. Many years later, long after the outpost was abandoned, an Aeosian village was attacked by the First Order, due to the presence of the former rebel outpost, and several Aeosians were wounded or killed in the attack.\nSometime after the attack, the space station Colossus arrived on Aeos Prime, seeking refuge from the First Order. During a scouting expedition Kazuda Xiono and Griff Halloran, entered the destroyed village. While exploring the planet's caves, Halloran, Xiono, and their droids were captured by the native Aeosians and brought before the queen. The queen ordered that the prisoners be fed to the krakavora, ignoring Xiono's attempts to explain their purpose on Aeos Prime. On their way to the krakavora, Xiono and the droid CB-23 escaped so that Xiono could provide medicine to Aeosians who had been wounded in the First Order's attack. Realizing that her prisoners were not a threat, the queen offered to free them in exchange for further supplies of medicine.\nThe queen, along with a number of Aeosians and her former prisoners, boarded the Colossus and met with the station's captain, Imanuel Doza. The queen agreed to allow the station to remain on Aeos Prime, though the Colossus would later be discovered by the First Order.\nThe Aeosian queen first appeared in the Star Wars Resistance episode \"The New World,\" voiced by Lucy Lawless.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/No_Place_Safe",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Aeos_Prime",
  "/wiki/Aeosian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/Aeos_Prime_rebel_outpost",
  "/wiki/Attack_on_Aeos_Prime",
  "/wiki/First_Order",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Colossus",
  "/wiki/Space_station",
  "/wiki/Kazuda_Xiono",
  "/wiki/Griff_Halloran",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Queen",
  "/wiki/Standard_year",
  "/wiki/Unidentified_Aeosian_village",
  "/wiki/Death",
  "/wiki/Scout",
  "/wiki/Cave",
  "/wiki/Droid",
  "/wiki/Krakavora",
  "/wiki/CB-23",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Star_Wars_Resistance",
  "/wiki/The_New_World",
  "/wiki/Lucy_Lawless",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)"
 ]
}