{
 "name": "Unidentified_alien_woman_(Vyndal)",
 "display_name": "Unidentified alien woman  (Vyndal)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Vyndal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Unidentified Vyndal species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "An alien woman was among the natives of Vyndal who welcomed Yeleb in their village after he landed on their homeworld. She had a son who was easily frightened. One day, she and her offspring encountered Kanan Jarrus, a male human who had been forced to land in the forests of Vyndal to repair his starship. Upon seeing that the stranger was injured and was falling unconscious, she brought him to her village, where she tended to his wound.\nAfter that, the alien woman led Jarrus to Yeleb, who acted as the village's protector and portrayed himself as a Jedi. Unknown to the woman and the other natives, Yeleb was an impostor. However, the stranger Kanan Jarrus was a genuine Jedi in hiding, and was given chase by the Grand Inquisitor, a brutal enforcer of the Galactic Empire. Despite his lack of actual powers, Yeleb confronted the Inquisitor, while the alien woman, her people and Kanan Jarrus stood up to the Imperial stormtroopers. Eventually, Jarrus tricked the Imperials into leaving the planet by making them chase an empty starship.\nWhen the alien woman realized that Yeleb had been mortally wounded in his battle against the Inquisitor, she took him into her arms, where he breathed his last. Deprived of the man who had been her beloved protector, the alien woman felt a great discouragement, thinking that her village had no future without Yeleb. However, she and her people listened to the words of Kanan Jarrus, who encouraged them to keep standing up for themselves and honor their former protector's courage.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Vyndal",
  "/wiki/Unidentified_Vyndal_species",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Yeleb",
  "/wiki/Unidentified_village_(Vyndal)",
  "/wiki/Homeworld",
  "/wiki/Unidentified_alien_boy_(Vyndal)",
  "/wiki/Standard_day",
  "/wiki/Kanan_Jarrus",
  "/wiki/Human",
  "/wiki/Forest",
  "/wiki/Starship",
  "/wiki/Alien",
  "/wiki/Jedi",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Galactic_Empire",
  "/wiki/Force_power",
  "/wiki/Skirmish_on_Vyndal",
  "/wiki/Stormtrooper",
  "/wiki/Death",
  "/wiki/Star_Wars_Rebels_Magazine",
  "/wiki/The_Fake_Jedi",
  "/wiki/Star_Wars_Rebels_Magazine_3"
 ]
}