{
 "name": "Unidentified_Nikto_bounty_hunter",
 "display_name": "Unidentified Nikto bounty hunter",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Nevarro"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "A Kadas'sa'Nikto male operated as a member of the Bounty Hunters' Guild during the era of the New Republic. Around 9 ABY, the bounty hunter was recruited alongside two other bounty hunters by the Guild agent Greef Karga, an agent of the Guild to steal a force-sensitive Child from the Mandalorian Din Djarin, who had been tricked by Karga into thinking the agent was seeking the Mandalorian's help.\nAfter meeting with Djarin and his own backup, the group set up camp for the night, only to be attacked by native reptavians which took away one of the bounty hunters. After the Child saved Karga's life, though, the agent had a change of mind. The next day, the Nikto and the other remaining bounty hunter attempted to kill Djarin when Karga chose to betray and kill the pair to help the Mandalorian.\nThe Nikto was a bounty hunter in the Bounty Hunters' Guild on the planet Nevarro by circa 9 ABY. During that time, he was recruited by Greef Karga, an agent in the Guild, to join his security detail. Along with a Trandoshan and a human bounty hunter, the Nikto accompanied Karga in meeting the Mandalorian bounty hunter Din Djarin, who was in possession of a Force-sensitive infant which the Guild had been hunting for an remnant of the Galactic Empire. Karga intended to kill Djarin and take the Child in order for the Imperial remnant to depart Nevarro.\nThe Nikto joined Karga and the rest of his security detail in meeting Djarin in the lava fields. Karga had coaxed the Mandalorian there by convincing him that he intended to kill the Client from the Imperial remnant to make his forces leave. Djarin brought his own backup, the ex-rebel shock trooper Cara Dune and the Ugnaught Kuiil, all riding on Blurrgs. Karga acknowledged both of their security details and inspected the Child. The Nikto Djarin put their hands on their holsters, in order to draw blasters if anything happened. Both of them relaxed their arms when the Child was put back into his pram.\nThe two parties traveled across the lava fields before setting up camp for the night. At the camp, Karga discussed his \"plan\" to kill the Client with Djarin. However, he was attacked by a native reptavians. The group open fired as more of the creatures attacked the camp, taking away one of the Blurrgs. A moment of silence passed, until one of the creatures attacked the Trandoshan bounty hunter, carrying reptile away as the others shot at the animal. The group continued to fend off the creatures, losing another Blurrg in the process. After the flying animals left, Djarin and Dune tended to Karga, who had received a fatal wound from one of the creatures. Dune asked the Nikto and his human colleague if they had any medical supplies but they shook their heads. The Child then approached Karga and used Force healing on him, saving his life.\nThe next day, the group approached the city which the Imperial remnant had occupied. As Karga looked over to it with Djarin, Dune and Kuiil, he covertly signaled the Nikto and the human bounty hunter to shoot the latter three. The pair silently drew their blaster while behind Djarin and Dune. Karga, though, had had a change of heart after being healed by the Child. Abandoning his plan to kill Djarin and his colleagues, he swiftly drew his blasters and shot the Nikto and the human. The pair dropped to the floor dead, and Karga began revealing to Djarin and his backup of how he had intended to kill them.\nThe bounty hunter was a Kadas'sa'Nikto with green skin with small brown areas and black eyes. He had his hand ready to draw a blaster during the time Greef Karga held the Child and relaxed when the Mandalorian did the same.\nThe Nikto bounty hunter wore brown clothing with rusted armor protecting his torso and shoulders and an ammunition belt. He also donned a pair of black goggles and wielded a blaster which he kept in a brown leather holster.\nThe Nikto bounty hunter first appeared in Chapter 7 of Jon Favreau's 2019 television show The Mandalorian, which was directed by Deborah Chow and aired on December 18, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Nikto",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/9_ABY",
  "/wiki/Nevarro",
  "/wiki/Nikto",
  "/wiki/Kadas%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Chapter_7:_The_Reckoning",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Bounty_hunter",
  "/wiki/Agent",
  "/wiki/Greef_Karga",
  "/wiki/Force-sensitive",
  "/wiki/Grogu",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Nevarro_reptavian",
  "/wiki/Unidentified_Trandoshan_bounty_hunter",
  "/wiki/Unidentified_human_bounty_hunter_(Nevarro)",
  "/wiki/Planet",
  "/wiki/Bounty",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Galactic_Empire",
  "/wiki/Lava_fields",
  "/wiki/The_Client",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Shock_trooper",
  "/wiki/Carasynthia_Dune",
  "/wiki/Ugnaught",
  "/wiki/Kuiil",
  "/wiki/Blurrg",
  "/wiki/Holster",
  "/wiki/Blaster",
  "/wiki/Magma",
  "/wiki/Trandoshan",
  "/wiki/Reptile",
  "/wiki/Force_healing",
  "/wiki/Standard_day",
  "/wiki/Nevarro_City",
  "/wiki/Eye",
  "/wiki/Armor",
  "/wiki/Goggles",
  "/wiki/Leather",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/The_Mandalorian",
  "/wiki/Deborah_Chow",
  "/wiki/December_18",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Cast",
  "/wiki/StarWars.com",
  "/wiki/Technology",
  "/wiki/Practical",
  "/wiki/Score",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_Two",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Death",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Databank_(website)",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020"
 ]
}