{
 "name": "Unidentified_Human_female_Jedi",
 "display_name": "Unidentified Human female Jedi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 19 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "A Human female Jedi served the Galactic Republic during the Clone Wars. In 19 BBY, the Human Jedi survived the initial execution of Order 66, which was the directive commanding clone troopers to execute the Jedi Knights as enemies of the Republic. She evaded the clone soldiers she was accompanying by taking advantage of the fog on the world on which she was stationed. Eventually she was among several Jedi who were captured and brought to Emperor Palpatine, alias the Sith Lord Darth Sidious, who gave them lightsabers and encouraged them to duel each other to see who would survive under his rule. The Jedi instead attacked Sidious, who killed all of them except for her and the Verpine Jedi Beyghor Sahdett. Sahdett, overpowered by his awe and fear of Sidious, then turned on the female Jedi and killed her.\nA Human female was born during the final decades of the Galactic Republic. She was eventually trained in the ways of the Force by the Jedi Order. After the Clone Wars between the Republic and the Confederacy of Independent Systems erupted in 22 BBY, the Jedi participated in the conflict alongside clone troopers of the Grand Army of the Republic.\nIn 19 BBY, the Jedi was with a squad of soldiers on a forested planet near a set of ruins. Her clone troopers received Order 66 from Supreme Chancellor Palpatine, which was a directive commanding the Republic forces to execute the Jedi Knights as traitors. When the clones attacked the Jedi, she managed to evade them due to the planet's extremely thick fog, which prevented them from locating her position and killing her.\nAround 19 BBY, she, alongside four other Jedi, including the Verpine Beyghor Sahdett, was eventually captured, starved and beaten. Soon, the Jedi were brought before Emperor Palpatine himself, whom they recognized to be a Sith Lord, Darth Sidious. The Emperor handed lightsabers to this Jedi and her fellow captives, encouraging them to duel one another for the right to survive under his rule. The Jedi had not given in to fear, however, and attacked the Sith as one; yet Sidious' prowess with the Force and a lightsaber allowed him to kill three of the Jedi in an instant. She and Sahdett were the only two left standing, shocked at how quickly their compatriots had been slaughtered. Sahdett, however, enraptured by awe and fear of Sidious' power, turned on the Jedi and rammed his blade through her stomach, killing her.\nThe Jedi was light-skinned with green eyes and red hair. She served the Republic during the Clone Wars along with clone troopers during the conflict, and when Order 66 was issued, she used the fog to her advantage and managed to escape the clone troopers with whom she traveled. Along with the other captive Jedi, she refused for them to duel each other upon Darth Sidious' encouragement, and instead attacked the Sith Lord, though they were no match for Sidious' power.\nThe Jedi was sensitive to the Force and was able to escape being executed during the initial stages of Order 66.\nThe Jedi wore a set of brown and gray Jedi robes and owned a blue lightsaber. She also adorned her forehead with a simple tiara containing a red stone at its center. At the time of her capture, she was wearing a different tiara, with a silver stone at the center.\nThe Jedi appeared in Republic 79 and was created by Randy Stradley, who wrote the Into the Unknown story arc of the Star Wars: Republic comic series under the pseudonym \"Welles Hartley.\" She was penciled by Douglas Wheatley. The comic was published by Dark Horse Comics on November 9, 2005.\nShe later reappeared in Dark Times—A Spark Remains 3, a comic authored by Stradley and published on September 18, 2013, albeit with a somewhat different appearance. Nonetheless, Stradley confirmed it was indeed the same character, and her addition to that comic was in response to some fans' thoughts of too many surviving Jedi in the Republic comic series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/19_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Unidentified_forested_planet_(Order_66)",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Verpine/Legends",
  "/wiki/Beyghor_Sahdett",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Prisoner/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Silver/Legends",
  "/wiki/Republic_79",
  "/wiki/Randy_Stradley",
  "/wiki/Star_Wars:_Republic:_Into_the_Unknown",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Douglas_Wheatley",
  "/wiki/Dark_Horse_Comics",
  "/wiki/November_9",
  "/wiki/2005",
  "/wiki/Dark_Times%E2%80%94A_Spark_Remains_3",
  "/wiki/September_18",
  "/wiki/2013",
  "/wiki/Category:Images_of_unidentified_Human_female_Jedi",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Standard_month/Legends",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/September_29",
  "/wiki/November_13",
  "/wiki/2014"
 ]
}