{
 "name": "Unidentified_Shadow_Academy_student",
 "display_name": "Unidentified Shadow Academy student",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Shadow Academy",
      "Second Imperium"
     ]
    }
   ]
  }
 ],
 "content": "This Shadow Academy student was much like other students that had attended the Shadow Academy. He hoped to accomplish his goal of becoming a Jedi by attending the Shadow Academy. What kind of Jedi he was destined to become if he did so was clear.\nMuch of his individuality had been squashed, and his thought patterns had become disjointed due to the indoctrination that he had received at the hands of his teachers Brakiss and Tamith Kai He learned never to question their lessons.\nWhen Jaina Solo and Lowbacca attended their first lesson at the Shadow Academy, this student sat between them. Jaina tried to get him to question whether Brakiss's lessons were correct. He responded by informing Brakiss that Jaina was trying to spread false teachings regarding the Force among the rest of the students of the Shadow Academy.\nBrakiss eventually punished Jaina's dissension with a few bolts of Force lightning. Lowbacca reacted to this unpleasant turn of events by knocking down this Shadow Academy student and throwing benches around the meeting room.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Shadow_Academy",
  "/wiki/Second_Imperium",
  "/wiki/Jedi/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Brakiss",
  "/wiki/Tamith_Kai",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Lowbacca",
  "/wiki/The_Force/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Young_Jedi_Knights:_Shadow_Academy"
 ]
}