{
 "name": "Unidentified_Imperial_officer_(Crimson_Empire)",
 "display_name": "Unidentified Imperial officer  (Crimson Empire)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Crimson Empire",
      "Crimson Empire"
     ]
    }
   ]
  }
 ],
 "content": "A Human male officer of the Galactic Empire served the Crimson Empire in its final days. As the last Supreme Commander of the Imperial Fleet, he led the Empire's defense of Ord Cantrell as both an admiral in the Imperial Navy and a general in the Imperial Army. When Emperor Xandel Carivus was killed during the battle, the crumbling Empire ceased to exist.\nA Human male with white hair and a mustache served as an officer in the Imperial Military in 11 ABY, during the Galactic Empire's incarnation as the Crimson Empire. Having emerged from the ruins of Emperor Palpatine's Dark Empire, the Crimson Empire held the only territory still answerable to centralized Imperial control. The Imperial Interim Ruling Council led the Empire from a villa in the planet Ord Cantrell's city of De-Purteen, where the mustachioed officer was also stationed. 11 ABY saw several council members assassinated by Nom Anor—an advance agent of the invading extra-galactic Yuuzhan Vong species who was trying to hasten the Empire's collapse—and by members of the criminal organization Black Sun. Following the deaths of navy Admiral Llon Banjeer and army General Immodet, the mustachioed officer was placed in supreme command of the Empire's fleets as an admiral and in charge of Ord Cantrell's troops as a general.\nThe mustachioed officer took command of a military that was thinly spread due to the Empire's ongoing Galactic Civil War with the New Republic, a manhunt for former Emperor's Royal Guard Kir Kanos called by council leader Xandel Carivus, and trouble raised by the Whiphid species following the death of Whiphid councilor Ch'Unkk. When Carivus disbanded the Ruling Council and declared himself Emperor, he imprisoned his fellow councilors, including Feena D'Asta. Baron Ragez D'Asta, the father of Feena and an Imperial-allied shipping magnate who commanded a large private fleet, consequently threatened to withdraw his support from the Empire in a message sent to Ord Cantrell. The mustachioed officer received the message aboard his flagship and contacted Carivus on Ord Cantrell's surface, but the Emperor dismissed the Baron's threats as hollow and told the officer to deal with them himself.\nFollowing his discussion with Carivus, the mustachioed officer received an urgent communiqué from the crime lord Grappa the Hutt stating that he had captured Kir Kanos. The officer again contacted his Emperor and passed the information on. Not long afterward, Baron D'Asta's armada attacked Ord Cantrell, and the mustachioed officer led the defense from the bridge of his flagship. The two fleets clashed in orbit, and the scant Imperial forces left at Ord Cantrell were quickly overwhelmed by D'Asta's cruisers and corvettes. Carivus lambasted the officer via wallscreen during the battle, but the communication was terminated as the vessel accumulated damage. The Imperial fleet was forced to retreat, and the mustachioed officer made his way to Carivus's Council Tower, which he was told to guard by the Emperor. Half of the Empire's starfighter squadrons had been involved in the orbital battle, and its remaining TIE fighters and interceptors dogfought D'Asta's A-wings within Ord Cantrell's atmosphere. Within the tower, both Carivus and the mustachioed officer felt the damage to the building that was inflicted by D'Asta's fighters.\nCarivus had his private guard retrieve the captive D'Asta, and he resolved to return her to her father in return for an end to hostilities. When the mustachioed officer pointed out that D'Asta still had the upper hand, he was shocked to hear a departing Carivus state that he would evacuate and abandon the army forces stationed on-world if the Baron continued to press the attack. D'Asta, however, accepted Carivus's offer, and the mustachioed officer sought the Emperor out in his throne room to report as much. The Baron also sought a private audience with Carivus, and the Emperor dismissed the mustachioed officer in order to meet with D'Asta alone. The Baron turned out to be accompanied by Kir Kanos—freshly rescued from Grappa by New Republic forces—who killed Carivus as part of a vendetta he held against the entire Ruling Council. Following Carivus's death, centralized Imperial authority utterly collapsed, and the Galactic Empire ceased to exist.\nThe white-haired, mustachioed Imperial officer appeared in the final two issues of the comic series Crimson Empire II: Council of Blood. His appearance closely resembles that of Gilad Pellaeon, another Imperial officer, but when Crimson Empire II author Randy Stradley was asked in 2006 if they were one and the same, he merely gave a cryptic answer. It was not until 2009 that the officer was revealed to be a unique character when The Essential Atlas stated that Pellaeon was serving Warlord Treuten Teradoc's Greater Maldrood, and not the Galactic Empire, during Carivus's reign as Emperor.\nThe character is called \"Admiral\" in Crimson Empire II's fifth issue, and both \"Admiral\" and \"General\" in its sixth. Similarly, the former issue sees Carivus state that the mustachioed officer is in charge of the Empire's fleets, while the latter has the officer reference his \"troops.\" This article takes the discrepancy to mean that Carivus, in the midst of the Empire's death throes, appointed the officer as both an admiral in command of the Imperial Navy and a general in the Imperial Army.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Crimson_Empire",
  "/wiki/Standard_day/Legends",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Battle_of_Ord_Cantrell",
  "/wiki/Ord_Cantrell/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/General/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Xandel_Carivus",
  "/wiki/Death/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Dark_Empire",
  "/wiki/Imperial_Space",
  "/wiki/Imperial_Ruling_Council/Legends",
  "/wiki/Council_Tower",
  "/wiki/Planet/Legends",
  "/wiki/City/Legends",
  "/wiki/De-Purteen",
  "/wiki/Officer/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Nom_Anor",
  "/wiki/Agent/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Extra-galactic",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Species/Legends",
  "/wiki/Black_Sun/Legends",
  "/wiki/Llon_Banjeer",
  "/wiki/Immodet",
  "/wiki/Fleet/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Kir_Kanos",
  "/wiki/Whiphid/Legends",
  "/wiki/Ch%27Unkk",
  "/wiki/Prisoner/Legends",
  "/wiki/Feena_D%27Asta_(clone)",
  "/wiki/Baron_of_the_Empire/Legends",
  "/wiki/Ragez_D%27Asta",
  "/wiki/Parent/Legends",
  "/wiki/D%27Asta_private_fleet",
  "/wiki/Baron/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Grappa_(Hutt)",
  "/wiki/Hutt/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Space_warfare",
  "/wiki/Orbit/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Wallscreen",
  "/wiki/Starship/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/RZ-1_A-wing_interceptor/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Xandel_Carivus%27s_Private_Guard",
  "/wiki/Army/Legends",
  "/wiki/Star_Wars",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_5",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_6",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Crimson_Empire_II:_Council_of_Blood",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Randy_Stradley",
  "/wiki/2006",
  "/wiki/2009",
  "/wiki/The_Essential_Atlas",
  "/wiki/Warlord/Legends",
  "/wiki/Treuten_Teradoc",
  "/wiki/Greater_Maldrood",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Sedriss_QL",
  "/wiki/Xecr_Nist",
  "/wiki/Redd_Wessel",
  "/wiki/Natasi_Daala",
  "/wiki/United_Warlord_Fleets",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_1",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Handbook_2:_Crimson_Empire",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_2",
  "/wiki/Crimson_Empire_II:_Council_of_Blood_3",
  "/wiki/July_12",
  "/wiki/September_24",
  "/wiki/2013"
 ]
}