{
 "name": "Unidentified_Toydarian_mechanic_(Mon_Gazza)",
 "display_name": "Unidentified Toydarian mechanic  (Mon Gazza)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Toydarian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "A male Toydarian was a member of Kidd Kareen's Podracer crew around 22 BBY. He and the rest of Kareen's crew agreed with San Maxus to start helping the Separatists and Count Dooku in order to make enough money to retire from podracing all together. While working on Mon Gazza the Toydarian aided Maxus and the other mechanics in fending off the undercover Jedi Knight Anakin Skywalker, as Skywalker had been snooping around Kidd Kareen's pit looking for Separatist contraband. Kareen arrived shortly after the fight began and broke it up. Later Skywalker again confronted Maxus as he was making a pitstop during the Mon Gazza Maze, in attempt to grab Republic intel from Maxus who was going to sell it to Asajj Ventress. Maxus escaped, leaving Skywalker to face the Gamorrean and the rest of the crew yet again. Anakin was able to dispatch some of the mechanics with debris, but left to pursue his Padawan Ahsoka Tano, who was podracing, leaving his clone trooper Rex to fend off the remaining mechanics along with the droid R2-D2. The Toydarian had been dispatched in some manner shortly before Skywalker left. Later, Kareen indicated that after it all only Maxus had been retired from the crew after being killed by Ahsoka Tano. Kareen in fact offered Tano to take a job as a replacement for Maxus, but Tano refused.\nAt some point in his life, the Toydarian had lost the ability to see out of his right eye and wore an eye-patch to cover it up.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Toydarian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Kidd_Kareen",
  "/wiki/Podracer/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/San_Maxus",
  "/wiki/Dooku/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Mon_Gazza/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Mon_Gazza_Speedway",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/CT-7567/Legends",
  "/wiki/Droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/The_Clone_Wars:_Crash_Course"
 ]
}