{
 "name": "Unidentified_Theta_Squadron_captain",
 "display_name": "Unidentified Theta Squadron captain",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Asturias"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicGrand Army of the RepublicTheta Squadron",
      "Grand Army of the RepublicTheta Squadron",
      "Theta Squadron"
     ]
    }
   ]
  }
 ],
 "content": "This captain was the commander of Theta Squadron.\nThe captain participated in the mission on Aviles Prime, which led to the action on Asturias, where he and the remainder of his commando squadron attempted to reclaim Director Lorca Oviedo after their ships were shot down by vulture droids deployed by a Droid Control Ship upon their drop out of lightspeed. After receiving where their mark's ship came down on the moon, he rallied the commandos to lead a rescue attempt on Oviedo, where he was conspiring with Wat Tambor to send him troop deployment methods after returning to Coruscant. After losing two commandos on the initial rescue, he declined an offer by Oviedo to become his bodyguard, saying that they'd seen how he treated those loyal to him, and even shielded the bombardment of comments from the director, stating that no one would care when they died, they were cannon fodder, and that they were just a product. He then led his troops to the sight of the Republic shuttle where they encountered droidekas, which also drained them of another two troops, though he, Sergeant RC-2088, and RC-1080 survived.\nThe captain met his end while attempting to board the Consular-class space cruiser, when he was surprised and shot down by two B1-Series battle droids that had been guarding the cruiser. He was shot below, though very close to, his right shoulder, killing him instantly as he fell before the ramp. Sergeant RC-2088 and RC-1080 survived the assault, though 1080 was shot near his left shoulder.\nThe captain stayed true to the mission, even refusing an order by Oviedo, and never veered off course. He gave his troops respect, and didn't abandon them after injury, a common trait among clones, referring to the incident that left the sergeant with scars over his right eye and disabling his use of his helmet. However, he did use all essentials in order to complete the mission, even the weapons of fallen comrades, again putting the mission first. He cared for his men and served the Republic gladly, saying it was good enough to be soldiers for the Galactic Republic for him and his troops.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Asturias",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Theta_Squadron_(Clone_Commando)",
  "/wiki/Lorca_Oviedo",
  "/wiki/Aviles_Prime",
  "/wiki/Action_on_Asturias",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Lucrehulk-class_Droid_Control_Ship",
  "/wiki/Wat_Tambor/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Droideka/Legends",
  "/wiki/RC-2088",
  "/wiki/RC-1080",
  "/wiki/Consular-class_cruiser",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Honor_Bound",
  "/wiki/Star_Wars_Tales_22",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_30th_Anniversary_Collection"
 ]
}