{
 "name": "Unidentified_Jedi_Knight_(Mustafar)",
 "display_name": "Unidentified Jedi Knight  (Mustafar)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "This individual was a male Human Jedi Knight who served the Jedi Order and the Galactic Republic during the last decades of the Republic Classic era.\nA Force-sensitive, this Human was trained in the ways of the Force. He fought against the Separatist forces during the Clone Wars and survived until the last year of fighting.\nIn 19 BBY, the last year of the war, he and his clone squad, Grey Squad, operated on the volcanic world of Mustafar. During his stay on the planet, he formed a very strong companionship with a loyal xandank he named Cobak. He was amongst his clone troopers when Supreme Chancellor Palpatine ordered the execution of Contingency Order 66: kill all Jedi. When his squad turned on him, this Jedi was able to defend himself and flee with Cobak. Soon after he escaped execution, this man witnessed Separatist vessels landing at a secret mining facility. He knew it would only be a matter of time before either his former squad or the droids of the Confederacy would track him down.\nIn preparation for his capture or death, this Jedi unloaded most of his personal belongings in his weathered travel chest which he had been able to recover at some point during his exile. He hid the chest in a remote place in the Berken's Flow region and instructed Cobak to guard the chest with the hopes that Grand Master Yoda would one day discover its contents and be able to divine what had happened. Recording a brief message detailing recent events on his datapad, the Jedi sealed the chest and disappeared into Mustafar's landscape.\nTwenty years later, a spacer discovered the datapad while looking through stolen goods in a bandit camp on Mustafar. Upon activation, the spacer found the Jedi's last message that led him to the hidden travel chest. There he encountered Cobak that still guarded the chest ferociously and had to kill the beast when it attacked him. Among the things he found in the chest were 10,000 credits and a pair of Mustafarian miner's boots.\nIn Star Wars Galaxies' third expansion, Trials of Obi-Wan, prior to the games closure on December 15, 2011, the datapad of this Jedi could be found in a bandit camp on Mustafar. Activating the datapad would start the quest \"The Jedi's Guard Dog\". A short holographic message of the Jedi was shown that lead the player to the hidden chest where he had to defeat Cobak.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Grey_Squad",
  "/wiki/Mustafar/Legends",
  "/wiki/Xandank/Legends",
  "/wiki/Cobak_(Xandank)",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Contingency_Orders_for_the_Grand_Army_of_the_Republic:_Order_Initiation,_Orders_1_Through_150",
  "/wiki/Order_66/Legends",
  "/wiki/Klegger_Corp_Mining_Facility/Legends",
  "/wiki/Berken%27s_Flow/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Salvage_Bandit_Camp",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Mustafarian/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/December_15"
 ]
}