{
 "name": "Unidentified_wounded_Naboo_guard_2",
 "display_name": "Unidentified wounded Naboo guard 2",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Naboo Security Forces"
     ]
    }
   ]
  }
 ],
 "content": "A Human male guard of the Royal Naboo Security Forces was wounded during the Invasion of Naboo in the year 32 BBY. He led ten troops against a Trade Federation Armored Assault Tank, but his troops were killed, and he suffered an injury to his leg. He found cover nearby and was discovered by the Jedi Padawan Obi-Wan Kenobi. Kenobi brought water to the guard, and in return he told Kenobi how to move past the tank.\nA Human male Palace Guard of the Royal Naboo Security Forces participated in the Invasion of Naboo in the year 32 BBY. He led ten troops against an Armored Assault Tank after the Trade Federation, a greedy galaxy-spanning corporation and the instigator of the invasion, entered the city of Theed, the capital of the planet Naboo. His troops were killed by the tank, and his leg was broken. He managed to find cover nearby but became stuck there.\nThe Jedi Padawan Obi-Wan Kenobi met the guard when he was escorting Sabé, a handmaiden posing as the Queen of Naboo, Padmé Amidala, through Theed. Kenobi spoke to the guard, who asked the Jedi for water. Kenobi brought the guard a canteen of water, and the guard gave him information about getting past the tank.\nKenobi was able to circumvent the Armored Assault Tank and continue leading the Queen back to the Theed Hangar.\nThe guard had light skin and wore the standard red uniform of the Palace Guards. After being wounded, he did not think he could last much longer when he met Kenobi. When Kenobi brought the guard a canteen of water, he showed gratitude. The guard also did not think the Jedi would be able to beat the Armored Assault Tank, which took out his troops.\nThe guard appears in the 1999 Star Wars: Episode I The Phantom Menace video game adaptation of Star Wars: Episode I The Phantom Menace film. The player, taking the role of Kenobi, may meet this guard during the course of the game's fifth mission. The player can talk to the guard using several dialogue options, and may choose to ignore the guard or bring him water. If the player chooses the latter option, the player finds a nearby pool of water and brings the canteen back to the guard, who gives information to the player about the nearby tank. This article assumes this canonical path. The video game's strategy guide explains how to complete this side-quest. In the game's credits, Nick Jameson is listed as voicing \"Injured Soldier #2,\" while Greg Burson is listed as voicing \"Injured Soldier #1,\" although it is not clear who voices this individual character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(video_game)",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Fall_of_Theed",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Armored_Assault_Tank",
  "/wiki/Troop/Legends",
  "/wiki/Death/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Water/Legends",
  "/wiki/Palace_Guard_(Naboo)",
  "/wiki/Tank_(vehicle)/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/City/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Canon",
  "/wiki/Sab%C3%A9/Legends",
  "/wiki/Handmaiden/Legends",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Canteen/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Theed_Hangar/Legends",
  "/wiki/Color/Legends",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Nick_Jameson",
  "/wiki/Greg_Burson",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Opening_crawl"
 ]
}