{
 "name": "Unidentified_Theed_woman_1",
 "display_name": "Unidentified Theed woman 1",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "A Human woman lived in the city of Theed on the peaceful planet Naboo with her son. She was light-skinned with brown hair and eyes. The Trade Federation invaded the planet in 32 BBY and the mother was separated from her son when the Trade Federation Droid Army entered Theed. The boy hid in a nearby kitchen while the mother returned home to wait for his return.\nThe Jedi Padawan Obi-Wan Kenobi met the mother when he was escorting the Queen of Naboo through Theed. The Jedi entered her home. Distraught, the woman told Kenobi about her plight. The Jedi agreed to help, and found her son nearby and subsequently returned the boy home. The mother gratefully told Kenobi \"May the Force be with you,\" and provided the Jedi with a medpac.\nLater, the Queen entered the woman's home during the final stages of the invasion and found a hidden blaster cannon.\nThe woman appears in the Star Wars: Episode I The Phantom Menace video game, the 1999 video game adaptation of the Episode I movie. The player, taking the role of Kenobi, may meet this woman during the course of the game's fifth mission. The player can talk to the woman using several dialogue options and can choose to go look for her son or refuse to help her. This article assumes the player found the boy and brought him back. The game's strategy guide explains how to complete the side-quest. She appears again in her home in the game's ninth mission when the player takes the role of Amidala. Carolyn Seymour voices \"Concerned Mother.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(video_game)",
  "/wiki/City/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Unidentified_boy",
  "/wiki/Brown",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Trade_Federation_Droid_Army/Legends",
  "/wiki/Fall_of_Theed",
  "/wiki/Canon",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/May_the_Force_be_with_you/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/1999",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Carolyn_Seymour",
  "/wiki/The_New_Essential_Chronology"
 ]
}