{
 "name": "Unidentified_Mon_Calamari_Jedi_Knight",
 "display_name": "Unidentified Mon Calamari Jedi Knight",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "A male Mon Calamari Jedi Knight served the Jedi Order and the Galactic Republic during their last decades.\nA male Mon Calamari was a member of the Jedi Order, serving the Galactic Republic. He built a green-bladed lightsaber and at some point passed his Trials of Knighthood, attaining the rank of Jedi Knight by the Jedi High Council.\nThe Jedi was active during the Separatist Crisis, a growing division between the Galactic Republic and the Confederacy of Independent Systems. When Emissary Nathanjo Nirrelz, a Gotal representative, was taken hostage by the the separatist group Roshu Sune during the battle of Antar 4, the Jedi Order was asked to intervene. The Mon Calamari was dispatched as part of a six-member Jedi task force to the Gotal colony world Atzerri, under the leadership of fellow Jedi Knight, Sarrissa Jeng. Once there, the team of diplomats were to negotiate the release of Nirrelz. During the negotiations, a group of unaffiliated vigilantes opened fire on the Roshu Shone guerrillas. This attack panicked the Gotal separatists, who opened fire on their captives. Leaping to defend the unarmed hostages, the Mon Calamari and his fellow Jedi managed to subdue the guerrillas on their commuter hopper, but not before Kaloor Cofi and Antyard-Wo Shissan lost their lives. Emerging from the firefight, the Mon Calamari and Jeng escorted Emissary Nirrelz to safety while the other Jedi helped transport the surviving hostages to medcenters in the nearby cities of Skreeka and Talos.\nAfter the fighting ended, the surviving Jedi departed for the Order's chapter house on Aleen for the funerals of Cofi and Shissan. Meanwhile, across the HoloNet News network, the Jedi were heavily criticized by Gotal Foreign Affairs Commune leader Shagrad Loset for what he saw as meddling in an internal affair. Rebuffing this criticism of the Order, Jedi Master and High Council member Shaak Ti commended the Jedi effort on Atzerri.\nThis Jedi was the creation of artist Joe Corroney. He was given the name Kerrshnek on Joe Corroney's website.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Mon_Calamari",
  "/wiki/Dac",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Nathanjo_Nirrelz",
  "/wiki/Gotal_hostage_standoff",
  "/wiki/Roshu_Sune/Legends",
  "/wiki/Battle_of_Antar_4",
  "/wiki/Antar_4/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Atzerri/Legends",
  "/wiki/Sarrissa_Jeng",
  "/wiki/Jedi_Diplomat",
  "/wiki/Commuter_hopper",
  "/wiki/Kaloor_Cofi",
  "/wiki/Antyard-Wo_Shissan",
  "/wiki/Medcenter/Legends",
  "/wiki/Skreeka",
  "/wiki/Talos",
  "/wiki/Jedi_chapter_house_(Aleen_Minor)",
  "/wiki/Aleen/Legends",
  "/wiki/Jedi_funeral/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Gotal_Foreign_Affairs_Commune",
  "/wiki/Shagrad_Loset",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Shaak_Ti/Legends",
  "/wiki/Joe_Corroney",
  "/wiki/HoloNet_News_Vol._531_53"
 ]
}