{
 "name": "Unidentified_Zabrak_patron",
 "display_name": "Unidentified Zabrak patron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "A Zabrak male was a patron of the Quarek'k, a bar complex located on the planet of Coruscant, shortly after the rise of the Galactic Empire in 19 BBY. The Zabrak, an Utai, and a Shistavanen were drinking together there when Aurra Sing, a bounty hunter, entered. The trio tried to get her to consort with them, but she refused and eventually cut off the Zabrak's arm before killing the other two so she would be left alone.\nA male Zabrak was present on the planet of Coruscant in 19 BBY. Soon after the Galactic Empire was founded, he was drinking heavily alongside two companions—an Utai and a Shistavanen—in Section 7-B of a large bar complex called the Quarek'k, when a female bounty hunter named Aurra Sing entered the establishment. The three of them blocked Sing's path, and the Zabrak tried to proposition the newcomer, but she rejected their advances. On his third attempt, the drunk tried to elicit a kiss from Sing, which prompted her to cleave his left arm off at the elbow with her lightsaber. The Zabrak's companions tried to assist him, but they were both quickly killed by Sing, who allowed the survivor to mesh with the bar's crowd and flee.\nThis Zabrak male was muscular, tall for his species, and had prominent canines. When extremely inebriated, he held no reservations about consorting with Sing, who was of a different species. Sing was not fond of the Zabrak's attitude, nor his breath, appearance, or stench—which particularly repulsed her.\nThe Zabrak appeared briefly in Coruscant Nights II: Street of Shadows, the second novel of the Star Wars: Coruscant Nights trilogy, written by Michael Reaves and published in 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Zabrak",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Coruscant_Nights_II:_Street_of_Shadows",
  "/wiki/Quarek%27k",
  "/wiki/Cantina/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Unidentified_Utai_patron",
  "/wiki/Unidentified_Shistavanen",
  "/wiki/Alcohol/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cho_mok/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Death/Legends",
  "/wiki/Section_7-B",
  "/wiki/Lightsaber/Legends",
  "/wiki/Species/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/Near-Human",
  "/wiki/Star_Wars:_Coruscant_Nights",
  "/wiki/Michael_Reaves",
  "/wiki/2008",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Standard_year/Legends",
  "/wiki/Coruscant_Nights_I:_Jedi_Twilight"
 ]
}