{
 "name": "Unidentified_brothel_hostess",
 "display_name": "Unidentified brothel hostess",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Leisure Zone brothel"
     ]
    }
   ]
  }
 ],
 "content": "A human female hostess worked at a brothel in the Leisure Zone on the planet Morlana One.\nA human female, the hostess worked at a brothel located in the Leisure Zone on Morlana One. Presumably, she did not use her real name with the establishment. In 5 BBY, she approached Cassian Andor, who was drinking at the bar. However, Andor was not after pleasure and instead questioned her for information regarding an employee who was from Kenari. The woman asked Andor if he was looking for his girlfriend, to which Andor said that he did not have one.\nAfter leaving to go check if there was an employee from Kenari working there, she returned and told Andor that a girl from Kenari had worked there before but had left several months earlier. She offered to find another employee that would take care of him, but Andor only asked if she knew where the girl had gone. The hostess insisted that she know Andor's relation to the girl, and Andor whispered that he was looking for his sister. She smiled sadly at him and said that people came and went from the establishment all the time and then told Andor that he should leave. Andor then asked what the girl's name was. The hostess replied that nobody that worked there used their real name before departing. Andor would leave the brothel soon after.\nThe hostess is played by Margaret Clunie.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Leisure_Zone_brothel",
  "/wiki/Leisure_Zone",
  "/wiki/Planet",
  "/wiki/Morlana_One",
  "/wiki/5_BBY",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Bar",
  "/wiki/Kenari",
  "/wiki/Standard_month",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_brothel_hostess",
  "/wiki/Andor_(television_series)",
  "/wiki/Kassa_(episode)",
  "/wiki/That_Would_Be_Me"
 ]
}