{
 "name": "Unidentified_Skykeeper",
 "display_name": "Unidentified Skykeeper",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Pijal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pijali monarchy"
     ]
    }
   ]
  }
 ],
 "content": "The Skykeeper serving the Pijali monarchy under Princess Fanry was a human male who lived during the Republic Era. Regarded as a Pijali religious leader on the Inner Rim planet Pijal, he was expected to take part in ceremonial duties and manage the docking areas of sacred soulcraft ships. For several years, the Skykeeper accepted bribes from the Czerka Corporation, allowing the company to use soulcraft docks for commercial use. His behavior angered Fanry, who formed a grudge against him.\nDuring Princess Fanry's coronation in 40 BBY, the Skykeeper presented her with the Pijali ceremonial sword and confirmed her assent to protect Pijal adherent to tradition. However, after the crowning's completion, she stabbed the religious leader with the weapon and announced to the present audience his failure to carry out his sacred duties due to the bribes he had taken. Jedi Padawan Obi-Wan Kenobi attempted to protect the Skykeeper by injuring Fanry's royal guard, captain Deren, which forced the princess to flee the scene in a royal troop dropship.\nThe Skykeeper was a human male who lived while Princess Fanry was the crown heir of the Inner Rim Territories planet Pijal. He served the Pijali monarchy for several years during the Republic Era. While the Pijali man held the rank of Skykeeper, he was regarded as a religious leader on Pijal. As part of his duties, the Skykeeper managed the docking areas reserved for soulcraft, spherical ships used for sacred Pijali ceremonies. However, the Czerka Corporation, a company with significant influence on Pijal, bribed him for several years to allow the organization to use reserved soulcraft docks for commercial activities.\nAt some point after becoming crown princess, Fanry learned about the bribes he had taken. She developed a grudge against him for his failure to respect and carry out his duties according to Pijali traditions. While on a mission to Pijal in 40 BBY, Jedi Master Qui-Gon Jinn had a distressing vision regarding Fanry's upcoming coronation in which an unknown figure urgently shouted about the Skykeeper while an attack took place.\nDays later, the Skykeeper attended Fanry's coronation, which was held in the Celestial Chalice of the Pijali palace. He followed Fanry up to her dais in the center of the ceremonial chamber alongside Pijal's court jeweler. The Skykeeper made a short speech about the traditions of Pijali's space-faring ancestors and welcomed Fanry's reign, believing she would connect her planet with the galaxy at large. The Skykeeper bestowed Fanry with a Pijali ceremonial sword, and after confirming her vow to protect Pijal, he completed her coronation ceremony. The moment after she promised to safeguard the world, Fanry stabbed the Skykeeper with the weapon she had received and ordered her royal guard captain Deren to seal off the dais with a kohlen crystal–powered personal shield.\nJedi Padawan Obi-Wan Kenobi attempted to help the badly injured religious leader but was prevented from doing so by Deren. Fanry took the opportunity to address the surrounding audience, claiming she had seized power violently to protect Pijal from Czerka's damaging influence and confronting the Skykeeper about the bribes he had taken from the company. When he began to stutter out an excuse, Fanry immediately dismissed his words as lies. With Fanry momentarily distracted, Kenobi used his kohlen crystal–powered lightsaber to breach Deren's shield and injure him, allowing the Padawan to put himself between the Skykeeper and Fanry. After realizing her shield could also be rendered useless, the princess chose to escape the Celestial Chalice in a royal troop dropship with her enslaved attendant Cady, leaving Kenobi, Deren, and the Skykeeper behind.\nMotivated by personal gain, the Skykeeper was willing to take bribes and allowed Czerka to use docking areas considered reserved for sacred soulcraft. He deliberately neglected his duties for several years and was only willing to address the topic when in fear of his life after being injured by Fanry during her coronation. Outwardly, while acting as a religious leader, the Skykeeper attempted to remain serious when speaking ritual words.\nWhile working as a religious leader of Pijal, the Skykeeper was able to properly perform several ceremonies considered important by the planet's monarchy and residents. The Pijali Skykeeper proved able to keep knowledge of the Czerka bribes that he had taken relatively secret for several years but eventually had his misdeeds publicized.\nAs a Skykeeper serving the Pijali monarchy, he managed and had access to sacred vessels and docking bays used for ceremonial purposes.\nThe Skykeeper appeared in Master \u0026 Apprentice, a 2019 novel written by Claudia Gray.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Pijal",
  "/wiki/Human",
  "/wiki/Pijali",
  "/wiki/Gender",
  "/wiki/Pijali_monarchy",
  "/wiki/File:Skykeeper1.ogg",
  "/wiki/Prince",
  "/wiki/Fanry",
  "/wiki/Republic_Era",
  "/wiki/Religion",
  "/wiki/Inner_Rim",
  "/wiki/Planet",
  "/wiki/Soulcraft",
  "/wiki/Starship",
  "/wiki/Standard_year",
  "/wiki/Skykeeper",
  "/wiki/Czerka_Arms",
  "/wiki/Coronation_of_Queen_Fanry",
  "/wiki/40_BBY",
  "/wiki/Pijali_ceremonial_sword",
  "/wiki/Crown",
  "/wiki/Weapon",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Royal_guard_(Pijal)",
  "/wiki/Captain",
  "/wiki/Deren",
  "/wiki/Troop",
  "/wiki/Dropship",
  "/wiki/File:Skykeeper2.ogg",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Mission_to_Pijal",
  "/wiki/Jedi_Master",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Force_vision",
  "/wiki/File:Skykeeper3.ogg",
  "/wiki/Standard_day",
  "/wiki/Celestial_Chalice",
  "/wiki/Pijali_palace",
  "/wiki/Unidentified_court_jeweler",
  "/wiki/Realspace",
  "/wiki/The_galaxy",
  "/wiki/Kohlen_crystal",
  "/wiki/Personal_energy_shield",
  "/wiki/Crystal",
  "/wiki/Lightsaber",
  "/wiki/Slavery",
  "/wiki/Aide",
  "/wiki/Cady",
  "/wiki/File:Skykeeper4.ogg",
  "/wiki/Master_%26_Apprentice",
  "/wiki/2019",
  "/wiki/Claudia_Gray",
  "/wiki/Category:Audio_files_of_unidentified_Skykeeper",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/Skywalker:_A_Family_at_War",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/32_BBY"
 ]
}