{
 "name": "Unidentified_Human_bounty_hunter_(Upper_City)",
 "display_name": "Unidentified Human bounty hunter  (Upper City)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Davik Kang"
     ]
    }
   ]
  }
 ],
 "content": "This Human bounty hunter worked for the crime lord Davik Kang on the planet Taris in 3956 BBY. Paired with a fellow Aqualish bounty hunter, he tried to extort 100 credits from a merchant, who owed them to Kang. The merchant did not have the money, and the bounty hunters prepared to take him to Kang, who would kill him as an example to others who did not pay their debts. However, the two bounty hunters were killed by the Galactic Republic soldier Revan, who rescued the merchant.\nThis bounty hunter, a Human male, worked for the crime lord Davik Kang on the planet Taris during the Jedi Civil War in 3956 BBY. When an elderly merchant failed to repay his hundred-credit debt he owed to Kang, the crime lord sent this Human bounty hunter and an Aqualish hunter to extort money from the merchant. Cornering the man in the Upper City, the two bounty hunters tried to force him to pay the credits. The merchant, however, did not have the full sum at his disposal and instead offered fifty credits as a down payment. The bounty hunters did not agree to his terms and prepared to take him to Kang, as an example for other debtors. Realizing that Kang would kill him, the merchant cried for help.\nThe exchange was witnessed by the Galactic Republic soldier Revan, who was on the planet in search for the Jedi Knight Bastila Shan. Hearing the merchant's scream, Revan decided to intervene and help the man, telling the bounty hunters to let him go. As Kang did not want to leave any witnesses behind, the Human and the Aqualish attacked Revan, but they were killed by him.\nThis bounty hunter did not feel any compassion for the merchant's predicament and, despite the man's desperate pleas, wanted to take the man to Kang. He was loyal to Kang and took orders only from him. At the time of his death, the Human carried a blaster pistol and fifty credits with him. The man had brown hair and eyes and dark skin.\nThis bounty hunter appeared in the 2003 video game Star Wars: Knights of the Old Republic as a non-player character whom the player encounters early in the game. This article follows the canonical light side walkthrough, although the player, controlling Revan, has several options in dealing with the bounty hunters in the game. The player may attack the bounty hunters in anger or decide not to intervene in the situation at all, in which case the Human and the Aqualish will take the merchant to Kang. If the player approaches the bounty hunters while wearing Sith trooper armor, they will remind him that Kang has an agreement with the Sith, according to which they do not interfere in his business and vice versa. If, following this, Revan pretends to be a Sith and orders the bounty hunters to release the merchant, they will reply that they take orders from Kang only and attack the player.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3956_BBY",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Davik_Kang",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Crime_lord/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Unidentified_Aqualish_bounty_hunter_(Upper_City)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Unidentified_Taris_merchant",
  "/wiki/Merchant/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Upper_City",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Rescue_of_Bastila_Shan",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Time/Legends",
  "/wiki/Eye/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sith_trooper_armor/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}