{
 "name": "Unidentified_Yuuzhan_Vong_warrior_(Duro)",
 "display_name": "Unidentified Yuuzhan Vong warrior  (Duro)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "26 ABY",
      "Duro"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Caste",
     "values": [
      "Warrior caste"
     ]
    }
   ]
  }
 ],
 "content": "A male Yuuzhan Vong warrior took part in his species' attack on the planet Duro in 26 ABY, during the Yuuzhan Vong War. The warrior willingly gave up his life to Warmaster Tsavong Lah after his superior was bested in a duel with the Jedi Jacen Solo, to sate the warmaster's fury at humiliation.\nA male Yuuzhan Vong from the warrior caste participated in the Yuuzhan Vong War, in which his species invaded the New Republic–controlled galaxy in 25 ABY. During the year 26 ABY, the warrior was part of a Yuuzhan Vong contingent that conquered the New Republic–allied Core World of Duro. After the refugee dome of Gateway was captured on the planet's surface, the Yuuzhan Vong warrior and two others were tasked with guarding the building that contained the office of Leia Organa Solo, the former administrator of captured Gateway, where Warmaster Tsavong Lah had taken up temporary residence.\nLah tortured Organa Solo in that building and was subsequently attacked by her son, Jedi Knight Jacen Solo, so that he could rescue her from captivity. In the fight, Lah was thrown out of the window of Organa Solo's office after being hit by a whirlwind of objects, which the young Solo created with the Force; Solo and his mother then fled the scene. The warrior guarding the building's exterior, along with his other two companions, witnessed the event and quickly came to the warmaster's side. While the other two averted their eyes so as to not witness the humiliation of their superior, whose leg had been mangled, the warrior declared that Lah would be avenged.\nOffering his life so that the warmaster could fulfill his act of revenge, the guard knelt, and Lah struck him with the warmaster's baton. Lah killed the warrior, taking out on the guard his anger at his humiliation. The warmaster then had the guard's two companions dispose the warrior's body in the fire pit that the Yuuzhan Vong had created in the center of Gateway.\nAfter the warmaster was shamed, the Yuuzhan Vong guard was willing to lay down his life so that Lah could relieve his fury. The warmaster thought this an appropriate offer from the underling.\nThe Yuuzhan Vong warrior appeared in Balance Point, a 2000 installment of The New Jedi Order series by Kathy Tyers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/26_ABY",
  "/wiki/Duro/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Warrior_caste",
  "/wiki/Species/Legends",
  "/wiki/Battle_of_Duro_(Yuuzhan_Vong_War)",
  "/wiki/Planet/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Death/Legends",
  "/wiki/Warmaster",
  "/wiki/Tsavong_Lah",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/New_Republic/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Refugee/Legends",
  "/wiki/Gateway",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Administrator/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Window/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Baton/Legends",
  "/wiki/Fire/Legends",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/2000",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/Kathy_Tyers"
 ]
}