{
 "name": "Unidentified_Jedi_(Kardem%27s_victim)",
 "display_name": "Unidentified Jedi  (Kardem's victim)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Perilious"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "A Human male Jedi served the Jedi Order during the Clone Wars. In 22 BBY, the Jedi Council dispatched the Jedi to track down and apprehend the female Jedi Knight Vydel Dir'Nul. After six months of searching, the Jedi found and confronted Dir'Nul on the planet Perilious. After defeating her in a duel, she attacked him with Force lightning and reverted to the personality of the male Dark Jedi Kardem, which she had created after murdering her lover Ash B'risko. The Jedi attempted to kill Dir'Nul, but he was instead slain by the Jedi Knight.\nA Human male was a Jedi who served the Jedi Order during the Clone Wars, a galactic conflict between the Galactic Republic and the Confederacy of Independent Systems. In 22 BBY, the Jedi Council sent him to track down and apprehend the former Jedi Knight Vydel Dir'Nul. He confronted Dir'Nul, who assumed that he was the Dark Jedi Kardem, on the planet Perilious. After the Jedi bested her in a lightsaber duel, Dir'Nul reverted to the Kardem personality—whom she had created after killing her lover, Ash B'risko—and tortured the Jedi with Force lightning. After he explained why the Council had sent him after her, the Jedi attempted to kill her, but was ultimately defeated and killed by Dir'Nul. Shortly after his death, Dir'Nul—who reverted back to her original personality—vowed to stop Kardem, unaware that she was the person that had killed the male Jedi.\nThe Jedi was determined to apprehend Vydel Dir'Nul and return her to the Jedi Council, regardless of whether she was living or deceased. He used a lightsaber containing a green crystal.\nThe Jedi was able to defeat Vydel Dir'Nul in lightsaber combat. He also displayed his ability to use the Force to throw his lightsaber at Dir'Nul.\nThe male Jedi first appeared in the short comic \"Dark Journey\", which was featured in Star Wars Tales 17 and written by Jason Hall. In the comic, he was drawn by Ben Templesmith. The story was later compiled into a trade paperback version and republished in Star Wars Tales Volume 5. Plausible stories in Star Wars Tales 1–20 were initially viewed as S-canon until referenced in a non-Tales source, at which point the subject matter was elevated to C-canon status. Because Vydel Dir'Nul received references outside of the Tales comic, the events of Dark Journey were elevated to C-canon, thus establishing the Jedi who was slain by Dir'Nul as a canonical character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Perilious",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Vydel_Dir%27Nul",
  "/wiki/Time/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Ash_B%27risko",
  "/wiki/The_galaxy/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dark_Journey_(comic)",
  "/wiki/Star_Wars_Tales_17",
  "/wiki/Jason_Hall",
  "/wiki/Ben_Templesmith",
  "/wiki/Star_Wars_Tales_Volume_5",
  "/wiki/Star_Wars_Tales_1",
  "/wiki/Star_Wars_Tales_20",
  "/wiki/Canon",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee",
  "/wiki/The_History_of_the_Mandalorians",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}