{
 "name": "Unidentified_Prince_Militaire",
 "display_name": "Unidentified Prince Militaire",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Paataatus"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Paataatus Hiveborn"
     ]
    }
   ]
  }
 ],
 "content": "The Paataatus male Prince Militaire ruled the Paataatus Hiveborn government when it was under control of the Nikardun species, who threatened the prince with death if the Hiveborn did not cooperate with them. The fierce commander viewed the arrival of the Chiss heavy cruiser Springhawk and its commander, Senior Captain Mitth'raw'nuruodo \"Thrawn,\" as an opportunity to free the Paataatus from Nikardun opression.\nThe Chiss and the prince performed a \"light show\" of laserfire, making it seem they were fighting, while Thrawn neared the Nikardun to destroy them. Eventually, the Paataatus fighters and the Prince's Paataatus heavy frigate moved while performing the supposed fight, and Thrawn destroyed the Nikardun cruiser with breacher missiles and starship-disabling plasma spheres, freeing the Hiveborn. The prince militaire then thanked Thrawn for his assistance and told the senior captain that the Hiveborn had not allied itself with the Vagaari pirates.\nA Paataatus male served the Paataatus government of the Hiveborn as its ruler, holding the rank of Prince Militaire. He was threatened by the Nikardun species with their military forces, and he was forced to cooperate with the Nikardun so he could live. The prince commanded a Paataatus heavy frigate located in the Unknown Regions Nettehi system, which was flanked by a Nikardun enhanced cruiser, where all the Nikardun leaders threatening him were, and forces of the Hiveborn under Nikardun command.\nAround 18 BBY, the Chiss heavy cruiser Springhawk arrived over the Paataatus homeworld Nettehi, and its commander, Senior Captain Mitth'raw'nuruodo \"Thrawn,\" greeted the prince, who in turn viewed Thrawn's arrival as an opportunity to destroy the Nikardun. After the Paataatus male and Thrawn acted as they were going to fight through comm, the prince's forces shot at the Springhawk with one-tenth power spectrum lasers keyed to Nettehi's interplanetary dust profile, which did not damage Thrawn's warship, but from the Nikardun's point of view seemed like a devastating attack. Thrawn noticed that, and continued the \"light show\" with his own laserfire.\nWhile Paataatus fighters and the Chiss exchanged laserfire, the Springhawk shot ship-disabling plasma spheres and breacher missiles at the fighters, trusting the Prince Militaire's intelligence to allow him to move his frigate and the fighters quickly enough so the Chiss attack would damage the Nikardun cruiser instead. The Paataatus leader was as intelligent as Thrawn believed, and he moved his forces aside so all of Thrawn's projectiles disabled the Nikardun instead, allowing him to destroy them fiercely. After the Nikardun's destruction, the prince told Thrawn that the Vagaari pirates had not allied themselves with the Hiveborn, which was the answer to Thrawn's question, he also expressed that it was a unique experience to have Thrawn as an ally, instead of as an enemy, as the Hiveborn had previously faced the senior captain to their regret.\nThe Prince Militaire was a male member of the Paataatus species, who was considered quick and perceptive by Senior Captain Thrawn.\nThe Prince Militaire appeared in the 2021 novel Thrawn Ascendancy: Greater Good, the second volume in the Star Wars: The Ascendancy Trilogy written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Paataatus",
  "/wiki/Gender",
  "/wiki/Paataatus_Hiveborn",
  "/wiki/Nikardun",
  "/wiki/Species",
  "/wiki/Prince",
  "/wiki/Death",
  "/wiki/Commanding_officer",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Springhawk",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Light_show",
  "/wiki/Skirmish_above_Nettehi",
  "/wiki/Paataatus_fighter",
  "/wiki/Paataatus_heavy_frigate",
  "/wiki/Paataatus_enhanced_cruiser",
  "/wiki/Breacher",
  "/wiki/Missile",
  "/wiki/Starship",
  "/wiki/Plasma_sphere",
  "/wiki/Vagaari",
  "/wiki/Pirate",
  "/wiki/Yiv%27s_battle_forces",
  "/wiki/Unknown_Regions",
  "/wiki/Nettehi_system",
  "/wiki/18_BBY",
  "/wiki/Homeworld",
  "/wiki/Nettehi",
  "/wiki/Comm_unit",
  "/wiki/Spectrum_laser",
  "/wiki/Warship",
  "/wiki/Cruiser",
  "/wiki/Attack_on_the_Paataatus",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)"
 ]
}