{
 "name": "Unidentified_clone_naval_captain",
 "display_name": "Unidentified clone naval captain",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Republic Navy",
      "Galactic Republic Navy"
     ]
    }
   ]
  }
 ],
 "content": "This clone navigation officer served as a Clone Captain in the Republic Navy during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. The captain served aboard the Tranquility, a Venator-class Star Destroyer that served as the flagship of Jedi General Luminara Unduli.\nThis clone navigation officer was born on the planet Kamino as a clone of the bounty hunter Jango Fett, and was familiar in naval warfare tactics, eventually put to serve the Galactic Republic. During the pan-galactic Clone Wars between the Republic and Separatist Alliance, this clone navigation officer had the rank of Clone Captain and served aboard the Republic Navy Venator-class Star Destroyer Tranquility, the flagship of Jedi General Luminara Unduli who led the 41st Elite Corps.\nAfter Viceroy of the Trade Federation Nute Gunray was captured on the planet Rodia, Green Company of the 41st Elite Corps brought the Viceroy to the Tranquility. Due to Gunray's importance, Senate Commandos had previously been dispatched to the Tranquility for additional security. General Unduli and Padawan Ahsoka Tano interrogated Gunray in the ship's brig when Separatist forces launched a surprise attack to either liberate Gunray, or silence him, by dispatching three Droch-class boarding ships and Vulture droid starfighters.\nAfter the Tranquility was attacked, Clone Commander CC-1004 \"Gree,\" who was defending the ship alongside the Jedi and Senate Commando Captain Faro Argyus, demanded a status report the clone navigation officer who was in the bridge as vulture droids attacked. Upon hearing of Separatist forces engaging the ship from the navigation officer, Commander Gree deployed Green Company to repel Separatist boarders. The three boarding ships all successfully breached through the Tranquility's hull and deployed B2-series super battle droids to the hangar. Separatist forces ultimately triumphed as Captain Argyus proved himself to be a traitor and liberated Gunray with the help of assassin Asajj Ventress.\nAs a clone of the bounty hunter Jango Fett, this clone navigation officer was a human male who stood at 1.83 meters tall. He had naturally black hair, brown eyes, and tan skin. While in the bridge of the Tranquility during the Separatist attack, the clone navigation officer stayed in his station in order to communicate with Commander Gree while other clone troopers around him fled to safety.\nThis clone navigation officer was trained in naval warfare, excelling to the rank of Clone Captain.\nAs a clone navigation officer, the captain wore a blue variant of the standard Republic military uniform with a rank insignia plaque denoting his rank.\nThis clone naval captain first appeared in \"Cloak of Darkness,\" which was the ninth episode of the first season of the animated TV series Star Wars: The Clone Wars.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_clone_naval_captain",
  "/wiki/Unidentified_clone_naval_captain/Legends",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Cloak_of_Darkness",
  "/wiki/Clone_Captain",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Captain",
  "/wiki/Tranquility",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Flagship",
  "/wiki/Jedi_General",
  "/wiki/Luminara_Unduli",
  "/wiki/Clone_navigation_officer",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Naval_warfare",
  "/wiki/The_galaxy",
  "/wiki/Officer",
  "/wiki/Military_rank",
  "/wiki/41st_Elite_Corps",
  "/wiki/Viceroy_of_the_Trade_Federation",
  "/wiki/Nute_Gunray",
  "/wiki/Mission_to_Rodia",
  "/wiki/Rodia",
  "/wiki/Green_Company",
  "/wiki/Viceroy",
  "/wiki/Senate_Commando",
  "/wiki/General",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Rescue_on_the_Tranquility",
  "/wiki/Droch-class_boarding_ship",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Clone_Commander",
  "/wiki/CC-1004",
  "/wiki/Faro_Argyus",
  "/wiki/Bridge_(starship)",
  "/wiki/Hull",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Hangar",
  "/wiki/Assassin",
  "/wiki/Asajj_Ventress",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Commander",
  "/wiki/Clone_trooper",
  "/wiki/Republic_military_uniform",
  "/wiki/Rank_insignia_plaque",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Databank_(website)"
 ]
}