{
 "name": "Unidentified_Imperial_shuttle_pilot",
 "display_name": "Unidentified Imperial shuttle pilot",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Shuttle 2743"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gideon's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "A human male pilot served in Moff Gideon's remnant of the Galactic Empire. Around 9 ABY, he and his co-pilot were pursued aboard the Lambda-class T-4a shuttle designated Shuttle 2743 by the Firespray-31-class patrol and attack craft Slave I while transporting Doctor Pershing. The Slave I immobilized the shuttle and clamped to it, the Mandalorian Din Djarin entering the vessel. After the co-pilot held Pershing at gunpoint, the pilot attempted to resolve the confrontation, but was shot dead by his comrade.\nDuring the reign of the New Republic, the pilot served in a remnant of the Galactic Empire led by Moff Gideon. Around 9 ABY, he was transporting the clone engineer Doctor Pershing aboard the Lambda-class T-4a shuttle designated Shuttle 2743 with a co-pilot. However, they were pursued by the Firespray-31-class patrol and attack craft Slave I, which fired on the shuttle. The pilots attempted to outmaneuver the Slave I, but Shuttle 2743 was soon immobilized by an Ion cannon shot.\nThe shuttle pilot acknowledged the loss of avionics in the shuttle as well as the comms being disabled. Boba Fett, the Slave I's pilot, ordered for the vessel's deflector shields and transponder to be disabled in addition. The attack craft promptly clamped onto Shuttle 2743 and the Mandalorian Din Djarin entered with his blaster raised. The pilot and Pershing raised their hands, but the co-pilot held Pershing at gunpoint shortly after. As the New Republic marshal Cara Dune entered the confrontation too, the pilot disassociated himself from his comrade and attempted to resolve the situation. The co-pilot abruptly shot him, however, and the pilot fell to the ground in a brief panic, perishing thereafter.\nThe Imperial shuttle pilot was a human male with light skin and green eyes. When Shuttle 2743 was hit with an ion cannon shot, the pilot assessed the system losses the vessel had taken. After his co-pilot held Pershing at gunpoint, he attempted to reason with Din Djarin by disassociating himself from his comrade, but was unsuccessful.\nThe pilot wore a black flight suit with the Imperial crest on his shoulders. He also donned black gloves and an aviator hat with a built in comlink.\nThe Imperial shuttle pilot appeared in \"Chapter 16: The Rescue\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Peyton Reed and released on December 18, 2020. Credited as \"Pilot,\" he was played by Luke Baines.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_ABY",
  "/wiki/Shuttle_2743",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Galactic_Empire",
  "/wiki/Pilot",
  "/wiki/Lambda-class_T-4a_shuttle",
  "/wiki/Operating_number",
  "/wiki/Firespray-31-class_patrol_and_attack_craft",
  "/wiki/Slave_I",
  "/wiki/Transport",
  "/wiki/Doctor",
  "/wiki/Pershing",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Starship",
  "/wiki/Death",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Cloning",
  "/wiki/Engineer",
  "/wiki/Unidentified_Imperial_shuttle_co-pilot",
  "/wiki/Shuttle",
  "/wiki/Ion_cannon",
  "/wiki/Boba_Fett",
  "/wiki/Deflector_shield",
  "/wiki/Transponder",
  "/wiki/The_Mandalorian%27s_IB-94_blaster_pistol",
  "/wiki/Marshal",
  "/wiki/Carasynthia_Dune",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Flight_suit",
  "/wiki/Imperial_crest",
  "/wiki/Glove",
  "/wiki/Comlink",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Peyton_Reed",
  "/wiki/December_18",
  "/wiki/2020",
  "/wiki/Luke_Baines",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/The_Mandalorian:_The_Rescue",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY"
 ]
}