{
 "name": "Unidentified_Kajain%27sa%27Nikto%27s_ally_2",
 "display_name": "Unidentified Kajain'sa'Nikto's ally 2",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  }
 ],
 "content": "A male bounty hunter was the ally of Biran Redben and a group of two other hunters, a Kajain'sa'Nikto and a short alien similar in appearance to Scrapjaw Motito. He, alongside three of his companions, attempted to capture Grogu from the Mandalorian bounty hunter Din Djarin, but was ultimately defeated.\nAround 9 ABY, this bounty hunter, alongside three of his comrades, set up a tripwire on the desert planet of Tatooine, hoping to kill Din Djarin and capture Grogu alive.\nThe plan went off without a hitch, and Din Djarin was close lined off of his speeder bike. However, Grogu and the Mandalorian managed to survive the crash. Having failed to kill Din Djarin in his initial attack, the bounty hunter began to engage the Mandalorian, with the help of a Nikto bounty hunter. Firing a shot into Din Djarin's beskar helmet, the individual informed his short alien comrade, who had been hiding behind a nearby boulder, to capture Grogu. Following Biran Redben's engagement with the Mandalorian, the bounty hunter jumped into the fight, using his blaster rifle as a blunt weapon. The fight wouldn't last long; however, as Din Djarin used his whipcord thrower to grab the rifle off of the bounty hunter's short alien friend, and used it to knock him unconscious.\nThis bounty hunter, was a humanoid male with brown hair and pale skin. During his fight with Din Djarin, he utilized a beige blaster rifle, and wore rough-looking yellow and black clothing. In addition, he was equipped with a black helmet, with a visor and mouthpiece attached to it.\nThis male bounty hunter was created for, and first appeared in, \"Chapter 10: The Passenger,\" the second episode of the second season of The Mandalorian,\" which was released on November 6, 2020. While it is not directly stated in the episode that this humanoid male is a bounty hunter, the audio description identifies him, and his friends, as hunters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bounty_hunter",
  "/wiki/Biran_Redben",
  "/wiki/Unidentified_Kajain%27sa%27Nikto",
  "/wiki/Unidentified_Kajain%27sa%27Nikto%27s_ally_1",
  "/wiki/Scrapjaw_Motito",
  "/wiki/Grogu",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/9_ABY",
  "/wiki/Bounty",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Death",
  "/wiki/Nikto",
  "/wiki/Zephyr-J",
  "/wiki/Beskar",
  "/wiki/Din_Djarin%27s_armor",
  "/wiki/Blaster_rifle",
  "/wiki/Whipcord_thrower",
  "/wiki/Rifle",
  "/wiki/Alien",
  "/wiki/Hair",
  "/wiki/Blaster",
  "/wiki/Clothing",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/The_Mandalorian",
  "/wiki/November_6",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Mandalorian_Mayhem",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Disney%2B",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY"
 ]
}