{
 "name": "Unidentified_Sith_Saber_(Luke_Skywalker_victim)",
 "display_name": "Unidentified Sith Saber  (Luke Skywalker victim)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "44 ABY",
      "Nam Chorios"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "A Human male Sith Saber was a member of the Lost Tribe of Sith sometime after the Second Galactic Civil War. In the year 44 ABY, he was part of a team sent to capture the dark side entity Abeloth on the planet Nam Chorios. During the mission, he and three other Sith Sabers ambushed Jedi Grand Master Luke Skywalker, Jedi Knight Ben Skywalker, and former Sith apprentice Vestara Khai in the town of Kesla Vein. In the ensuing fight, the Saber was quickly killed by the elder Skywalker.\nA Human male Sith Saber served the Lost Tribe of Sith in the time following the Second Galactic Civil War. Born on the isolated planet Kesh, he was taken and trained by the Lost Tribe of Sith, descendants of a group of Sith who had been stranded on the planet thousands of years prior. In 44 ABY, the Human held the rank of Sith Saber and was chosen to be part of an armada sent to capture the female dark side entity Abeloth on the remote planet Nam Chorios.\nFor that mission, the Human was paired with two other Sith and placed under the command of Sith Saber Tola Annax. After landing on Nam Chorios, the Sith Saber and his companions ambushed another group searching for Abeloth, which consisted of Jedi Grand Master Luke Skywalker, Jedi Knight Ben Skywalker, and the fugitive Sith apprentice Vestara Khai, in the town of Kesla Vein. While Annax stayed behind, the three Sabers engaged the group in lightsaber combat, with the Human fighting Luke Skywalker. However, after a brief duel, the Sith was cut in two by the Grand Master and was killed instantly.\nDuring the time of the mission to Nam Chorios, the Sith was in good physical condition. He was able to reach the rank of Sith Saber in the tribe, and he wore the standard attire for settlers on Nam Chorios during his mission there. He used a red-bladed lightsaber to fight Luke Skywalker but was easily slain by the experienced Jedi Master.\nThe Sith Saber had a brief appearance in Conviction, the seventh novel of the Fate of the Jedi series. Conviction was written by author Aaron Allston and was published in May 2011. The Sith was not named and was killed in the novel.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/44_ABY",
  "/wiki/Nam_Chorios/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Standard_year/Legends",
  "/wiki/Sith_armada_(Lost_Tribe_of_the_Sith)",
  "/wiki/Operation_Shieldfall",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Abeloth",
  "/wiki/Planet/Legends",
  "/wiki/Sith_Saber",
  "/wiki/First_duel_in_Kesla_Vein",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Vestara_Khai",
  "/wiki/City/Legends",
  "/wiki/Kesla_Vein",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Death/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Sith_training",
  "/wiki/Sith/Legends",
  "/wiki/Unidentified_Sith_Saber_(Ben_Skywalker_victim)",
  "/wiki/Gavar_Khai%27s_petty_officer",
  "/wiki/Tola_Annax",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Sai_tok/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Fate_of_the_Jedi:_Conviction",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Aaron_Allston",
  "/wiki/May",
  "/wiki/2011",
  "/wiki/Fate_of_the_Jedi:_Conviction_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}