{
 "name": "Unidentified_tevelor",
 "display_name": "Unidentified tevelor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Leritor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sauvax"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "This male Sauvax held the rank of tevelor, roughly meaning chieftain or spokesbeing, of his kuuvan, roughly meaning community. As a spokesbeing, he could speak Galactic Basic Standard, a language that most Sauvax did not know—although the tevelor did not have a full grasp of the foreign tongue.\nAs the leader, he could be identified by ceremonial trinkets made of driftwood, shells and coral hanging in their clothes. He also had the biggest cabin in his village, a retinue of Sauvax bodyguards and the respect of all the people in his community.\nA Dark Side Adept known as Profex Rynalla secretly traveled to Leritor and raided a Sauvax kuuvan north of this tevelor's kuuvan. When the tevelor knew, he mistakenly blamed the Human settlers of Leritor, as he was unaware of Rynalla's presence. The tevelor took all of his warriors and went to demand explanations to the Humans. Being a peaceful person from a peaceful people, the tevelor did not attack the first Human community he met. Instead, the warriors surrounded the combine-reaper Gevion and the tevelor demanded to parlay face to face with some Human. Nevertheless, he was sure that the Human settlers had mercilessly ravaged the kuuvan, probably in a plot to exterminate the Sauvax species.\nThe Gevion crew had been similarly misled by Rynalla to believe that the Sauvax had initiated, unprovoked, attacks against combine-reapers—something the tevelor was unaware of and would consider implausible—and as such were cautious, disliking the idea of sending an envoy because that person could be murdered. The Humans tried to shout from the combine-reaper, but the tevelor was offended: The Humans were deeming the Sauvax unworthy of a personal meeting.\nThen, the Gevion captain sent a distress call that was answered by some nearby offworlders. Those newcomers offered to mediate among the groups. Initially the tevelor received them with threats as they had unwittingly broken another cultural taboo, but eventually the tevelor calmed down and agreed to abandon the blockade in exchange for the promise of a further research.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Leritor/Legends",
  "/wiki/Sauvax",
  "/wiki/Gender/Legends",
  "/wiki/Tevelor",
  "/wiki/Kuuvan",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Dark_Side_Adept",
  "/wiki/Professor/Legends",
  "/wiki/Rynalla",
  "/wiki/Combine-reaper",
  "/wiki/Gevion",
  "/wiki/Gevion_captain",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Standoff_on_Leritor",
  "/wiki/Star_Wars_Gamer_10"
 ]
}