{
 "name": "Unidentified_grenadier",
 "display_name": "Unidentified grenadier",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal Naboo Security Forces",
      "Grenadiers",
      "Grenadiers"
     ]
    }
   ]
  }
 ],
 "content": "A light-skinned Human male grenadier was a member of the Royal Naboo Security Forces in the year 32 BBY. As a grenadier, he wore a uniform similar to that of the Queen's Palace Guard. He fought against the Trade Federation during the Invasion of Naboo that year when Trade Federation forces entered the capital city. He engaged a grenade droid with his own grenades, and fell back to cover. He then met the Jedi Knight Obi-Wan Kenobi, who at the time was on a mission to rescue the Queen from her Federation captors.\nThe grenadier asked Kenobi to follow him, and he showed the Jedi an Armored Assault Tank which had other Naboo guards pinned down. The grenadier gave Kenobi several ion grenades and asked him to assist with disabling the tank. The grenadier also told Kenobi to come back for more grenades if he needed them.\nKenobi aided the Naboo guards by dropping an ion grenade on the Armored Assault Tank before continuing with his mission.\nThis grenadier appears in the 2001 video game Star Wars: Obi-Wan. The player, taking the role of Kenobi, meets him during the game's third chapter. Identified in the subtitles as \"Man,\" he shares the same model with the other grenadiers and his voice actor is not specified. The player can choose to ignore the grenadier's request to help or may destroy the tank. This article assumes the player took the latter choice. The player can also return to the grenadier at any time for more grenades. The player can also kill the grenadier.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Grenadier_(Royal_Naboo_Security_Force)",
  "/wiki/Star_Wars:_Obi-Wan",
  "/wiki/Standard_year/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Grenadier/Legends",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/Palace_Guard",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Fall_of_Theed",
  "/wiki/Theed/Legends",
  "/wiki/City/Legends",
  "/wiki/Grenade_droid",
  "/wiki/Grenade/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Canon",
  "/wiki/Armored_Assault_Tank",
  "/wiki/Ion_grenade/Legends",
  "/wiki/2001",
  "/wiki/Video_game",
  "/wiki/Obi-Wan:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}