{
 "name": "Unidentified_Inquisitor",
 "display_name": "Unidentified Inquisitor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 18 BBY and 5 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Taller than 1.76 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Empire",
      "Inquisitorius",
      "Inquisitorius"
     ]
    }
   ]
  }
 ],
 "content": "A humanoid male Inquisitor served the Galactic Empire as a Jedi hunter during the Great Jedi Purge. A former member of the Jedi Order, the Inquisitor was a member of the Imperial Inquisitorius. At some point during or after 19 BBY, he visited a farming village after a villager tipped off the Empire to the presence of a Jedi there: former Padawan Ahsoka Tano. She was away from the village when the Inquisitor arrived, causing him to destroy the settlement and kill everyone there except for the villager who had informed and an old man. When Tano returned from delivering harvested crops with the villager's sister, the Inquisitor recognized her, but she saved the informant's life from the Inquisitor and killed him with his own double-bladed spinning lightsaber.\nA humanoid male Force-sensitive, who was once a member of the Jedi Order, served the Galactic Empire's Inquisitorius as an Inquisitor, hunting the Jedi. At some point during or after 18 BBY, the Inquisitor was tipped off by a villager about the former Togruta Jedi Ahsoka Tano's presence in a village, and arrived in the settlement to investigate. Upon not finding his target there, he slaughtered the entire village but the villager who had informed him of Tano's presence and an old man.\nWhen Tano returned to the village from a delivery, alongside the villager's sister, the informer told the Inquisitor that he had been telling the truth and should be rewarded. The Inquisitor attempted to \"reward\" him by killing him, but Tano used telekinesis to pull the man away from the Inquisitor, and cause his lightsaber to miss its target. Intrigued, the Inquisitor recognized Tano and gloated that he would be rewarded for her death. He attempted to kill Tano, but she dodged his blows before grabbing his lightsaber and deactivating it. She then wrenched the weapon out of his hands and decapitated him. The Inquisitor's head was flung away from his body, and deflated within his mask after landing on the ground.\nThe Inquisitor was a male humanoid, taller than 1.76 meters. He mocked a young man before attempting to kill him. However, the Inquisitor was also arrogant and ambitious, as he was confident he could defeat an unarmed Ahsoka Tano, which he believed would earn him a \"reward.\"\nThe Inquisitor wore a skull-like mask and black cloak, which included a hood that covered his head. He was equipped with a red double-bladed spinning lightsaber as a weapon.\nThe Inquisitor appeared in the sixth episode of Star Wars: Tales of the Jedi, \"Resolve,\" and was portrayed by Clancy Brown. Within the Ahsoka novel by E. K. Johnston, Ahsoka Tano confronts and defeats an Inquisitor known as the Sixth Brother during the Raada Uprising of the early Imperial Era. When Johnston reacted to the trailer for Star Wars: Tales of the Jedi, she assumed the Inquisitor was not an adaption of the Sixth Brother because the character he is seen threatening is not Kaeden Larte. When a fan replied by assuming the Inquisitor would end up being the Sixth Brother, she joked that was merely a lack of optimism.\nWhen addressing the possibility of contradictions, she stated she hopes fans do not declare her novel non-canon, stating that the book was approved by Dave Filoni years prior so it was natural for Tano's story to change. When Tales of the Jedi released, Filoni confirmed that the episode was based on the same outline provided for the Ahsoka novel, and was intended to be the same story. This article assumes, however, that the novel and episode depict separate events, including separate Inquisitors, as neither inherently contradicts or negates the other.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Inquisitor_(disambiguation)",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/18_BBY",
  "/wiki/5_BBY",
  "/wiki/Humanoid",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Galactic_Empire",
  "/wiki/Inquisitorius",
  "/wiki/File:AndWhoMightYouBe-Resolve.ogg",
  "/wiki/Jedi_hunter",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Inquisitor",
  "/wiki/19_BBY",
  "/wiki/Unidentified_village_brother",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Attack_on_a_farm_village",
  "/wiki/Death",
  "/wiki/Unidentified_old_man_(Ahsoka_Tano)",
  "/wiki/Unidentified_village_sister",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/File:CanItBeAhsokaTano-Resolve.ogg",
  "/wiki/Force-sensitive",
  "/wiki/Togruta",
  "/wiki/Telekinesis",
  "/wiki/Lightsaber",
  "/wiki/File:ImperialFavor-Resolve.ogg",
  "/wiki/Bone",
  "/wiki/Helmet",
  "/wiki/Cloak",
  "/wiki/Resolve_(episode)",
  "/wiki/Clancy_Brown",
  "/wiki/Ahsoka_(novel)",
  "/wiki/E._K._Johnston",
  "/wiki/Lightsaber_combat",
  "/wiki/Sixth_Brother",
  "/wiki/Raada_Uprising",
  "/wiki/Kaeden_Larte",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars",
  "/wiki/Standard_year",
  "/wiki/Imperial_Era",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Out_of_Darkness",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_84",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Darth_Vader_(2017)_7",
  "/wiki/Amy_Ratcliffe",
  "/wiki/October_26",
  "/wiki/2022"
 ]
}