{
 "name": "Unidentified_Rodian_Doomed_member_2",
 "display_name": "Unidentified Rodian Doomed member 2",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "2974 BBY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Doomed"
     ]
    }
   ]
  }
 ],
 "content": "A Force-sensitive male Rodian was a member of the Doomed on Kesh. He died fighting one of Dreypa's Leviathans during the Battle of Sessal Spire in 2974 BBY.\nThis Rodian was a member of the Doomed, a Force-sensitive order which consisted of the descendants of former Jedi and Dark Jedi who had become stranded on the planet of Kesh following the Hundred-Year Darkness. The Doomed resided in Eshkrene, the planet's southern polar continent away from the native Keshiri and the Human Sith Tribe which settled on Kesh' continent of Keshtah Minor during the Great Hyperspace War. He lived in the City of the Doomed, a settlement which was home to the Doomed community. The Doomed consisted of individuals from a wide range of species including S'kytri, Rodians, Wookiees, Chagrians, Twi'leks, Ithorians, and Weequays. All members of the Doomed committed themselves to finding a balance between the light and dark sides of the Force. There were at least two other Rodian members of the Doomed community.\nIn 2974 BBY, he participated during the Battle of Sessal Spire. Following the awakening of the ancient Sith Lord Remulus Dreypa, the Doomed managed to obtain a herd of uvaks, winged flying beasts, and flew to Keshtah Minor in pursuit of Dreypa. The Doomed managed to rain down arrows on Dreypa and his Leviathan sithspawn, vast reptilian beasts capable of draining the life force of sentient beings. However, Dreypa fought back with Force lightning and his leviathans managed to capture and devour many of the Doomed and their uvak steeds. This Rodian was among those captured by the Leviathans and was drained of his life energies.\nPrior to his death, this Rodian Doomed member managed to confront Dreypa. Based on the life forces drained from the Doomed, Dreypa learnt about their identity and origins. While he knew that the Doomed had pledged never to make war again near the Keshiri, he did not know why they had returned to Keshtah Minor. The Rodian responded that there was only peace while Dreypa was sealed within his oubliette. He also denounced Dreypa as his great shame and stated that it had to be put right. In response, Dreypa stated that he would put all of the Doomed right one at a time. He then sensed that the Doomed were hiding something from him and vowed to find out what it was. Dreypa then departed and left the Rodian Doomed member to die. Ultimately, Dreypa was defeated by the two members of the Lost Tribe, Parlan Spinner and Takara Hilts, at the Siege of Tahv.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kesh",
  "/wiki/2974_BBY",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/The_Doomed",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Remulus_Dreypa",
  "/wiki/Leviathan_(creature)",
  "/wiki/Battle_of_Sessal_Spire",
  "/wiki/Jedi/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Hundred-Year_Darkness/Legends",
  "/wiki/Eshkrene",
  "/wiki/Keshiri",
  "/wiki/Human/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Keshtah_Minor",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/City_of_the_Doomed",
  "/wiki/S%27kytri",
  "/wiki/Wookiee/Legends",
  "/wiki/Chagrian/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Unidentified_Rodian_Doomed_member",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Uvak",
  "/wiki/Sithspawn/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Oubliette_(stasis_casket)",
  "/wiki/Last_Hope_(Jedi_Starship)",
  "/wiki/Parlan_Spinner",
  "/wiki/Takara_Hilts",
  "/wiki/Siege_of_Tahv",
  "/wiki/Lost_Tribe_of_the_Sith%E2%80%94Spiral_4",
  "/wiki/Lost_Tribe_of_the_Sith%E2%80%94Spiral_2"
 ]
}