{
 "name": "Unidentified_Yuuzhan_Vong_(Leafy_Green)",
 "display_name": "Unidentified Yuuzhan Vong  (Leafy Green)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "26 ABY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Leafy Green"
     ]
    }
   ]
  }
 ],
 "content": "A Yuuzhan Vong female spy worked at the Leafy Green tapcafe while undercover on the New Republic capital world of Coruscant. While there, the Yuuzhan Vong's ooglith masquer cover was blown after the Jedi Tekli overheard two patrons express their suspicions that she was not Human. Jedi Master Mara Jade Skywalker and her nephew Anakin Solo went to the Leafy Green and apprehended her after a brief altercation. Although New Republic medics examined the captive to learn more about Yuuzhan Vong biology, at the first opportunity she killed herself to prevent further discoveries.\nIn 26 ABY during the Yuuzhan Vong invasion of the galaxy, the Yuuzhan Vong took an undercover assignment as spy on the New Republic capital world of Coruscant. There, she worked at the Leafy Green tapcafe until the Jedi Tekli overheard two patrons at the establishment express suspicions that she was not Human. Recalling the Yuuzhan Vong ability to disguise themselves as Human using ooglith masquers, Tekli reported her suspicions during a meeting of the Jedi Order. Two Jedi, Jedi Master Mara Jade Skywalker and her nephew Anakin Solo, went to investigate the lead. Determining through their inability to sense her through the Force that she was indeed a Yuuzhan Vong saboteur, they confronted the Yuuzhan Vong and apprehended her after a fight. During the fight, Jade Skywalker and Solo discovered a way to kill the amphistaff creatures that the Yuuzhan Vong employed as weapons.\nNew Republic medics examined the captive Yuuzhan Vong in the hopes of learning more about the biology of the species. However, rather than allow the New Republic to learn anything more from her about her people, the Yuuzhan Vong killed herself at the first opportunity. The untimely death frustrated Jade Skywalker, who felt that it wasn't enough and she should have done better.\nThe Yuuzhan Vong had pale skin with bluish sacs below each eye and patchy black hair that grew in tufts across her skull. Her face had little flesh on it and one upper cheek was burned all almost through, forming a scar that revealed a cheekbone covered in jagged, healed fractures. The Yuuzhan Vong had tattoos shaped like concentric energy bursts across her forehead, and half of her body was tattooed with similar concentric designs meeting at a focal point that vaguely resembled a living creature. She had extendable claws protruding from the knuckles of each hand, formed from a parasitic Yuuzhan Vong creature embedded deep into the bone. Because she had fewer bone breaks and scars than the Domain Shai warriors scanned at Bimmiel, Jade Skywalker surmised she was a younger, low-ranking Yuuzhan Vong who was given undercover work to prove herself. Though female, according to the examinations performed by New Republic medics, the Yuuzhan Vong's ooglith masquer disguise had the appearance of a pale, Human male. The unnatural way she carried herself while wearing the masquer led some members of other species, including Rodians and Humans, to doubt that she was truly Human.\nAs a Yuuzhan Vong operative, she could fight using an amphistaff and other biological weaponry of her species, including blorash jelly. She also knew Galactic Basic and used the language when working at the Leafy Green.\nWhile in Human disguise, the Yuuzhan Vong wore the uniform for servers at the Leafy Green restaurant. This included pants and a belt from which she carried a pouch of blorash jelly. She carried an amphistaff concealed up one sleeve, but did not wear any armor.\nThe Yuuzhan Vong first appeared in the 2000 novel The New Jedi Order: Balance Point, written by Kathy Tyers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/26_ABY",
  "/wiki/Coruscant/Legends",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Leafy_Green",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/Spy/Legends",
  "/wiki/Tapcafe/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cloaker",
  "/wiki/Jedi/Legends",
  "/wiki/Tekli",
  "/wiki/Human/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Anakin_Solo",
  "/wiki/Medic/Legends",
  "/wiki/Death/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/The_Force/Legends",
  "/wiki/Amphistaff",
  "/wiki/Prisoner/Legends",
  "/wiki/Species/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Bone/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Domain_Shai",
  "/wiki/Warrior_caste",
  "/wiki/Bimmiel/Legends",
  "/wiki/Blorash_jelly",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Language/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Armor/Legends",
  "/wiki/2000",
  "/wiki/Kathy_Tyers",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught"
 ]
}