{
 "name": "Unidentified_clone_trooper_(Prosecutor)",
 "display_name": "Unidentified clone trooper  (Prosecutor)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Prosecutor",
      "Corbantis system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "A clone trooper served in the Grand Army of the Republic during the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. In 21 BBY, he was stationed aboard the assault ship Prosecutor, which was captured by Trandoshan slavers, and survived the initial attack by hiding within the ship's torpedo bays. He came out of hiding when the Prosecutor reappeared in the Corbantis system and was subsequently boarded by the clone commandos of Delta Squad. However, upon opening a maintenance hatch for Republic commando RC-1138, he was killed by a scavenger droid belonging to the slavers.\nCloned from the Mandalorian bounty hunter Jango Fett on the planet Kamino for the Galactic Republic, the clone trooper participated in the Clone Wars between the Republic and the Confederacy of Independent Systems. In 21 BBY, the clone trooper was stationed aboard the Acclamator-class assault ship Prosecutor when the ship was attacked and boarded by Trandoshan slavers whilst patrolling trade routes in the Corellian sector. The clone trooper survived the attack by making his way to the ship's torpedo bays until the Prosecutor reappeared in the Corbantis system, part of the Chaykin Cluster. When the clone commandos of the Republic's Delta Squad were dispatched to the Prosecutor, the clone trooper was the first sentient encountered by the squad's leader, RC-1138, known as \"Boss.\" The clone trooper expressed his relief upon seeing the commando and, when Boss asked him what had happened aboard the Prosecutor, remarked that he had been surveying the ship's maintenance corridors at the time it was attacked.\nBoss accused the clone trooper of cowardice, but the trooper claimed that he had gone to the torpedo bay so that he could launch a torpedo in order to alert the Republic of the Prosecutor's status. While thanking Boss for rescuing him, the trooper used a console to open a maintenance hatch for the commando. However, doing so distracted the trooper from noticing a nearby scavenger droid used by the slavers. Unable to help him otherwise, Boss tried to warn the trooper of this threat but to no avail, as the droid attacked the trooper, causing him to fall into a nearby pit. The droid then dragged the trooper's lifeless body upward and deposited it where he had been initially standing.\nLike all clones of Jango Fett, the clone trooper stood 1.83 meters in height. He survived the Trandoshan attack on the Prosecutor by hiding in the ship's torpedo bays. Although the trooper claimed to be trying to send a distress signal, RC-1138 was of the opinion that the trooper hid because he was a coward.\nThe clone wore white Phase I clone trooper armor and was armed with a DC-15S aboard the Prosecutor.\nThis clone trooper first appeared in LucasArts' first-person shooter video game Star Wars: Republic Commando, which was released for PC and Xbox in 2005. He was voiced by Roger Jackson and was briefly mentioned in the game's official strategy guide.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_clone_trooper",
  "/wiki/Kamino/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Prosecutor",
  "/wiki/Corbantis_system",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Acclamator-class_assault_ship",
  "/wiki/Attack_on_the_Prosecutor",
  "/wiki/Trandoshan/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Torpedo/Legends",
  "/wiki/Mission_to_the_Chaykin_Cluster",
  "/wiki/Clone_commando/Legends",
  "/wiki/Delta_Squad/Legends",
  "/wiki/Commando/Legends",
  "/wiki/RC-1138/Legends",
  "/wiki/Death/Legends",
  "/wiki/Scavenger_droid",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Hyperlane",
  "/wiki/Corellian_sector/Legends",
  "/wiki/Chaykin_Cluster",
  "/wiki/Sentience/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Time/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Distress_signal/Legends",
  "/wiki/Color/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/DC-15S",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Republic_Commando",
  "/wiki/Personal_computer",
  "/wiki/Xbox",
  "/wiki/2005",
  "/wiki/Roger_Jackson",
  "/wiki/Star_Wars:_Republic_Commando:_Prima_Official_Game_Guide",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Standard_day/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Databank_(original)",
  "/wiki/The_New_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/Star_Wars:_Revenge_of_the_Sith:_The_Visual_Dictionary"
 ]
}