{
 "name": "Unidentified_Twi%27lek_Jedi_(Geonosis)",
 "display_name": "Unidentified Twi'lek Jedi  (Geonosis)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "This individual was a male Rutian Twi'lek who served the Jedi Order and the Galactic Republic during the final decade of the Republic Classic era.\nDiscovered to be Force-sensitive at an early age, this Twi'lek was inducted into the Jedi Order and trained in the ways of the Force at the Coruscant Jedi Temple's academy. After years of study as a Padawan, this individual constructed a blue-bladed lightsaber before completing the Trials of Knighthood and attaining the rank of Jedi Knight. Dressing in traditional brown robes, this Jedi took to wearing heavy wrist gauntlets.\nStationed at the Temple when Jedi Obi-Wan Kenobi, Anakin Skywalker and Senator Padmé Amidala were sentenced to death by the Confederacy of Independent Systems on Geonosis, this Jedi answered Master of the Order Mace Windu's call to arms and left for the dust world immediately. Landing on the plains of Geonosis, this Twi'lek and the other two hundred-some Jedi stormed the Petranaki arena and fought against the Separatist Droid Army in an attempt to free the captives. While the battle was counted as a victory for the Republic, the Jedi lost the majority their original force, except for a few dozen. It is highly likely this Jedi perished in the arena as well.\nThis Jedi's sole appearance is depicted as promotional art for an action figure set manufactured by Hasbro. The figures included are this Twi'lek Jedi, a Rodian Jedi, and Lumas Etima. His action figure has blue skin, while the promotional art for this set depicts him as having tannish-white skin. Also, on the promotional art, he is visible wielding a blue lightsaber, but is packaged grasping a green one.\nThis Twi'lek may resemble Norcuna or Anoon Bondara, however no canonical link has been made between any of the characters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Twi%27lek_Jedi",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Rutian/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/Padawan/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Gauntlet/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Death/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Petranaki_arena",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Hasbro_Inc.",
  "/wiki/Unidentified_Rodian_Jedi_(Petranaki_arena)",
  "/wiki/Lumas_Etima",
  "/wiki/Norcuna",
  "/wiki/Anoon_Bondara",
  "/wiki/Star_Wars:_Clone_Wars_(toy_line)"
 ]
}