{
 "name": "Unidentified_Yinchorri_commander",
 "display_name": "Unidentified Yinchorri commander",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yinchorr"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Yinchorr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yinchorri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "This Yinchorri commander was present during a plot by the Galactic Empire to assassinate Princess Leia Organa.\nA short time before the Battle of Endor, Imperials under the command of Governor Marcellin Wessel captured the Yinchorri Council of Elders. Blackmailing the remaining Yinchorri, Wessel claimed that he would release the council if the Yinchorri would turn over the Rebel leader, Princess Leia Organa to him. The Yinchorri were scheduled to meet with Organa about joining the Rebel Alliance, and the Yinchorri commander, along with two other Yinchorri, left in a shuttle to meet with the Princess.\nAfter picking up Organa, the Yinchorri commander and his pilot returned to Yinchorr. After entering the planet's atmosphere, two TIE fighters arrived to escort the shuttle to Wessel's location. The Yinchorri commander pulled a blaster on Organa and pinned her to her chair, preparing to turn the Rebel leader over to the Imperials. The commander told his pilot to land the shuttle, hoping to turn Organa over to the Imperials immediately. However, Wessel had decided to simply kill the Rebel leader, and the two TIEs opened fire on the shuttle. The commander was shocked at the betrayal, and he was unprepared when Organa stood up from her chair and knocked him off his feet.\nOrgana, having first-hand experience with Imperial betrayals quickly took command of the situation. She told the pilot to fly evasive maneuvers while she took control of the shuttle's blaster cannon. Organa was able to shoot down one of the TIE fighters, but the remaining TIE pilot continued to pursue the shuttle. The commander told his pilot to increase speed to lose the starfighter, but the Imperial was still able to shoot down the shuttle. Organa disabled the TIE fighter at the same time, but it was too late to save the shuttle. The craft plummeted to the ground, crashing in the open desert. Only Organa, strapped into the shuttle's turret, survived. All the Yinchorri in the shuttle were killed in the crash, including the Yinchorri commander.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yinchorr/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Yinchorri",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Marcellin_Wessel",
  "/wiki/Council_of_Elders_(Yinchorri)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Yinchorri_shuttle",
  "/wiki/Unidentified_Yinchorri_pilot",
  "/wiki/Atmosphere/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Blaster/Legends",
  "/wiki/Blaster_cannon/Legends",
  "/wiki/Unidentified_Alderaanian_stormtrooper",
  "/wiki/Star_Wars_(1977)_86"
 ]
}