{
 "name": "Unidentified_Near-Human_slave",
 "display_name": "Unidentified Near-Human slave",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Infinite Empire"
     ]
    }
   ]
  }
 ],
 "content": "This unidentified child was a slave of the Infinite Empire. They were a Near-Human with fair skin, a flat nose and long blond hair. Like all Force-sensitive slaves of the Infinite Empire, they were named after a letter in the Aurebesh and had their letter tattooed on their face. The slave was brood mates with fellow slaves Xesh, Trill and Yirt, and all five were among those who were used to power the machines of the Rakata species that ruled the Infinite Empire. They were present when pack leader Yirt tried to pick on Xesh, who was quickly defended by Trill, who used the Force to throw Yirt across the cell. Having been challenged and defeated, Yirt was left at the mercy of the other slaves, who attacked their former tormentor as Trill and Xesh retreated to another corner of the cell.\nThis individual was first shown in a flashback scene from Trill's past in Dawn of the Jedi: The Prisoner of Bogan 2, the second issue in the The Prisoner of Bogan story arc of the Star Wars: Dawn of the Jedi comic book series. Due to their face only being seen from the side, only half of the tattoo of the Aurebesh character they are named after, is seen; and there are two characters that fit the motif. Their name must be either Qek  or Wesk .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Near-Human",
  "/wiki/Infinite_Empire",
  "/wiki/Slavery/Legends",
  "/wiki/Nose/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Aurebesh/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Tau_(individual)",
  "/wiki/Trill_(Force_Hound)",
  "/wiki/Yirt_(slave)",
  "/wiki/Rakata/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Dawn_of_the_Jedi:_The_Prisoner_of_Bogan_2",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi:_The_Prisoner_of_Bogan",
  "/wiki/Star_Wars:_Dawn_of_the_Jedi",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Qek/Legends",
  "/wiki/Wesk/Legends"
 ]
}