{
 "name": "Unidentified_female_refugee",
 "display_name": "Unidentified female refugee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Arkinnea"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "This human female was present at the refugee camp on Arkinnea soon after the end of the Clone Wars, when Master K'Kruhk with Chase Piru and a group of Jedi Initiates arrived there. They were given a tent and began to settle down, when some time later a fight between a human and an Aqualish ensued near their tent. K'Kruhk interfered and dragged the troublemakers apart, telling them to think about their families first and what would happen to them if they got arrested. Then he went to find some food, and a woman, who was the wife of the human who had taken part in the fight, approached Chase Piru and thanked her for K'Kruhk saving her husband from trouble. She then gave Piru some tips about living and surviving in the camp and expressed hope that all them would soon be chosen to be transported to the free lands in the north, where the Arkinnea Militia ferried all the offworld refugees for colonization.\nAt night the woman saw K'Kruhk and the younglings packing up and leaving, and in the morning she and her husband were among those who were to be ferried to the free lands that day. While waiting to board the transport she overheard Captain Relik and the members of the Arkinnea Militia talking about the newcomers missing.\nDespite being very friendly to K'Kruhk, Piru and the younglings, she inadvertently turned them in, exclaiming in surprise that she had thought they just had moved tents. From her words Relik deduced that they had deliberately left and were not just late for the transport or lost in the overcrowded camp. He hurried all the leaving refugees on board of an old ore carrier and launched a full-scale search. As the Arkinnea Militia only pretended to be transporting refugees to the free lands and in fact they were just getting rid of them, dumping them from the ore carrier to a ravine, this woman and her husband died with the whole carried group of refugees, being dropped from the transport to the ravine in the mountains.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Arkinnea",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/K%27Kruhk",
  "/wiki/Chase_Piru",
  "/wiki/Soaring_Hawkbat_Clan",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Arkinnea_Militia",
  "/wiki/Captain/Legends",
  "/wiki/Relik",
  "/wiki/Dark_Times%E2%80%94Fire_Carrier_1",
  "/wiki/Dark_Times%E2%80%94Fire_Carrier_2",
  "/wiki/Dark_Times%E2%80%94Fire_Carrier_3"
 ]
}