{
 "name": "Unidentified_Republic_APC_driver",
 "display_name": "Unidentified Republic APC driver",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Army",
      "Republic Army"
     ]
    }
   ]
  }
 ],
 "content": "An APC driver served in the Army of the Galactic Republic during the Cold War with the Sith Empire. In 3643 BBY, the driver was stationed on the planet Ord Mantell as part of the Republic forces deployed in the Separatist War against a group of Separatists intent on overthrowing Ord Mantell's government. During his time on the world, he was assigned to transport a group of Republic troopers to Fort Garnik, a Republic stronghold on the island of Avilatan. However, the driver was killed by armor-piercing missiles fired by a group of Separatists as he piloted his APC walker past the small settlement of Drelliad village.\nA Human male served the Army of the Galactic Republic as a Manka-class armored transport, or APC, driver during the Cold War between the Republic and the Sith Empire. In the year 3643 BBY, during a conflict known as the Separatist War, which was fought between the Republic and a group of Separatists attempting to overthrow the planet Ord Mantell's government, the driver was stationed on Avilatan, an island on the planet. During his time on Ord Mantell, he was tasked with transporting a group of six Republic troopers, including Lieutenant Bex Kolos and a new recruit of the Republic Special Forces unit known as Havoc Squad, from a landing pad to the Republic stronghold of Fort Garnik in a Republic APC walker.\nAs he drove the vehicle past Drelliad village, a small settlement near the fort, the driver used the walker's sensors to determine that there was a large amount of fighting around the village and that the Separatists were close to taking it. Shortly after the driver informed Lieutenant Kolos of the situation over the comm system, the APC was attacked by a group of Separatists in the village who hit the walker with two shoulder-launched armor-piercing missiles. The second missile hit the cockpit, killing the driver, and, although none of the other troopers were killed, the APC was damaged beyond repair. However, while Kolos attempted to repair the APC, the Havoc Squad recruit was able to successfully destroy the Separatist missile stockpile inside the village and get to Fort Garnik.\nThe APC driver was skilled enough as a pilot to operate a Republic APC walker, although he was unable to evade the missiles fired at his vehicle. He had brown eyes, fair skin, and brown hair. His uniform included a gray helmet that left his face exposed.\nThe Republic APC driver makes his first appearance in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare. He only appears in the opening sequence of the class story for players of the Trooper class, which is part of the quest \"Hit the Ground Running.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3643_BBY",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Army",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Manka-class_armored_transport",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Pilot/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Separatist_War",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Ord_Mantell_Central_Authority",
  "/wiki/Time/Legends",
  "/wiki/Republic_trooper",
  "/wiki/Fort_Garnik",
  "/wiki/Avilatan",
  "/wiki/Death/Legends",
  "/wiki/Armor-piercing_missile",
  "/wiki/Battle_in_Drelliad_village",
  "/wiki/Walker/Legends",
  "/wiki/Drelliad_village",
  "/wiki/Standard_year/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Bex_Kolos",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Havoc_Squad",
  "/wiki/Hangar/Legends",
  "/wiki/Fortress/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Comm_unit/Legends",
  "/wiki/Missile/Legends",
  "/wiki/Cockpit/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Armor/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Voidhound"
 ]
}