{
 "name": "Unidentified_Ugnaught_vendor",
 "display_name": "Unidentified Ugnaught vendor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ugnaught"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Grey"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "This male Ugnaught worked as a vendor in the marketplace of the Colossus platform on Castilon, selling food. He was generally unpleasant with his customers, refusing to allow them to purchase more than one bowl of his wares. The vendor had a bushy grey beard and a peg leg.\nWhile going inside before curfew when the platform was experiencing a power outage, he was briefly harassed by speagulls, before informing Kazuda Xiono of the curfew. Later, while he was distracted arguing with a customer, Garma, young fugitives Kel and Eila took the opportunity to steal a bowl of food to eat. When he discovered it missing, the vendor tracked the children down and chased them around the market. The children eventually came to the end of the marketplace where Bolza Grool's stall was located, leading the vendor to, while leaping off a stack of crates, collide with Grool and knock them both over. One of Grool's gorgs fell on the vendor's face, and he had difficulty pulling it off, as the children escaped.\nThe Ugnaught vendor is a character on Star Wars Resistance, and is voiced by franchise regular Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Ugnaught",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Colossus_marketplace",
  "/wiki/Colossus",
  "/wiki/Castilon",
  "/wiki/Foodstuff",
  "/wiki/Speagull",
  "/wiki/Kazuda_Xiono",
  "/wiki/Garma",
  "/wiki/Kel",
  "/wiki/Eila",
  "/wiki/Bolza_Grool",
  "/wiki/Gorg",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/The_High_Tower",
  "/wiki/The_Children_from_Tehar",
  "/wiki/Synara%27s_Score",
  "/wiki/Neeku%27s_Reward",
  "/wiki/The_New_Trooper",
  "/wiki/Kaz%27s_Curse",
  "/wiki/No_Place_Safe",
  "/wiki/StarWars.com"
 ]
}