{
 "name": "Unidentified_Wookiee_mercenary",
 "display_name": "Unidentified Wookiee mercenary",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aurodium Sword"
     ]
    }
   ]
  }
 ],
 "content": "A Wookiee mercenary served as a member of the group known as Aurodium Sword Executive Security at some point during the Galactic Civil War. On one assignment, the mercenary joined a rogue ARC trooper known as Muzzle and fellow Wookiee Snoova to protect a Sullustan executive. When their client came under fire from an industrial assassination squad, the Wookiee mercenary came to his defense in the ensuing skirmish. An image of the battle reached the Galactic Empire via an undercover Imperial intelligence agent.\nWhile operating as a mercenary, a Wookiee worked for the security firm known as Aurodium Sword Executive Security, an organization that protected wealthy clients from those who might try to harm them. In that position, the Wookiee worked alongside a free-agent ARC trooper known as Muzzle and another Wookiee, a bounty hunter named Snoova. Some time before 0 ABY, a Sullustan executive hired Aurodium Sword's services. When an industrial assassination squad found the Sullustan and opened fire, the Wookiee mercenary, Muzzle, and Snoova came to their charge's aid.\nAn image of the altercation reached an Imperial intelligence agent, who sent it along with a report on Aurodium Sword to the Galactic Empire. Commander Maximillian Seerdon of the Imperial Security Bureau placed both the report and the image in a dossier on underworld figures he compiled shortly after the Battle of Yavin. The report made no mention of the Wookiee's name or that of the agent who had sent the image of the mercenary skirmish.\nDuring the altercation with the assassination squad, the Wookiee fought using a blaster rifle. The mercenary had brown eyes, skin, and fur; the Wookiee's hair was tied with silver bands into three knots about the chin.\nA Wookiee member of Aurodium Sword appears in an illustration by Joe Corroney printed as part of \"Underworld: A Galaxy of Scum and Villainy.\" The article, written by Abel G. Peña and Ryan Kaufman, was published as part of Star Wars Insider 89 in August 2006. The text does not mention the character by name, nor does it provide the mercenary's gender. The idea for the character came from Ryan Kaufman's five-year-old son, Max, who liked to team up a clone commander action figure with three toy Wookiees. Kaufman found the idea of a clone backed up by Wookiees to be attractive, so he adopted that configuration for the Aurodium Sword organization.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookiee/Legends",
  "/wiki/Color/Legends",
  "/wiki/Aurodium_Sword/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Alpha-66",
  "/wiki/Snoova",
  "/wiki/Unidentified_Sullustan_executive",
  "/wiki/Assassin/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Unidentified_Aurodium_Sword_skirmish",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Unidentified_Imperial_intelligence_agent",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Time/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Maximillian_Seerdon",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Joe_Corroney",
  "/wiki/Underworld:_A_Galaxy_of_Scum_and_Villainy",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/Star_Wars_Insider_89",
  "/wiki/August",
  "/wiki/2006",
  "/wiki/Gender/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/Cloning/Legends",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/StarWars.com"
 ]
}