{
 "name": "Unidentified_Twi%27lek_majordomo",
 "display_name": "Unidentified Twi'lek majordomo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mayor of Mos Espa",
      "Fett gotra"
     ]
    }
   ]
  }
 ],
 "content": "A Twi'lek male served as the majordomo of the Ithorian Mok Shaiz, mayor of Mos Espa on the planet Tatooine. After the palace of Jabba the Hutt was taken over by the bounty hunter Boba Fett, the majordomo visited the palace to greet Daimyo Fett and his accomplice, the assassin Fennec Shand. Fett and Shand had assumed that Shaiz himself had intended to visit to pay tribute, but sent the majordomo in his place, who then instead requested tribute from Fett. Fett declined to pay tribute, allowing the Majordomo to leave with his life, though the Twi'lek warned Fett to expect another delegation in the future as he departed.\nAfter assassins from the Order of the Night Wind attacked Fett, one captured assassin claimed Shaiz had sent them. Fett and Shand went to the city hall to confront the mayor. While the majordomo insisted his boss was busy, Fett and his party walked past the Twi'lek and before Shaiz. Fett and the Mayor exchanged in a light argument, with the Majordomo briefly trying to shut down Fett's accusations and delivering a payment of credits from Shaiz.\nFett soon visited again to question Shaiz, the majordomo insisting that the mayor was again busy. After being threatened by Shand, the Twi'lek lied to the pair and left the room, locking the door behind him to try and flee. He rode away on a speeder, but Fett and Shand caught him leaving, and had their riders chase him on speeders. The majordomo was pursued by through the streets of Mos Espa by the riders, crashing into many things in his rush. However, one rider caused him to crash, and he found himself confronted by Fett again, admitting to the Daimyo that Shaiz had infact sided with the Pyke Syndicate.\nUnder the custody of Fett and Shand, the majordomo made confessions, but his captors were unable to locate Shaiz. The Twi'lek was later present for a meeting between Fett and his assets.\nEarlier into his life, the Twi'lek was educated on the city planet Coruscant, while he did not consider his parents to be wealthy considering the privileged position he was in. He attended finishing academy, and specialized in Civic Council Negotiations.\nAround 9 ABY, the male Twi'lek worked as the majordomo to Mok Shaiz, the mayor of the city of Mos Espa and its surrounding plateaus on the desert planet Tatooine. After Jabba the Hutt's palace was occupied by the bounty hunter Boba Fett in the same year, Shaiz sent the majordomo to see Fett.\nFett received the majordomo in the Palace's throne room, and was surprised to find that his guest was not the mayor himself, having expected Shaiz. Having been introduced by 8D-series smelter droid 8D8 as being the mayor, the majordomo apologized for the confusion, explaining that the mayor was away on pressing matters. When Fett asked for tribute, the majordomo stated that he had brought none, except for Mayor Shaiz's heartfelt welcome to Mos Espa. Fennec Shand, Fett's partner and master assassin, became annoyed and noted that the majordomo would have been fed to Jabba's pets for his insolence had the Hutt still been in power, though the majordomo was unphased by this.\nFett told the majordomo to inform the mayor that he was here now, to which the majordomo responded that the mayor was aware. Though dismissed by Fett, the majordomo proceeded to request tribute from Fett, which confused the newly anointed crime lord. Fett allowed the majordomo to leave unharmed, despite being asked by Shand if he should be killed. Shand conveyed the gift of his leave unmolested which the majordomo received with indifference, offering apologies and appreciation. As he exited the room, the majordomo told Fett that he should expect another delegation from the Mayor's office in the near future.\nNot long after, Fett was attacked by six assassins from the Order of the Night Wind. Shand was able to capture one Night Wind assassin, who soon confessed that he had been sent by Mok Shaiz. As a result, Fett, Shand and their two Gamorrean guards took the assassin to the city hall of Mos Espa. Approaching the city hall clerk, Fett demanded to see the mayor, and the majordomo stepped in to greet the party, commenting that the Daimyo had not arrived with a litter. With no reply from Fett, the Twi'lek continued, calling the visit an honor but also informing them that Shaiz was busy. Regardless, Fett walked towards the door to the mayor's room.\nThe majordomo tried to stop Fett's group, insisting that the area was restricted, but the Daimyo walked through with his party regardless. With the visitors arriving before Shaiz, the majordomo apologized to the mayor for the intrusion. Shaiz asked who his visitors were, Fett insisting the mayor already knew that. Nevertheless, the majordomo introduced Fett to his superior, and the Daimyo accused the mayor of arranging his assassination. The Twi'lek tried to shut down Fett's claims until Shaiz identified the assassin's affiliation with the Order of the Night Wind, having Fett's captive shot. Because the Night Wind's were not allowed to operate outside of Hutt Space, the mayor had his majordomo give a payment of credits to Fett for turning the assassin in. The Daimyo then exchanged snide remarks with the Twi'lek's boss before leaving the city hall.\nMeanwhile, Shaiz had promised the territories of Mos Espa to the Pyke Syndicate, which was expanding its spice trade on Tatooine. The mayor left the town hall and flew off world—officially on a scheduled vacation— before Fett returned to question him, having learned of Shaiz's new allegiance. The majordomo greeted Fett at the counter, insisting that the mayor had a very busy schedule. Shand advised him to choose his next words carefully, threatening his life. Swallowing, the majordomo claimed he could try and rearrange some of the mayors less time sensitive appointments, backing towards the office saying he needed a moment to see what he could do. Retreating to the mayors office under the guise of checking the schedule, he instead locked the door behind himself and fled to his speeder to escape. Fett and Shand quickly caught on to the majordomo's escape attempt, exiting the city hall as the Twi'lek rode his speeder away. The Daimyo ordered his gang of mods to pursue the majordomo on their speeders.\nFleeing through Mos Espa in a speeder, the majordomo weaved through the busy streets at high speeds, crashing into numerous objects while he drove, including a large water tower. Pursuing the Twi'lek,the mods soon chose to split up, eventually managing to flank the majordomo's speeder from all sides. The mod Skad and one of his comrades tried to damage the speeder's engines, but the Twi'lek rammed each away from him, Skad's accomplice crashing as a result. When a pair of Bith riding a rickshaw pulled by a droid nearly drove into his path, the majordomo tried to wave them out of his path. The droid quickly sped out of the way, with it's rickshaw narrowly being hit and spun around by the majordomo.\nOne of the mods, Drash, drove her speeder onto a roof top and then plummeted her vehicle down to the majordomo's speeder, colliding with its right engine. The Twi'lek lost control and crashed through a farmer's market, his speeder becoming buried in meiloorun fruit. He tried to drive off, but found the speeder would no longer work. Fett, flying by jetpack arrived before the majordomo, asking where Shaiz was. Giving in, the Twi'lek admitted that the mayor was working with the Pyke Syndicate.\nThe majordomo was held in custody with his wrists in shackles under Fett following his attempted escape in Mos Espa. Despite the majordomo's confessions, Fett's enforcers did not locate the mayor even when combing the streets of the city, determining that he had indeed fled off world. Fett gathered his assets for a meeting about the rising threat of the Pyke Syndicate as the crime syndicate gathered troops in Mos Espa. Shand summarized the Pyke's culmination of forces and mentioned Shaiz fleeing off world as a sign war was about to break out. The majordomo stepped forward with claims that the mayor was on a scheduled vacation, but quickly conceded and stepped back when the others did not give a response. One Gamorrean guard got in his face, causing him to flich backwards. The Twi'lek then stood in the back as the meeting continued, with Shand concluding that Fett's forces needed foot soldiers to aid them against the Pykes.\nAs the forces of Fett's gotra and the Pyke Syndicate approached open warfare, the majordomo was one of several individuals with Fett in the ruins of the Sanctuary, which had been bombed by the Pykes. While Fett and his cadre debated where to make their stand, the majordomo stood in the background looking concerned. The Daimyo was then drawn into a brief standoff with the Duros bounty hunter Cad Bane, who was hired by the Pykes, outside of the Sanctuary's ruins. After Bane and his Pyke shooters left the scenes, the majordomo exited the ruins and praised Fett's actions as an impressive display of restraint while offering his own advice. Fett mockingly questioned the price of the Twi'lek, prompting the latter to apologize and state he should not have interjected.\nThe exchange was interrupted when Fett's allies reported that the three families of Mos Espa had turned on them. When Shand concluded that they needed to take out the Pyke Syndicate's leadership on Tatooine, Fett asked the majordomo if the Pyke's headquarters on the world was still located in the Mos Eisley spaceport. The Twi'lek was initially reluctant to tell the Daimyo, but with Shand cocking her rifle, he revealed that the Pykes still operated out of the Desert Survey Office in Mos Eisley. Thus Shand left to deal with the Pyke Syndicate aligned leadership.\nPyke foot soldiers soon arrived outside the Sanctuary, leading Fett and Djarin to prepare to fight them. The majordomo then cut in and offered his services as a negotiator, citing his studies in Civic Council Negotiations while insisting that his family had not been wealthy. As the Twi'lek was confident in negotiating a sufficient outcome in Fett's escape, the Daimyo agreed and demanded the majordomo's tablet to write terms to the Pykes on. Fett wrote down his terms of what the Twi'lek thought was a surrender and sent him outside to the Pyke forces. The majordomo declared himself unarmed and offered to read the supposed terms of surrender to the Pykes. The lead Pyke demanded he read it, calling him a tail-head. The majordomo laughed off the insult and began complementing the obsidian cliffs of the Pyke homeworld Oba Diah, but the Pyke again demanded for the terms to be read.\nThe majordomo began reading Fett's offer but quickly realized that the Daimyo had made no concessions, attempting to change the subject. The lead Pyke again demanded the Twi'lek to read Fett's offer, and the majordomo continued, reading out a threat from Fett to the Pykes. Angered, the Pyke in charge began raising his blaster, and the Twi'lek added that the threat was Fett's words and not his own. Unbeknownst to the Twi'lek, the attempted negotiation was a distraction which allowed Fett and Djarin to ambush the Pyke forces. As the pair flew in using jetpacks, firing on the Pyke forces, the majordomo quickly retreated back towards the ruins of the Sanctuary, briefly pausing to survey the battlefield. He hid behind a pillar, watching as the pair engaged the enemy forces.\nThe majordomo was a male Twi'lek with orange skin and brown eyes. He was a smooth talker and was confident enough to ask the bounty hunter Boba Fett for tribute even though he was a guest at the palace utilized by Fett. When greeting the new crime lord, the majordomo's bow seemed perfunctory, while his departing bow carried a courtly flourish. Upon Fett's first unannounced visit to the city hall, the majordomo had a less exaggerated tone towards him, bringing no response from the Daimyo when he greeted him with a grin, but trying to continue his negotiation efforts nonetheless. As Fett walked past him, the majordomo attempted to protest, becoming more panicked when the Daimyo did not listen. Once Fett had reached Mok Shaiz, the Twi'lek changed his tone to apologize to the mayor for the interruption, quickly defending the mayor from Fett's accusations.\nThe next time Fett abruptly arrived to visit the mayor, the majordomo was caught off guard, quickly creating excuses why the mayor could not be seen and frequently stumbling on his words. The Twi'lek froze when Fennec Shand threatened his life, struggling to muster a lie in order for him to flee. During his chase by Fett's riders, the panicked majordomo rushed through his obstacles. He was agitated when the riders tried to damage the engines, and continued to be fearful of the chasers until he was unable to escape. Trapped by Fett and his riders, the majordomo pouted momentarily in defeat, before giving confessing.\nAfter his capture by Boba Fett, the majordomo remained steadfastly loyal to Mok Shaiz, verbally defending the major even as he himself remained in shackles. When challenged by a Gamorrean guard following his verbal defense of the mayor, he flinched backwards.\nThe Twi'lek wore green robes with golden accents and had two rings on his right hand. He sported a piece of fabric headwear that wrapped around his lekku.\nThe majordomo was first pictured in the official trailer for the Disney+ series The Book of Boba Fett, which was published on YouTube on November 1, 2021. He then made his debut in the first episode of the series, \"Chapter 1: Stranger in a Strange Land,\" which was directed by Robert Rodriguez and released on December 29 of that year. The character was portrayed by David Pasquesi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Twi%27lek",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/Fett_gotra",
  "/wiki/File:MajordomoActually.ogg",
  "/wiki/Ithorian",
  "/wiki/Mok_Shaiz",
  "/wiki/Mayor",
  "/wiki/Mos_Espa",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Attack_on_Jabba%27s_Palace_(Boba_Fett)",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Majordomo",
  "/wiki/Daimyo",
  "/wiki/Assassin",
  "/wiki/Fennec_Shand",
  "/wiki/Order_of_the_Night_Wind",
  "/wiki/Ambush_outside_of_the_Sanctuary",
  "/wiki/Unidentified_Night_Wind_assassin",
  "/wiki/Mos_Espa_City_Hall",
  "/wiki/Credit",
  "/wiki/Chase_through_Mos_Espa",
  "/wiki/Drash",
  "/wiki/Pyke_Syndicate",
  "/wiki/City",
  "/wiki/Coruscant",
  "/wiki/File:ActuallyTribute.ogg",
  "/wiki/9_ABY",
  "/wiki/Desert",
  "/wiki/Hutt",
  "/wiki/8D-series_smelter_droid",
  "/wiki/8D8",
  "/wiki/Master_Assassin",
  "/wiki/Crime_lord",
  "/wiki/Death",
  "/wiki/Gamorrean_Warrior",
  "/wiki/Unidentified_clerk",
  "/wiki/Hutt_Space",
  "/wiki/Spice",
  "/wiki/Mods",
  "/wiki/Skad",
  "/wiki/Bith",
  "/wiki/Meiloorun_fruit",
  "/wiki/Jetpack",
  "/wiki/Pyke",
  "/wiki/Unidentified_Gamorrean_guard_2",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/Duros",
  "/wiki/Cad_Bane",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Desert_Survey_Office",
  "/wiki/Unidentified_Pyke_capo",
  "/wiki/Homeworld",
  "/wiki/Oba_Diah",
  "/wiki/File:ApologiesAndAppreciation.ogg",
  "/wiki/Eye",
  "/wiki/Robe",
  "/wiki/Ring",
  "/wiki/Limb",
  "/wiki/Clothing",
  "/wiki/Lekku",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/November_1",
  "/wiki/2021",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Robert_Rodriguez",
  "/wiki/December_29",
  "/wiki/David_Pasquesi",
  "/wiki/Category:Audio_files_of_Unidentified_Twi%27lek_majordomo",
  "/wiki/Category:Images_of_Unidentified_Twi%27lek_majordomo",
  "/wiki/The_Book_of_Boba_Fett_Junior_Novel",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Krrsantan",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/The_Mandalorian",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Second_rescue_of_Grogu"
 ]
}