{
 "name": "Unidentified_Onderon_Soldier",
 "display_name": "Unidentified Onderon Soldier",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Onderon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Onderonian military"
     ]
    }
   ]
  }
 ],
 "content": "An Onderon Soldier was involved in the Battle of Telos IV, as part of the strike force sent by Queen Talia of Onderon, after the TSF sent out a distress call to Onderon. The soldier found himself injured after he was hit by a grenade, narrowly missing the full blow. As he held his position while the rest of his squadmates went on ahead, he eventually came across the Jedi Exile, whom he then assisted in taking care of the remaining Sith units.\nWhen Citadel Station found itself under attack, Queen Talia of Onderon sent a force to assist in the defense of the station and the Telosian restoration effort. That force was lead by Riiken, who'd just been promoted to the title of Major. The soldier was part of the same force. While Riiken remained in the Ithorian compound, the soldiers made their way towards the TSF module. Once in Entertainment Module 081, his squad were ambushed by Sith troops, where the soldier was hit by a grenade, barely missing the full blast. He remained by the entrance to the Module as his squadmates advanced towards the TSF office, after they finished off the Sith troops in the immediate area.\nEventually, he was approached by the Jedi Exile, who assured him that his injuries weren't fatal. After that, the Onderon soldier decided to continue fighting alongside the exile, helping her catch up to the rest of the Onderon force and defeat the remaining Sith troops on the station. As the exile then decided to assist the Mandalorians in boarding the Ravager, the soldier's work was done.\nThe soldier wears the same uniform that is worn by any standard soldier of the Onderon Royalists, he is equipped with a standard blaster rifle, but is also equipped with a sword, for if he comes up against any enemies with melee weapons.\nThe Onderon Soldier appears as a non-playable character in the 2004 video game Star Wars: Knights of the Old Republic II: The Sith Lords.\nHe is in a fairly critical state upon meeting the Jedi Exile, however he can't be healed by the exile, whether through dialogue choices or when the soldier assists the exile in fighting, so he remains clutching his side whilst not engaging in combat.\nIf the exile doesn't reassure the soldier by saying that his injury isn't too severe, he will refuse to accompany the exile, if the exile then attempts to be forceful, the soldier will fight back, resulting in his death, this results in the player getting dark side points, and will allow the player to gain influence with HK-47 and Atton, but lose it with everyone else.\nThe exile can still advise him to stay put and wait for a medic, which he will abide by, unless the exile has already assured him that his injury isn't too severe, then he will decide that he might as well fight.\nThe soldier can fall in combat if the player has him assist the exile, and the enemy forces direct too much offensive attention towards the soldier. A particular glitch in the game can regularly occur, involving the exile's companions suddenly attacking and killing the soldier if he assists the party in fighting the Sith, the companions will then act as if the player purposely brought on that action.\nIf the player chooses the dark side path and assists Vaklu in her travels to Onderon, the soldier will instead be a Vaklu soldier, rather than a Royalist, and will have a slightly different face, however dialogue options will be exactly the same.\nAs another alternative, the Jedi Exile may not even talk to the soldier, as it is not compulsory.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Onderon/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Onderonian_military",
  "/wiki/Meetra_Surik",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Battle_of_Telos_IV",
  "/wiki/Sith/Legends",
  "/wiki/Citadel_Station",
  "/wiki/Riiken",
  "/wiki/Major/Legends",
  "/wiki/Citadel_Station_Ithorian_Compound",
  "/wiki/Entertainment_Module_081",
  "/wiki/Mandalorian/Legends",
  "/wiki/Ravager_(Centurion-class)",
  "/wiki/Onderon_Royalists",
  "/wiki/Vaklu"
 ]
}