{
 "name": "Unidentified_clone_commando_sniper",
 "display_name": "Unidentified clone commando sniper",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grand Army of the Republic",
      "Special Operations Brigade",
      "RC-1013's clone commando squad",
      "Special Operations Brigade",
      "RC-1013's clone commando squad",
      "RC-1013's clone commando squad"
     ]
    }
   ]
  }
 ],
 "content": "This clone commando sniper was a member of a squad of the Grand Army of the Republic's clone commandos who carried out special forces missions for the Galactic Republic during the Clone Wars. A clone of the Mandalorian bounty hunter Jango Fett, this soldier was born on the aquatic world of Kamino, and acted as his squad's sniper during a mission to the Mid Rim planet, Ord Mantell. There, he and his commando brothers engaged a group of Trandoshan bounty hunters responsible for stealing a diplomatic package bound for Supreme Chancellor Palpatine. He was responsible for the death of a number of the Trandoshan mercenaries, but perished when the ordnance module on his backpack was struck by enemy blasterfire, detonating it and killing the commando. The sniper's squad leader, RC-1013, mourned the loss of his comrade before taking the life of his squadmate's killer and recovering the parcel they had been sent to retrieve.\nA clone of the Mandalorian bounty hunter Jango Fett, this male Human was born on the aquatic world of Kamino, located in the remote Wild Space region of the galaxy. Over the following years, he was trained as a clone commando to serve in the Grand Army of the Republic. Following the Battle of Geonosis that triggered the outbreak of the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems, the clone soldier was deployed with the rest of the Grand Army and like all of his commando comrades, joined the ranks of Special Operations Brigade, a special forces unit within the Grand Army made up of clone commandos and Advanced Recon Commandos. Six months after the events of Geonosis, the commando was serving as a member of a squad led by clone commando RC-1013. He and his squad, in addition to the members of another, were summoned to the headquarters of Republic Intelligence, where they were met by an ARC trooper intelligence officer in yellow-marked armor. The ARC trooper informed the assembled commandos that a package sent by Malastarian diplomats and intended for Supreme Chancellor Palpatine had been intercepted while en route and stolen by a gang of Trandoshan bounty hunters. The eight commandos were then tasked with retrieving the stolen package from the Trandoshans, a mission that was to take place on Ord Mantell.\nAt midday on Ord Mantell, the commandos put their ambush into action, with the members of the sniper's squad taking position on a rooftop while the other squad blocked the street the Trandoshans were traveling by landspeeders not far away. This commando provided surveillance for the squad using his sniper rifle, identifying the package they had been sent after aboard the second in a convoy of three speeders the bounty hunters were piloting. His squadmate opened fire with a missile launcher, destroying the lead speeder and killing the Trandoshans within; the missile strike also signaled the squad on the street to engage the enemy, rushing the target speeder. The Trandoshans fled, throwing a number of thermal detonators from their vehicle that exploded in the wake of their escape, killing the attacking squad. However, the commando sniper was able to shoot the pilot of the second fleeing speeder in the head, killing him instantly and sending the vehicle out of control before crashing in a burst of flame. The final speeder, the one carrying the package the commandos had been tasked with recovering, sped away in the direction of the industrial yards, with the sniper and his squad following in a speeder of their own, piloted by the squad's fourth member.\nTracking the Trandoshan bounty hunters to a courtyard in the industrial yards, the squad split up to search for mercenaries. The pilot located the Trandoshans first, falling quickly to fire from the group of Confederacy battle droids that had been sent to make the buy for the package. The squad's leader tossed an EMP grenade through the door, shorting out the droids before he and the other members of his squad burst in, destroying the droids with their DC-17m blaster rifles. The Trandoshans had run behind a secondary blast door however, which the clone sniper and his team were forced to blow their way through before engaging the bounty hunters. The squad's ordnance specialist died from a hail of Trandoshan fire, but a grenade from the squad leader killed all but one of the remaining bounty hunters. The Trandoshan leader emerged from his hidden cover and fired on the sniper, his shot striking the ordnance module on the commando's backpack, killing him in the resultant explosion. The squad leader futilely reached out to his dead brother, but accepting that there was nothing he could do for him, the clone commando attacked the final bounty hunter, pinning him to the ground before ending his life with the vibroblade housed in his gauntlet's knuckle plate. The clone recovered the package, and saw its safe return to Coruscant and into the hands of Chancellor Palpatine.\nThis commando served as his squad's sniper during the mission to Ord Mantell, and in addition to the DC-17m blaster rifle standard to all clone commandos, he wielded an additional sniper rifle with a significantly longer barrel and stock, one which he used with lethal accuracy. The commando also wore Katarn-class commando armor, and decorated the armor with patched of the color blue. His helmet was adorned with macrobinoculars, enhancing the advanced HUD system built into the helmet.\nIn 2005, the third volume of the Clone Wars Adventures comics introduced two squads of Republic commandos with the story \"The Package\", the clone commander sniper among them.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Special_Operations_Brigade/Legends",
  "/wiki/RC-1013%27s_clone_commando_squad_(Ord_Mantell)",
  "/wiki/RC-1013",
  "/wiki/Clone_commando/Legends",
  "/wiki/Special_forces/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Clone_sniper",
  "/wiki/Mission_to_Ord_Mantell_(Clone_Wars)",
  "/wiki/Mid_Rim",
  "/wiki/Commando/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/The_Package",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Death/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Bomb/Legends",
  "/wiki/Backpack/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/Unidentified_Advanced_Recon_Commando_(intelligence_officer)",
  "/wiki/Wild_Space/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Army/Legends",
  "/wiki/Advanced_Recon_Commando/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Unidentified_clone_commando_squad_(Ord_Mantell)",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Landspeeder/Legends",
  "/wiki/Sniper_rifle/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Missile_launcher/Legends",
  "/wiki/Missile/Legends",
  "/wiki/Thermal_detonator/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Electromagnetic_pulse_grenade",
  "/wiki/Droid/Legends",
  "/wiki/DC-17m_Interchangeable_Weapon_System/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Blast_door/Legends",
  "/wiki/Lightfight",
  "/wiki/Grenade/Legends",
  "/wiki/Wrist_blaster/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Gauntlet/Legends",
  "/wiki/Knuckle_plate_vibro_blade",
  "/wiki/Coruscant/Legends",
  "/wiki/Rifle/Legends",
  "/wiki/Katarn-class_commando_armor",
  "/wiki/Armor/Legends",
  "/wiki/Blue",
  "/wiki/Macrobinoculars/Legends",
  "/wiki/Heads-up_display/Legends",
  "/wiki/2005",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_3",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_(comics)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/The_Package_(comic)",
  "/wiki/Databank_(original)",
  "/wiki/Republic_Commando:_Triple_Zero",
  "/wiki/Orders",
  "/wiki/Star_Wars:_Clone_Wars_Adventures_Volume_4",
  "/wiki/The_Essential_Atlas"
 ]
}