{
 "name": "Unidentified_Quarren_(Ambush_in_Cloud_City)",
 "display_name": "Unidentified Quarren  (Ambush in Cloud City)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "A male Quarren assassin and some other fringers participated in an ambush set up for Baron Administrator Lando Calrissian by the bounty hunter Bossk. In 1 ABY, Dominic Raynor, the former owner of Cloud City of the planet Bespin, lost the ownership of the floating settlement to the professional sabacc gambler Calrissian. Thinking his opponent had cheated, Raynor hired Bossk to extract his revenge. The bounty hunter brought the Quarren and some other mercenaries to Cloud City, where they set up a trap for the new Baron Administrator. Bossk sent a fake emergency call to lure Calrissian to a lower maintenance level, where his team ambushed the Baron's party, but Calrissian fled through a nearby hangar.\nA male Quarren worked as an assassin in 1 ABY, during the Galactic Civil War. In that year, Cloud City Baron Administrator Dominic Raynor gambled away his ownership of the floating Bespin city in a game against Lando Calrissian, a professional sabacc player. Raynor felt that his opponent cheated, thus he hired the Trandoshan bounty hunter Bossk to extract his revenge on the gambler. The Quarren, along with some other mercenaries and cutthroats, was contacted by Bossk to take part in the job and to help him deal with any problems that might arise during the hunt.\nAfter the Quarren and his companions—including Bossk, a Twi'lek scoundrel, another scoundrel of the same species, and a Duros mercenary—slipped through the security of Cloud City, they began setting up an ambush to capture Calrissian. Their plan was to lure the Baron Administrator to a maintenance level with a fake emergency call. Bossk hacked into the city's communication system and, impersonating the city's chief engineer, reported to Calrissian that a primary repulsorlift pod was in bad shape and would break down—a critical failure that would destroy the floating settlement. Calrissian responded immediately and went to the city's lower levels to check the pod himself; however, he took his Twi'lek bodyguard and four Bespin Wing Guards along as a precautionary measure.\nBossk ordered his companions to take cover but remain in sight to lure Calrissian out. Since they did not know which turbolift Calrissian would arrive in, the Quarren and the others spread into every room near the lifts. After Calrissian's group entered the maintenance level, a blast door suddenly shut behind them, and the ad hoc hunters opened fire on the Baron Administrator's guards. Calrissian's escorts planned to hold their enemies off and enable the Baron Administrator to escape. The Quarren engaged his opponents with a blaster in the erupting combat. However, thanks to another quartet of Wing Guards alarmed by a distress call, the Baron Administrator managed to flee the ambush through a nearby hangar.\nThe Quarren appeared in Sore Loser's Revenge, a Wizards.com online scenario written by Eric Cagle for the Star Wars Miniatures collectible tabletop strategy game in 2004. During the game, one player controls Calrissian's party, and another one controls Bossk's party, including the Quarren, who is represented by a generic Quarren Assassin miniature figurine from the Miniatures set Rebel Storm. The survival of the character depends on the players' actions.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Quarren",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Fringer",
  "/wiki/Ambush_in_Cloud_City",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bossk/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Dominic_Raynor",
  "/wiki/Cloud_City/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/City/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Administrator/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Unidentified_Twi%27lek_1_(Ambush_in_Cloud_City)",
  "/wiki/Unidentified_Twi%27lek_2_(Ambush_in_Cloud_City)",
  "/wiki/Species/Legends",
  "/wiki/Unidentified_Duros_(Ambush_in_Cloud_City)",
  "/wiki/Cloud_City_chief_engineer",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Unidentified_Twi%27lek_bodyguard",
  "/wiki/Bespin_Wing_Guard/Legends",
  "/wiki/Turbolift/Legends",
  "/wiki/Blast_door/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Sore_Loser%27s_Revenge",
  "/wiki/Wizards.com",
  "/wiki/Eric_Cagle",
  "/wiki/Star_Wars_Miniatures",
  "/wiki/2004",
  "/wiki/Rebel_Storm",
  "/wiki/Lady_Luck_(comic)",
  "/wiki/Lando_Calrissian:_Idiot%27s_Array"
 ]
}