{
 "name": "Unidentified_Mon_Calamari_server",
 "display_name": "Unidentified Mon Calamari server",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unidentified inn"
     ]
    }
   ]
  }
 ],
 "content": "A Mon Calamari server was a worker at an inn at a port on the moon Trask. In 9 ABY, the server saw the Mandalorian Din Djarin to his seat and provided confirmation, upon payment of Calamari Flan, that other Mandalorians had been present at the port, also serving the foundling Grogu some Trask Chowder. The Mon Calamari then introduced Djarin to a Quarren boatman who had seen the other Mandalorians.\nDuring the New Republic's reign, the Mon Calamari worked as a server in an inn at the black market port on the estuary moon of Trask. The server at some point became aware of some Mandalorians which passed through the port in 9 ABY. Soon after, the Mon Calamari was working at the inn when the frog-like alien \"Frog Man\" guided the Mandalorian Din Djarin there. The server, after waving to Frog Man, saw the Mandalorian and his foundling Grogu to a table and asked what they wanted. Djarin only asked for Trask Chowder for Grogu, and the Mon Calamari insisted that whoever was seated must eat.\nThe Mandalorian instead offered Calamari Flan for information on the sighted Mandalorians that had been on Trask. Serving Grogu chowder through a tube, the server confirmed to Djarin that other Mandalorians had passed through the port. Djarin asked if someone could take him to them, and so the Mon Calamari approached a Quarren boatman who had seen the Mandalorians. After learning from the server about Djarin and his business, the Quarren approached the Mandalorian and offered to take him aboard his boat.\nThe server was a Mon Calamari with red skin and orange eyes. The server was insistent that every seated guest at the inn had to eat due to how scarce available seats were. The Mon Calamari accepted information as one such export to allow Djarin to keep his seat after receiving payment from the Mandalorian.\nThe server wore brown clothing with a red scarf and used a tube to serve chowder to patrons at the inn.\nThe Mon Calamari server appeared in \"Chapter 11: The Heiress\" of Jon Favreau's Disney+ series The Mandalorian, which was directed by Bryce Dallas Howard and released on November 13, 2020. Credited as \"Mon Calarmari Server,\" the character was portrayed by Norwood Cheek.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mon_Calamari",
  "/wiki/Color",
  "/wiki/Unidentified_inn_(Trask)",
  "/wiki/Chapter_11:_The_Heiress",
  "/wiki/Moon",
  "/wiki/Trask",
  "/wiki/9_ABY",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Calamari_Flan",
  "/wiki/Foundling",
  "/wiki/Grogu",
  "/wiki/Trask_Chowder",
  "/wiki/Quarren",
  "/wiki/Unidentified_Quarren_boatman",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Era",
  "/wiki/Water",
  "/wiki/Unidentified_frog-like_anthropoid",
  "/wiki/Alien",
  "/wiki/Frog_Man",
  "/wiki/Gender",
  "/wiki/Boat",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Scarf",
  "/wiki/Jon_Favreau",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Bryce_Dallas_Howard",
  "/wiki/November_13",
  "/wiki/2020",
  "/wiki/Norwood_Cheek",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_13:_The_Jedi"
 ]
}