{
 "name": "Unidentified_Old_Jawa",
 "display_name": "Unidentified Old Jawa",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jawa"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unknown Jawa clan"
     ]
    }
   ]
  }
 ],
 "content": "This \"Old Jawa\" was the leader of the Jawa clan, an angry mechanic and a scarred warrior. The clan leader normally used a piece of mechanical equipment as a walking cane.\nThe clan leader severely scolded the mechanic when learning that that mechanic had destroyed the clan's entire stock of droids out of frustration at failing to replair a defect R5 droid. When the clan later salvaged an X-wing, the clan leader decided to have the now depressed mechanic repair it, so the clan could sell the starfighter and profit greatly from it.\nThe clan leader was well informed about the Galactic Civil War, and knew the Darth Vader owned a TIE advanced, so when the clan discovered that a group of salvagers had found a TIE advanced, it theorized that it was Vader's fighter which had been shot down by the Millennium Falcon.\nThe clan leader would later be among the clan members who celebrated the mechanic as a hero when it managed to steal the TIE/LN starfighter from the salvagers.\nThis individual only appears in the story Oh!! Jawajawa, published in Star Wars Manga: Silver issue of Tokyopop's Star Wars Manga. Originally published in Japan, those stories were considered to be of \"fuzzy\" continuity by Lucasfilm. Since then, they have been republished in English in the United Kingdom under Infinities label, which established the material in them as non-canonical.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Jawajawa_clan",
  "/wiki/Unidentified_Jawa_Hero",
  "/wiki/Unidentified_scarred_Jawa",
  "/wiki/Droid/Legends",
  "/wiki/Unidentified_R5_unit_(Jawas)",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/TIE_Advanced_x1/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Oh!!_Jawajawa",
  "/wiki/Star_Wars_Manga:_Silver",
  "/wiki/Tokyopop%27s_Star_Wars_Manga",
  "/wiki/Infinities",
  "/wiki/Canon",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee",
  "/wiki/November_6",
  "/wiki/2006"
 ]
}