{
 "name": "Unidentified_Grysk_commander",
 "display_name": "Unidentified Grysk commander",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Around 0 BBY",
      "aboard a Grysk warship"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Grysk"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Grysk Hegemony",
      "Grysk military",
      "Grysk military"
     ]
    }
   ]
  }
 ],
 "content": "A Grysk male served the Grysk Hegemony, the hegemony of the Grysk warlike species, as a commander around 0 BBY. He led a task force consisting of two Grysk warships and at least a scout ship during the conflict with the Galactic Empire. He led the Hegemony's attack on the Chiss heavy cruiser Steadfast, commanded by Admiral Ar'alani of the Chiss Ascendancy. Using several fighters armed with missiles to destroy the heavy cruiser at first, which were intercepted by plasma spheres from the Steadfast, disabling the fighters. The Chiss, using their ship's tractor beam, attempted to find a weakness in the Grysk starfighters from a fighter that had been brought aboard the Steadfast by the tractor beam. As the Grysk starfighters' electrostatic barriers shifted through a comm switch, Ar'alani returned some of the fighters to create interference, eventually leaving them dead in space.\nAs the Chiss heavy cruiser rushed toward the Grysk warships, the fighters defended the Grysk vessels with their barriers, preventing any acid from the Chiss' breacher missiles—which held acid inside them—from reaching the Grysk hulls. However, as the lead Grysk warship, and the fighters pierced through the Steadfast's hull, twelve TIE/d \"Defenders\" appeared at the battle, attacking the Grysk warships, which prompted the commander to follow Grysk tradition of suicide, destroying both Grysk warships.\nAround 0 BBY, during the conflict between the hegemony of the Grysk warlike species, the Grysk Hegemony, and the Galactic Empire, a male Grysk commander sent a scout ship near the Chiss heavy cruiser Steadfast of the Chiss sentient species' nation of the Chiss Ascendancy, locating the Chiss warship, and going back to hyperspace in seconds. The Grysk then sent two Grysk warships of his task force, including his command ship, to destroy the Chiss. Upon the Grysks' arrival, Admiral Ar'alani, the commander of the Steadfast, warned the Grysk commander and threatened the Grysks with destruction if they continued their operations in Galactic Empire space, recalling the previous defeats, which the Grysk commander considered amusing. The Grysk mocked Ar'alani, asking if Grand Admiral Mitth'raw'nuruodo, who had previously defeated the Grysk Hegemony, ruled in Emperor Palpatine's place. The commander was reminded of the destruction of two warships, which he called as a victory for the Empire, not the Chiss; however, Ar'alani countered stating that the survivors had been interrogated using Chiss interrogation methods. Then, Ar'alani shot a cloaked gravity well projector behind the warships, preventing their escape.\nThe Grysk then dispatched twenty fighters from the lead warship to destroy the Chiss, which were disabled by plasma sphere, making them unable to use their missiles and lasers. However, the Grysks dispatched more and more fighters, which quickly began to damage the Steadfast with their missiles and lasers, piercing through the warship's hull. The Steadfast used its tractor beam on Ar'alani's orders to retrieve one of the disabled fighters, in an attempt to find a weakness. As the Grysk commander switch ed starfighters already in battle with fresh ones, while pulling the fighters back, Mid Commander Tanik then informed his Admiral that the newcomers were undergoing frequency changes in their electrostatic barriers. Undergoing damage from the Grysk missiles, Admiral Ar'alani ordered the Steadfast's crew to give full acceleration to its thrusters, driving toward the Grysk warships as lasers and missiles destroyed the Chiss heavy cruiser's hull.\nThe Grysk fighters began attacking the Steadfast, using their laser cannons, to destroy the Chiss warship and its electrostatic barriers. As the Chiss attacks on the Grysk warships were being thwarted by the fighters, Ar'alani launched a group of missiles with low enough speed to impact on a cluster of fighters, disabling the defenders of the Grysk warships—and allowing the Steadfast to destroy them. As Grysk missiles and lasers pierced the Chiss cruiser's hull, the lead warship was heavily damaged, losing weapon clusters, hull pieces, electrostatic barriers and defenses. Admiral Ar'alani inquired human Lieutenant Eli'van'to if his forces were ready, receiving a confirmation, and shortly after, witnessing twelve TIE/d \"Defenders\" appear and disappear several times as they attacked both Grysk warships. As his task force underwent severe casualties, the Grysk commander followed Grysk tradition and activated the self-destruct mechanisms aboard the Grysk vessels, taking his own life and all others aboard, ending the battle and the conflict with the Galactic Empire.\nThe Grysk male was a capable and arrogant commander, being able to inflict heavy damage on a Chiss heavy cruiser only with fighters.\nThe Grysk commander first appeared in the novel Thrawn: Treason by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Grysk",
  "/wiki/0_BBY",
  "/wiki/Grysk_warship",
  "/wiki/Grysk",
  "/wiki/Gender",
  "/wiki/Grysk_Hegemony",
  "/wiki/Grysk_military",
  "/wiki/Hegemony",
  "/wiki/Species",
  "/wiki/Commanding_officer",
  "/wiki/Unidentified_Grysk_task_force",
  "/wiki/Scout",
  "/wiki/Starship",
  "/wiki/Imperial%E2%80%93Grysk_conflict",
  "/wiki/Galactic_Empire",
  "/wiki/Skirmish_with_Grysk_warships",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Steadfast_(Chiss)",
  "/wiki/Admiral",
  "/wiki/Ar%27alani",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Grysk_starfighter",
  "/wiki/Missile",
  "/wiki/Cruiser",
  "/wiki/Plasma_sphere",
  "/wiki/Starfighter",
  "/wiki/Chiss",
  "/wiki/Tractor_beam",
  "/wiki/Electrostatic_barrier",
  "/wiki/Comm_unit",
  "/wiki/Death",
  "/wiki/Realspace",
  "/wiki/Acid",
  "/wiki/Breacher",
  "/wiki/Hull",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Suicide",
  "/wiki/Self-destruct_mechanism",
  "/wiki/File:Gryskcomm2.ogg",
  "/wiki/Commander",
  "/wiki/Warship",
  "/wiki/Hyperspace",
  "/wiki/Second",
  "/wiki/Command_ship",
  "/wiki/Attack_on_a_Grysk_warship",
  "/wiki/Battle_against_Grysk_forces",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Senior_Captain_Thrawn%27s_last_stand",
  "/wiki/Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Cloaking_device",
  "/wiki/Gravity_well_projector",
  "/wiki/Spectrum_laser",
  "/wiki/Mid_Commander",
  "/wiki/Tanik_(Chiss)",
  "/wiki/Engine",
  "/wiki/Laser_cannon",
  "/wiki/Missile_launcher",
  "/wiki/Weapon",
  "/wiki/Human",
  "/wiki/Lieutenant",
  "/wiki/Eli_N._Vanto",
  "/wiki/Book",
  "/wiki/Thrawn:_Treason",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn:_Treason_(audiobook)",
  "/wiki/Attack_on_Lothal",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Liberation_of_Lothal",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Jedi_Night",
  "/wiki/Standard_day",
  "/wiki/Template:World_Between_Worlds_date"
 ]
}