{
 "name": "Unidentified_clone_sergeant",
 "display_name": "Unidentified clone sergeant",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Teth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Torrent Company",
      "Torrent Company"
     ]
    }
   ]
  }
 ],
 "content": "A clone sergeant served in the 501st Legion during the Clone Wars between the Galactic Republic and the Separatist Alliance. Part of Torrent Company, a company within the 501st, the Clone Sergeant participated in the Battle of Teth in 22 BBY, where he was one of three clone troopers who had blue markings on their clone trooper armor, albeit his were defined and had not been worn down. The sergeant was killed by the end of the battle.\nGrown on the planet Kamino from the DNA of bounty hunter Jango Fett, who became the template of the clones of the Republic Military the clone was a clone trooper in the Grand Army of the Republic during the Clone Wars. Early during the war, he served as a Clone Sergeant in the 501st Legion's Torrent Company, alongside Jedi General Anakin Skywalker, Jedi Commander Ahsoka Tano, and Clone Captain CT-7567 \"Rex.\"\nFollowing the Battle of Christophsis in 22 BBY, Torrent Company and two AT-TEs were deployed to the planet Teth in order to rescue Rotta, Hutt crime lord Jabba Desilijic Tiure's son, so that that the Republic could join an alliance with the Hutt Clan and gain access to vital hyperspace routes into the Outer Rim Territories. The sergeant was onboard the gunship that carried General Skywalker, Commander Tano, Captain Rex, and clone trooper \"Ridge.\" As the gunships neared the B'omarr Order Monastery atop a tall mesa, the contingent of gunships came under Separatist anti-air fire, sustaining minor damage. After the gunships managed to land in proximity to the base of the mesa, Rex ordered all troopers to exit the gunship, including the sergeant.\nAfter the Republic forces scaled the mesa's surface with grappling guns and captured the B'omarr Order Monastery on the planet Teth, the sergeant was one of the clone troopers who accompanied Skywalker, Tano, Captain Rex, and several other clone troopers, including two others with faded blue markings, into the monastery in an attempt to investigate the area. After encountering the secret Separatist operative 4-A7 inside, Skywalker ordered Rex and the others to stay at the entrance of the monastery while he and Tano would go further inside and rescue the Huttlet Rotta. Rex and his troops then moved to the outside of the monastery.\nBy the time Skywalker and Tano found Rotta, the sergeant reported directly to Rex that an observation of the area found that there were no more Separatist droids. Shortly afterwards, however, the Separatists launched a counterattack on the monastery, and the clone troopers moved forward to engage them at the entrance of the courtyard, including the sergeant. Eventually, after the destruction of the sole AT-TE, Republic troops were forced to retreat inside the structure. The sergeant was among the contingent of troopers remaining as General Skywalker relayed orders to the unit with input from Tano. Skywalker and Tano retreated further inside, while the remaining clone forces held the entrance to the monastery. Once Separatist forces breached the doors, a firefight ensued inside and the company sustained heavy casualties. Eventually, the remaining clone forces of Torrent Company were taken prisoner, and by the time that Rex and the surviving clones were held captive in the courtyard, the sergeant had perished.\nAs a clone of the bounty hunter Jango Fett, the sergeant was a human male that stood at 1.83 meters tall, had natural black hair, tan skin, and brown eyes.\nThe clone sergeant made use of Phase I clone trooper armor, which included blue markings. Unlike at least two other clone troopers in his unit, the sergeant's blue markings were well-defined and not worn down. The clone utilized a DC-15A blaster rifle during combat.\nThe clone sergeant first appeared in the 2008 animated film Star Wars: The Clone Wars, where he was voiced by Dee Bradley Baker, who voiced all other clone troopers in the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_clone_sergeant",
  "/wiki/Unidentified_clone_trooper_sergeant_(Teth)",
  "/wiki/Kamino",
  "/wiki/22_BBY",
  "/wiki/Teth",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Torrent_Company",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/501st_Legion",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Company",
  "/wiki/Clone_Sergeant",
  "/wiki/Battle_of_Teth",
  "/wiki/Clone_trooper",
  "/wiki/Clone_trooper_armor",
  "/wiki/Sergeant",
  "/wiki/Death",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Clone_template",
  "/wiki/Republic_Military",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi_Commander",
  "/wiki/Ahsoka_Tano",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Battle_of_Christophsis",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Rotta",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt_Clan",
  "/wiki/Hyperspace_route",
  "/wiki/Outer_Rim_Territories",
  "/wiki/General",
  "/wiki/Commander",
  "/wiki/Captain",
  "/wiki/Ridge",
  "/wiki/B%27omarr_Order_Monastery",
  "/wiki/Gunship",
  "/wiki/Trooper",
  "/wiki/Grappling_gun",
  "/wiki/4-A7",
  "/wiki/Droid",
  "/wiki/Prisoner",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/DC-15A_blaster_rifle",
  "/wiki/2008",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}