{
 "name": "Unidentified_Pyke_traveler",
 "display_name": "Unidentified Pyke traveler",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pyke"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light blue and beige"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "A male Pyke traveler ran the transportation of sansanna spice on a Pyke Syndicate repulsortrain at the planet Tatooine. Travelling through the Dune Sea, the Pykes conflicted with a Tusken Raider tribe, prompting the Tuskens to launch a counterattack. The attack was successful and the hovertrain was crashed, the traveler and his surviving comrades being captured. Boba Fett, a bounty hunter living with the tribe, confronted the traveler and gave new terms to pass on to the syndicate before making the Pykes walk across the Dune Sea for the settlement Anchorhead.\nAround 4 ABY, the male Pyke worked for the Pyke Syndicate on the desert planet Tatooine. He ran the transportation of sansanna spice aboard a repulsortrain which traveled across Tatooine's Dune Sea. The hovertrain's presence came in conflict with the local Tusken Raiders, who laid ancestral claim upon the Dune Sea, and Pyke guards open fired on one such tribe as they passed. However, the tribe began preparing for a counterattack with the help of the bounty hunter Boba Fett. The tribe ambushed the Pyke train when it passed, grounding the hover vehicle and killing many defending Pykes.\nThe Pyke traveler was among those Pykes who survived the attack, and he and his people were rounded up by the Tusken tribe. Sitting before the group, Fett asked who the leader was. The traveler, looking at his peers, walked up to the bounty hunter and removed his helmet, wondering if the tribe was going to kill them. Looking for his own answers, Fett asked if the train was carrying spice, the Pyke pretending that he didn't know what the bounty hunter meant until two Tuskens brought out a crate of sansanna spice. The traveler instead insisted that his people were only trying to protect their route.\nFett set out new terms for the Pykes: they could only pass through the Dune Sea if they paid a toll and any deaths caused by them would be returned ten-fold. Telling the traveler to pass on the terms to his syndicate, the bounty hunter ordered the Pyke prisoners to walk in a single file in the direction of the higher of the two suns, which could lead them to the settlement Anchorhead. The Pyke traveler believed his people would be killed on the journey, but Fett assured them they were under the protection of the Tusken Raiders. Althought the traveler still worried about thirst, the bounty hunter promised a black melon for each of the Pykes as its milk could keep them hydrated. Fett thus advised the Pykes to leave, and the group begun travelling.\nA Pyke male, the traveler had skin which faced from light blue to beige from top to bottom of his head. He attempted to hide the motivations of his people, acting like he did not know what spice was and implying that the Tusken Raiders were the aggressors. When Fett left the Pykes with a journey across the Dunes, traveler showed doubt that his group would make it without protection and hydration, prompting further favors from the bounty hunter.\nThe traveler wore black and yellow robes with black gloves, black boots and a black helmet with an orange metal faceshield.\nThe Pyke traveler appeared in the flashbacks of \"Chapter 2: The Tribes of Tatooine,\" the second episode of the Disney+ series The Book of Boba Fett, which was directed by Steph Green and released on January 5, 2020. Credited as \"Pyke Traveler,\" the character was portrayed by Alfred Hsing. While not credited in the episode itself, Stephen Stanton provided the character's voice, revealing his role on Twitter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Pyke",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Pyke_Syndicate",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Transport",
  "/wiki/Sansanna_spice",
  "/wiki/Pyke_repulsortrain",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Dune_Sea",
  "/wiki/Skirmish_in_the_Dune_Sea",
  "/wiki/Tusken_Raider",
  "/wiki/Raid_on_a_Pyke_repulsortrain",
  "/wiki/Hovertrain",
  "/wiki/Boba_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Anchorhead",
  "/wiki/4_ABY",
  "/wiki/Desert",
  "/wiki/Pyke_guard",
  "/wiki/Death",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Helmet",
  "/wiki/Spice",
  "/wiki/Star",
  "/wiki/Black_melon",
  "/wiki/Milk",
  "/wiki/Glove",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Steph_Green",
  "/wiki/January_5",
  "/wiki/2020",
  "/wiki/Alfred_Hsing",
  "/wiki/Stephen_Stanton",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}