{
 "name": "Unidentified_Jedi_(Endar_Spire)",
 "display_name": "Unidentified Jedi  (Endar Spire)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3956 BBY",
      "Endar Spire",
      "over Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "A Human female Jedi Master served the Jedi Order during the time of the Jedi Civil War in 3956 BBY. She was one of several Jedi who accompanied Jedi Knight Bastila Shan on the Republic Hammerhead-class cruiser Endar Spire when it was ambushed and boarded by a Sith fleet. During the battle, she engaged a Dark Jedi invader in a hallway aboard the vessel. She was able to defeat and kill the man, though the wall section behind her exploded moments later, killing her.\nA Human female was a member of the Jedi Order and a Jedi Master by 3956 BBY. In that year, she accompanied Jedi Knight Bastila Shan on the Republic Hammerhead-class cruiser Endar Spire when it was pulled out of hyperspace over the planet Taris, ambushed, and boarded by a Sith battle fleet led by Darth Bandon.\nDuring the attack, she encountered a Dark Jedi and engaged him in lightsaber combat aboard the Spire. Trask Ulgo and Revan, two Republic crew members who had just entered the hallway, watched the conclusion of the duel, which resulted in the Dark Jedi's demise. However, the Jedi was also killed, moments later, when the wall section she stood beside sustained heavy damage from the Sith fleet and exploded.\nThe Jedi Master had fair skin and blue eyes. She chose to tie her long, black hair back with a red cloth the day she died aboard the Endar Spire.\nAs a member of the Jedi Order, the Jedi wielded a blue lightsaber and wore standard Jedi robes. She was adept enough in lightsaber combat to kill an invading Dark Jedi, while also possessing the knowledge and skills required to become a Jedi Master. However, despite being Force-sensitive, she was unable to predict the explosion that resulted in her death.\nThe Jedi's first and only appearance is as a non-playable character in Star Wars: Knights of the Old Republic, a video game developed by BioWare. After a cutscene featuring her dueling the Dark Jedi ends, the player can explore the area and salvage a vibration cell and adrenal strength stimulant from her remains.\nThe Jedi shares her appearance with one of the possible choices for a female Revan, the player character from Knights of the Old Republic. Should the player choose that particular face during the initial part of the game, the Jedi Master's appearance will change accordingly, taking another of Revan's potential faces at random. Because Revan was canonized as a male, there is no possibility of an overlap should the player decide to play a fully canonically-correct game.\nIt was revealed in the game's official strategy guide that the woman held the rank of Jedi Master. The sentence in the guide acknowledging the duelists mentioned that she was one of \"your own Jedi masters,\" from Revan's perspective.\nA woman identical in appearance to the Jedi may also appear near Forn Dodonna and Vandar Tokare in a light side ending of Knights of the Old Republic during victory celebrations at the Temple of the Ancients after the Battle of Rakata Prime.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3956_BBY",
  "/wiki/Endar_Spire",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Blue",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Hammerhead-class_cruiser",
  "/wiki/Attack_on_the_Endar_Spire",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Fleet/Legends",
  "/wiki/Unidentified_Dark_Jedi_(Endar_Spire)",
  "/wiki/Starship/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Interdiction_field/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Darth_Bandon",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Trask_Ulgo",
  "/wiki/Revan/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Red",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Lehon",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Vibration_cell",
  "/wiki/Adrenal",
  "/wiki/Stimulant/Legends",
  "/wiki/Canon",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Forn_Dodonna",
  "/wiki/Vandar_Tokare",
  "/wiki/Temple_of_the_Ancients",
  "/wiki/Battle_of_Rakata_Prime",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide"
 ]
}