{
 "name": "Unidentified_Twi%27lek_doorman",
 "display_name": "Unidentified Twi'lek doorman",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "A Twi'lek male doorman worked at the Carnita arena when the Mandalorian Din Djarin visited to see the Abyssin gangster Gor Koresh. The doorman let Djarin in, but later helped Koresh's assailants fight the Mandalorian after Koresh attempted to steal Djarin's beskar armor. Djarin defeated the Twi'lek and the rest of Koresh's assailants before intercepting the Abyssin.\nIn 9 ABY, the Twi'lek worked as the doorman to an arena owned by the Abyssin gangster Gor Koresh in a warehouse district. One day, the Mandalorian Din Djarin came to an entrance to the arena, where the Twi'lek stood guard while a fight took place inside, and claimed that he wished to see Koresh. The doorman eyed the Mandalorian's foundling, Grogu, before telling Djarin to enjoy the fights and allowing him through.\nDjarin negotiated with Koresh for information, but the Abyssin and his thugs attempted to steal the Mandalorian's beskar armor. Being held at gunpoint, Djarin used whistling birds to eliminate the thugs before being attacked by more of Koresh's assailants. The Twi'lek doorman grabbed the Mandalorian and held him towards his Zabrak comrade, who threw a punch at Djarin's head. Djarin's head threw back into the Twi'lek as a result, and the Mandalorian dealt two further blows to the doorman, incapacitating him. Djarin then defeated Koresh's remaining assailants and intercepted the Abyssin.\nThe doorman was a Twi'lek male with dark skin and brown eyes. He gave a glance at the infant Grogu when Din Djarin visited the fighting pit.\nThe Twi'lek wore dark colored clothing and robes with yellow features and a brown satchel bag.\nThe Twi'lek doorman appeared in the premiere of the second season of the television series The Mandalorian, which aired on Disney+ on October 30, 2020. Credited as \"Twi'lek Doorman,\" the character was portrayed by Isaac C. Singleton.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Carnita_arena",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Abyssin",
  "/wiki/Gangster",
  "/wiki/Gor_Koresh",
  "/wiki/Beskar",
  "/wiki/Mandalorian_armor",
  "/wiki/9_ABY",
  "/wiki/Warehouse_district_(Carnita_arena)",
  "/wiki/Standard_day",
  "/wiki/Eye",
  "/wiki/Foundling",
  "/wiki/Grogu",
  "/wiki/Whistling_bird",
  "/wiki/Zabrak",
  "/wiki/Clothing",
  "/wiki/Chapter_9:_The_Marshal",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/The_Mandalorian",
  "/wiki/Disney%2B",
  "/wiki/October_30",
  "/wiki/2020",
  "/wiki/Isaac_C._Singleton",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Template:MandoDate",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Chapter_13:_The_Jedi"
 ]
}