{
 "name": "Unidentified_male_Imperial_Knight_(Agamar_corpse)",
 "display_name": "Unidentified male Imperial Knight  (Agamar corpse)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "137 ABY",
      "Agamar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire-in-exile",
      "Imperial Knights",
      "Imperial Knights"
     ]
    }
   ]
  }
 ],
 "content": "A brown-haired Human male was an Imperial Knight in 137 ABY, during the Second Imperial Civil War. In that year, he journeyed with Emperor Roan Fel of the Empire-in-exile to the planet Agamar, serving as one of many bodyguards while Fel conducted peace talks with members of the Jedi Order. When a group of Sith attacked the meeting, the Imperial Knights and Jedi fought back. The brown-haired male was one of several Knights who died during the combat while protecting the Emperor, and a remembrance ceremony was later held to honor him and the rest of the fallen.\nIn 137 ABY, during the Second Imperial Civil War, a Human male with light skin and short brown hair was a member of the Imperial Knights, an order of Force-users loyal to Emperor Roan Fel of the Empire-in-exile. The Emperor traveled to the planet Agamar in that year to conduct peace talks with members of the Jedi Order, and the brown-haired male was one of many Imperial Knights who accompanied Fel as bodyguards. As the Imperial delegation met with several Jedi on Agamar's grassy plains and negotiated an alliance against the Sith Lord Darth Krayt's Empire, the proceedings were interrupted by a group of Sith who ascended from nearby swamps and attacked. The Imperial Knights and Jedi stood together and defended the Emperor, but several of their numbers, including the brown-haired male, died in the melee. Most of the survivors were able to evacuate the battleground in the escape shuttle Defender One.\nThe brown-haired male's corpse lay on the ground with a wound in its forehead. Three days after the attack, the Sith Bokar and Yuln came across it and the corpse of a female Imperial Knight while searching for survivors. Shortly thereafter, Fel held a remembrance ceremony on the Imperial fortress world of Bastion in part to honor all of the Imperial Knights who died on Agamar.\nAs an Imperial Knight, the brown-haired male was part of an organization whose members were considered to be among the most talented and dangerous Force-users in the galaxy. Despite this, he did not survive battle with the Sith on Agamar.\nThe brown-haired male's corpse appeared in a single panel of the forty-eighth issue of the comic series Star Wars: Legacy, which depicted the aftermath of the battle on Agamar. Three months prior, Legacy's forty-fifth issue showed eight Agamarian farmers tending to a field close to the peace talks between the Imperial Knights and Jedi, and in the following issue, five of those farmers shed their robes and revealed themselves to be Imperial Knights in disguise. Although Legacy 48 introduced two additional Imperial Knights who fought in the battle, neither the brown-haired male nor the female whose corpse he lay next to have been explicitly confirmed to have been one of the other three farmers. All three issues were written by John Ostrander and penciled by Jan Duursema.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/137_ABY",
  "/wiki/Agamar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Empire-in-exile",
  "/wiki/Imperial_Knight",
  "/wiki/Legacy_(2006)_48",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Standard_year/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Planet/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Mission_to_Agamar",
  "/wiki/New_Jedi_Order",
  "/wiki/One_Sith",
  "/wiki/Operation:_Thunderstroke",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Funeral/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Grass/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Shuttle/Legends",
  "/wiki/Defender_One",
  "/wiki/138_ABY",
  "/wiki/Sith/Legends",
  "/wiki/Bokar",
  "/wiki/Yuln",
  "/wiki/Unidentified_female_Imperial_Knight_(Agamar_corpse)",
  "/wiki/Imperial_Knight_remembrance_ceremony",
  "/wiki/Fortress_world",
  "/wiki/Bastion/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Legacy_(2006)_45",
  "/wiki/Agamarian",
  "/wiki/Farm/Legends",
  "/wiki/Legacy_(2006)_46",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Legacy_Era_Campaign_Guide"
 ]
}