{
 "name": "Unidentified_light-haired_Imperial_Knight",
 "display_name": "Unidentified light-haired Imperial Knight",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire-in-exile",
      "Imperial Knights",
      "Imperial Knights"
     ]
    }
   ]
  }
 ],
 "content": "A light-haired Human was an Imperial Knight in 137 ABY, and was one of many Knights who accompanied Emperor Roan Fel of the Empire-in-exile to the planet Agamar in that year as he conducted peace talks with representatives of the Jedi Order. Everyone at the site of the negotiations disguised themselves as farmers, and the light-haired Knight joined several other Imperial Knights in pretending to work on a nearby field. After an alliance against Darth Krayt's Galactic Empire was brokered between Fel and the Jedi, a Sith strike team attacked the gathered parties, and the light-haired Knight helped fight them off. The Emperor and most of the Jedi and Imperial Knights were able to escape from the melee and flee the planet.\nIn 137 ABY, a Human with light hair served Emperor Roan Fel of the Empire-in-exile as an Imperial Knight. The Knight was one of many who acted as a bodyguard to the Emperor in that year as he secretly rendezvoused with representatives of the Jedi Order on the planet Agamar. The two groups met on the planet's grassy plains, and every Imperial Knight and Jedi dressed in a farmer disguise. Several Imperial Knight Masters stood with Fel as he and the Jedi Master K'Kruhk negotiated an alliance against the Sith Lord Darth Krayt's Empire; the light-haired Knight and a group of other Imperial Knights stood away from the proceedings and furthered their farmer deception by pretending to tend to a nearby field. After Fel and K'Kruhk struck an agreement, the talks were interrupted by Nyna Calixte—the Director of Imperial Intelligence for Krayt's Empire—who was secretly an ally of Fel's.\nAs she rode a local animal into the field where the light-haired Knight stood, Calixte was knocked to the ground when two Imperial Knights fired blaster rifles at the beast. She told the two groups that Darth Krayt's Sith knew about the meeting, and that a Sith–Imperial task force was en route to Agamar to capture or kill the Emperor. A Sith strike team emerged from nearby swamps, and the Jedi and Imperial Knights jettisoned their farmer disguises as a battle began. When Antares Draco, the leader of the Imperial Knights, called on his Knights to defend their Emperor, the light-haired Knight ignited a lightsaber. Every Jedi and Imperial Knight began to fight off the attacking Sith in an effort to protect Fel, and at least ten Sith fell to their enemies' blades and to Calixte's blaster. Some Jedi and Imperial Knights died as well, but the Emperor and most of the survivors managed to evacuate the battlefield on the escape shuttle Defender One.\nAs an Imperial Knight, the light-haired Knight was part of an order of Force-sensitives whose members were considered to be among the most talented and dangerous Force-users in the galaxy. The Imperial Knights were an organization dedicated to protecting the Emperor and preserving his Empire. On Agamar, the light-haired Knight wore Imperial Knight armor and used the order's standard lightsaber while helping fight off an attacking force of Sith.\nThe light-haired Knight was created by John Ostrander and Jan Duursema for the comic series Star Wars: Legacy and first appeared in its forty-fifth issue, which depicted the character as an Agamarian farmer working in a field. Along with four other Imperial Knights, the light-haired Knight's farmer robes were shed in the following issue and revealed armor and a lightsaber beneath. All five Knights appeared in a single panel of the comic, and it was not revealed if they survived the battle with the Sith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Empire-in-exile",
  "/wiki/Imperial_Knight",
  "/wiki/Legacy_(2006)_46",
  "/wiki/137_ABY",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Planet/Legends",
  "/wiki/Agamar/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mission_to_Agamar",
  "/wiki/New_Jedi_Order",
  "/wiki/Farm/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Jedi/Legends",
  "/wiki/One_Sith",
  "/wiki/Operation:_Thunderstroke",
  "/wiki/Bodyguard/Legends",
  "/wiki/Grass/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/K%27Kruhk",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Morrigan_Corde",
  "/wiki/Director_of_Imperial_Intelligence",
  "/wiki/Agamarian_beast",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sith/Legends",
  "/wiki/First_Sith_Imperial_Strikeforce",
  "/wiki/Death/Legends",
  "/wiki/Antares_Draco",
  "/wiki/Lightsaber/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Defender_One",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Imperial_Knight_armor",
  "/wiki/Imperial_Knight_lightsaber",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Legacy_(2006)_45",
  "/wiki/Agamarian",
  "/wiki/Unidentified_female_Imperial_Knight_(Agamar)",
  "/wiki/Unidentified_male_Imperial_Knight_(Agamar)",
  "/wiki/Unidentified_male_Imperial_Knight_II_(Agamar)",
  "/wiki/Unidentified_male_Imperial_Knight_III_(Agamar)",
  "/wiki/Armor/Legends",
  "/wiki/Legacy_Era_Campaign_Guide",
  "/wiki/Legacy_(2006)_48"
 ]
}