{
 "name": "Unidentified_Tynnan_diplomat",
 "display_name": "Unidentified Tynnan diplomat",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tynnan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "A Tynnan diplomat traveled with Galactic Alliance Admiral Gar Stazi to the planet Kuthard in 137 ABY. While on the planet, the Tynnan fruitlessly attempted to persuade a matriarch of the Dimok to surrender land to the opposing Ripoblus during the Sepan Civil War between the two species.\nA Tynnan male diplomat accompanied Duros Admiral Gar Stazi of the Galactic Alliance and several Coruscant News Network reporters on an observation mission to the world of Kuthard in the Expansion Region's Sepan sector in 137 ABY. The Tynnan traveled with Stazi and the reporters to a Dimok village, where they met with an elderly Dimok matriarch; after asking her about the ongoing Sepan Civil War between her people and the opposing Ripoblus, the reporters promptly moved on, leaving Stazi and his companion to talk to the elder.\nCatching Stazi's eye with a smile, the Tynnan posed several questions to the matriarch concerning her family and proposed that the Dimok hand over a small parcel of her family's land to the Ripoblus to settle an outstanding claim; she vehemently refused, declaring that she would die before doing so. Stazi later recounted the story to Rogue Leader Jhoram Bey via holomessage, using it to illustrate a point that the peoples of the galaxy were predisposed to war.\nThe Tynnan sported gray whiskers and was considered world-weary by Stazi.\nThe Tynnan possessed knowledge of property claims, past atrocities, and peace proposals relative to the locality of the Dimok matriarch's village, and attempted to employ that knowledge while negotiating with her.\nThe Tynnan diplomat was introduced in the reference book The Essential Guide to Warfare, written by Jason Fry and Paul R. Urquhart and published in 2012.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Unidentified_Tynnan_diplomat",
  "/wiki/Tynnan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Admiral/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Planet/Legends",
  "/wiki/Kuthard",
  "/wiki/137_ABY",
  "/wiki/Unidentified_Dimok_crone",
  "/wiki/Dimok_(species)",
  "/wiki/Ripoblus_(species)",
  "/wiki/Sepan_Civil_War",
  "/wiki/Species/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Coruscant_News_Network",
  "/wiki/Journalist/Legends",
  "/wiki/Expansion_Region/Legends",
  "/wiki/Sepan_sector",
  "/wiki/Unidentified_Kuthard_village",
  "/wiki/Eye/Legends",
  "/wiki/Matriarch",
  "/wiki/Death/Legends",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Jhoram_Bey",
  "/wiki/Holomessage/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Color/Legends",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Jason_Fry",
  "/wiki/Paul_R._Urquhart",
  "/wiki/2012",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion"
 ]
}