{
 "name": "Unidentified_Pyke_boss",
 "display_name": "Unidentified Pyke boss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 9 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pyke"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light blue and beige"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Pyke Syndicate"
     ]
    }
   ]
  }
 ],
 "content": "A Pyke male served as the boss of the Pyke Syndicate's operations on the planet Tatooine. After the operations came into conflict with the local Tusken Raiders, a protection fee was demanded for the indigenous people, which the boss's superiors refused as they already paid the Nikto bikers of the Kintan Striders Gang. The Pyke boss discussed the arrangement complications with the ex-bounty hunter Boba Fett, the Tuskens' representative, who promised that the Pykes would not hear from the Nikto bikers again.\nHaving lied to Fett, the boss had the Tusken tribe destroyed and framed the Kintan Striders, which Fett took revenge on. The former bounty hunter later became the Daimyo of Tatooine, but was defied by Mayor Mok Shaiz of the city Mos Espa, who promised the Daimyo's territories to the Pyke Syndicate. The boss thus prepared to usurp Fett, sending the bounty hunter Cad Bane to keep the settlement Freetown from joining the Daimyo and having his own assets bomb the Sanctuary cantina in Mos Espa.\nWorking with the leaders of Mos Espa's three families, the boss staged an attack on the Fett gotra in Mos Espa. However, the forces failed to defeat the gotra and retreated back to the Mos Eisley spaceport where the boss was based. The Pyke informed the leaders of Mos Espa that he was leaving Tatooine, much to their displeasure, when they were interrupted by an attack. With his allies being shot down, the boss fired back and attempted to face the attacker, Fennec Shand. However, Shand stabbed him in the back.\nThe male Pyke was a member of the Pyke Syndicate. Between 4 ABY and 9 ABY, he was the boss of the Pyke's spice trading operations on the Outer Rim desert planet Tatooine, operating from the Desert Survey Office in the Mos Eisley spaceport. During his spice operations, the boss paid protection fees to the Kintan Striders Gang, a local Nikto biker gang, to pass through Tatooine's Dune Sea. However, when their transportation of sansanna spice came into conflict with the Tusken Raiders, the indigenous people of the Dune Sea, a tribe of Tuskens attacked a Pyke repulsor train. The train was caused to crash, and the surviving Pykes were sent back to the boss with a message to pay a toll for the Tuskens.\nIn response to the Tusken retaliation, the boss spoke with his superiors in the Pyke Syndicate, who refused to pay protection fees to multiple parties, wishing not to be taken advantage of. Soon enough, Boba Fett, a former bounty hunter who was representing the Tuskens, traveled to Mos Eisley to visit the Pyke boss and collect protection fees. The boss informed Fett of his superiors' refusal to make double arrangements and their existing deal with the Kintan Striders. The Pyke claimed he was willing to pay either party, but not both, and so Fett promised the Pykes would not hear from the Nikto bikers again. As the ex-bounty hunter turned to leave, the boss stated that he looked forward to their partnership.\nHowever, the boss had lied to Fett, and sent his forces to massacre the Tusken Raider tribe. The Pykes left the symbol of the Kintan Striders behind to frame the biker gang. When Fett found tribe destroyed, he recognized the symbol and fell for the syndicate's ploy, later obliterating the Nikto bikers in what he thought was revenge. After, Fett changed his focus went on to murder Bib Fortuna, the Daimyo of the Tatooine territories, seizing the position for himself and starting his own gotra, the Fett gotra. Fett's newly established rule was met with resistance from multiple figures, including Mayor Mok Shaiz of the city Mos Espa, who chose to promise Fett's territories to the Pyke Syndicate.\nWith Pyke troops gathering in Mos Espa, Mok Shaiz took refuge in the Desert Survey Office with the boss. The Pyke chose to begin his takeover of Fett's territories by bombing the Sanctuary cantina. He also sent the Duros bounty hunter Cad Bane to the settlement Freetown, where Fett's Mandalorian ally Din Djarin had reached out to Marshal Cobb Vanth to help the Daimyo, to make sure the people there would not interfere with the Pykes. The Duros gunned down Vanth as a message to the residents of Freetown to stay neutral.\nWhen Bane returned to the Desert Survey Office, the Pyke boss, breaking from his conversation with Shaiz, commended how quick the bounty hunter had been. After Bane confirmed that Vanth would be staying neutral in the war against Fett, Shaiz questioned if there was any other assets Fett had, mentioning his old Tusken tribe. The boss explained to the mayor that the Pykes had dealt with the tribe themselves and framed the Kintan Striders. Shaiz asked when the Pyke Syndicate's war with Fett would be over and expressed displeasure with the bombing of the Sanctuary as he had not signed up for open warfare. The boss apologized for crossing the line with his deal with the mayor and revealed his intelligence that Fett was taking refuge in the cantina's ruins, Bane adding that he had an idea to draw the Daimyo out.\nAs part of the Pyke boss's plan to take over Mos Espa, he made a deal with the leaders of the three ruling families to betray Fett and break a deal of neutrality they had made with the Daimyo. While soldiers from the three families turned on Fett's forces, Pyke forces advanced on the Sanctuary, and a battle eventually broke out. Unfortunately for the boss, half of his forces were killed in battle and were forced to retreat. Back at the Desert Survey Office, the Pyke spoke with Shaiz and the three family dons, informing them that his remaining forces were recalling to Mos Eisley for a withdrawal from Tatooine. Two of the family leaders angrily contested the Pyke boss as he had a deal with them, but the boss added that the deal required for Tatooine to be hospitable for the Pyke Syndicate's business, citing the Pykes' losses at the battle in Mos Espa when Shaiz argued that it was hospitable.\nThe group was then interrupted by the sound of blaster shooting outside, and the boss called to his door guards, drawing his blaster pistol when no response came. That was when blaster fire came from above, killing the three family leaders and the room's two Pyke guards. Shaiz was then snared by a grappling line which strangled him to death. Being the only one left alive, the Pyke shot above him and looked around, spotting a silhouette through a window. However, the attacker, Fett's assassin, Fennec Shand, sneaked behind the boss and stabbed him in the back, killing him.\nA Pyke male, the boss had light blue and beige skin with black eyes. When faced with a potentially deadly situation, the esteemed boss preferred to soothe out differences and find solutions that wouldn't disrupt his criminal enterprise, and he retaliated to the Tusken tribe by destroying them in order to protect his business. The boss chose to frame the Kintan Striders for the atrocity in order for Boba Fett to enact his revenge on the Nikto bikers rather than the Pyke Syndicate, all while appearing to welcome partnership with Fett. Although Mayor Mok Shaiz did not want open warfare in Mos Espa, the Pyke regardless authorized a bombing at the Sanctuary cantina, going on to apologize to the mayor for it after. After the Pyke Syndicate forces were bisected in their battle for the city, the boss decided to cut his losses and abandon Tatooine, seeing it as no longer hospitable for the syndicate.\nThe Pyke boss wore a blue robes with golden patterns as well as black gloves and trousers. He also wielded a blaster pistol.\nThe Pyke boss appeared in the flashbacks of \"Chapter 3: The Streets of Mos Espa,\" the third episode of the television series The Book of Boba Fett, which released on Disney+ on January 12, 2022. Credited as \"Pyke Boss\" he was voiced by Phil LaMarr, with Jamie Alexander being the performance artist for the character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/9_ABY",
  "/wiki/Tatooine",
  "/wiki/Pyke",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Pyke_Syndicate",
  "/wiki/Planet",
  "/wiki/Raid_on_a_Pyke_repulsortrain",
  "/wiki/Tusken_Raider",
  "/wiki/Nikto",
  "/wiki/Speeder_bike",
  "/wiki/Kintan_Striders_Gang",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Daimyo",
  "/wiki/Mayor_of_Mos_Espa",
  "/wiki/Mok_Shaiz",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Cad_Bane",
  "/wiki/Freetown",
  "/wiki/Bombing_of_the_Sanctuary",
  "/wiki/Sanctuary",
  "/wiki/Cantina",
  "/wiki/Battle_for_Mos_Espa",
  "/wiki/Fett_gotra",
  "/wiki/Gotra",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Assassination_of_the_Pyke_Syndicate_leaders",
  "/wiki/Fennec_Shand",
  "/wiki/4_ABY",
  "/wiki/Spice",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Desert",
  "/wiki/Desert_Survey_Office",
  "/wiki/Dune_Sea",
  "/wiki/Transport",
  "/wiki/Sansanna_spice",
  "/wiki/Skirmish_in_the_Dune_Sea",
  "/wiki/Unidentified_Tusken_Raider_tribe",
  "/wiki/Tatooine_repulsor_train",
  "/wiki/Kintan",
  "/wiki/Massacre_of_a_Tusken_Raider_tribe",
  "/wiki/Attack_on_the_Kintan_Striders",
  "/wiki/Bib_Fortuna",
  "/wiki/War_for_Tatooine",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Duros",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Marshal",
  "/wiki/Cobb_Vanth",
  "/wiki/Pyke_sentinel",
  "/wiki/Blaster_pistol",
  "/wiki/Grappling_line",
  "/wiki/Death",
  "/wiki/Assassin",
  "/wiki/Eye",
  "/wiki/Glove",
  "/wiki/Blaster",
  "/wiki/Pistol",
  "/wiki/Chapter_3:_The_Streets_of_Mos_Espa",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Disney%2B",
  "/wiki/January_12",
  "/wiki/2022",
  "/wiki/Phil_LaMarr",
  "/wiki/Chapter_7:_In_the_Name_of_Honor",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Krrsantan",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Chapter_2:_The_Tribes_of_Tatooine",
  "/wiki/Chapter_6:_From_the_Desert_Comes_a_Stranger"
 ]
}