{
 "name": "Unidentified_Imperial_freighter_pilot",
 "display_name": "Unidentified Imperial freighter pilot",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Trask"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gideon's Imperial remnant"
     ]
    }
   ]
  }
 ],
 "content": "A human male freighter pilot served in a Galactic Empire remnant led by Moff Gideon, holding the rank of lieutenant. He served on an Imperial Gozanti-class Assault Carrier, which was attacked above the moon Trask in 9 ABY by four Mandalorians led by Bo-Katan Kryze.\nThe pilot was told by his captain to pull his ship out of Trask's airspace prior to clearing the local harbor's boundaries. After the ship's deck officer was killed by the Mandalorians, the pilot was present for a discussion between the ship's captain and Gideon. After receiving new orders the captain shot the freighter pilot.\nDuring the reign of the New Republic, the freighter pilot served in Moff Gideon's remnant of the Galactic Empire, having the rank of lieutenant. In 9 ABY, he piloted an Imperial Gozanti-class Assault Carrier, alongside a security officer. One day, the Gozanti assault carrier began departing the estuary moon Trask when it was attacked by four Mandalorians. The captain of the assault carrier made his way to the bridge and the security officer filled him in just before a stormtrooper fell onto the bridge window. Thus the captain had the freighter pilot seal the the bridge.\nThe Mandalorians made it inside the Gozanti-class Assault Carrier and proceeded to eliminate defending stormtroopers. The three officers at the bridge listened to reports before the stormtrooper over the comm was killed. The captain then asked the freighter pilot how long it would be until the Gozanti cruiser could escape into hyperspace. The pilot replied that the cruiser could not ascend until it left Trask's harbor zone, but the captain had him and the security officer begin the ascent immediately.\nThe freighter pilot listened as the Imperial deck officer failed to hold off the Mandalorians and when the Mandalorians' leader Bo-Katan Kryze exchanged with the bridge, threatening to capture the Gozanti-class Assault Carrier. The captain contacted Gideon in front of the freighter pilot, requesting immediate backup. Hearing the severity of the Gozanti assault carrier's situation, Gideon implicitly ordered the captain to destroy the assault carrier. The pilot and the security officer exchanged glances in fear, and the captain complied with the moff, shooting the pair with his blaster. The captain then attempted to crash the Gozanti-class Assault Carrier but was stopped by the Mandalorians.\nThe freighter pilot was a human male with light skin, brown eyes, and black hair. He retained a neutral expression while at his post aboard the Gozanti-class Assault Carrier, but gave a fearful glance at the security officer when hearing Moff Gideon give new orders to the captain.\nThe pilot wore the standard uniform of an Imperial naval officer, including an Imperial kepi and two code cylinders attached below each shoulder. He wore a rank insignia plaque on his left breast with two red bars above two blue, which signified the rank of lieutenant.\nThe pilot appeared in \"Chapter 11: The Heiress\" of Jon Favreau's 2019 Disney+ television series The Mandalorian, directed by Bryce Dallas Howard and released on November 13, 2020. Credited as \"Freighter Pilot,\" he was played by Alexander Wraith.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_ABY",
  "/wiki/Trask",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Gideon%27s_Imperial_remnant",
  "/wiki/Chapter_11:_The_Heiress",
  "/wiki/Galactic_Empire",
  "/wiki/Moff",
  "/wiki/Gideon",
  "/wiki/Military_rank",
  "/wiki/Lieutenant",
  "/wiki/Unidentified_Gozanti-class_Assault_Carrier",
  "/wiki/Assault_on_the_Imperial_Gozanti_freighter",
  "/wiki/Moon",
  "/wiki/Mandalorian",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Pilot",
  "/wiki/Unidentified_Imperial_captain",
  "/wiki/Unidentified_Imperial_deck_officer_(Trask)",
  "/wiki/Death",
  "/wiki/Captain",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Freighter",
  "/wiki/Unidentified_Imperial_security_officer",
  "/wiki/Standard_day",
  "/wiki/Imperial_Gozanti-class_cruiser",
  "/wiki/Water",
  "/wiki/Carrier",
  "/wiki/Bridge_(starship)",
  "/wiki/Security_officer",
  "/wiki/Stormtrooper",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Imperial_officer",
  "/wiki/Hyperspace",
  "/wiki/SE-14r_light_repeating_blaster",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Clothing",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Breast",
  "/wiki/Jon_Favreau",
  "/wiki/2019",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Bryce_Dallas_Howard",
  "/wiki/November_13",
  "/wiki/2020",
  "/wiki/Alexander_Wraith",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Template:MandoDate",
  "/wiki/Star_Wars_Rebels:_Spark_of_Rebellion"
 ]
}