{
 "name": "Unidentified_stormtrooper_(Apocalypse_Endor)",
 "display_name": "Unidentified stormtrooper  (Apocalypse Endor)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Tempest Force",
      "Stormtrooper Corps",
      "Tempest Force"
     ]
    }
   ]
  }
 ],
 "content": "A stormtrooper was the leader of a platoon assigned to the forest moon of Endor. Years later, he reminisced about his time on Endor in a bar.\nPrior to 4 ABY, the stormtrooper, in charge of a platoon, was assigned to Endor while the Empire constructed the Death Star II in orbit of the moon. He and his platoon were sent to make contact with the native Ewoks. When one of the Ewoks stuck a flower in the barrel of one of the troopers's blasters, the platoon leader misinterpreted it as the Ewoks trying to jam their weapons and ordered the troops to open fire. After this, the Ewoks began attacking the Imperials at night. The stormtrooper and his fellow troops feared the Ewoks as they killed the Imperials one by one using guerilla tactics, including his squad member, Kovacs, and beat their drums outside their sleeping quarters at night.\nThe stormtrooper was happy to finally be able to fight Rebels during the Battle of Endor in 4 ABY. During the battle, he and his platoon were assigned to hold a clearing. In the trees above, the Ewoks began dropping large rocks onto the Imperials. Two of the troops stumbled into a pitfall trap and were impaled by spikes on the bottom. When the Ewoks began shooting arrows at them, the platoon leader ordered his troops to retreat. By the end of the battle, he was happy to be taken prisoner by the Rebels, as it meant getting away from the Ewoks.\nEventually, he was released from captivity and visited an unnamed cantina, relating his story to other bar patrons. His only consolation about the Battle of Endor was that the explosion of the Death Star II must have caused a deadly rain of debris on the Ewoks, but one bar patron informed him that was just a myth.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Tempest_Force",
  "/wiki/Apocalypse_Endor",
  "/wiki/Platoon_Leader",
  "/wiki/Platoon/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Endor/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Kovacs",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Endor_strike_team/Legends",
  "/wiki/Endor_disaster",
  "/wiki/Star_Wars_Tales_14"
 ]
}