{
 "name": "Unidentified_Twi%27lek_majordomo_(Vogga)",
 "display_name": "Unidentified Twi'lek majordomo  (Vogga)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Vogga"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Vogga"
     ]
    }
   ]
  }
 ],
 "content": "A male Twi'lek was a majordomo who served Vogga the Hutt on Nar Shaddaa. His primary duties seemed to lie in providing Vogga with adequate entertainment by recruiting humanoid females to work as dancers.\nThe majordomo had been in service to Vogga for a number of years, and once recruited a familial relation of his own to dance for Vogga. Unfortunately, the new dancer would displease Vogga so much that he had her fed to his Kath Hounds. Vogga made sure the Domo knew he was being held solely responsible and ordered him to find him another dancer. The Domo would then begin holding auditions in the Cantina of the Entertainment Promenade next to the Pazaak Den, but was continually dissappointed by what he viewed as subpar dancing. However, as he was about to give up, he was approached by the human female Meetra Surik. The Domo was quite pleased with this turn of events, considering Surik beautiful enough for Vogga's tastes. He immediately offered her a position as one of Vogga's dancers, but Surik instead questioned him about his master. Sensing an opportunity to impress the young woman, the Domo described Vogga as one of the most influential Hutts on the smuggler's moon, and also mentioned his master's fuel shipping business on Sleheyron. Surik, who was interested in meeting Vogga to negotiate on behalf of Citadel Station, then agreed to dance for Vogga. Elated, the Domo informed her that before he could bring her before Vogga, he required her to change into a dancer's costume and perform for him to ensure her skills were enough. When Surik tentatively inquired concerning the outfit, the Domo hurriedly attempted to brush off her concerns, worried that she would back out. In the end, the Domo was sufficiently impressed with Surik's dancing and brought her before Vogga to dance.\nWhen Surik danced for Vogga, the Hutt became tired and fell asleep. The Domo apologized, explaining that Vogga often became drowsy watching dancers. He thanked her for her services and paid her a large sum of credits and allowed her to keep the dancing costume as a gift before leaving to attend to \"other matters.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Vogga",
  "/wiki/Nar_Shaddaa",
  "/wiki/Meetra_Surik",
  "/wiki/Sleheyron/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords"
 ]
}