{
 "name": "Unidentified_Quarren_informant",
 "display_name": "Unidentified Quarren informant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Senate Guard"
     ]
    }
   ]
  }
 ],
 "content": "A male Quarren informant worked for the Senate Guard in 32 BBY. He infiltrated the Black Heth gang on the planet of Coruscant but was discovered and captured. The Jedi Padawan Obi-Wan Kenobi was sent to rescue the informant from the construction site he was being held at. At the beginning of his infiltration, Kenobi was contacted by his Jedi Master, Qui-Gon Jinn, who cautioned the younger Jedi to not raise any alarms, as the Black Heth might kill the informant; Kenobi could monitor the informant on his comlink. Kenobi then fought his way down into the facility, eliminating the Black Heth thugs and their droids before they could set off an alarm. At the time, the Quarren was being interrogated to discover his identity. Kenobi was able to rescue the informant before his impending execution. The informant thanked the young Jedi and reported that the Black Heth was importing weapons. The two then left the facility.\nThe Quarren was referred to as a \"brave friend\" by Master Jinn.\nThe Quarren informant appears in the 2001 video game Star Wars: Obi-Wan during the game's first chapter in the mission The Informant. The player, in the guise of Kenobi, must infiltrate the Black Heth warehouse and rescue the informant. If the player fails to subdue the guards before they trigger an alarm, the Black Heth executes the informant and the mission fails. In the game, the Quarren informant is said to be working for the Coruscant Guard.\nThe character was credited as \"Coruscant Informer\" and was voiced by Joe Paulino.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Quarren",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Senate_Guard/Legends",
  "/wiki/Star_Wars:_Obi-Wan",
  "/wiki/32_BBY/Legends",
  "/wiki/Black_Heth",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Skirmishes_on_Coruscant",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Death/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Droid/Legends",
  "/wiki/2001",
  "/wiki/Video_game",
  "/wiki/Coruscant_Guard/Legends",
  "/wiki/Joe_Paulino",
  "/wiki/Obi-Wan:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars_Gamer",
  "/wiki/State_of_the_Arts",
  "/wiki/Star_Wars_Gamer_8",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}