{
 "name": "Unidentified_head-bumping_stormtrooper",
 "display_name": "Unidentified head-bumping stormtrooper",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "This stormtrooper was a Human clone with the Imperial Stormtrooper Corps during the early part of the Galactic Civil War. He was stationed aboard the original Death Star as part of the battlestation's guard contingent in 0 BBY, just prior to the Battle of Yavin. He was part of a squad of troopers dispatched to the gantry office above Docking Bay 327, where he and the others encountered the droids R2-D2 and C-3PO. Shortly afterwards, the Alliance to Restore the Republic attacked and destroyed the Death Star over the Yavin system.\nWhen Imperial forces discovered an incursion on the first Death Star, the Empire learned that a security control center overlooking Docking Bay 327 had strangely been locked. This stormtrooper was among a squad that had been dispatched to investigate. The squad's leader was eventually able to open the door, but as the group barged in, the head-bumping stormtrooper did not account for his height and the low clearance that the entrance presented. As a result of his helmet's poor field of vision, the stormtrooper knocked his head on the door, slowing his advance. Two droids, R2-D2 and C-3PO, were discovered in the room alongside the bodies of a gantry officer and his aide, but they were thought to be Imperial property. The stormtroopers then left the room, directed by the droids to the prison level to chase after the \"madmen\" who had attacked the officer. A short time later, the Battle of Yavin occurred, during which the Alliance to Restore the Republic launched an attack on the Death Star over the Yavin system, and successfully destroyed the battlestation.\nThe head-bumping stormtrooper first appeared in Star Wars: Episode IV A New Hope, . The actor playing the trooper inadvertently bumped his head on a door frame while entering his scene.\nLaurie Goode recalls bumping his head on set as a Stormtrooper, leading many to believe that he may be the unidentified head-bumping stormtrooper. Michael Leader also recalls a similar event, and when the actor died in 2016, at least one media obituary identified him as the stormtrooper actor. As a result, the true identity of the stormtrooper remains uncertain.\nOne of the most visible gaffes from Star Wars Episode IV: A New Hope, the \"head-bumping stormtrooper\" mistake has been highlighted by Lucas years after the initial release of the film. In 2002's Star Wars: Episode II Attack of the Clones, George Lucas paid homage to the scene by having Jango Fett bump his head on the low clearance door of the Slave I. In the 2004 DVD re-release of the original trilogy, the \"head-bumping stormtrooper\" bump was enhanced with an obvious sound effect to draw more attention to the gaffe. Although Lucas implies this stormtrooper was a clone of Jango Fett, the stormtrooper did not share Fett's voice or accent when speaking.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wanten",
  "/wiki/Unidentified_head-bumping_stormtrooper",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/0_BBY/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Docking_Bay_327/Legends",
  "/wiki/Droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/C-3PO/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Yavin_system/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Gantry_officer/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Time/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/1977",
  "/wiki/Laurie_Goode",
  "/wiki/Michael_Leader",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Slave_I/Legends",
  "/wiki/2004",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Wonder_Column",
  "/wiki/Star_Wars_Insider_31",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Imperial_Icons",
  "/wiki/Star_Wars_Insider_148",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/George_Lucas",
  "/wiki/October_1",
  "/wiki/2019",
  "/wiki/August_26",
  "/wiki/2016",
  "/wiki/September_11",
  "/wiki/2020",
  "/wiki/Star_Wars_Trilogy_(DVD)"
 ]
}