{
 "name": "Unidentified_Near-Duros",
 "display_name": "Unidentified Near-Duros",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Keyorin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lemo and Sanda's gang"
     ]
    }
   ]
  }
 ],
 "content": "This Near-Duros criminal was a member of Lemo and Sanda's gang.\nAround 3 ABY, this criminal was shocked to see Chewbacca enter the gang's base, apparently puzzled to see a Wookiee on Arcan IV. When \"Captain Drebble,\" Lando Calrissian in disguise, also entered the base, the Near-Duros backed up his leaders, Lemo and Sanda, as they confronted the cocky captain. After Koruu confronted the stranger and was abruptly killed, the Duros was in shock, but he still stayed with the gang when they fetched the Wookiee and \"Drebble\" at the Arcan IV Spaceport to take them to dinner.\nWhen \"Drebble\" slipped up during dinner and revealed his real identity as Lando Calrissian, the Near-Duros pulled his weapon on the Rebel. However, Chewbacca was able to rescue his friend by swinging his bench at the gang, striking the Near-Duros and throwing him across the room. He was able to recover though, joining Lemo and Sanda in their hover car as they chased Chewbacca and Calrissian back to the Spaceport. Unfortunately for the criminal, during the chase, Chewbacca was able to jump into their craft, throwing all the individuals from the moving vehicle.\nSometime later, after the Battle of Endor, the Near-Duros was on Keyorin, the \"Hunter's World,\" when he spotted Han Solo, \"Captain Drebble,\" and his Wookiee companion alongside Han Solo. As the three exited Barpotomous Drebble's tavern, the Near-Duros and his bald companion began to chase the trio down the street. The three Rebels were also being chased by bounty hunters under the employ of Barpotomous Drebble, and the Near-Duros was unable to catch the group before they were stunned by Drebble's group. The two gang members were able to convince Drebble to turn Solo and Chewbacca over to them, and they brought the two back to Lemo and Sanda.\nAfter hanging Solo and Chewie by energy binders, Lemo interrogated the two about the whereabouts of the Dancing Goddess, a statue that the gang had been searching for. Solo convinced the gang that \"Captain Drebble\" actually had the statue, and the group immediately left to confront Barpotomous and his prisoner \"Captain Drebble.\" However, at the same time, Solo and Chewie escaped from their energy binders and opened fire on Lemo and Sanda's gang. In the brief firefight that ensued, Barpotomous Drebble's bounty hunters caught the gang in a crossfire. As the gang was quickly destroyed, the Near-Duros was killed by IG-88A.\nIn one scene near the end of \"The Big Con,\" where Chewbacca is about to jump into Lemo and Sanda's car, the Near-Duros can be seen in profile. The profile picture seems to show the criminal with something of a nose. In \"The Hero,\" one panel also seems to show the Near-Duros with ears.\nIn \"The Hero,\" the skin color of the Near-Duros seems to alternate from yellow to green, perhaps indicating that the pirate is actually a full Duros, but only with several artistic errors surrounding his appearance and skin color.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Keyorin",
  "/wiki/Near-Duros",
  "/wiki/Gender/Legends",
  "/wiki/Lemo_and_Sanda%27s_gang",
  "/wiki/Star_Wars_(1977)_79",
  "/wiki/3_ABY/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Lemo_and_Sanda%27s_den",
  "/wiki/Wookiee/Legends",
  "/wiki/Arcan_IV",
  "/wiki/Captain/Legends",
  "/wiki/Barpotomous_Drebble/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Lemo",
  "/wiki/Sanda",
  "/wiki/Koruu",
  "/wiki/Arcan_IV_Spaceport",
  "/wiki/Hover_car",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Barpotomous_Drebble%27s_tavern",
  "/wiki/Unidentified_bald_pirate",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Energy_binders",
  "/wiki/Dancing_Goddess/Legends",
  "/wiki/IG-88A/Legends",
  "/wiki/Star_Wars_(1977)_85"
 ]
}