{
 "name": "Unidentified_Mandalorian_police_officer",
 "display_name": "Unidentified Mandalorian police officer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.88 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorian police",
      "Almec's smugglers"
     ]
    }
   ]
  }
 ],
 "content": "This officer was a part of the Mandalorian Guard and a part of Prime Minister Almec's team of smugglers.\nAround 21 BBY, Jedi Knight Anakin Skywalker and his Padawan, Ahsoka Tano, were called to Mandalore to investigate a corruption case. Tano was given the task of looking into the matter, and with help from a few cadets from the Royal Academy of Government of Sundari, they discovered Almec's involvement in the black market conspiracy. She then brought the cadets to the Prime Minister, accusing them of the black market conspiracy and claiming that the Duchess of Mandalore, Satine Kryze was their leader. The cadets were later imprisoned and this guard along with another guard were guarding them. However, Almec was a bit suspicious of Tano and alerted the guard to report to him of any suspicious activities. Almec's suspicion proved right as it was all a plan to expose Almec's activities. When Tano used a mind trick on this guard into taking her to the captured Satine, the other guard activated a homing beacon and followed this guard and Tano to the detention facility where Satine was being kept. When Ahsoka was going to 'interrogate' Satine, the other guard questioned her and Ahsoka applied a mind trick on him too. However, the guard having being trained to resist mind tricks, pretended to fall under the trick and allowed her to release Satine. But Almec soon arrived, flanked by many officers and ordered the two guards to stop acting. When Almec tried to force Satine into signing a confession paper but Ahsoka broke free of the guards grip and a little scuffle ensued in which the police officer along with his comrades and Almec were overpowered and arrested.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Mandalorian",
  "/wiki/Mandalore/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mandalorian_Guard/Legends",
  "/wiki/Almec/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Prime_Minister/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Knight",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Royal_Academy_of_Government",
  "/wiki/Duke/Legends",
  "/wiki/Satine_Kryze/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Academy",
  "/wiki/Star_Wars_Annual_2011"
 ]
}