{
 "name": "Unidentified_Tarisian_noble",
 "display_name": "Unidentified Tarisian noble",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "This male Human was a Tarisian noble. Among his ancestors was a member of one of the founding houses of the planet Taris.\nAfter Revan gives Christya 20 credits to buy the two of them drinks, she goes talking with this noble, he begins to brag to her about his rich heritage. Eventually, the two of them leave the cantina together, leaving Revan 20 credits short.\nThis noble's first canonical appearance was as a non-player character in the Star Wars: Knights of the Old Republic video game, in which the player, Revan, can interact with him. However, the nature of the conversation is such that it does not progress any plot, nor does it change the player's alignment. Therefore, it is undetermined whether Revan ever interacted with him at all.\nThe same noble also appears in Davik Kang's estate when the player is there at the same time, however, the player can persuade the noble not to take action for him entering his room, the noble is convinced that he works for Davik Kang, so gives the player a 5 credit tip, but the player can later choose to reveal himself to the noble, resulting in the noble attacking the player, resulting in the noble's death.\nHowever, if the noble has already interacted with Christya in the Cantina, his corpse is left on the floor in his room when the player opens the door to his room, not holding any remains for the player to take.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Christya",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Canon",
  "/wiki/Video_game",
  "/wiki/Davik_Kang%27s_estate",
  "/wiki/Davik_Kang",
  "/wiki/Death/Legends"
 ]
}