{
 "name": "Unidentified_stormtrooper_(Timira_City)",
 "display_name": "Unidentified stormtrooper  (Timira City)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "A Human male enlisted stormtrooper served in the special forces as an elite soldier of the Galactic Empire. By 1 BBY, he was part of the Imperial garrison in Timira City, a Kaminoan cloning facility located on the planet Kamino. His superior officer was Commander Cody, a veteran of the Clone Wars and a former clone trooper who deeply resented non-clone enlisted soldiers.\nThe Human male who was stationed on Kamino after enlisting as a stormtrooper was assigned to Commander Cody's battalion. As a major source of the clone stormtroopers who were created to serve the Galactic Empire, a large Imperial garrison was established on Kamino in order to protect the planet's vital cloning facilities. This enlisted trooper was stationed on the Timira City Cloning Facility where his main activities consisted of guard and patrol duties.\nWhen the Rebel Alliance dispatched a fleet of warships to assault Kamino in a surprise attack, the enlisted trooper and his comrades were ultimately unable to repel the invasion. The Assault on Kamino became a major early triumph for the fledgling Rebellion in the Galactic Civil War; the Imperial casualties were heavy, Timira City was destroyed, and the Sith Lord Darth Vader was taken prisoner by Jedi General Rahm Kota, who was assisted by a rogue clone of the late Galen Marek.\nThis enlisted stormtrooper regarded Timira City as a miserable detail to be assigned to. Given the rarity of an attack on a major Imperial military installation site and the planet's constant rainstorms, the trooper dismissed Kamino as an inhospitable location, if not a boring one as well. Forced to frequently patrol Timira City on Commander Cody's orders, the trooper developed a particular loathing for Kamino's rainy climate. His lack of enthusiasm with the Kaminoans' homeworld reflected the general attitude of other Imperial soldiers and the low troop morale that they experienced.\nThe unidentified enlisted stormtrooper was first referenced in the databank of the 2010 LucasArts video game Star Wars: The Force Unleashed II. His personal thoughts on his assignment in Timira City can be found in the \"Timira City Cloning Facility\" profile.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Star_Wars:_The_Force_Unleashed_II",
  "/wiki/Stormtrooper/Legends",
  "/wiki/1_BBY/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Timira_City",
  "/wiki/Kaminoan/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Commander/Legends",
  "/wiki/CC-2224/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Battalion/Legends",
  "/wiki/Clone_stormtrooper",
  "/wiki/Trooper/Legends",
  "/wiki/Timira_City_Cloning_Facility",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Warship/Legends",
  "/wiki/Assault_on_Kamino",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Rahm_Kota/Legends",
  "/wiki/Subject_1138",
  "/wiki/Death/Legends",
  "/wiki/Galen_Marek",
  "/wiki/Homeworld/Legends",
  "/wiki/2010",
  "/wiki/LucasArts",
  "/wiki/Video_game",
  "/wiki/PlayStation_3",
  "/wiki/Xbox_360",
  "/wiki/The_Force_Unleashed_II_(novel)"
 ]
}