{
 "name": "Unidentified_Chadra-Fan",
 "display_name": "Unidentified Chadra-Fan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Sullust"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chadra-Fan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Sullustan resistance"
     ]
    }
   ]
  }
 ],
 "content": "A male Chadra-Fan was a member of the Sullustan resistance, a rebel cell on Sullust. On the day of the Battle of Hoth, its ship, the Keepsake was stormed by a squad of stormtroopers. They found the Chadra-Fan but it set off a detonator that killed him and most of the stormtroopers.\nThe Chadra-Fan was a member of the Sullustan resistance, a group of rebel operatives, led by Nien Nunb, that had formally come to Sullust to help the Cobalt Laborers' Reformation Front before its militant members were detained. He was aboard a Corellian Engineering Corporation VCX-150 freighter called the Keepsake and following an attack on the Inyusu Tor mineral processing facility, the Imperial Security Bureau managed to affiliate the ship with the Sullustan resistance and sent at least a dozen stormtroopers to search it. The Chadra-Fan hid in a small space behind a conduit access panel and as stormtroopers searched around the ship, one of them, SP-156, split from them to investigate the panel. The other stormtroopers aimed their blasters at the conduit, and 156 hit the panel out of place with the butt of his rifle. He then took the metal sheet away, revealing the Chadra-Fan to the squad.\nThe squad leader, SP-113, asked him where Nien Nunb and the other Sullustan resistance members were, to which the Chadra-Fan told them they were in the city, wishing him good luck on finding them. 113 then asked about the contacts the Sullustan resistance had on Sullust and the Chadra-Fan laughed, saying that the stormtroopers had the people so scared that they refused to help in anyway. The Chadra-Fan further stated that the Sullustan resistance was indeed behind the attack on the factory, but worked alone. 113 told his stormtroopers to take him into custody and one of them suddenly discovered a detonator with him. It exploded, killing him and most of the squad. Among the survivors were 113 and SP-475.\nThe individual was a male Chadra-Fan with brown fur and skinny legs. It was brave enough to be one of the few people on Sullust to be resisting the Empire. When they finally captured him, he wasn't afraid to reveal the obvious facts about the Sullustan resistance and laughed doing so.\nThe Chadra-Fan owned a VCX-150 freighter called the Keepsake, which had over half a dozen rooms in it. He also had a detonator, which he used to kill himself and most of the squad of stormtroopers that found him.\nThe Chadra-Fan first appeared in the novel Battlefront: Twilight Company, written by Alexander Freed and released in June 28 2016.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Chadra-Fan_(disambiguation)",
  "/wiki/3_ABY",
  "/wiki/Sullust",
  "/wiki/Chadra-Fan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Sullustan_resistance",
  "/wiki/Battle_of_Hoth",
  "/wiki/Keepsake",
  "/wiki/Stormtrooper",
  "/wiki/Nien_Nunb",
  "/wiki/Cobalt_Laborers%27_Reformation_Front",
  "/wiki/Corellian_Engineering_Corporation",
  "/wiki/VCX-150_freighter",
  "/wiki/Inyusu_Tor_mineral_processing_facility",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Sullustan",
  "/wiki/SP-156",
  "/wiki/SP-113",
  "/wiki/Detonator",
  "/wiki/Thara_Nyende",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Alexander_Freed",
  "/wiki/June_28",
  "/wiki/2016",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)"
 ]
}