{
 "name": "Unidentified_Star_Tours_Mon_Calamari",
 "display_name": "Unidentified Star Tours Mon Calamari",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Star Tours"
     ]
    }
   ]
  }
 ],
 "content": "A number of members of the Mon Calamari species worked at two different Star Tours travel company ports over the years.\nTwo Mon Calamari served as supervisors at the Star Tours facility at Spaceport THX1138 around the time of an incident there involving a Rebel spy. They worked in the control booth overlooking the maintenance area where they directed various aspects of the facility's operations.\nMon Calamari also served in the same capacity from a similar control booth at Star Tours' Tomorrowland Starport years later, when a StarSpeeder 3000 that left the port inadvertently arrived in the midst of a battle. Other Mon Calamari at Tomorrowland Starport included one working in a security booth overlooking the entrance to the facility. Yet another was a droid supervisor.\nTwo Mon Calamari figures could first be seen overlooking the queue of the original Star Tours ride in all of its locations at Disney parks. Though they remained in the refurbished queue area of the updated Star Tours: The Adventures Continue, the rides' setting is considered to be a different spaceport. It's unclear if they should be considered to be the same two individuals.\nAnother Mon Calamari figure could be seen in a security booth only found in the queue of the Star Tours ride at Disneyland in California. That booth and figure were removed before the original ride was replaced by Star Tours: The Adventures Continue in 2011.\nA Mon Calamari droid supervisor portrayed by a puppet appeared on a video screen in the queue of Tokyo Disneyland's version of the ride. It was also removed before the attraction was updated in 2013.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Star_Tours/Legends",
  "/wiki/Spaceport_THX1138",
  "/wiki/Raid_at_Spaceport_THX1138",
  "/wiki/Unidentified_Rebel_spy",
  "/wiki/Tomorrowland_Starport",
  "/wiki/StarSpeeder_3000/Legends",
  "/wiki/Battle_of_Death_Star_III",
  "/wiki/Unidentified_Star_Tours_droid_supervisor",
  "/wiki/Star_Tours_(real-world)",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/Star_Tours:_The_Adventures_Continue",
  "/wiki/2011",
  "/wiki/2013",
  "/wiki/George_Lucas%27_Star_Tours",
  "/wiki/Canon",
  "/wiki/Complete_Guide_to_Star_Tours",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Tours:_%22The_Ultimate_Adventure%22_is_Still_the_Ultimate_Ride_at_Disneyland",
  "/wiki/The_Lucasfilm_Fan_Club_Magazine_2"
 ]
}