{
 "name": "Unidentified_senior_Milvayne_Authority_officer",
 "display_name": "Unidentified senior Milvayne Authority officer",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Milvayne Authority"
     ]
    }
   ]
  }
 ],
 "content": "A human male officer in the Milvayne Authority, the planet Milvayne's law enforcement agency, held a senior position in the police force. In 3 ABY, he held he trial for the captured fugitives Chelli Aphra and 0-0-0, accompanied by vigilante and discharged Milvayne lawman Tam Posla.\nAfter the senior officer left the sentence decision to Posla, Aphra brought up to the cops that the vigilante was a deserter, convincing the Milvayne Authority officers to turn on the former cop. Posla resultantly attacked the senior officer and his men, the ensuing firefight allowing Aphra and 0-0-0 to escape.\nThe human male was a senior police officer in the Milvayne Authority, the law enforcement agency on the Inner Rim Territories planet Milvayne, during the time of the Galactic Empire. In 3 ABY, the rogue archaeologist Chelli Aphra and assassin droid 0-0-0 traveled through Milvayne City, both wanted by the Milvayne Authority. A live feed from 0-0-0's eyes was also being broadcast across Milvayne by the Doctor Cornelius Evazan, who encouraged viewers to help the Milvayne Authority catch the two fugitives.\nThe Milvayne Authority was soon able to capture Aphra and 0-0-0 with the assistance of the vigilante Tam Posla, a discharged Milvayne Authority officer who had assumed a position with his former law enforcement agency. Posla was also undead, having been revived by some Force-sensitive gundravian hookspores, an infectious fungus. The senior Milvayne Authority officer, led Aphra and 0-0-0's trial at a ledge above Milvayne's undercity, joined by five other cops and Posla. The senior officer addressed the apprehended pair and left the sentencing to the \"arresting officer,\" Posla, who ordered that they were shot to death and thrown over the ledge.\nAs Posla ordered the five other officers to take aim, Aphra argued about the legitimacy of the undead vigilante, coming to point out that he had been fired from the Milvayne Authority. One of the cops confirmed to the senior officer that Posla had been dishonorably discharged for absentia. Aphra then reminded the six officers that 0-0-0's eyes were recording, asking if they wanted the whole planet to know they had been outdone by a \"deserter.\" The senior officer spoke with one of his peers before the group of them turned their blasters on Posla.\nEnraged, Posla revealed his cybernetic weapons and the Force energies from the fungus imbuing him caused the senior officer to step back. The officer drew his blaster and shot at Posla, ordering his peers to kill their new opponent. Posla then activated his jetpack and began shooting the cops as Aphra and 0-0-0 escaped. The viewers of the live feed across Milvayne watched as some of the Milvayne Authority officers were slaughtered.\nThe senior officer was resentful of infractions of the law, claiming the crimes of Aphra and 0-0-0 were too \"numerous and nauseating\" to count. He treated any denunciation of his charges as an assertion of guilt. However, the officer was against working with a deserting officer like Tam Posla, choosing to turn on the vigilante rather than let the former lawman help the Milvayne Authority. The senior officer had a light skin color.\nThe officer wore white armor over his chest and upper back with green shoulder pads and elbow guards. He wore a brown padded tunic under the armor with brown sleeves and a belt that included compartments and a holstered blaster. The officer also donned brown gloves, kamas and trousers with black boots, as well as a white helmet with a yellow vizor.\nThe Milvayne Authority officer appeared in the twenty-ninth issue of the 2016 Star Wars: Doctor Aphra comic series, written by Simon Spurrier, pencilled by Emilio Laiso, and published by Marvel Comics on February 27, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Milvayne_Authority",
  "/wiki/Planet",
  "/wiki/Milvayne",
  "/wiki/Law_enforcement_agency",
  "/wiki/3_ABY",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/0-0-0",
  "/wiki/Tam_Posla",
  "/wiki/Police_officer",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Archaeologist",
  "/wiki/Assassin_droid",
  "/wiki/Chase_on_Milvayne",
  "/wiki/Milvayne_City",
  "/wiki/Eye",
  "/wiki/Doctor",
  "/wiki/Cornelius_Evazan",
  "/wiki/Death",
  "/wiki/Force-sensitive",
  "/wiki/Gundravian_hookspore",
  "/wiki/Fungus",
  "/wiki/Underworld_(Milvayne)",
  "/wiki/Blaster",
  "/wiki/Cybernetics",
  "/wiki/Jetpack",
  "/wiki/Armor",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Holster",
  "/wiki/Glove",
  "/wiki/Kama",
  "/wiki/Boot",
  "/wiki/Helmet",
  "/wiki/Doctor_Aphra_(2016)_29",
  "/wiki/2016",
  "/wiki/Star_Wars:_Doctor_Aphra_(2016)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Simon_Spurrier",
  "/wiki/Emilio_Laiso",
  "/wiki/Marvel_Comics",
  "/wiki/February_27",
  "/wiki/2019",
  "/wiki/StarWars.com",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Doctor_Aphra_(2016)_40",
  "/wiki/Accresker_Jail",
  "/wiki/Skirmish_aboard_Accresker_Jail",
  "/wiki/Crimson_Reign_3",
  "/wiki/Jeremoch_Colton",
  "/wiki/Wreckage-prison",
  "/wiki/Standard_year",
  "/wiki/The_Archivist",
  "/wiki/Prisoner",
  "/wiki/Secret_mission_to_Tatooine",
  "/wiki/Tantive_IV",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Battle_of_Hoth",
  "/wiki/Doctor_Aphra_(2016)_28",
  "/wiki/Doctor_Aphra_(2016)_27"
 ]
}