{
 "name": "Unidentified_Human_job_candidate",
 "display_name": "Unidentified Human job candidate",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cato Neimoidia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "A Human male who lived on Cato Neimoidia during the early days of the recently formed galactic empire had heard about a job offered by Ember Chankeli to which he considered signing on. He arrived with Ember short time before Dass Jennir, another candidate. Jennir was curious about what the job actually was exactly, since the offer wasn't very specific, to which Ember responded that it was to take care of a gang problem. When the job candidate asked how many members this gang contained, Ember responded that it was about forty. The job candidate was baffled about the idea of just the two of them taking on so many enemies at once. Jennir on the other hand observed that maybe one could do it instead of two, but before any of the three could get an agreement, they were interrupted by a thug who Jennir had beaten earlier and his friends. Jennir beat the attackers with ease, meanwhile the job candidate took his chance and ran away.\nThe job candidate appeared in 2009 in Dark Times: Blue Harvest, Part 2 the second of two mini-issues of the Star Wars: Dark Times comic book series which was designed as an introduction to the Blue Harvest story arc. The issue was written by Randy Stradley under the name Mike Harrison and illustrated by Douglas Wheatley.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cato_Neimoidia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_Times:_Blue_Harvest,_Part_2",
  "/wiki/Ember_Chankeli",
  "/wiki/Dass_Jennir",
  "/wiki/Unidentified_Chistori_thug",
  "/wiki/2009",
  "/wiki/Star_Wars:_Dark_Times",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Dark_Times:_Blue_Harvest",
  "/wiki/Randy_Stradley",
  "/wiki/Douglas_Wheatley"
 ]
}