{
 "name": "Unidentified_Togruta_(Jarl)",
 "display_name": "Unidentified Togruta  (Jarl)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Togruta"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jarl's crew"
     ]
    }
   ]
  }
 ],
 "content": "A Togruta male individual was part of a crew on the planet Coruscant. At some point while chasing after a droid that was known to point to treasure, the crew ended up at Dex's Diner, holding the customers there hostage. Following a lightfight, the droid played a message that gave the location of the treasure; however, the diner's owner, Dexter Jettster, tricked Jarl and his crew into thinking that the treasure was destroyed many years prior, leading them to dejectedly leave the eatery.\nA Togruta male was part of the crew of the Weequay Jarl, joined by a human and the protocol droid T7 on the planet Coruscant. At some point during the era of the Galactic Republic, a Mirialan named Servit asked Jarl about a family EX droid, wondering its worth. When Jarl failed to acquire the droid from him, knowing it to be a valuable clue toward treasure, he and his crew chased after Servit and arrived at the eatery Dex's Diner. The Togruta, human, and T7 held the customers at blaster point while Jarl tried to convince Servit to give him the droid. However, the owner, Dexter Jettster, briefly knocked the Weequay unconscious with a frying pan, forcing the rest of his crew to open fire.\nA lightfight ensued; Jettster's frying pans eventually overtook the Togruta and human, and T7 was knocked out of commission by getting brakkenback stew stuck in his circuits. Jarl then re-entered, however, persuading Servit via blaster to play the holorecording stored on the EX droid. Once it was finished, Jarl became very excited as he could now find the treasure for himself, but his eagerness was quashed by Jettster laughing loudly; the Besalisk claimed that the location of treasure mentioned in the recording had been destroyed fifty years prior in a supernova in the Ishram system. Jettster was lying—the location was really in the Arath system—unbeknownst to Jarl, who had the Togruta check Jettster on a datapad. As Jarl did not recheck whether the coordinates matched up to the Ishram system, when the Togruta, ashen-faced, confirmed the system was gone, the crew then left, miserable; the Togruta then mumbled about a missing bounty hunter on the planet Batuu on the way out.\nThe Togruta appeared in \"Galactic Tales: Inheritance,\" an installment of the Galactic Tales series of short stories. The story was written by George Mann and was published in the Star Wars Insider magazine's 211th issue on June 7, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Togruta",
  "/wiki/Togruta",
  "/wiki/Gender",
  "/wiki/Jarl%27s_crew",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/EX_droid",
  "/wiki/Dex%27s_Diner",
  "/wiki/Lightfight",
  "/wiki/Droid",
  "/wiki/Shara%27Tam",
  "/wiki/Restaurant",
  "/wiki/Dexter_Jettster",
  "/wiki/Weequay",
  "/wiki/Jarl",
  "/wiki/Human",
  "/wiki/Protocol_droid",
  "/wiki/T7",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Mirialan",
  "/wiki/Servit",
  "/wiki/Blaster",
  "/wiki/Frying_pan",
  "/wiki/Brakkenback_stew",
  "/wiki/Holorecorder",
  "/wiki/Standard_year",
  "/wiki/Supernova",
  "/wiki/Ishram_system",
  "/wiki/Arath_system",
  "/wiki/Datapad",
  "/wiki/Star_system",
  "/wiki/Unidentified_bounty_hunter_(Batuu)",
  "/wiki/Batuu",
  "/wiki/Galactic_Tales:_Inheritance",
  "/wiki/Galactic_Tales",
  "/wiki/George_Mann",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/June_7",
  "/wiki/2022",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/StarWars.com",
  "/wiki/Prequel_trilogy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Databank_(website)",
  "/wiki/Titan_Magazines"
 ]
}