{
 "name": "Unidentified_Neimoidian_captain",
 "display_name": "Unidentified Neimoidian captain",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "A Neimoidian male served as the captain of a Confederate Munificent-class star frigate patrolling near the planet Florrum in the Outer Rim Territories during the Clone Wars. Following bounty hunter Cad Bane's rescue of the Republic prisoner Ziro the Hutt on the galactic capital of Coruscant circa 21 BBY, Bane's Weequay accomplice, Shahan Alama, took a Flarestar-class shuttle and headed for Florrum to escape from the Republic. The Neimoidian captain ordered his frigate to open fire on Alama's craft and, moments later, had squadrons of droid starfighters deployed to combat a Republic LAAT/i gunship spotted in the area.\nA Neimoidian male was the captain of a Munificent-class star frigate serving in the Navy of the Confederacy of Independent Systems during the Clone Wars. Shortly after a group of bounty hunters, under the command of the Duros mercenary Cad Bane, rescued Hutt crime lord Ziro Desilijic Tiure from his imprisonment in the Republic Judiciary Central Detention Center on Coruscant circa 21 BBY, the Neimoidian and his frigate were patrolling a sector of the Outer Rim Territories in which the planet Florrum, home to a base of Weequay pirates, was located.\nThe Neimoidian captain was informed by a battle droid lieutenant that an unidentified Flarestar-class shuttle—piloted by the Weequay Shahan Alama, a member of the group that freed Ziro—was approaching their frigate. Though the battle droid's original report of the unidentified vessel did not help the captain, the Neimoidian vaguely recalled the importance of the craft. He ordered the lieutenant to obtain the threat files for their current sector. After reading the records of Separatist leader Count Dooku's brief stay as a captive of the local Weequay pirates, the Neimoidian rationalized that Dooku would want vengeance brought upon the pirates, and ordered the droids to fire upon Alama's craft.\nNearby, under the command of Twi'lek Jedi General Aayla Secura and Clone Commander CC-5052, \"Bly,\" a Republic Acclamator-class assault ship was performing a scouting mission. After watching the Separatist frigate engage the Weequay craft via hologram, Secura had Bly perform a quick reconnaissance, telling the commander to take a squad of LAAT/i gunships to determine the situation and only fire on the enemy if they were attacked first. One of the Republic gunships was spotted by the Separatist frigate; on the frigate's bridge, the droid lieutenant informed the Neimoidian of the enemy's presence. The captain ordered squadrons of Vulture droids, Hyena bombers, and Single Trooper Aerial Platforms to attack the Republic craft. Noting that all of the dispatched forces were droids, he announced that he would not have to worry about sharing credit for what he presumed to be an imminent success. However, Bly's gunship dealt with the majority—if not all—of the droids dispatched, and the Republic craft also managed to shoot down Alama's ship, denying the Neimoidian captain his two victories.\nDressed in purple robes and wearing a similarly colored miter, the Neimoidian was the commander of a Separatist frigate assigned to patrol duties in the Outer Rim. He believed that a good Neimoidian commander made his own opportunities. Holding a contemptuous attitude toward the droids under his command, the captain was almost continually finding fault in the reports of his battle droid lieutenant. He did not believe in sharing with them the glory that he believed he would receive after successfully dealing with both the Weequay pirates—who had previously held Confederate Head of State Count Dooku—and the Republic forces on reconnaissance in the area. The Neimoidian had green skin and red eyes.\nThe Neimoidian captain first appeared as an unidentified character in The Clone Wars: Hunting the Hunters , an issue of the online The Clone Wars comic series, taking place between seasons one and two of the Star Wars: The Clone Wars television series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/The_Clone_Wars:_Hunting_the_Hunters_(Part_I)",
  "/wiki/Captain/Legends",
  "/wiki/Unidentified_Munificent-class_star_frigate_(Florrum)",
  "/wiki/Planet/Legends",
  "/wiki/Florrum/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cad_Bane/Legends",
  "/wiki/Senate_hostage_crisis/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Ziro_Desilijic_Tiure/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Weequay/Legends",
  "/wiki/Shahan_Alama/Legends",
  "/wiki/Flarestar-class_attack_shuttle/Legends",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/Battle_of_Florrum",
  "/wiki/Squadron/Legends",
  "/wiki/Droid_starfighter/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Gunship/Legends",
  "/wiki/Confederate_Navy",
  "/wiki/Duros/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Republic_Judiciary_Central_Detention_Center/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Ohnaka_Gang/Legends",
  "/wiki/OOM_command_battle_droid/Legends",
  "/wiki/Unidentified_OOM_command_battle_droid_lieutenant",
  "/wiki/Shahan_Alama%27s_Flarestar-class_attack_shuttle",
  "/wiki/Pilot/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Head_of_State/Legends",
  "/wiki/Count/Legends",
  "/wiki/Dooku/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Clone_trooper_commander",
  "/wiki/CC-5052/Legends",
  "/wiki/Aayla_Secura%27s_Acclamator-class_assault_ship",
  "/wiki/Scout/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Hyena-class_bomber",
  "/wiki/Single_Trooper_Aerial_Platform/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/The_Clone_Wars:_Season_Two",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Hostage_Crisis",
  "/wiki/Star_Wars_Annual_2011",
  "/wiki/Dooku_Captured",
  "/wiki/Gunship_Over_Florrum"
 ]
}