{
 "name": "Unidentified_Imperial_officer_(Fortress_Inquisitorius)",
 "display_name": "Unidentified Imperial officer  (Fortress Inquisitorius)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "An individual who was a human female served as a major in the Galactic Empire. By 9 BBY, the officer was stationed on Fortress Inquisitorius on the ocean moon Nur. She attended a briefing with three Inquisitors and two other officers when the fugitive Jedi Master Obi-Wan Kenobi was reported to be on the planet Mapuzo.\nLater on, the Imperial officer reported to the Inquisitor Third Sister when the Imperial officer Captain Tala Durith requested an immediate audience with the Inquisitor. The pair went to Durith, who provided a falsified narrative to the Third Sister as a distraction for Kenobi's infiltration of the fortress. As the Inquisitor tried to expose Durith as a spy, they were interrupted by alarms and the major informed the Third Sister of Kenobi's presence.\nDuring the time of the Galactic Empire, the human female served as an Imperial officer in Fortress Inquisitorius, the headquarters of the Jedi-hunting group the Inquisitorius, on the ocean moon of Nur in the Outer Rim's Mustafar system. In 9 BBY, the officer held the military rank of major in the Imperial Army when the Inquisitors were able to find a lead on the fugitive Jedi Obi-Wan Kenobi, sending out viper probe droids to mining star systems to try and locate their target. One probe droid was successful and reported Kenobi at the Mid Rim mining planet Mapuzo before it was destroyed.\nReceiving the intelligence, the Inquisitors Third Sister, Fourth Sister, and Fifth Brother convened with the female Imperial officer and two other Imperial officers at a tactical room in fortress. While the three officers watched, the Inquisitors discussed Kenobi's presence on Mapuzo and the Empire resources there. Once the Third Sister brought up informing Darth Vader, a Sith Lord and their superior, the female Imperial officer began discussing the matters on Mapuzo separately with the other two officers. The Fourth Sister then told the trio to gather their battalions and shut down all of the spaceports on Mapuzo.\nVader and the three Inquisitors traveled to Mapuzo, Kenobi barely escaping the planet alive. However, the Third Sister was able to apprehend Leia Organa, the ten year-old daughter of Imperial Senator Bail Organa, and took the girl back to Fortress Inquisitorius for questioning on the whereabouts of Kenobi and an anti-Imperial network known as the \"Hidden Path\" which was helping him and other Jedi. Meanwhile, Kenobi infiltrated the fortress with the help of Tala Durith, an Imperial officer who was secretly helping the Path. Kenobi advised Durith to make a distraction, and so Durith approached the female Imperial officer for an urgent meeting with the Third Sister. The Imperial officer thus went to the Inquisitor, interrupting an imminent interrogation of Organa to inform the Third Sister that there was a matter that could not wait.\nThe pair then went to Durith, and the officer awaited at ease while Durith gave the Inquisitor a fake story about the Path operating out of the planet and the Sertar sector. The Third Sister tried to expose Durith as a spy, eventually ordering for her to be taken to interrogation. The room was interrupted by the sound of klaxons going off in the fortress. Checking her device, the Imperial officer confirmed to the Third Sister that it was because of Kenobi, and so the Inquisitor stormed out of the room, with the officer following to leave Durith with two stormtroopers.\nThe Imperial officer was a human female with light skin.\nThe officer wore a gray-green Imperial officer's uniform, including an Imperial kepi with an officer's disk, black gloves and boots, and a black belt with a silver buckle and compartments. She carried two code cylinders, slotted above each breast, and a rank insignia plaque on her left breast displaying three blue tiles followed by two red tiles in a horizontal row.\nThe officer first appeared in \"Part III\" of the live-action Disney+ television series Obi-Wan Kenobi, directed by Deborah Chow and released on June 1, 2022. She was portrayed by actor Helen Day, who was not credited as the actor until the character's appearance in the following episode \"Part IV,\" directed again by Chow and released week later on June 8.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/Major",
  "/wiki/9_BBY",
  "/wiki/Imperial_officer",
  "/wiki/Fortress_Inquisitorius",
  "/wiki/Ocean",
  "/wiki/Moon",
  "/wiki/Nur",
  "/wiki/Inquisitor",
  "/wiki/Officer",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Battle_on_Mapuzo",
  "/wiki/Planet",
  "/wiki/Mapuzo",
  "/wiki/Reva_Sevander",
  "/wiki/Captain",
  "/wiki/Tala_Durith",
  "/wiki/Rescue_of_Leia_Organa",
  "/wiki/Fortress",
  "/wiki/Spy",
  "/wiki/Imperial_Era",
  "/wiki/Jedi",
  "/wiki/Hunting",
  "/wiki/Inquisitorius",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Mustafar_system",
  "/wiki/Military_rank",
  "/wiki/Viper_probe_droid",
  "/wiki/Mining",
  "/wiki/Star_system",
  "/wiki/Probe_droid",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Fourth_Sister",
  "/wiki/Fifth_Brother",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sith_Lord",
  "/wiki/Battalion",
  "/wiki/Spaceport",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Standard_year",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Hidden_Path",
  "/wiki/Torture",
  "/wiki/Sertar_sector",
  "/wiki/Stormtrooper",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Breast",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Part_III",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/June_1",
  "/wiki/2022",
  "/wiki/Helen_Day",
  "/wiki/Part_IV",
  "/wiki/June_8",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Yavin",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Andor_(television_series)",
  "/wiki/June_4",
  "/wiki/File:Imperial_Forces_Rank_Chart_-_Rogue_One.png",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Part_I",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Dooku_Captured"
 ]
}