{
 "name": "Unidentified_Imperial_officer_(Post_994-203)",
 "display_name": "Unidentified Imperial officer  (Post 994-203)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "A member of the Galactic Empire's force on the planet Metalorn, an Imperial officer served under Governor Corwyth's rule. During the year 0 ABY, the officer investigated a condition red at Post 994-203. A lone stormtrooper had been ambushed by Princess Leia Organa of the Rebel Alliance, and his traceable blaster rifle had been abducted. The officer's investigation revealed the method in which Organa incapacitated the trooper, and the officer reported his findings back to Corwyth.\nA human male served the Galactic Empire as an officer on the planet Metalorn, and served under the command of Governor Corwyth.\nDuring the year 0 ABY, Princess Leia Organa of the Rebel Alliance infiltrated the Imperial mining facilities on Metalorn on a mission to find her old mentor. Disguised as a citizen, she was approached by a lone stormtrooper at Post 994-203, whom she attacked and disarmed. Afterwards, Organa took the soldiers blaster rifle, unaware of the elaborate tracking system installed on it. With the blaster being removed form the possession of its owner, a condition red alerted Corwyth's command center.\nAs such, the Imperial officer was sent to investigate the stormtrooper's last known location. Along with a squad of other stormtroopers, the officer found the incapacitated trooper. Using a playback feature in the trooper's helmet's recording unit, the officer learned of Organa and trooper's encounter. Further investigation revealed that Organa had used an adhesive spray from a first aid kit to clog the ventilation system of the trooper's helmet. The officer reported his findings back to Corwyth, who dispatched further squads to apprehend the Princess.\nThe officer was a light-skinned human male. After learning about how Organa incapacitated the Post 994-203 trooper, the officer admitted that he thought the Princess' maneuver was clever.\nThe unnamed Imperial officer was created for the comic book Star Wars  30, an issue of the Marvel Comics Star Wars series. Released on December 30, 1979, A Princess Alone was written by Archie Goodwin and illustrated by Carmine Infantino and Gene Day.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_(1977)_30",
  "/wiki/Planet/Legends",
  "/wiki/Metalorn/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Corwyth",
  "/wiki/Standard_year/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Post_994-203",
  "/wiki/Unidentified_stormtrooper_(Metalorn)",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Arn_Horada",
  "/wiki/Soldier/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Helmet/Legends",
  "/wiki/Recording_rod",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/December_30",
  "/wiki/1979",
  "/wiki/Archie_Goodwin",
  "/wiki/Carmine_Infantino",
  "/wiki/Gene_Day",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/0_BBY/Legends",
  "/wiki/Death/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Orman_Tagge/Legends"
 ]
}