{
 "name": "Unidentified_retired_Galactic_Republic_pilot",
 "display_name": "Unidentified retired Galactic Republic pilot",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Starfighter Corps",
      "Republic Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "A male Human pilot served in the Republic Starfighter Corps in the years prior to the conflict known as the Invasion of Naboo, flying to many planets of the galaxy before retiring in 38 BBY due to old age and eventually settling on the planet Tatooine. In 32 BBY, the pilot saw the young slave boy Anakin Skywalker participate in a podrace. After the race, the pilot met Skywalker and his friends at Mos Espa's marketplace, where he shared with them stories of his past exploits and encouraged Skywalker to pursue his dream of becoming a space pilot. The pilot would continue to spend time with Skywalker on occasion and entertain him with more stories. Among many things, the pilot told Skywalker about the mysterious Angels of the planet Iego and the creation of the Sith Order.\nA Human male pilot served in the Republic Starfighter Corps during the Galactic Republic's waning years. During his career in the corps, the pilot flew a cruiser with Republic soldiers to the planet Makem Te during the Republic's efforts to stop the rebellion instigated by the local cult known as the Temple of the Beatific Razor. On another occasion, he flew a team of four Jedi Knights on a mission and was forbidden to talk about the place he had taken them. The pilot also successfully flew through the notorious Kessel Run hyperspace route, although many of his peers had tried to discourage him from doing so due to the dangerous nature of the route. In 38 BBY, having visited a large number of worlds and believing himself to be too old for his profession, the pilot retired from the corps.\nAround 33 BBY, the pilot landed on the planet Tatooine with no fuel or money. Content with spending the rest of his days in the shade of the planet's twin stars, he gladly shared stories of his past travels with anyone who wanted to listen. On one occasion, while in the Mos Espa spaceport, he went to the Mos Espa Grand Arena to see a podrace that took place there. The pilot took notice of one of the racers, the young boy Anakin Skywalker, who demonstrated great skill with the vehicle, although he crashed his pod at the end of the race. Later that day, the pilot visited the Mos Espa marketplace, where he noticed Skywalker discussing starfighters with his friends Kitster Banai and W. Wald. Intervening in their discussion, the pilot bought himself and the boys some ruby bliels—a beverage popular on Tatooine—and went on to tell them about his exploits, much to the youngsters' amazement. Skywalker confessed to him that he wanted to become a pilot himself, but Wald believed that the Human boy would not succeed since he was a slave. Telling Skywalker about his experience with the Kessel Run, the old pilot encouraged the boy to pursue his dream no matter what.\nIn Mos Espa, the pilot frequented Maggy the Gorgon's cantina, where he met Skywalker and his friends and entertained them with more stories from his past. The pilot told Skywalker more stories about the Jedi, informing him that the Jedi Order generally only accepted very young children—who did not yet reach one year old—for Jedi training. He also told Skywalker about the so-called \"Angels\" from the planet Iego, who were rumored to be the most beautiful creatures in the galaxy. On another occasion, the pilot was sitting outside the cantina at the Mos Espa marketplace when he saw the boy passing by and waved to him, inviting a conversation. However, the pilot was shocked when the boy asked him if he knew anything about the Sith; the man was frightened at the very thought of the return of the ancient dark side cult. It turned out that Skywalker had merely found the remains of an old war droid and saw an old holographic recording that mentioned the Sith Order. Relieved, the old pilot told the boy that the Sith Order was founded by rogue Jedi Knights thousands of years ago. Millennia later, the Sith were believed to have been destroyed, although rumors remained that one Sith Lord survived to pass on their teachings. In 32 BBY, shortly before the Boonta Eve Classic podrace, the pilot visited Maggy the Gorgon's, where he shared a drink with a Duros assassin. Soon, a fistfight broke out between the Boonta pilots who spent their time there. As the situation heated, the pilot took a ruby bliel and exited the cantina, following one of the other patrons that was thrown out during the fight.\nOutside, the pilot witnessed a standoff between Skywalker and the Dug podracer pilot Sebulba, with Banai and Wald also present. Taking an imposing posture, he inquired as to what was going on. Assuring the pilot that he meant no harm to the boy, Sebulba quickly left the scene. Advising the boys not to go into Maggy the Gorgon's, the pilot gave them his ruby bliel, and Banai and Wald left. Before Skywalker joined his friends, he asked the pilot to tell him about the Angels again the next time he visited the cantina. The pilot agreed and returned to his Duros companion inside the cantina. When the Duros asked him why he bothered talking with a slave, the pilot replied that he sensed something special about the boy. Hearing those words, the Duros jokingly stated that the pilot sounded like a Jedi, but the latter laughed it off. Not long after that, Skywalker indeed found himself behind the controls of a starfighter, helping to put an end to the Trade Federation's invasion of the planet Naboo.\nThe gruff old spacer was a tall, lean, and corded man, with a weatherworn and sun-browned face and hair cut short. He had distinctly styled gray-colored facial hair, which consisted of a full beard, shaved at the chin with the exception of a small strap of hair there. The man possessed eyes that were an odd color of gray, and a warm and ironic smile. Despite having traveled a lot around the galaxy during his days at the corps, he still believed that he was far from seeing all the wonders of space. When he realized that he had become too old for his profession, he retired and enjoyed telling tall tales to gullible audiences. The pilot was a determined man, following through with his idea to fly the Kessel Run despite all the discouragement he had received. When he saw Anakin Skywalker handling a pod, the spacer was very impressed by the boy's skill, believing that Skywalker was better at flying than he himself had been at twice the boy's age. When Skywalker expressed his desire to become a space pilot, the old man supported him, telling the boy that he should not accept his fate as a slave as permanent.\nThe pilot's experience told him that Skywalker would succeed in his dream; the feeling was so strong that his Duros companion compared it to a Jedi's Force sense. In terms of starfighters, the pilot had a preference for the Z-95 Headhunter. The pilot was afraid of the return of the Sith, and became visibly frightened when Skywalker mentioned that ancient order. However, he could also be rather frightening himself, forcing Sebulba to quickly retreat during the standoff at Maggy the Gorgon's.\nThe retired pilot first appeared in Terry Brooks' 1999 novelization of Star Wars: Episode I The Phantom Menace. The scene where Anakin Skywalker meets a space pilot after his unfortunate race is also featured in Anakin's Fate, a storybook written by Marc Cerasini and illustrated by John Alvin. However, Anakin's Fate contradicts The Phantom Menace novel in a number of ways. In the storybook, instead of Wald, Skywalker is accompanied by a boy named Seek. Instead of the old veteran depicted in the novel, the space pilot is portrayed as a young man. The dialogue between him and Skywalker is also different. Instead of talking about his past career, the young pilot only tells Skywalker to pursue his dreams, believing that the boy flies better than he himself did at his age. Star Wars Episode I Journal: Anakin Skywalker featured the pilot, establishing that he was the one who told Skywalker about the Angels of Iego. The comic book Episode I: The Phantom Menace ½ featured a space pilot visiting Maggy the Gorgon's, and also had Skywalker asking that pilot to tell him about the Angels again, thus establishing that the pilot is the same character as the one from The Phantom Menace novel and the Episode I Journal.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/Anakin%27s_Fate",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Starfighter_Corps/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Planet/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/38_BBY/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Podracing/Legends",
  "/wiki/Mos_Espa/Legends",
  "/wiki/Mos_Espa_marketplace",
  "/wiki/Realspace/Legends",
  "/wiki/Time/Legends",
  "/wiki/Diathim/Legends",
  "/wiki/Iego/Legends",
  "/wiki/Exiles",
  "/wiki/Sith/Legends",
  "/wiki/Corps/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Makem_Te/Legends",
  "/wiki/Makem_Te_rebellion",
  "/wiki/Temple_of_the_Beatific_Razor",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Kessel_Run/Legends",
  "/wiki/Hyperlane",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/33_BBY/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Binary_star/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Mos_Espa_Grand_Arena/Legends",
  "/wiki/Podracer_(profession)/Legends",
  "/wiki/Anakin_Skywalker%27s_Podracer/Legends",
  "/wiki/Podracer/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Kitster_Chanchani_Banai",
  "/wiki/W._Wald",
  "/wiki/Ruby_bliel",
  "/wiki/Maggy_the_Gorgon%27s",
  "/wiki/Cantina/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/6900_BBY",
  "/wiki/1000_BBY",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Boonta_Eve_Classic/Legends",
  "/wiki/Unidentified_Duros_assassin",
  "/wiki/Dug/Legends",
  "/wiki/Sebulba/Legends",
  "/wiki/Duros/Legends",
  "/wiki/N-1_starfighter/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Naboo/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Star/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Z-95_Headhunter/Legends",
  "/wiki/Terry_Brooks",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Marc_Cerasini",
  "/wiki/John_Alvin",
  "/wiki/Seek/Legends",
  "/wiki/Star_Wars_Episode_I_Journal:_Anakin_Skywalker",
  "/wiki/Episode_I:_The_Phantom_Menace_%C2%BD",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(unabridged_audiobook)",
  "/wiki/Episode_I:_Anakin_Skywalker",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unseen_Planets_of_Episode_I",
  "/wiki/Star_Wars_Insider_56",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_40",
  "/wiki/The_Official_Star_Wars_Fact_File_134",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Geonosis_and_the_Outer_Rim_Worlds"
 ]
}