{
 "name": "Unidentified_Sith_Councilor_(Sith_arthropods)",
 "display_name": "Unidentified Sith Councilor  (Sith arthropods)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sith Council",
      "Sith Council"
     ]
    }
   ]
  }
 ],
 "content": "A Sith male Sith Lord served as a member of the Sith Empire's ruling council during the time leading up to the Great Hyperspace War of 5000 BBY. After his fellow Sith Lord Naga Sadow had staged what the Sith Council assumed to have been a Galactic Republic attack that year, the Councilor supported Sadow's bid for the title of Dark Lord of the Sith of the Sith Empire. Later, the Councilor performed a private ceremony where he branded the newly elected Sadow with the emblem of the Dark Lords.\nA Sith Lord who ruled over a dozen worlds of the Sith Empire served as a member of its Sith Council by 5000 BBY. That year, when the explorers Gav and Jori Daragon of the Galactic Republic's Koros system arrived in Sith Space, the Sith Councilor's fellow Sith Lord Naga Sadow plotted to use their arrival to force the Sith Empire into a new phase of expansion via an invasion of the Republic. To that end, Sadow violently liberated the Daragon siblings from their imprisonment on the Sith capital planet Ziost, in the process planting as evidence Republic blaster weapons\nSadow's actions led the Sith Council to believe the Daragons were Republic spies and that their liberation was a precursor to a Republic invasion of the Sith Empire. When Sadow arrived from his hidden stronghold on the moon Khar Shian to an emergency session of the Council held in Ziost's Sith Citadel and, feigning ignorance of the recent events, demanded to know the reason behind the meeting, the Sith Councilor informed him that the empire had experienced an attack. The Councilor then observed Sadow as he was publicly inspecting one of the weapons planted during the raid, in the process proclaiming his unfamiliarity with the item.\nIn a speech subsequently delivered to the Sith Council, Sadow used the recent events as an argument for both crowning him as the new Dark Lord of the Sith of the empire and launching a conquest of the Republic. Being a part of the majority of the councilmembers that expressed support for Sadow's candidature, the Sith Councilor proclaimed that it was indeed Sadow who needed to be elected the new leader of the empire. After Sadow's rival, Ludo Kressh, and his supporters stormed out of the Council chamber in protest over Sadow's election, the Sith Councilor and his remaining peers all bowed to Sadow as their new Dark Lord. Meanwhile, Sadow instructed all of them to rally their warships and soldiers for an upcoming invasion of the Republic.\nLater, the Sith Councilor and one of his fellow councilmembers took part in the private ceremony of Sadow receiving the mark of the Dark Lord of the Sith. During the ritual, the Councilor took from his colleague a crystalline vessel containing a pair of arthropods. Then, after confirming that Sadow was ready for the procedure, the Councilor released the arthropods on Sadow's forehead, where the creatures burned the emblem of the Dark Lords into the new Sith ruler's skin. At the conclusion of the ceremony, both of the Sith Lords performing the ritual bowed to Sadow, with the Sith Councilor also expressing verbally his subservience to the new Dark Lord.\nAs a Sith Lord of the Sith Empire and a member of the empire's Sith Council, the Sith Councilor was loyal to the Dark Lord of the Sith. He was a male of the Sith species and had red skin and brown hair and beard. The Councilor wore his hair long on the sides but only had very sparse hair on the top of his head, and he had on his forehead a black tattoo depicting an abstract symbol.\nThe Sith Councilor wore purple robes with gold-colored upper-torso armor. He also wore a golden headdress and a pair of ornamental gauntlets of matching color. The Councilor was equipped with a Sith sword with a jagged blade.\nThe Sith Councilor first appeared in the third issue of Dark Horse Comics' Star Wars: Tales of the Jedi — The Golden Age of the Sith comic book mini-series. The issue was written by Kevin J. Anderson, penciled by Dario Carrasco, Jr., and published on December 11, 1996.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Sith_Council",
  "/wiki/Time/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/5000_BBY/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/First_raid_on_the_Sith_Citadel",
  "/wiki/Standard_year/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Gav_Daragon",
  "/wiki/Jori_Daragon",
  "/wiki/Empress_Teta_system/Legends",
  "/wiki/Sith_Worlds",
  "/wiki/Prison/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Ziost/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Weapon/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Naga_Sadow%27s_Khar_Shian_citadel",
  "/wiki/Moon/Legends",
  "/wiki/Khar_Shian",
  "/wiki/Sith_Citadel_(Ziost)",
  "/wiki/Ludo_Kressh",
  "/wiki/Ludo_Kressh%27s_faction",
  "/wiki/Warship/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Unidentified_Sith_Councilor_(crystal_vessel)",
  "/wiki/Crystal/Legends",
  "/wiki/Sith_pincerbug",
  "/wiki/Arthropod/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Sith_sword",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_3",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Golden_Age_of_the_Sith",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Dario_Carrasco,_Jr.",
  "/wiki/December_11",
  "/wiki/1996",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_4",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Category:Images_of_the_unidentified_Sith_Councilor_(Sith_arthropods)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Fall_of_the_Sith_Empire",
  "/wiki/Marvel_Comics"
 ]
}