{
 "name": "Unidentified_Lamproid_(Kabal)",
 "display_name": "Unidentified Lamproid  (Kabal)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Florn"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lamproid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "A Lamproid was present on the planet Kabal in 0 ABY. In a run-in with the Krish big-game hunter Tyro Viveca, her mate was killed and she was captured, placed in a force cage, and sedated so that Viveca could hunt her down on a later date.\nDuring her captivity, the female Lamproid had little room and no freedom, and was left with no choice but to wallow in her own filth. She attempted to escape, but the force cage shocked and stunned her each time she slammed her weight against it, leaving her body scarred and burned. When an unknown Human approached her cage—actually the conman Cecil Noone, running from Tyro Viveca himself—the Lamproid sensed she might manipulate him. She used telepathic powers to ease the pain of an injury Noone had suffered and to suggest to Noone that he free her. He dutifully did so, and she escaped into the brush.\nThe Lamproid later ambushed Viveca as he hunted down Noone with the aid of his hunting nashtah and Houk servant, Rutt. She killed Rutt with a stab of her tail stinger, and snapped off the nashtah's leg with her coils. She then attacked the Krish. The two grappled for a moment, and the Lamproid used her telepathy on the hunter. However, Viveca managed to free his hunting blaster, which prompted the Lamproid to retreat and swipe at him with her tail stinger. Nevertheless, the Krish managed to shoot the Lamproid at point-blank range, decapitating her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Florn/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Lamproid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fair_Prey",
  "/wiki/Planet/Legends",
  "/wiki/Kabal/Legends",
  "/wiki/Krish_(species)/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Tyro_Viveca/Legends",
  "/wiki/Unidentified_Lamproid_(Tyro_Viveca%27s_trophy)",
  "/wiki/Force_cage",
  "/wiki/Human/Legends",
  "/wiki/Cecil_Noone",
  "/wiki/Telepathy/Legends",
  "/wiki/Nashtah",
  "/wiki/Houk/Legends",
  "/wiki/Rutt",
  "/wiki/Hunting_blaster/Legends",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars_Gamer_1"
 ]
}