{
 "name": "Unidentified_Twi%27lek_Black_Vulkar",
 "display_name": "Unidentified Twi'lek Black Vulkar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Vulkars"
     ]
    }
   ]
  }
 ],
 "content": "This Twi'lek male was a member of the Tarisian Black Vulkar gang during the Jedi Civil War.\nHe was a high-ranking member of the gang long before Brejik became leader; back when the Vulkars had honor and respect. But after Brejik and his followers took over, the gang was transformed into a group of violent thugs and the original Vulkars were demoted and ridiculed. This specific Twi'lek went from being one of the highest ranking members to a mere guard in a back room. He despised Brejik and wanted to leave, but knew that he would be killed if he tried.\nAt some point after the Sith took over Taris, the Vulkars captured the Jedi Bastila Shan as well as stole a Prototype accelerator from their rivals, the Hidden Beks. Eventually, the former Sith Lord Revan and his allies invaded the Black Vulkars' base and encountered the Twi'lek. After a very brief skirmish, the gang member quickly surrendered and expressed his disgust with Brejik's rule of the gang. After telling Revan about the base's security systems, Revan spared the Twi'lek, allowing him to leave the gang for good.\nThe player can ask the Twi'lek about Bastila Shan and the prototype accelerator. He states that Bastila is well out of the player's reach, but he will give information on the accelerator and how to bypass the systems.\nThe player can either kill the Twi'lek or let him go. The former will give the player Dark Side points, but the latter won't affect the player's alignment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Black_Vulkars/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Swoop_gang",
  "/wiki/Jedi_Civil_War",
  "/wiki/Brejik",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Jedi/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Prototype_accelerator",
  "/wiki/Hidden_Beks",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Revan/Legends"
 ]
}