{
 "name": "Unidentified_Twi%27lek_child_(Coruscant)",
 "display_name": "Unidentified Twi'lek child  (Coruscant)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Teal"
     ]
    }
   ]
  }
 ],
 "content": "A Twi'lek male child was present in the Coruscant Underworld with his mother in 19 BBY.\nDuring the Clone Wars in 19 BBY, the Twi'lek child was on a turbolift in the Coruscant Underworld with his mother before they were separated when Ahsoka Tano ran into the lift to escape the Coruscant underworld police. As Tano entered the turbolift, one of the police officers fired at the lift's controls, causing it to begin plummeting towards the ground. The child was surprised and scared. Tano, thinking quickly, began cutting a hole in the top of the lift with her lightsabers. The child tried to tell Tano that the turbolift's emergency stop button would halt the lift, but she was too focused on cutting the hole. He then simply pressed the button, bringing the falling turbolift to a halt and embarrassing Tano. Tano proceeded to cut a hole in the turbolift's door and jumped down to the ground with the child in her arms, reuniting him with his mother after landing.\nThe Twi'lek child first appeared in the Star Wars: The Clone Wars episode \"To Catch a Jedi,\" voiced by Nika Futterman, who also voiced Asajj Ventress in the episode as well as throughout the series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Twi%27lek_child",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Coruscant_Underworld",
  "/wiki/Parent",
  "/wiki/19_BBY",
  "/wiki/Clone_Wars",
  "/wiki/Turbolift",
  "/wiki/Ahsoka_Tano",
  "/wiki/Coruscant_underworld_police",
  "/wiki/Police_officer",
  "/wiki/Lightsaber",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/To_Catch_a_Jedi",
  "/wiki/Nika_Futterman",
  "/wiki/Asajj_Ventress"
 ]
}