{
 "name": "Unidentified_Queen_of_Naboo_(New_Republic)",
 "display_name": "Unidentified Queen of Naboo  (New Republic)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo"
     ]
    }
   ]
  }
 ],
 "content": "A Human female served as Queen of Naboo during the height of the New Republic. She wore the traditional garb and makeup of her predecessors on the throne of the planet Naboo, and was known to enjoy open-air activities like guarlara-riding or hunting with her pet twirrls.\nAt some point following the establishment of the New Republic in 4 ABY, a young female Human became the Queen of the Human people living on Naboo, the capital planet of the Chommell sector. When the famous zoologist Lyrre T'enna came to observe the Nabooian wildlife, the Queen allowed her access to the royal twirrling, hunting, and guarlara-riding parties. T'enna made on-the-fly drawings of the Queen with her mounts, pet twirrls, handmaidens, and Nabooian Royal Guards. The monarch was also depicted holding voorpaks, diminutive furballs traditionally kept as mascots by noblewomen. T'enna's colored renderings eventually appeared in the published version of her field journal.\nAt the time of Lyrre T'enna's visit, the Queen of Naboo was a youthful-looking woman with reddish brown hair, pale skin, and gray eyes. She wore the heavy, intricate, and highly-codified regalia of the Royal House, some of which were dyed in an array of pastel colors. Like Padmé Amidala, one of her predecessors during the last days of the Galactic Republic, the Queen sported traditional make-up, including stylized beauty marks and the red scar of remembrance—a symbol of remembrance for Naboo's Time of Suffering before the Great Time of Peace, which had been brought about by King Jafan around 832 BBY.\nThe Queen would occasionally go twirrling with other ladies of the court on a royal white-furred gualama. She also possessed a royal herd of guarlaras to ride as well. When she was pictured by T'enna, she rode sidesaddle, with both legs on the same side of the mount, which allowed her to wear fine, flowing clothes fitting to her rank when riding.\nThe unidentified Queen of Naboo was pictured in The Wildlife of Star Wars: A Field Guide, a 2001 guide written by Terryl Whitlatch and Bob Carrau, and published by Chronicle Books. Whitlatch also illustrated the book, reusing many conceptual designs she had originally created for the 1999 film Star Wars: Episode I The Phantom Menace.\nThroughout the Naboo chapter of the guide, the Queen is depicted four times: practicing falconry, mounting a guarlara, riding among a hunting crowd and holding two voorpaks. While the book never explicitly identifies the pictured lady as the Queen, she bears the scar of remembrance, which is a royal attribute. Additionally, the guide does mention that guarlaras are \"ridden by monarchy only.\" Since the foreword of the field journal says that all of T'enna's sketches were done \"on-site\" and \"on the fly,\" the zoologist must have met the Queen personally.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Unidentified_Queen_of_Naboo",
  "/wiki/Naboo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Royal_House_of_Naboo/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Guarlara/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Twirrl",
  "/wiki/Declaration_of_a_New_Republic/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Naboo_(people)/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Chommell_sector/Legends",
  "/wiki/Zoologist/Legends",
  "/wiki/Lyrre_T%27enna",
  "/wiki/Queen/Legends",
  "/wiki/Twirrling",
  "/wiki/Handmaiden/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Voorpak/Legends",
  "/wiki/Noble/Legends",
  "/wiki/Lyrre_T%27enna%27s_annotated_field_guide",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Scar_of_remembrance/Legends",
  "/wiki/Time_of_Suffering/Legends",
  "/wiki/Great_Time_of_Peace/Legends",
  "/wiki/Jafan/Legends",
  "/wiki/832_BBY/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Gualama/Legends",
  "/wiki/Limb/Legends",
  "/wiki/The_Wildlife_of_Star_Wars:_A_Field_Guide",
  "/wiki/2001",
  "/wiki/Terryl_Whitlatch",
  "/wiki/Bob_Carrau",
  "/wiki/Chronicle_Books",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_100",
  "/wiki/Kylantha",
  "/wiki/18_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Empire_at_War:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_Episode_I_The_Visual_Dictionary",
  "/wiki/Star_Wars:_Complete_Locations_(2005)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Databank_(original)"
 ]
}