{
 "name": "Unidentified_Miskara_(Jorj_Car%27das)",
 "display_name": "Unidentified Miskara  (Jorj Car'das)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "27 BBY",
      "Unknown Regions"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vagaari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Smaller than Jorj Car'das"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Vagaari Empire",
      "Vagaari fleet",
      "Vagaari fleet"
     ]
    }
   ]
  }
 ],
 "content": "A male Miskara, and also known as The Miskara addressed to as \"Your Eminence\", was a member and ruler of the Vagaari sentient species. In 27 BBY, he led the Vagaari fleet during the battle on the Geroon species' homeworld, as well as their attempt on seizing the massive starship known as Outbound Flight. The Vagaari ruler was informed by Human smuggler Jorj Car'das of Chiss Force Commander Mitth'raw'nuruodo's base, who the Miskara wished to kill, as the Chiss had defeated the Vagaari in the Crustai system and at Geroon.\nHowever, although Car'das believed the Miskara had not thought of the possibility of it being a Chiss trap, the Miskara imprisoned Car'das in a Zero-g plastic bubble on his flagship, as he believed the information on the base to be the location of a trap. After arriving at the coordinates the Human had provided, the Miskara freed Car'das and used him as his translator during their brief attempt at negotiating with Outbound Flight. However, after the Vagaari had began to move towards the starship, battle droids commandeered by Thrawn in secret, that had been given to the Miskara as a gift by Car'das, opened fire on the bridge of the Vagaari's warship, killing all Vagaari aboard, as well as the Miskara.\nIn 27 BBY, the Vagaari sentient species carried out their nomadic conquests of several worlds to temporarily colonize for the Vagaari's civilians and to plunder minerals, and other important items from the colonized worlds. One such world was the Geroon species' homeworld, which was attacked by the Vagaari fleet. The Miskara led the attack, commanding over a hundred warships and another hundred civilian transports which transported civilizans for the plundering of the Geroon homeworld. As the Geroons fought the Vagaari, they underwent severe casualties.\nDuring the attack, Chiss Force Commander Mitth'raw'nuruodo  of the Chiss Ascendancy's Picket Force Two, visited the homeworld in hopes of studying the Vagaari and acquiring a Vagaari gravity well projector. Aboard Thrawn's warship, two Humans hailing from the Galactic Republic's planet of Corellia, Jorj Car'das and Maris Ferasi. After realizing one of the gravity well projectors preventing the Geroons from escaping via hyperspace was protected by a lesser force, Thrawn sent his starfighters and two Assault teams to retrieve the projector and neutralize its crew. As Thrawn and his flagship, the Springhawk the Vagaari forces attacked them with more severe firepower, eventually causing an attack that almost killed the commander. However, the Humans aboard saved the commander with the help of the Springhawk's crew. Although the bridge was partially destroyed thanks to the Vagaari attack, the Chiss were able to retrieve the projector.\nAfterward, Car'das abandoned Thrawn's base at the Crustai system of the Unknown Regions, and traveled to the Geroon homeworld, where he met with the Miskara. During their meeting, Car'das informed the Miskara that he, along with his companions originating from the Galactic Republic, had lost their way and been captured by the Chiss. The Eminence inquired Car'das on how he knew of the Vagaari's location, which prompted the Human to unveil thta he had been aboard the Chiss warship that had fought in the attack on the Geroon. As the Chiss warship had stolen one of the Vagaari's ship net, as well as the gravity well projector, the Miskara inquired Car'das on the whereabouts of Thrawn. However, Car'das's offiering was deemed unsufficient to the Miskara. Although the Vagaari ruler had lost interest, he found battle droids, mechanical servants that were able to attack anyone who their leader wanted to kill.\nCar'das demonstrated the Droideka's and the battle droid's capabilities on the Geroon slaves, and informed the Eminence of how many droids Thrawn possessed. Upon learning of the sheer firepower the droids would grant him, the Vagaari ordered his fleet to go to the Crustai base—in reality, coordinates in which Thrawn would destroy the Vagaari once—however, although Car'das believed the Miskara to have been fooled, the Vagaari imprisoned Car'das in a Zero-g plastic bubble, along with the Geroon slaves on the hull of his warship and other vessels.\nAfter leaving the Geroon homeworld through hyperspace, the Vagaari fleet, consisting of two thousand starships, including civilian transports and warships, was brought to realspace before they reached the coordinates Car'das had supplied to the Vagaari. Instead of arriving at the base, they arrived at the location of a battle, a battle between the Jedi-commandeered Outbound Flight colony starship, and Thrawn's Picket Force Two. The Miskara inquired Car'das on what he had brought the Vagaari to, the smuggler suggested that the Chiss had used the \"ship net\" against the massive starship at the same time that the Vagaari passed through that area. The Miskara dismissed Car'das' concerns on what had brought them there, and upon informing the Miskara of the amount of sheer firepower Outbound Flight's Dreadnaughts packed, the Miskara told Car'das that his concerns were touching, however, that they were the Vagaari, and they took what they wanted.\nThe Miskara, and Car'das, acting as the translator of the Vagaari with the Outbound Flight, attempted to negotiate with the Jedi aboard, however, although Car'das spoke the Jedi's language, Basic, Jorus C'baoth, the commander of the expedition ignored their attempt. And shortly after, utilized a Force meld on all the Vagaari on the warships, destroying their minds slowly. Although the Vagaari had been neutralized, as the Jedi focused on the alien fleet, the Chiss used Vulture drois, droid starfighters, on the Vagaari's hulls, firing with enough precision to shoot through the hulls without touching the slaves' bubbles. The Miskara and the warships' crew was ultimately killed, as well as the Jedi, however, a portion of the Vagaari fleet escaped, avoiding Thrawn's attempt to destroy them.\nThe Miskara was an arrogant and ruthless member of the Vagaari species. He had no care for anyone, and was comfortable with killing anyone, which he enjoyed doing, or viewing others doing. He was intelligent, however, his greed contrarrested it when a \"prize\" was big enough for him. The Miskara knew two words in Basic, \"fire\" and \"target.\"\nThe Miskara wore a heavy-looking multicolored robe with sunburst shoulder and ankle guards. he also wore a serrated cloak and four belts around his waist. He also owned and led his warship.\nThe Miskara appeared in the 2007 novel Outbound Flight written by Timothy Zahn. An image from The Unknown Regions depicts a member of the Vagaari species with clothing that matches the Miskara's clothing in Outbound Flight, however, no connection has been established.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Miskara",
  "/wiki/27_BBY/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Vagaari/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jorj_Car%27das",
  "/wiki/Vagaari_Empire",
  "/wiki/Vagaari_fleet",
  "/wiki/Emperor/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Species/Legends",
  "/wiki/Battle_of_the_Geroon_homeworld",
  "/wiki/Geroon_(species)",
  "/wiki/Homeworld/Legends",
  "/wiki/Battle_of_Outbound_Flight",
  "/wiki/Starship/Legends",
  "/wiki/Outbound_Flight",
  "/wiki/Human/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Chiss/Legends",
  "/wiki/Force_Commander",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Crustai_base",
  "/wiki/Death/Legends",
  "/wiki/Skirmish_in_the_Crustai_system",
  "/wiki/Crustai_system",
  "/wiki/Geroon",
  "/wiki/Prison/Legends",
  "/wiki/Zero-g_plastic_bubble",
  "/wiki/The_Miskara%27s_warship",
  "/wiki/Galactic_coordinates/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Bridge_(starship)",
  "/wiki/Planet/Legends",
  "/wiki/Colonies/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Mineral/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Vagaari_warship",
  "/wiki/Vagaari_civilian_transport",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Core_name/Legends",
  "/wiki/Chiss_Ascendancy/Legends",
  "/wiki/Picket_Force_Two/Legends",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Maris_Ferasi",
  "/wiki/Hyperspace/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Assault_Team_One",
  "/wiki/Assault_Team_Two",
  "/wiki/Flagship/Legends",
  "/wiki/Springhawk/Legends",
  "/wiki/B1-Series_battle_droid",
  "/wiki/Droideka/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Hull/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dreadnaught-class_heavy_cruiser",
  "/wiki/Jedi/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Jorus_C%27baoth",
  "/wiki/Force_meld",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Color/Legends",
  "/wiki/Robe/Legends",
  "/wiki/2007",
  "/wiki/Outbound_Flight_(novel)",
  "/wiki/Timothy_Zahn",
  "/wiki/File:Vagaari-tur.jpg",
  "/wiki/The_Unknown_Regions",
  "/wiki/Outbound_Flight_(audiobook)",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/32_BBY/Legends"
 ]
}