{
 "name": "Unidentified_Aleena_2",
 "display_name": "Unidentified Aleena 2",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Aleen"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aleena"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Beige"
     ]
    }
   ]
  }
 ],
 "content": "A male Aleena lived on the planet Aleen during the events of the Clone Wars around 21 BBY.\nDuring the Mission to Aleen, this Aleena welcomed the Galactic Republic clone troopers into his village along with the rest of the villagers. After the troopers arrived, commander Wolf sent a team of two troopers along with astromech droid R2-D2 and a couple of Aleena, including this one, to repair and survey the local Republican communication station that was affected by an earthquake. This Aleena pointed the clones in the direction of the station, which was under debris.\nAfter the station was fixed, this villager along with another one and a child showed R2-D2 and C-3PO a hole in the ground that led to the Aleen Underworld, but a groundquake suddenly started and the two droids fell into the hole. This Aleena then came back to the village to warm the remaining Aleena and the clones to come to their aide. Since the clones could not understand their language, king Manchucho returned with the rest of the villagers and started praying near the site where the two droids had fallen into the ground.\nIn the end, C-3PO and R2-D2 managed to return to the surface and this Aleena and the rest of the villagers celebrated when they sealed up the crack leading to the underworld and bid farewell to them once they departed after their mission was over.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Unidentified_Aleena_2",
  "/wiki/Aleen/Legends",
  "/wiki/Aleena/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sinker/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Mission_to_Aleen/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Commander/Legends",
  "/wiki/CC-3636",
  "/wiki/Astromech_droid/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Unidentified_Aleena_1",
  "/wiki/Unidentified_Aleena_child",
  "/wiki/Aleen_Underworld/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/King/Legends",
  "/wiki/Manchucho/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Mercy_Mission_(episode)"
 ]
}