{
 "name": "Unidentified_Kaleesh",
 "display_name": "Unidentified Kaleesh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kaleesh"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "A Kaleesh individual met with fellow Kaleesh Grievous prior to the general's departure to fight in the renewed Huk War. Grievous bowed before the Kaleesh at a landing site, where the latter anointed him with red markings and called on their ancestors to watch over him.\nA member of the Kaleesh species lived at the time of the renewed Huk War around 24 BBY. After the Yam'rii, a species known derogatorily as the Huk by the Kaleesh, tarnished several sacred Kaleesh burial grounds, the Kaleesh General Grievous returned to his homeworld Kalee for vengeance. At a landing site, Grievous knelt before the Kaleesh individual, who believed the Galactic Republic and the Jedi Order had ignored Kaleesh appeals and favored the Yam'rii.\nThe individual called Grievous the \"last hope\" for their people, anointing the general by drawing red markings across his face with a finger. The Kaleesh blessed Grievous, calling for the spirits of their ancestors to watch over him and his soldiers, to which the general retorted that he would be fine as long as his troop carrier, the Martyr, held together. The Kaleesh individual watched as Grievous took flight, although his voyage was cut short due to sabotage by the Confederacy of Independent Systems, who wished to recruit Grievous.\nThe Kaleesh individual had red skin and sharp white fingernails. The Kaleesh believed that the Republic and the Jedi showed favoritism towards the Yam'rii and that Grievous was the species' remaining hope for justice. The individual also held spiritual beliefs, calling on Grievous' ancestors to bless him. The general bowed before the Kaleesh to receive his blessing, even though Grievous was considered a demigod amongst his own people.\nAt the time of the meeting with Grievous, the Kaleesh individual held a white crooked staff and a brown satchel. The individual wore a white robe, two white bracelets on each arm, and had a head adorned with an animal skull.\nThe Kaleesh individual appeared in \"The Eyes of Revolution,\" a comic story written and illustrated by Warren Fu that was published in the anthology Star Wars: Visionaries, released on April 2, 2005.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kaleesh/Legends",
  "/wiki/Color/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/General/Legends",
  "/wiki/Huk_War",
  "/wiki/Gender/Legends",
  "/wiki/Species/Legends",
  "/wiki/Time/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Yam%27rii/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Kalee/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Troop_carrier/Legends",
  "/wiki/Martyr",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/God/Legends",
  "/wiki/Staff/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Bracelet/Legends",
  "/wiki/Bone/Legends",
  "/wiki/The_Eyes_of_Revolution",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Warren_Fu",
  "/wiki/Star_Wars:_Visionaries",
  "/wiki/April_2",
  "/wiki/2005",
  "/wiki/Category:Images_of_Unidentified_Kaleesh",
  "/wiki/Star_Wars_Insider",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/Star_Wars_Insider_86",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/Marvel_Comics"
 ]
}