{
 "name": "Unidentified_Death_Watch_soldier_(Concord_Dawn)",
 "display_name": "Unidentified Death Watch soldier  (Concord Dawn)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "58 BBY",
      "Concord Dawn"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Death Watch"
     ]
    }
   ]
  }
 ],
 "content": "A male Human Death Watch soldier fought against the True Mandalorians in a battle on the planet Concord Dawn, located in the Mandalore sector of the galaxy's Outer Rim. Together with the other members of the Death Watch, during the battle, the soldier forced the True Mandalorians to retreat into the fields of locally grown crops. He then joined the Death Watch leader, Tor Vizsla, in hunting down the scattered True Mandalorians and Mand'alor Jaster Mereel.\nUpon tracking the True Mandalorians to the Fett family farm, violence broke out, leading to the deaths of the farm's Journeyman Protector owner and his wife, as well as the kidnapping of their daughter, Arla Fett, events in which the Death Watch soldier took part. Though the True Mandalorians were able to save the family's young son, Jango Fett, they were forced to flee again; this time, however, the Death Watch ignited the fields where the True Mandalorians were taking refuge, and as they burned, the Death Watch believed their foes had perished.\nThinking themselves victorious, the Death Watch soldier and his compatriots rode into a nearby town in order to celebrate, only to come under siege from a True Mandalorian ambush. Amidst the fighting, the Death Watch soldier was attacked by a vengeful Jango Fett. Held at blaster-point by the boy, Jango remebered the soldier as the one, alongside Vizsla, who killed his family but the Death Watch Soldier only gruffly retorted that the dead Fetts were \"casualties of war\". The Death Watch then attempted to kill the boy with his gauntlet's vibroblade; slashing him across the face and knocking Jango to the ground. The Death Watch soldier prepared to finish him off only to be ultimately killed by the boy when Fett managed to grab a nearby blaster off the ground and shoot the man in the chest, avenging his family. Fett was subsequently picked up and taken in Jaster's arms where he asked the young boy if he felt better. The traumatized, and confused, boy stated no — or more rather he didn't know. With that, Jaster welcomed him into the Mandalorians and eventually took Jango as his adoptive son.\nThe Death Watch soldier first appeared in Star Wars canon in the first issue of the Jango Fett: Open Seasons comic series, written by Haden Blackman and published May 1, 2002.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/58_BBY",
  "/wiki/Concord_Dawn/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Death_Watch/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/True_Mandalorians",
  "/wiki/Battle_of_Concord_Dawn",
  "/wiki/Planet/Legends",
  "/wiki/Mandalore_sector/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Lightfight",
  "/wiki/Death/Legends",
  "/wiki/Secret_Mandalore",
  "/wiki/Tor_Vizsla",
  "/wiki/Mandalore_(title)",
  "/wiki/Jaster_Mereel",
  "/wiki/Clan_Fett",
  "/wiki/Farm/Legends",
  "/wiki/Journeyman_Protector/Legends",
  "/wiki/Fett_(Elder_Journeyman_Protector)",
  "/wiki/Jango_Fett%27s_mother",
  "/wiki/Arla_Fett",
  "/wiki/Time/Legends",
  "/wiki/Fire/Legends",
  "/wiki/Tank_(vehicle)/Legends",
  "/wiki/City/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/Jango_Fett:_Open_Seasons_1",
  "/wiki/Jango_Fett:_Open_Seasons",
  "/wiki/Star_Wars_comic_books",
  "/wiki/W._Haden_Blackman",
  "/wiki/May_1",
  "/wiki/2002",
  "/wiki/The_Essential_Atlas",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_History_of_the_Mandalorians",
  "/wiki/Star_Wars_Insider_80",
  "/wiki/Order_66:_A_Republic_Commando_Novel"
 ]
}