{
 "name": "Unidentified_Sith_emissary",
 "display_name": "Unidentified Sith emissary",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "A Force-sensitive male Sith Pureblood member of the Sith Empire served as a Sith emissary in the time before the Mandalorian Wars. Around 3978 BBY, the Sith Emperor sent the Sith Lord as an emissary to the planet Mandalore in order to convince Mandalore the Ultimate to help in the search for the Emperor's half-brother's tomb. Mandalore helped the Sith find the tomb, and the emissary told Mandalore about the vision that his Master had of the Mandalorians' rise and their defeat of the Galactic Republic.\nA male Sith Pureblood of the Sith Empire who achieved the rank of Sith Lord lived in the time prior to the Mandalorian Wars. Around 3978 BBY, he was chosen by the Sith Emperor to act as his emissary to the current Mandalore, Mandalore the Ultimate, the leader of the Mandalorian warriors. He was sent to the planet Mandalore and managed to convince Mandalore to help in his search for the Emperor's half-brother's tomb. After Mandalore helped the Sith find the tomb on the planet Rekkiad, the emissary retrieved the remains to bring back to the Emperor. He then told Mandalore of the vision his Master had seen of the Mandalorians rising up and defeating the Galactic Republic. He told Mandalore of how his Master saw the Mandalorians conquering many worlds, and of how they would crush the Republic until it collapsed on itself, promising Mandalore a glorious victory.\nTwo years later, the Mandalorians went on to invade the Republic, crushing countless worlds in the process, until in 3963 BBY the Jedi Knight Revan and his faction of Jedi joined the war. They were able to turn the tide, and Revan personally defeated Mandalore in combat. Only as Mandalore lay dying did he realize that he and his people were betrayed by the Sith and the emissary they sent, and that they were never meant to win the war but to test the Republic's strength. His final words to Revan were of the Sith's involvement, and he told Revan where he could find proof of their existence.\nThe Sith emissary was a Sith Pureblood male with red skin. He was persuasive and manipulative enough to convince Mandalore the Ultimate to help him in his search. He was also able to persuasively convince Mandalore to invade the Republic, with the help of his Force powers.\nThe Sith emissary was sensitive to the Force. He was a Sith Lord of the Sith Empire who was advanced enough in the use of the dark side to manipulate Mandalore's mind. He was so powerful in the art that the spell was only broken when Mandalore was fatally wounded.\nThe Sith emissary was first mentioned in Drew Karpyshyn's novel The Old Republic: Revan, released on November 15, 2011. The Sith was later mentioned in Pablo Hidalgo's reference book The Essential Reader's Companion, which was released on October 2, 2012.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Time/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/3978_BBY",
  "/wiki/Tenebrae",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Q%C3%A2zoi_Kyantuska",
  "/wiki/Mandalore_the_Ultimate",
  "/wiki/Search_for_Dramath_the_Second%27s_remains",
  "/wiki/Emperor/Legends",
  "/wiki/Dramath_the_Second",
  "/wiki/Dramath_the_Second%27s_tomb",
  "/wiki/Force_vision/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Emissary/Legends",
  "/wiki/Mandalore_(title)",
  "/wiki/Rekkiad",
  "/wiki/Skeleton/Legends",
  "/wiki/3976_BBY",
  "/wiki/3963_BBY",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Revanchist",
  "/wiki/Jedi/Legends",
  "/wiki/Battle_of_Malachor_V",
  "/wiki/Death/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Drew_Karpyshyn",
  "/wiki/The_Old_Republic:_Revan",
  "/wiki/November_15",
  "/wiki/2011",
  "/wiki/Pablo_Hidalgo",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/October_2",
  "/wiki/2012",
  "/wiki/The_Old_Republic:_Revan_(audiobook)"
 ]
}