{
 "name": "Unidentified_Trandoshan_gambler",
 "display_name": "Unidentified Trandoshan gambler",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A male Trandoshan gambler was gambling with some other Trandoshans at the Sanctuary cantina when they were attacked by the Wookiee bounty hunter Krrsantan. He tried to defend himself breaking a glass on the Wookiee's back, but Krrsantan immobilized him right after. Despite the cantina owner Garsa Fwip's advice to stop torturing the Trandoshan, Black Krrsantan ripped off his left arm and left him agonizing on the floor.\nAround 9 ABY, the Trandoshan male gambler played at a gambling table in the Sanctuary, a cantina in the city of Mos Espa on the desert planet Tatooine. The gambler had a streak of winning hands, celebrating with his three comrades. Unbeknownst to them, the Wookiee bounty hunter Krrsantan was staring them down from his booth. Becoming aggravated, the Wookiee made his way to the Trandoshans' gambling table and grabbed the gambler, throwing him across the room. While the bounty hunter proceeded to throw the other Trandoshans around, the gambler crawled to his feet and threw a glass at the back of Krrsantan's head.\nKrrsantan turned to the Trandoshan gambler, who looked back in fear. The Wookiee then lifted the gambler up to dismember him when Garsa Fwip, the Sanctuary's owner, intervened, attempting to convince the bounty hunter to let the Trandoshan go. Fwip offered to wipe Krrsantan's debt if he freed the gambler, but Krrsantan instead chose to rip off the Trandoshan's left arm, dropping his victim to the floor. The other patrons looked and cried out in horror, and Krrsantan left the cantina.\nThe male Trandoshan had green skin an yellow eyes. When Black Krrsantan attacked him and the other Trandoshans, he tried to fight back, but soon found himself staring at the Wookiee in fear when he realized he was outmatched.\nThe Trandoshan wore light blue and grey clothing with dark blue trousers, brown and black boots, and a blue belt that bore a black pouch at his front waist.\nThe Trandoshan gambler appeared in \"Chapter 4: The Gathering Storm,\" the forth episode of the Disney+ The Book of Boba Fett which was directed by Kevin Tancharoen and released on January 19 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Trandoshan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chapter_4:_The_Gathering_Storm",
  "/wiki/Gambling",
  "/wiki/Sanctuary_(cantina)",
  "/wiki/Cantina",
  "/wiki/Wookiee",
  "/wiki/Bounty_hunter",
  "/wiki/Krrsantan",
  "/wiki/Garsa_Fwip",
  "/wiki/9_ABY",
  "/wiki/Gambler",
  "/wiki/City",
  "/wiki/Mos_Espa",
  "/wiki/Desert",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Limb",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Kevin_Tancharoen",
  "/wiki/January_19",
  "/wiki/2022",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_211",
  "/wiki/Boba_Fett",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_5:_Return_of_the_Mandalorian",
  "/wiki/Chapter_7:_In_the_Name_of_Honor"
 ]
}