{
 "name": "Unidentified_Mandalorian_chieftain",
 "display_name": "Unidentified Mandalorian chieftain",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians"
     ]
    }
   ]
  }
 ],
 "content": "A Mandalorian chieftain was present during a meeting of numerous Mandalorian clan chiefs, mercenaries, and company heads with Mand'alor Boba Fett. Gathered at MandalMotors Hall in the city of Keldabe, Mandalore's capital, the chieftain opened the meeting with the question of who the Mandalorians would be fighting for in the growing war between the Galactic Alliance and the fledgling Confederation.\nA humanoid male, this Mandalorian came to become the chieftain of his clan at some point prior to the year 40 ABY. That year, he gathered with a number of other chieftains, clan leaders, and Mandalorian company CEOs at a meeting of the clans held in Mandalore's capital city of Keldabe, at MandalMotors Hall. There, in addition to the other clan leaders and numerous other Mandalorian mercenaries, bounty hunters, and any other Mandalorian who had been interested in attending, he questioned reigning Mand'alor Boba Fett as to what role the Mandalorians would take in the growing conflict between the Galactic Alliance and the Confederation. The chieftain believed that the Mandalorians should be involved, fighting on one side or the other—though he asserted no preference for either government—if for no other reason than because they always had some part in galactic warfare throughout history. When Fett suggested that Mandalore stay out of the war, the chieftain warned that the war may end up coming unwillingly to them.\nThe chieftain was later drawn into a discussion with the gathered clan leaders and soldiers when Neth Bralor suggested Mandalore look after itself and focus on rebuilding in the wake of the Yuuzhan Vong attack on the planet during the Yuuzhan Vong War. Minutes later, when the Mandalorian known as Graad—an avid supporter of the kadikla movement—suggested that Fett should recall a number of Mandalorians from diaspora throughout the galaxy, the chieftain and nearly all of the assembled Mandalorians looked to Fett for his response, one that would come in favor of Graad's suggestion. Soon after, the meeting broke up and the chieftain departed MandalMotors hall with the other assembled clan leaders.\nThe Mandalorian chieftain believed that the Mandalorians' place was fighting in the galaxy's wars, and he appeared to be proud of their legacy of being a presence in every major war in history. He was a politically wary man, as well, unconvinced that if Mandalore declared itself neutral of the rising civil war, it would be enough to keep them from being caught up in the hostilities.\nPhysically, the chieftain possessed a beard which he shaved in an ornate fashion, and an eye patch that he wore over one eye.\nThis unnamed Mandalorian chieftain made his first appearance in Star Wars canon in the novel Legacy of the Force: Sacrifice, the fifth entry in the Star Wars: Legacy of the Force series. Written by author Karen Traviss, the novel was published May 29, 2007.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Unidentified_Mandalorian",
  "/wiki/Mandalore/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Legacy_of_the_Force:_Sacrifice",
  "/wiki/Chief/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Chief_Executive_Officer/Legends",
  "/wiki/Mandalore_(title)",
  "/wiki/Boba_Fett/Legends",
  "/wiki/MandalMotors_Hall",
  "/wiki/City/Legends",
  "/wiki/Keldabe/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Confederation",
  "/wiki/Standard_year/Legends",
  "/wiki/40_ABY",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Neth_Bralor",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Battle_of_Mandalore_(Yuuzhan_Vong_War)",
  "/wiki/Planet/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Standard_minute/Legends",
  "/wiki/Graad",
  "/wiki/Kadikla",
  "/wiki/Politics/Legends",
  "/wiki/Eye_patch",
  "/wiki/Eye/Legends",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/Star_Wars:_Legacy_of_the_Force",
  "/wiki/Author/Legends",
  "/wiki/Karen_Traviss",
  "/wiki/May_29",
  "/wiki/2007"
 ]
}