{
 "name": "Unidentified_village_brother",
 "display_name": "Unidentified village brother",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "A human male individual worked as a farmer in a village during the Imperial Era, alongside his sister. While working in the field, his sister was saved from falling bales of harvested crops by Ahsoka Tano, who had survived the Jedi Purge and was living in the village under the alias \"Ashla.\" The sister noticed Tano's use of the Force, though her brother did not. That evening, the brother overheard his sister promising to keep Tano's secret. Believing the Galactic Empire would reward him for the information, the brother reported the Jedi while Tano and his sister were away delivering harvested crops to Mon-Hella. While they were gone, an Inquisitor arrived at the village and destroyed it searching for Tano. The Inquisitor killed everyone in the village except the brother and an old man and was about to kill the brother for lying about the presence of a Jedi when Tano and his sister returned. Tano intervened and saved him revealing her identity. The Inquisitor attacked Tano, but was defeated and killed relatively quickly. While relieved that her brother was still alive, his sister was also angry with him for his actions. Realizing the three survivors could not remain there, Tano used a comlink she had been given to contact Alderaanian Senator Bail Organa, who arrived in the Tantive IV to pick them up.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Resolve_(episode)",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Farmer",
  "/wiki/Imperial_Era",
  "/wiki/Unidentified_village_sister",
  "/wiki/Ahsoka_Tano",
  "/wiki/Great_Jedi_Purge",
  "/wiki/The_Force",
  "/wiki/Galactic_Empire",
  "/wiki/Unidentified_Inquisitor",
  "/wiki/Attack_on_a_farm_village",
  "/wiki/Inquisitor",
  "/wiki/Unidentified_old_man_(Ahsoka_Tano)",
  "/wiki/Jedi",
  "/wiki/Death",
  "/wiki/Comlink",
  "/wiki/Alderaanian",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Tantive_IV",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_village_brother",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)"
 ]
}