{
 "name": "Unidentified_Devastator_captain",
 "display_name": "Unidentified Devastator captain",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "A human male Imperial Navy officer was the captain of the Dark Lord of the Sith Darth Vader's Imperial I-class Star Destroyer Devastator. In 9 BBY, he informed the Sith Lord of the Inquisitor Third Sister's arrival before applying her new Grand Inquisitor rank plaque when she was promoted. At his superior's behest, the captain set a course for the planet Jabiim afterwards. At Jabiim, the captain reported on the success of the assault against Jedi Master Obi-Wan Kenobi and his allies. Lord Vader then instructed him to pass down the orders to stand down, believing their quarry was already in their grasp. Following the Path's escape, the captain stood by his superior and the Grand Inquisitor during the ongoing pursuit of Kawlan Roken's freighter and later carried out Lord Vader's command to solely follow the pod piloted by Kenobi.\nBy 9 BBY, during the time, the male Imperial officer served as the naval captain of the Imperial I-class Star Destroyer Devastator, the flagship of Dark Lord of the Sith Darth Vader. That year, the Inquisitor Third Sister was summoned aboard the Devastator to report on her tracking of the fugitive Jedi Obi-Wan Kenobi. The captain went to the Dark Lord at the Devastator's bridge and stood at ease, informing his superior of the Inquisitor's arrival.\nThe Devastator's captain gave way as the Third Sister went to the Dark Lord and stood at ease behind the Inquisitor as she informed their superior that Kenobi had gone to the planet Jabiim. Pleased with her news, the cyborg had her kneel and awarded her the rank of Grand Inquisitor, the captain walking over and applying a pinned rank plaque to her uniform. Lord Vader then ordered the captain to set a course for Jabiim immediately.\nThe Devastator made its way to Jabiim, where the Dark Lord sent a force of stormtroopers and two purge troopers led by the new Grand Inquisitor, the Third Sister. The Inquisitor led the forces in an attack on a base run by an anti-Imperial network known as the \"Hidden Path,\" which was helping Kenobi and a number of refugees. Once the Third Sister's force breached the base and began fighting inwards, the Devastator's captain updated his superior on the progress. Vader had the captain inform the Inquisitor to stand down, asserting that Kenobi was already in their grasp.\nFollowing the Path's escape, the Devastator continued its harrying of the insurgents, with the captain standing by Lord Vader and the Grand Inquisitor on the bridge throughout the ongoing chase. When a pod launched from Kawlan Roken's freighter, he notified his superior of it, specifying it held only one life form, the fugitive Jedi Master. In spite of the Grand Inquisitor's misgivings, Lord Vader had the captain break off pursuit and focus on following Kenobi.\nThe Devastator's captain was a human male with light skin and brown hair. He was initially skeptical of his superior's decision to stand down their forces on Jabiim. Nonetheless, the officer always carried out the Sith Lord's whims, even when the Grand Inquisitor put the judgement of the Dark Lord of the Sith into question.\nThe captain wore a gray-green Imperial officer's uniform, including an Imperial kepi with an officer's disk, black gloves and boots, and a black belt with a silver buckle and compartments. He bore two code cylinders that were visibly slotted above each breast and wore a rank insignia plaque on his left breast displaying three blue tiles followed by two red tiles in a horizontal row.\nThe captain appeared in \"Part V\" of the live-action Disney+ television series Obi-Wan Kenobi, directed by Deborah Chow and released on June 15, 2022. Credited as \"Devastator Captain,\" the character was portrayed by Crispian Belfrage.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_officer",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/9_BBY",
  "/wiki/Sith_Lord",
  "/wiki/Inquisitor",
  "/wiki/Reva_Sevander",
  "/wiki/Grand_Inquisitor",
  "/wiki/Planet",
  "/wiki/Jabiim",
  "/wiki/Attack_on_Jabiim",
  "/wiki/Jedi_Master",
  "/wiki/Hidden_Path",
  "/wiki/Lord",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Kawlan_Roken",
  "/wiki/Escape_pod",
  "/wiki/Imperial_Era",
  "/wiki/Navy",
  "/wiki/Captain",
  "/wiki/Flagship",
  "/wiki/Standard_year",
  "/wiki/Jedi",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Bridge_(starship)",
  "/wiki/Cyborg",
  "/wiki/Military_rank",
  "/wiki/Stormtrooper",
  "/wiki/Purge_trooper",
  "/wiki/Freighter",
  "/wiki/Hair",
  "/wiki/Sith",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Breast",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Part_V",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/June_15",
  "/wiki/2022",
  "/wiki/Crispian_Belfrage",
  "/wiki/Part_VI",
  "/wiki/Part_I",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Ultimate_Star_Wars"
 ]
}