{
 "name": "Unidentified_New_Republic_Gungan_diplomat",
 "display_name": "Unidentified New Republic Gungan diplomat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Otolla Gungan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "A male Gungan diplomat held an official position in the government of the New Republic. The diplomat, an elderly Gungan belonging to the Otolla subspecies, was known for his wildlife acumen. He enjoyed bringing pets from his homeworld of Naboo to Coruscant, capital of the Republic.\nAt some point after the foundation of the New Republic in 4 ABY, a male Gungan from the planet Naboo was appointed to an ambassadorial function within the young government. That individual belonged to the lanky Otolla subspecies of Gungan, which were differentiated from the Ankura by their elongated heads and retractable eyestalks.\nIn the course of his professional activities, he often traveled to the gleaming planet Coruscant, seat of the New Republic, with his two pets—a slavering blarth he kept on a leash and an igitz that he transported in a vivarium shaped like a typical Gungan hydrostatic bubble. At some point during his tenure, the Gungan diplomat participated in some sort of cortege in which galactic ambassadors marched with their favorite pets. The illustrious zoologist Lyrre T'enna immortalized that event in the published edition of her field guide.\nWhen he served the New Republic, the orange-skinned diplomat was already aged, as he sported prominent flesh whiskers that grew on older Gungans. He also wore the long robes patterned with Otoh swirls and the leather hood of the Reps, members of the Gungan High Council of Otoh Gunga, capital city of the Gungans on Naboo.\nThe diplomat enjoyed the company of domestic animals, including that of the blarths, a species of rotund and amiable creatures that had been kept as household pets by Gungans for many a century. His care for wildlife was also considered a sign of civic pride in the political class of Coruscant.\nThe unidentified Gungan diplomat was featured in The Wildlife of Star Wars: A Field Guide, a reference book published in 2001 and co-authored by Terryl Whitlatch and Bob Carrau. Whitlatch also illustrated the guide, which reused many conceptual drawings she had originally created for Star Wars: Episode I The Phantom Menace.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Naboo/Legends",
  "/wiki/Otolla/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Declaration_of_a_New_Republic/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Ankura/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blarth/Legends",
  "/wiki/Igitz",
  "/wiki/Vivarium",
  "/wiki/Hydrostatic_bubble/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Zoologist/Legends",
  "/wiki/Lyrre_T%27enna",
  "/wiki/Lyrre_T%27enna%27s_annotated_field_guide",
  "/wiki/Clothing/Legends",
  "/wiki/Otoh_swirls/Legends",
  "/wiki/Leather/Legends",
  "/wiki/Rep/Legends",
  "/wiki/Gungan_High_Council/Legends",
  "/wiki/Otoh_Gunga/Legends",
  "/wiki/City/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Politics/Legends",
  "/wiki/The_Wildlife_of_Star_Wars:_A_Field_Guide",
  "/wiki/2001",
  "/wiki/Terryl_Whitlatch",
  "/wiki/Bob_Carrau",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/Star_Wars:_Episode_I_The_Visual_Dictionary",
  "/wiki/StarWars.com"
 ]
}