{
 "name": "Unidentified_clone_trooper_pilot_(Bothawui)",
 "display_name": "Unidentified clone trooper pilot  (Bothawui)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Gold Squadron",
      "Gold Squadron"
     ]
    }
   ]
  }
 ],
 "content": "A clone trooper pilot was a member of Gold Squadron, a Republic Navy starfighter unit, during the Clone Wars. Piloting a V-19 Torrent starfighter, the clone trooper participated in a battle in the Both system in 22 BBY. Led by Jedi General Anakin Skywalker, Gold Squadron, including the clone pilot, departed from the Republic Star Destroyer Resolute, intending to combat a fleet of Confederate Munificent-class star frigates led by General Grievous. During the battle, the clone trooper told fellow pilot Gold Six to watch his stabilizer. As the starfighter unit took casualties from Confederate laser fire, Skywalker ordered Gold Squadron to retreat while he continued toward the frigates. Grievous' fleet was eventually destroyed by AT-TE walkers hidden in the asteroid belt.\nA clone trooper pilot was born on the planet Kamino, created to fight in the Grand Army of the Republic. The clone trooper pilot was assigned to the starfighter unit Gold Squadron in the Republic Navy. In 22 BBY, during the Clone Wars, Confederate General Grievous planned to invade the planet Bothawui, home of the native Bothans. However, the Republic became aware of the plans, and Jedi General Anakin Skywalker, along with a battle group consisting of three Venator-class Star Destroyers, were sent to protect the Bothan homeworld. Even though the Republic forces were outnumbered, Skywalker persisted in protecting the Both system from a fleet of Confederate Munificent-class star frigates commanded by Grievous. Skywalker placed several All Terrain Tactical Enforcers on asteroids in the gas giant Bothawui Prime's asteroid belt, planning to attack the Confederate ships from behind.\nAfter the Confederate frigates emerged from hyperspace, Grievous ordered his ships to navigate through the Bothawui asteroid belt, as the cyborg General planned to use the asteroids to cover his ships from Republic laser fire. Led by Skywalker in his Delta-7B interceptor, the clone pilot—wearing clone trooper armor with yellow markings—and the rest of Gold Squadron departed from the Star Destroyer Resolute in V-19 Torrent starfighters. The Jedi General led the clone pilots toward the approaching Confederate frigates but ordered Gold Squadron to hold positions, as he wanted the enemy ships to come closer so that the AT-TEs on the asteroids could attack them from behind. On Grievous' command, the frigates opened fire, causing damage to one of the Republic Star Destroyers. Just before one of Gold Squadron's starfighters was hit by laser fire, causing it to crash into another starfighter, the clone trooper pilot told wingmate Gold Six to watch his stabilizer. As the squadron took casualties from laser fire, Skywalker ordered the group to retreat, while he continued the assault on the approaching Confederate ships. Grievous' frigates were attacked by the Republic walkers from behind, eventually leading to the destruction of his fleet. However, Grievous himself was able to escape the battle.\nCreated from the genetic template of bounty hunter Jango Fett, the clone trooper pilot was a human male who stood at a height of 1.83 meters.\nThe clone trooper pilot was briefly seen in the sixth episode of the Star Wars: The Clone Wars television series' first season, \"Downfall of a Droid.\" In the episode, which aired on November 7, 2008, the clone was voiced by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_clone_trooper_pilot",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Gold_Squadron_(Galactic_Republic)/Legends",
  "/wiki/Downfall_of_a_Droid",
  "/wiki/Republic_Navy",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/V-19_Torrent_starfighter/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Battle_of_Bothawui/Legends",
  "/wiki/Both_system",
  "/wiki/22_BBY/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Clone_trooper_pilot/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Resolute/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Munificent-class_star_frigate/Legends",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Gold_Six_(clone_trooper)/Legends",
  "/wiki/Stabilizer/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/All_Terrain_Tactical_Enforcer/Legends",
  "/wiki/Walker/Legends",
  "/wiki/Golm_asteroid_belt",
  "/wiki/Planet/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Battle_group/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Golm",
  "/wiki/Starship/Legends",
  "/wiki/File:Munificents_emerge.png",
  "/wiki/Hyperspace/Legends",
  "/wiki/Asteroid_belt",
  "/wiki/Cyborg/Legends",
  "/wiki/Delta-7B_Aethersprite-class_light_interceptor/Legends",
  "/wiki/Phase_I_clone_trooper_armor/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Wingmate/Legends",
  "/wiki/Gene/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/November_7",
  "/wiki/2008",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Clone_Wars_Gambit:_Stealth",
  "/wiki/The_Clone_Wars:_Wild_Space",
  "/wiki/The_Essential_Atlas"
 ]
}