{
 "name": "Unidentified_stormtrooper_corporal",
 "display_name": "Unidentified stormtrooper corporal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "A male stormtrooper corporal served the Galactic Empire on the planet Lothal as a deck officer during the year 3 BBY. Serving with Lieutenant Yogar Lyste, the stormtrooper corporal was one of several Imperials assigned to oversee the safety of three Alderaanian Sphyrna-class Hammerhead corvettes that had come to Lothal in order to deliver relief aide to the famished civilians. Alongside a scanning crew, the corporal inspected the corvettes for contraband, but they did not find any. Later in the day, the rebel Spectres group—who were secretly in league with the ships' overseer—raided the depot where the ships were being held. The corporal attempted to stop the rebels, but he was subdued by rebel Ezra Bridger. The stormtrooper commanding officer regained consciousness shortly after the rebels flew off with all three Hammerhead corvettes.\nA human male lived during the Age of the Empire and served the Galactic Empire as a stormtrooper. By the year 3 BBY, the trooper was stationed on the planet Lothal with the military rank of corporal, and further served as the deck officer of the Lothal Depot near the city of Jalath in the position Stormtrooper Commander. At some point, Lothal was visited by a delegation from the planet Alderaan, who had been given permission from the Imperial Senate to deliver relief aide to the famished Lothal civilians. The delegation consisted of three Sphyrna-class Hammerhead corvettes under the leadership of Princess Leia Organa.\nThe corporal, along with a two-man scanning crew, received the delegation at the depot, unaware that the ships were intended to fall into the hands of the local rebellion.\nUpon meeting Organa face-to-face, she requested that she be able to begin delivering her relief aide. The corporal informed her that before she could do that, he and his crew had to inspect the cargo for contraband, and then wait for the arrival of Lieutenant Yogar Lyste, Organa's liaison for the relief mission. The corporal then continued with his scanning operation. During the time of the scan, Organa had Lyste hand over his own transport for her personal use. Along with two disguised rebels, Kanan Jarrus and Ezra Bridger, Organa helped rescue the Imperial prisoner Ryder Azadi and fake her own capture.\nShortly after the rescue, the corporal finished his scan after finding no contraband. He reported his findings to Lyste in person, shortly before Lyste received news of the abductions of Azadi and Organa.\nAfter nightfall, Organa returned to the depot aboard the scout ship Phantom. The corporal, Lyste, and another stormtrooper leveled blasters at the princess, at which point Organa claimed that the stormtrooper and Imperial cadet that were with her rescued her from the rebels. Lyste pushed the corporal's E-11 medium blaster rifle away from the princess and apologized for the misunderstanding.\nIn truth, the stormtrooper and cadet were Jarrus and Bridger, respectively. However, more rebels arrived shortly after to steal the Hammerhead corvettes. The corporal spotted Azadi freeing the ships from their gravity locks, and Lyste ordered his troopers to open fire. Azadi escaped immediate danger when rebel Sabine Wren took control of one of the corvette's weapon systems and fired at the Imperials, knocking the corporal to the ground.\nLyste and the troopers refocused their weapons, but Jarrus and Bridger sprung into action, with Jarrus subduing Lyste and the stormtrooper. Before the corporal could react, Bridger jumped onto his shoulders and began to beat the deck officer with his bare hands. After a brief struggle, Bridger tore off the corporal's helmet, knocked him to the ground, and knocked him out with a forceful punch to the face. Azadi, Jarrus and Bridger escaped in the last two corvettes, while Organa allowed herself to be stunned by Bridger to make herself appear a victim of the rebels. Lyste, the corporal, and the stormtrooper regained conscious shortly after the rebels departed, and Lyste apologized profusely to Organa for losing her ships.\nA male individual, the stormtrooper corporal followed his orders as directed. When speaking to Princess Organa, the corporal remained polite but asserted that his orders superseded her personal requests. The stormtrooper was attentive, as he had spotted Azadi working to free the corvettes out in the open while Lyste and the other trooper were occupied with the princess.\nThe corporal wore standard stormtrooper armor along with a black pauldron that allowed him to stand out against the other stormtroopers. The corporal used an E-11 blaster rifle during the rebel raid on Lothal.\nThe stormtrooper corporal appeared in the tenth episode of the second season of the television series Star Wars Rebels, titled \"A Princess on Lothal.\" The trooper played a supporting role in the episode, but was not identified by name or a callsign. The character was credited as \"Stormtrooper Deck Officer\" and was voiced by Steve Blum.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/A_Princess_on_Lothal",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Deck_officer",
  "/wiki/Standard_year",
  "/wiki/3_BBY",
  "/wiki/Lieutenant",
  "/wiki/Yogar_Lyste",
  "/wiki/Stormtrooper",
  "/wiki/Corporal",
  "/wiki/Alderaan",
  "/wiki/Sphyrna-class_Hammerhead_corvette",
  "/wiki/Scanning_crew",
  "/wiki/Corvette",
  "/wiki/Standard_day",
  "/wiki/Spectres",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mission_on_Lothal",
  "/wiki/Lothal_Depot",
  "/wiki/Ezra_Bridger",
  "/wiki/Stormtrooper_Commander",
  "/wiki/Imperial_Era",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Military_rank",
  "/wiki/City",
  "/wiki/Jalath",
  "/wiki/Imperial_Senate",
  "/wiki/Prince",
  "/wiki/Phoenix_Cell",
  "/wiki/Kanan_Jarrus",
  "/wiki/Ryder_Azadi",
  "/wiki/Scout",
  "/wiki/Starship",
  "/wiki/Phantom",
  "/wiki/Blaster",
  "/wiki/Cadet",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Gravity_lock",
  "/wiki/Sabine_Wren",
  "/wiki/Stormtrooper_armor",
  "/wiki/Pauldron",
  "/wiki/Blaster_rifle",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Callsign",
  "/wiki/Steve_Blum",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Jedi:_Fallen_Order"
 ]
}