{
 "name": "Unidentified_thief_(Codia%27s_second_moon)",
 "display_name": "Unidentified thief  (Codia's second moon)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 44 BBY and 32 BBY",
      "Codia's second moon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "A bearded human male thief was part of a group of burglars who attempted to steal diamonds from a mining outpost on Codia's second moon. The group destroyed the facility's power core, which created unusual radioactivity that suppressed the light spectrum in the outpost and drove the Defel miner Rosack Denahst mad, causing him to slaughter most of the thieves. The bearded thief then encountered the Jedi Qui-Gon Jinn and Obi-Wan Kenobi in the dark and stuck with them until he was attacked and killed by Denahst.\nA bearded human male who worked as a thief was part of a group of burglars who took part in a heist to steal a shipment of diamonds from a mining outpost on the second moon of the planet Codia I at some point between 44 BBY and 32 BBY. The group destroyed the fuel rod of the outpost's power core using a non-incendiary photonic charge; however, the core was primarily made of solid accelerite, so the charge's photonic burst created unusual radioactivity that suppressed the entire light spectrum in the outpost. One of the miners, a Defel named Rosack Denahst, was also driven into a frenzy by the radiation. After the thieves murdered six miners, Denahst slaughtered five of them and fatally wounded another who died soon after.\nAlone in the darkened outpost, the bearded thief called out for help and was soon found by the Jedi Master Qui-Gon Jinn, who had been sent to investigate the facility with his Padawan, Obi-Wan Kenobi. The thief explained to Jinn that he was a criminal and that the core was destroyed; the Jedi then led the thief through the darkness to find Kenobi, who had been fighting with Denahst. After the Defel fled, Jinn and Kenobi discussed the core, and after the thief revealed that they had used a photonic charge, the Jedi realized what was causing the darkness and questioned if Denahst was part of the heist. Knowing nothing about the Defel, the thief denied his involvement, and the trio moved further into the facility until they came upon the corpses of the thief's compatriots.\nAs they looked at the bodies, they were fired upon by the outpost's supervisor, a Gran. Jinn disarmed the supervisor, and the group then exchanged information, allowing them to work out Denahst's identity. As the supervisor asked the Jedi to kill the Defel, the bearded thief moved away from the group but was attacked and killed by Denahst. Ultimately, the Jedi and supervisor were able to repair the core and restore Denahst's sanity. Many years later, around 0 BBY, Kenobi reflected on the incident and wrote about the thief in his journals while sheltering in his home on the planet Tatooine during a sandstorm.\nThe thief had light skin, light eyes, and white hair, including a beard and moustache.\nHe wore a jumpsuit with dark boots and a belt.\nThe thief was created for the second issue of the Star Wars: Obi-Wan comic series which was written by Christopher Cantwell, illustrated by Luke Ross, and published by Marvel Comics on June 29, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_thief",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Unidentified_thief_(Codia%27s_second_moon)",
  "/wiki/44_BBY",
  "/wiki/32_BBY",
  "/wiki/Codia%27s_second_moon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hair",
  "/wiki/Thief",
  "/wiki/Diamond",
  "/wiki/Unidentified_mining_outpost_(Codia%27s_second_moon)",
  "/wiki/Power_core",
  "/wiki/Radiation",
  "/wiki/Defel",
  "/wiki/Miner",
  "/wiki/Rosack_Denahst",
  "/wiki/Jedi",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Planet",
  "/wiki/Codia",
  "/wiki/Fuel",
  "/wiki/Non-incendiary_photonic_charge",
  "/wiki/Accelerite",
  "/wiki/Death",
  "/wiki/Unidentified_wounded_burglar",
  "/wiki/Jedi_Master",
  "/wiki/Mission_to_Codia%27s_second_moon",
  "/wiki/Padawan",
  "/wiki/Photonic_charge",
  "/wiki/Unidentified_outpost_supervisor",
  "/wiki/Gran",
  "/wiki/Standard_year",
  "/wiki/0_BBY",
  "/wiki/The_Journals_of_Ben_Kenobi",
  "/wiki/Ben_Kenobi%27s_home",
  "/wiki/Tatooine",
  "/wiki/Sandstorm",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Obi-Wan_2",
  "/wiki/Star_Wars:_Obi-Wan_(comic_series)",
  "/wiki/Christopher_Cantwell",
  "/wiki/Luke_Ross",
  "/wiki/Marvel_Comics",
  "/wiki/June_29",
  "/wiki/2022",
  "/wiki/Category:Images_of_unidentified_thief_(Codia%27s_second_moon)",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Reproduction",
  "/wiki/Battle_of_Yavin",
  "/wiki/StarWars.com",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}