{
 "name": "Unidentified_male_bar_patron",
 "display_name": "Unidentified male bar patron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "This bar patron was a male human who was present in the castle of Maz Kanata on Takodana when the First Order attacked the planet. He was seen talking to Grummgar as Finn left the castle with Sidon Ithano and Quiggold. Shortly aftwerward, he was one of the many people who witnessed the destruction of the Hosnian system from outside the castle.\nThe bar patron was portrayed by British actor Miltos Yerolemou in Star Wars: Episode VII The Force Awakens. The actor did not audition for the role, but was cast when casting director Nina Gold sent his tape to director J.J. Abrams, who was looking for character actors to play space pirates. Gold was familiar with the actor due to his work on Game of Thrones, for which she was also the casting director.\nDespite the character's short screen time, Yerolemou spent two weeks filming at Pinewood Studios. Due to the secrecy of the production, he received no script and wasn't told what he was going to do until he showed up for filming. Yerolemou wore orange plasters on his fingers and nose for the part, and had a tube going up his nose. He was told that they didn't have to do the tube, but the actor insisted that they keep it, saying that it was the best thing about the character's design.\nOriginally, the bar patron was going to have a bigger role in the film and was going to have a fight with the character Grummgar, with the patron asking for his money and the hulking alien having a go at him. However, due to time constraints, all that was shot was a segment where the patron is trying to have an argument with Grummgar; this can be seen in the background of two shots where Finn is leaving Moz Kanata's castle. Abrams intended for the patron and some of the other background characters to be involved in the story as opposed to merely being extras, and was frustrated that they ran out of time.\nFor the bit that was kept, Abrams instructed Yerolemou to stand in front of the animatronic Grummgar: \"You say something and he says something…in fact he's not going to say anything at all because we are going to dub it later.\" Because Grummgar was animatronic, with three people inside operating him, they did not rehearse the scene. The actor hadn't seen the creature move yet, so the first time they shot the scene, when the big alien started picking up a glass of brandy, the actor forgot that the characters were supposed to be having an argument, and ruined the take by blurting out his amazement. However, in the actual film, Grummgar is merely seen holding the glass and no line is dubbed in.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Takodana_Castle",
  "/wiki/Maz_Kanata",
  "/wiki/Takodana",
  "/wiki/First_Order",
  "/wiki/Battle_of_Takodana",
  "/wiki/Planet",
  "/wiki/Grummgar",
  "/wiki/Finn",
  "/wiki/Sidon_Ithano",
  "/wiki/Quiggold",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Hosnian_system",
  "/wiki/Miltos_Yerolemou",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Nina_Gold",
  "/wiki/J.J._Abrams",
  "/wiki/Pinewood_Studios",
  "/wiki/Currency",
  "/wiki/Brandy",
  "/wiki/Ultimate_Sticker_Collection:_Star_Wars:_The_Force_Awakens",
  "/wiki/April_14",
  "/wiki/2020",
  "/wiki/March_8",
  "/wiki/2022"
 ]
}