{
 "name": "Unidentified_Outer_Rim_cyberneticist",
 "display_name": "Unidentified Outer Rim cyberneticist",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "On an industrial wasteland world in the Outer Rim Territories, a certain cyberneticist worked circa 1500 BBY.\nThe cyberneticist created a unique set of armor that he was willing to test on Jaing and Durge. Jaing accepted and both he and Durge were given sets of the armor, but at a price.\nThe scientist wanted protection for himself and a rare Sith artifact that he had stolen from Mandalorians of Ung Kusp's clan. Jaing promised this protection, but as he did so a Mandalorian strike team burst through a wall in the scientist's lab and tried to take the artifact.\nJaing, Durge, and the doctor's assistant Nubyl in her combat cyborg form, made short work of the intruders until one of them threw a thermal detonator, and Jaing was fatally injured in the blast. Enraged, Durge routed the rest of the clan, and promised to kill every Mandalorian alive.\nUnknown to Durge, the events had been meticulously planned by the scientist himself, who told the dying Jaing that his plan to start a war between the Mandalorians and the Sith had come to pass.\nThe doctor's identity remains a mystery. The fact that the exact time period of Prototypes is never stated makes placing it on a timeline difficult, as does the seemingly immortal lifespan of Gen'Dai like Durge. With the inclusion of the Emperor's cane, the author may have been attempting to hint that the doctor was connected with Palpatine in some way. In addition, the \"war between the Mandalorians and the Sith\" that the doctor mentions could be interpreted as the New Sith Wars, the Clone Wars, or even another conflict. This article, and others referencing Prototypes, assume that it occurred shortly prior to the New Sith Wars, as context clues in the story seem to point to its placement there. Officially, though, no date has been laid down for Prototypes' events, and attempts to date them remain conjecture.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Cyborg_science_center",
  "/wiki/1500_BBY",
  "/wiki/Jaing",
  "/wiki/Durge/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Emperor%27s_cane",
  "/wiki/Mandalorian/Legends",
  "/wiki/Ung_Kusp",
  "/wiki/Nubyl",
  "/wiki/Prototypes",
  "/wiki/Gen%27Dai",
  "/wiki/Palpatine/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Clone_Wars/Legends",
  "/wiki/The_Clone_Wars_Campaign_Guide"
 ]
}