{
 "name": "Unidentified_aiwha",
 "display_name": "Unidentified aiwha",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aiwha"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unidentified aiwha pod"
     ]
    }
   ]
  }
 ],
 "content": "According to a Kaminoan legend, a male aiwha sacrificed himself to save his pod when the god-beast Protas stopped the pod from traveling south for the cold winter. Knowing they would die if they returned north, the aiwha pod fought Protas. The pod struggled to overcome their enemy until Protas exposed his throat, which the male aiwha saw and clamped down upon. Protas attempted to dislodge the aiwha, beating at and killing the aiwha. Even in death, the aiwha's jaws did not release, allowing his pod to deal a final blow to the god-beast.\nAccording to the Kaminoan species' mythological tale \"The Tale of the Aiwha Pod,\" a male aiwha lived with his pod in the oceans of the planet Kamino. One winter, the pod was traveling south out of the cold northern waters when they encountered the god-beast Protas, ruler of Kamino's oceans as the most powerful beast.\nPreviously, Protas was said to have defeated the titan Melkorr and overcome an army of kikla swimmers, both of whom had challenged the mystical Protas for his authority and rule. With the victories over his challengers, Protas became arrogant in his old age. It was with that mindset that he prevented the aiwha pod from continuing their journey south, directing them to turn back north on a whim.\nKnowing they would die if they returned to the northern waters, the aiwha allegedly attacked Protas as a unified force without warning or any desire for either fame or glory. Despite swarming the monster-god and making powerful attacks, they could not break the defenses of Protas' thick skin with enough efficacy to deal a killing blow. In the midst of the battle, Protas exposed his soft throat, creating an opening. The male aiwha saw the vulnerability and took advantage, clamping down on Protas' throat with his jaws. Realizing his error, Protas fought against the aiwha, dealing blow after blow to the brave creature. The blows took their toll, killing the aiwha but without complete success—even in death the aiwha did not release Protas, allowing the pod to deal a final blow and ending the battle.\nThe apparent sacrifice made by the aiwha, which allowed his pod to achieve victory, was remembered and immortalized in the tale that would eventually be translated from Kaminoan into Basic by an individual named Ryan Kaufman. The conduct of the pod in defeating Protas without seeking glory or power; the resulting peace in Protas' absence; and the self-sacrifice of the male aiwha, explained why the aiwha were accorded the respect of all the creatures of Kamino.\nThe aiwha, like the rest of his pod, did not seek glory or fame and took to battle out of his necessity to survive. He was brave and cared deeply for his pod, sacrificing himself to ensure their survival.\nThe aiwha was observant, noticing the weakness shown by Protas in the midst of battle. He also had strong jaws, able to hold on to Protas despite the beating sustained by the god-beast.\nThe aiwha appeared in \"The Tale of the Aiwha Pod,\" a short story by Ryan Kaufman, which was published in the 2005 reference book Star Wars: Republic Commando: Prima Official Game Guide.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Aiwha/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Unidentified_aiwha_pod",
  "/wiki/Kaminoan/Legends",
  "/wiki/The_Tale_of_the_Aiwha_Pod",
  "/wiki/Death/Legends",
  "/wiki/Deity/Legends",
  "/wiki/Protas",
  "/wiki/Pod_(social_group)",
  "/wiki/Temperature/Legends",
  "/wiki/Winter/Legends",
  "/wiki/Destruction_of_Protas",
  "/wiki/Species/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Water/Legends",
  "/wiki/Battle_of_Thalina",
  "/wiki/Melkorr",
  "/wiki/Battle_of_the_Ancient_Trench",
  "/wiki/Kikla",
  "/wiki/Magic",
  "/wiki/Kaminoan_(language)/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Ryan_Kaufman",
  "/wiki/The_Tale_of_the_Aiwha_Pod_(short_story)",
  "/wiki/List_of_short_stories",
  "/wiki/Ryan_Kaufman_(author)",
  "/wiki/2005",
  "/wiki/Star_Wars:_Republic_Commando:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}