{
 "name": "Unidentified_Quarren_boatman%27s_brother",
 "display_name": "Unidentified Quarren boatman's brother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Trask"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  }
 ],
 "content": "The brother of a Quarren boatman sought revenge on the Mandalorian Din Djarin, whom he believed had killed his brother when he went aboard the boatman's since sunken boat on the moon Trask. The Quarren confronted Djarin at the port with a number of Quarrens and threatened to kill Grogu. However, the boatman's true killers arrived and killed the boatman's brother and his comrades.\nIn 9 ABY, during the reign of the New Republic, the brother of a Quarren boatman was present on the estuary moon of Trask. One day, the boatman was killed while after taking the Mandalorian Din Djarin and his foundling Grogu aboard his boat, which sank along with the entire crew. Believing that Djarin had killed the boatman, the boatman's brother, holding a spear, confronted the Mandalorian and Grogu that night at the port, backed by a number of armed Quarren.\nThe boatman's brother accused Djarin of killing his the boatman, but the Mandalorian simply asked to for the Quarren to let him pass. The brother, though, ignored Djarin's request and threatened to kill Grogu in revenge. That was when three other Mandalorians flew down on jetpacks to assist Djarin. The lead Mandalorian, Bo-Katan Kryze, revealed that she had killed the boatman. She and her two comrades then fired on the boatman's brother and his assailants, killing all of them. The Mandalorians departed the scene after.\nThe Quarren boatman's brother was a Quarren male with orange skin and blue eyes. Believing Din Djarin had killed the boatman, he was insistent with the Mandalorian and wished to kill Grogu in revenge.\nThe boatman's brother wore a green coat with a brown belt and brown trousers and boots. He wielded a spear and had white fabric wrapped around his wrists.\nThe Quarren boatman's brother appeared in \"Chapter 11: The Heiress\" of Jon Favreau's Disney+ series The Mandalorian, which was directed by Bryce Dallas Howard and released on November 13, 2020. He was credited as \"Quarren\" in the subtitles.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/9_ABY",
  "/wiki/Trask",
  "/wiki/Quarren",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chapter_11:_The_Heiress",
  "/wiki/Unidentified_Quarren_boatman",
  "/wiki/Mandalorian",
  "/wiki/Din_Djarin",
  "/wiki/Boat",
  "/wiki/Moon",
  "/wiki/Death",
  "/wiki/Grogu",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Water",
  "/wiki/Standard_day",
  "/wiki/Foundling",
  "/wiki/Spear",
  "/wiki/Jetpack",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/Eye",
  "/wiki/Jacket",
  "/wiki/Belt",
  "/wiki/Boot",
  "/wiki/Jon_Favreau",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Bryce_Dallas_Howard",
  "/wiki/November_13",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Chapter_13:_The_Jedi"
 ]
}