{
 "name": "Unidentified_SIS_Assassin_(Mission_to_Corellia)",
 "display_name": "Unidentified SIS Assassin  (Mission to Corellia)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Strategic Information Service",
      "Republic Strategic Information Service",
      "Darth Baras' spy network"
     ]
    }
   ]
  }
 ],
 "content": "An assassin was in the employ of the Dark Lord of the Sith Darth Baras around 3640 BBY. An agent for Baras within the ranks of the Republic Strategic Information Service , this human male operated as an assassin, and was entrusted by the Dark Lord—along with two other operatives—with killing Darth Darth Vowrawn.\nDuring the Cold War between the reconstituted Sith Empire and the Galactic Republic, an SIS assassin was hired by three different Sith to kill the rogue Lord Grathan's son on Dromund Kaas, but the issue with Grathan and his heir was resolved by an apprentice of Darth Baras.\nAround 3640 BBY, as the conflict with the Republic waged on and intensified into the Galactic War, the power-hungry Baras became a Dark Councillor of the Empire and severed his mentorship with the very same apprentice who stepped in on the Grathan issue, as the Councillor saw the rising Sith as a threat. Amidst the absence of the Sith Emperor and the disappearance of the Voice of the Emperor on Voss, Baras also declared himself the new Voice before the Dark Council. He was met with only one voice of opposition—Darth Darth Vowrawn—who openly challenged Baras' bid.\nSeeking to eliminate opposition, Darth Baras contacted three assassins to remove Vowrawn, who was entrenched in the Battle of Corellia against both local resistance and Republic forces. One assassin was an SIS personnel, who travelled to the Core World of Corellia to fulfill his highly dangerous mission, not daring to infringe the powerful Darth Baras.\nThe SIS assassin took a Fortitude-class assault shuttle, landing it on the rooftop of the Gannir Executive Suites skyscraper in the Incorporation Islands district of Corellia and descended from the Assassin Ship. On the roof, the operative prepared to assassinate the nearby Vowrawn, who led Imperial forces on the planet from within a Republic facility as a security precaution.\nHowever, the former apprentice of Darth Baras made retaliation efforts against the self-proclaimed Emperor's Voice, and with agents of the Emperor's Hand—a organization within the Sith Empire loyal to the Emperor—secured intelligence of the assassination attempts, and the former apprentice—now a Sith Lord and the Emperor's Wrath—had routed the first assassin, an Imperial droid, and reached the roof of the building upon which the SIS assassin stood via the building's turbolift.\nIntercepted by the Emperor's Wrath, a confrontation ensued, and the assassin was ultimately killed by the Wrath, who proceeded to defeat the third assassin on a nearby skyscraper, thus protecting Vowrawn and foiling Baras' plans.\nThe assassin was impressed by the Wrath's dealings against Lord Grathan, Nomen Karr, Admiral Monk, the War Trust, and countless Jedi. Having studied the Darth Baras' former apprentice in a slightly obsessive manner, the SIS assassin knew that the Sith Lord confronting himself was the former apprentice of Darth Baras, and was honored to meet his personal hero, wanting to let the Wrath know of his personal appreciation as much as he was confident in defeating his opponent. This was not to be, however, as the agent was bested by the Emperor's Wrath.\nThe assassin is introduced in the Sith Warrior-class storyline of Star Wars: The Old Republic, where he is identified by his nametag as \"SIS Assassin.\" His ship is also given a conjectural name, being labelled \"Assassin's Ship.\"\nIf the player allows the assassin to speak, the assassin would reveal that he studied the player in great detail, admitting his near-obsessive observation of the Emperor's Wrath. Revealing his admiration for the Sith Lord, Baras' assassin then also divulged his view that the player would be bested as he himself had analysed his personal hero and opponent's tactics. Ultimately, he ruefully expresses his view of the Sith's impending death as unfortunate and attacks the player, only to fall to the Wrath's blade.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3640_BBY",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Strategic_Information_Service",
  "/wiki/Darth_Baras%27_spy_network",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Assassin/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Death/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Vowrawn",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Grathan",
  "/wiki/Beelzlit_Grathan",
  "/wiki/Dromund_Kaas",
  "/wiki/Parent/Legends",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Galactic_War",
  "/wiki/Dark_Council",
  "/wiki/Politics/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Valkorion",
  "/wiki/Sel-Makor",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Voss",
  "/wiki/Battle_of_Corellia",
  "/wiki/Corellian/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Fortitude-class_assault_shuttle",
  "/wiki/Gannir_Executive_Suites",
  "/wiki/Skyscraper/Legends",
  "/wiki/Incorporation_Islands",
  "/wiki/Starship/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Emperor%27s_Wrath",
  "/wiki/Turbolift/Legends",
  "/wiki/Mission_to_Corellia_(Emperor%27s_Wrath)",
  "/wiki/Nomen_Karr",
  "/wiki/Admiral/Legends",
  "/wiki/Monk_(Human)",
  "/wiki/War_Trust",
  "/wiki/Jedi/Legends",
  "/wiki/Template:TOR_dates"
 ]
}