{
 "name": "Unidentified_Rodian_prisoner",
 "display_name": "Unidentified Rodian prisoner",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "A Rodian was a prisoner of a Tusken Raider tribe on the planet Tatooine around 4 ABY. The prisoner was joined by another captive named Boba Fett, a famed bounty hunter. When Fett attempted to escape, the Rodian alerted the Tusken Raiders. The two prisoners were then taken to collect water with a Tusken child. After finding a moisture farm being raided, the child had the prisoners dig for water pouches. That was when the Rodian stumbled upon a sand beast which attacked them and suffocated them in the sand.\nAround 4 ABY, a Rodian was a prisoner of a Tusken Raider tribe, which tied them up against a broken tree branch. The raiders took another captive, the famed bounty hunter Boba Fett, who had been badly defeated in a skirmish at a Sarlacc pit. Fett was tied up at a tree branch next to the Rodian by a fireplace for the night, guarded by a massiff. Waking up, the bounty hunter looked around and exchanged a look with the Rodian prisoner, before breaking free of his bonds by baiting the massiff and using its teeth. Fett then offered to free the Rodian, but they instead called out to the Tuskens, leading the freed prisoner to be pursued and quickly recaptured.\nThe next morning, a Tusken child took the Rodian prisoner and Fett and led them across the dunes of Tatooine with the massiff, Fett stumbling due to how weak he had become. They arrived near a homestead which was being raided by a gang of Kajain'sa'Niktos. The Tusken child instead led the Rodian and Fett to a separate place and told them to start digging for black melons. While Fett could not understand the child's commands, the Rodian prisoner immediately began digging, leading their fellow captive to join them. The Rodian quickly found a black melon and handed it to the Tusken before continuing to dig.\nAs the two prisoners dug more, the Rodian found another black melon for the Tusken child, while Fett reluctantly handed over his first find. When the child and Massiff fell asleep, Fett complained to the Rodian, claiming they could escape, reach the settlement Anchorhead and get offworld. The Rodian ignored him, so he threatened to strangle them with their ankle chain, leading the Rodian to snap back at him until he advised them to lower their voice. Still digging, the Rodian then discovered a scaly limb, which attacked them. A sand beast revealed itself from the sand and mauled the Rodian, suffocating the prisoner in sand. Fett killed the creature after, and returned to the Tusken tribe with the child and Massiff.\nThe Rodian had pink skin and black eyes. Despite being captive to the Tuskens, the prisoner was loyal to them, informing them of Fett's escape attempt and working willingly for the Tusken child. The Rodian only spoke and understood his native language, being unable to understand Boba Fett in Galactic Basic Standard, who intended to free him by mistaking him for flaying him. Still, he did understand from the tone of voice when he was being insulted in the Galactic Basic Standard.\nThe Rodian wore a yellow and dark brown jumpsuit with brown boots.\nThe Rodian appeared in the flashbacks of \"Chapter 1: Stranger in a Strange Land,\" the first episode of the Disney+ series The Book of Boba Fett, which was directed by Robert Rodriguez and released on December 29, 2021. Credited only as \"Rodian Prisoner,\" Dawn Dininger provided visual portrayal and Sam Witwer voiced the character.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Rodian",
  "/wiki/Color",
  "/wiki/Tusken_Raider",
  "/wiki/Planet",
  "/wiki/Boba_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Unidentified_Tusken_Raider_tribe",
  "/wiki/Water",
  "/wiki/Unidentified_Tusken_Raider_youngling",
  "/wiki/Moisture_farm",
  "/wiki/Sand_beast",
  "/wiki/Tree",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Fire",
  "/wiki/Unidentified_massiff",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Massiff",
  "/wiki/Tooth",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Black_melon",
  "/wiki/Anchorhead",
  "/wiki/Limb",
  "/wiki/Death",
  "/wiki/Eye",
  "/wiki/Rodese",
  "/wiki/Jumpsuit",
  "/wiki/Boot",
  "/wiki/David_W._Collins",
  "/wiki/Chapter_1:_Stranger_in_a_Strange_Land",
  "/wiki/Disney%2B",
  "/wiki/The_Book_of_Boba_Fett",
  "/wiki/Robert_Rodriguez",
  "/wiki/December_29",
  "/wiki/2021",
  "/wiki/Dawn_Dininger",
  "/wiki/Sam_Witwer",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Book_of_Boba_Fett",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi"
 ]
}