{
 "name": "Unidentified_majordomo",
 "display_name": "Unidentified majordomo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Sulon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jerec",
      "8t88",
      "Other Government House executives"
     ]
    }
   ]
  }
 ],
 "content": "A Human male served as a majordomo for the Dark Jedi Jerec during his brief time as governor of the moon Sulon. The majordomo remained at Jerec's Sulon headquarters after the Jedi had moved on, and continued to serve other masters. When the droid information broker 8t88 came to stay at the tower, the majordomo sent 8t88 to a coat room while passing it off as a VIP guest suite, as he thought that it was where an uppity droid belonged. However, 8t88 caught on to the majordomo's duplicity and—after reprimanding him—killed the Human by breaking his neck. Afterwards, 8t88 noticed that the majordomo's death had invigorated the remaining staff.\nSometime during the Galactic Civil War, a Human male served as a majordomo for the Dark Jedi Jerec, an Inquisitor of the Galactic Empire, during Jerec's brief stint as governor of the moon Sulon during the year 0 BBY. The majordomo worked in the Sulon Government House, also referred to as the Dark Palace, and after Jerec's departure, the majordomo continued to serve the executives who would go on to take residence in the house. Bragging about his work for the house's past masters eventually became a hobby of the decadent majordomo.\nDuring the year 5 ABY, the droid information broker 8t88, who was under the employ of Jerec, took residence of the house while working on a project for the Dark Jedi. The majordomo was not fond of the droid, and as such passed off a coat room as a luxurious VIP guest suite for 8t88 to stay in, hoping to impress the rest of the house's staff by doing so. When the droid noticed that his room was conjoined to the palace's ballroom, 8t88 realized that he had been fooled; miffed by the duplicity, 8t88 tasked his henchman Rol to find the majordomo. When the majordomo was informed of his summoning, he took his time in answering the call and made sure to precede Rol into 8t88's \"guest suite.\" 8t88 coyly asked what the history of the house was and asked the majordomo to start with the alleged suite. Initially, the majordomo began to explain the history of the entire structure itself before 8t88 instructed the man to focus solely on the room. Before the majordomo could answer, 8t88 pointed out how it was attached to the ballroom—an observation 8t88 noted as being odd—and requested to know for what the room was originally intended, specifically being interested in its \"pedigree.\"\nThe majordomo silently considered confessing to the droid, but figured that bluffing out of it would be less embarrassing. As such, he persisted that the coat room was a VIP suite, and that it was assigned to 8t88 because of the droid's rank and stature, as well as the fact that it was the only room that could accommodate 8t88's pet hornagaunt Grendel. When 8t88 asked for him to come closer, the majordomo assumed that his cover had worked. However, as soon as he within reach of the mechanical, 8t88 reached out and grabbed the majordomo's robes and pulled him so they were face to face and revealed that he had already seen through the man's lies. 8t88 wrapped his fingers around the majordomo's neck as the man pleaded for mercy and promised to make amends. However, 8t88 rebuked him and snapped the majordomo's neck, which caused him to urinate, scream, faint and finally die. Afterwards, Grendel consumed the majordomo's body.\n8t88 later moved into a more luxurious study, and noticed that the majordomo's death invigorated the remaining staff.\nThe Human majordomo was known to boast about his service to the Dark Palace's resident governors. The majordomo held himself in high esteem, taking his time in answering 8t88's call and preceding Rol into 8t88's chamber. Believing that he could impress the Palace staff by putting 8t88 in a coat room, he became nervous when he believed that 8t88 had caught onto the deception and decided to bluff, thinking that would not be as embarrassing as confessing the truth. When addressing 8t88, the majordomo spoke with condescension in a manner that left Rol uneasy.\nWhen 8t88 made it clear that he was displeased with the majordomo's duplicity, the man urinated himself and begged for 8t88 to let the him make amends. However, 8t88 did not believe such a task was possible, claiming that the majordomo had a malfunction in his brain. In addition, 8t88 thought that the majordomo possessed a stigma against droids.\nThe majordomo was light-skinned, and adorned himself with a flowing red robe at the time of his death. The man was bald, but had black eyebrows and brown eyes.\nThe unnamed majordomo first appeared in the novella Dark Forces: Rebel Agent, which was written by William C. Dietz and released during 1998. The character appeared in one of the novella's illustrations, which was crated by artist Ezra Tucker. The character later appeared in the novella's full cast audio drama, where his voice was provided by Bob Otto. There are few differences in the scene between the novella and the audio drama. The most prominent difference is that the novella never clearly states where exactly the majordomo had placed 8t88; it only mentioned that 8t88's quarters were adjoined to a ballroom. The audio drama changes 8t88's dialogue in order to make it explicitly clear that the room was in fact a simple coatroom. Also in the novella, Rol goes to fetch the majordomo personally, whereas in the audio drama Rol only sent for the majordomo, and did not retrieve him on foot. Finally, the audio drama added extra dialogue to make up for the lack of the readable prose that the novella offered. This article treats the novella as the correct depiction of events.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/Sulon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jerec_(Inquisitor)",
  "/wiki/8t88/Legends",
  "/wiki/Government_House_(Sulon)",
  "/wiki/Dark_Forces:_Rebel_Agent",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Majordomo/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Rol_(Human)",
  "/wiki/Hornagaunt",
  "/wiki/Grendel",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Dark_Forces:_Rebel_Agent_audio_drama",
  "/wiki/William_C._Dietz",
  "/wiki/1998",
  "/wiki/Ezra_Tucker",
  "/wiki/Bob_Otto",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Wizards.com",
  "/wiki/The_Dark_Forces_Saga",
  "/wiki/0_ABY/Legends",
  "/wiki/Star_Wars:_Jedi_Knight:_Dark_Forces_II:_The_Official_Strategy_Guide"
 ]
}