{
 "name": "Unidentified_Imperial_commander_(Blockade_of_Kashyyyk)",
 "display_name": "Unidentified Imperial commander  (Blockade of Kashyyyk)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Military",
      "Imperial Military"
     ]
    }
   ]
  }
 ],
 "content": "A Human male commander in the Galactic Empire's military helped enforce martial law on the planet Kashyyyk during an Imperial blockade of the world during the Life Day holiday of 1.5 ABY. Leading a team of two stormtroopers and a technician, the commander entered residences of the planet's native Wookiees and searched for ties to the Rebel Alliance. When the Imperials arrived at the house of the Alliance hero Chewbacca, who was away from home, they harassed Chewbacca's family while awaiting his return, yet remaining ignorant of his identity. After dismissing the trader Saun Dann from the house; threatening Chewbacca's wife, Mallatobuck, with harm; and overseeing a search of the residence; the commander finally departed when Chewbacca's son Lumpawarrump covertly used a mini-transmitter to broadcast a \"return to base\" signal to the officer's comlink. Suspecting that their missing Wookiee was indeed a Rebel, the commander left stormtrooper B4711 at the house to await Chewbacca's return.\nA Human male with brown hair and brown eyes served as a commander in the Galactic Empire's military during the Empire's civil war with the Rebel Alliance. During the Wookiee holiday of Life Day midway through the year 1 ABY, the commander was dispatched to the Wookiee homeworld of Kashyyyk during an Imperial blockade of the planet. Martial law was declared and a curfew imposed due to suspected Rebel activity on Kashyyyk, and the commander led two stormtroopers and a technician from home to home in search of ties to the Alliance. Their hunt brought them to a treetop house in the city of Rwookrrorro that belonged to the family of Chewbacca, an Alliance hero.\nThe Imperials barged into the house and found three Wookiees: Chewbacca's wife, Mallatobuck, his father, Attichitcuk, and his son, Lumpawarrump. The Human trader Saun Dann was also present. As the residents cowered, the technician reported that another adult male Wookiee lived in the home; although unaware that the Wookiee in question was the famous Chewbacca, the commander demanded to know where he was. Dann offered his services as a translator between the Imperials' Basic and the Wookiees' Shyriiwook, but the commander was only interested in seeing the trader's identification. As he plugged Dann's identification card into a reader, he ordered his men to search the residence for any signs of Rebel activity. When the trader's card checked out, the commander dismissed him from the home, and a nervous Dann—who was also secretly a member of the Alliance, hoping to protect Chewbacca's identity—only departed when he found a stormtrooper's blaster rifle pointed at his chest.\nThe impatient commander bid his men to finish their search, but when one of the troopers pointed his rifle at a furious Mallatobuck after the other trooper knocked Lumpawarrump and Attichitcuk out of his way, the commander intervened. He ordered Mallatobuck to keep her son quiet, implying that harm would otherwise come her way. She cooperated by letting her son watch a cartoon about his father's adventures in the Rebellion, and when the video caused Lumpwarrump to scream, the commander investigated. The young Wookiee quickly changed the screen of his video book to instead display a game, and the commander lost interest. Meanwhile, the technician and one of the troopers tore apart Lumpawarrump's room during their search, and the commander afterward sent the young Wookiee to clean it up, hoping that it would keep him out of the Imperials' way.\nAll four Imperials directed their attention to the residence's wallscreen when a program began that announced itself as required viewing for all members of the Imperial forces. The program, entitled Life on Tatooine, was a live broadcast of a harrowing night in the life of Ackmena, the nightshift bartender of a cantina in the planet Tatooine's city of Mos Eisley. It was shown with the hope that viewers would be uplifted by a feeling of superiority over the cantina's lowly denizens. Following the program, the commander's comlink transmitted a \"return to base\" order, which the Imperials failed to realize had actually been broadcasted by Lumpawarrump via a mini-transmitter. The commander led the technician and one stormtrooper out the door but left trooper B4711 behind to await the return of the missing Wookiee. When Chewbacca did return, he and his Human companion, Han Solo, sent B4711 tumbling from the treetops down to the forest floor, and Saun Dann reported to another Imperial officer that the stormtrooper had fled into the woods. The officer believed the lie, and the Wookiees were free to celebrate Life Day without Imperial interference.\nThe Imperial commander had brown hair, brown eyes, and light skin. He wore prominent sideburns, which were popular with Imperial officers at the time. While in Chewbacca's home, the commander was short with Saun Dann and had little patience for the trader's attempts to interfere with the search for Rebel activity. He displayed a similar temperament to his own men and grew annoyed with their slow progress, adamant that there were other homes to be searched before the day's end. He frequently addressed his men with nothing more than a snap of his fingers.\nAlthough the commander prevented one of his stormtroopers from firing on Mallatobuck, he warned her not to test the trooper's patience, and subtly threatened her with harm unless she kept a reign on her son Lumpawarrump, whom the commander found annoying. Despite being unaware that he was in the home of Chewbacca, the commander suspected that the residence's missing Wookiee was one of the Rebels for whom he was searching, and acted on his suspicion by leaving B4711 behind after departing.\nThe Imperial commander first appeared in The Star Wars Holiday Special, a 1978 television feature that was spun off from the original 1977 Star Wars film. He was played by actor Jack Rader. Although addressed only as \"officer\" in the program, and referred to as \"Guard officer\" in the fourth draft of the Holiday Special's script, he was later identified as a commander in 1995's The Essential Guide to Characters. An Imperial commander was included in the Holiday Special as early as its initial story treatment, which features the character at an Imperial base, adamant with his aides that the Starship Musica vessel—carrying several Rebels—not be allowed to reach the Wookiee planet in time for holiday celebrations. A guest star, written to be played by actress Raquel Welch, volunteers to sabotage the ship.\nFollowing its only airing, the Holiday Special was almost universally panned. Star Wars author Alex Newborn has credited the Imperial characters as contributing factors to the program's poor finished product, calling them \"ineffectual Imperial antagonists\" in the midst of a 1970s variety show who helped lead to an overall lack of focus.\nIn the Holiday Special, the commander wears three code cylinders in his military uniform and sports a single row of six squares in his rank insignia. Although 2012's The Essential Guide to Warfare explains the use of code cylinders and rank insignia by officers of the Imperial Navy, no source has revealed the branch of the Imperial Military to which the Holiday Special's commander belongs. His uniform's tunic also parts down the middle, unlike the tunics worn by officers in the original Star Wars trilogy, which part down either the left or right side.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Commander/Legends",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/Chewbacca%27s_home",
  "/wiki/1_ABY/Legends",
  "/wiki/Unidentified_Imperial_commander_(Kashyyyk)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Battle_of_Kashyyyk_(c._18_BBY)",
  "/wiki/Kashyyyk/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/Planet/Legends",
  "/wiki/Life_Day/Legends",
  "/wiki/Holiday",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Unidentified_Imperial_technician",
  "/wiki/Wookiee/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Attichitcuk%27s_family",
  "/wiki/Merchant/Legends",
  "/wiki/Saun_Dann",
  "/wiki/Marriage/Legends",
  "/wiki/Mallatobuck/Legends",
  "/wiki/Lumpawaroo/Legends",
  "/wiki/Mini-transmitter",
  "/wiki/Officer/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/B4711",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/City/Legends",
  "/wiki/Rwookrrorro/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Attichitcuk/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Interpreter",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Shyriiwook/Legends",
  "/wiki/Identichip/Legends",
  "/wiki/Identification_reader",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Unidentified_Rebel_cartoon",
  "/wiki/Youngling/Legends",
  "/wiki/Video_book",
  "/wiki/Wallscreen",
  "/wiki/Life_on_Tatooine",
  "/wiki/Ackmena/Legends",
  "/wiki/Bartender/Legends",
  "/wiki/Chalmun%27s_Spaceport_Cantina/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Unidentified_stormtrooper_(Blockade_of_Kashyyyk)",
  "/wiki/Han_Solo/Legends",
  "/wiki/Tree/Legends",
  "/wiki/Unidentified_Imperial_officer_(wallscreen)",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/I_Have_a_Bad_Feeling_About_This!",
  "/wiki/1978",
  "/wiki/1977",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Jack_Rader",
  "/wiki/1995",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Aide/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Star_Wars",
  "/wiki/Alex_Newborn",
  "/wiki/Code_cylinder/Legends",
  "/wiki/Imperial_military_uniforms/Legends",
  "/wiki/Rank_insignia_plaque/Legends",
  "/wiki/2012",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Military_rank/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Star_Wars_Holiday_Special_(article)",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Star_Wars_Insider_106",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee",
  "/wiki/October_12",
  "/wiki/2006",
  "/wiki/Tyrant%27s_Test",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/Starwarsholidayspecial.com",
  "/wiki/December_23",
  "/wiki/2010",
  "/wiki/July_16",
  "/wiki/2011",
  "/wiki/Jawa%27s_Corner",
  "/wiki/Star_Wars_Insider_94",
  "/wiki/October_10",
  "/wiki/2009",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi"
 ]
}