{
 "name": "Unidentified_fisherman",
 "display_name": "Unidentified fisherman",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Theed",
      "Naboo"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "A Human male fisherman ran a boat the Solleu River, in the city of Theed on Naboo. During the Invasion of Naboo in 32 BBY, he met Padawan Obi-Wan Kenobi, who held a conversation with the fisherman before continuing his mission. The fisherman was later killed.\nDuring the reign of Queen Padmé Amidala, a red-haired Human male fisherman considered the Solleu River to be his home. The river ran through the capital city of the planet Naboo, Theed. He operated what he called the \"finest Naboo fishing rig ever built.\" In the year 32 BBY, the Trade Federation's droid army invaded Theed. Although the battle droids left the fisherman alone, the explosions during the invasion scared the fish away, leaving the man with nothing to do. During the battle, the Jedi Padawan Obi-Wan Kenobi, while escorting the Queen of Naboo during her escape from the planet, attempted to cross the river in order the reach a set of bridge controls. He jumped into the fisherman's boat to cross the river and held a short conversation with him before continuing.\nBy the time Queen Amidala returned to Naboo and fought to recapture Theed, the fisherman's boat had been sunk, and his body was seen in a nearby house.\nThis fisherman appears in Star Wars: Episode I The Phantom Menace video game, the 1999 video game adaptation of the Episode I movie. The player, taking the role of Kenobi, may meet this fisherman and hold a conversation with him during the course of the game's fifth mission, although it has no effect on the game. Bill Martin voices \"Fisherman.\"\nAs an in-game Easter egg, the game's development team made several NPCs to look like real-world celebrities. The fisherman was given the appearance of the famous musician and actor David Bowie. The Bowie-lookalike character model was also reused in the Coruscant level of the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(video_game)",
  "/wiki/Boat/Legends",
  "/wiki/Solleu_River/Legends",
  "/wiki/City/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Fishing/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Trade_Federation_Droid_Army/Legends",
  "/wiki/Fall_of_Theed",
  "/wiki/Battle_droid/Legends",
  "/wiki/Fish/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Bridge",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/1999",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Bill_E._Martin",
  "/wiki/Easter_egg_(virtual)",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Ray_West_(3D_artist)",
  "/wiki/August_13",
  "/wiki/2001"
 ]
}