{
 "name": "Unidentified_Kanji_criminal",
 "display_name": "Unidentified Kanji criminal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black and Blind"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "Kanji Criminal Enterprise",
      "Kanji Criminal Enterprise"
     ]
    }
   ]
  }
 ],
 "content": "A human criminal was a member of the Kanji Criminal Enterprise during the reign of the Galactic Empire. The Kanji protected the pit fighter Wyrmen Lictor protected as she won them a lot of money in the Garkata Fighting Arena on the Smuggler's Moon of Nar Shaddaa for winning fights. Between 3 ABY and 4 ABY, the bounty hunter Boba Fett, who fought under the name Jango, killed Lictor in a fight in the arena, and after Fett attempted to collect his winnings, the Kanji criminal and several others approached Fett and offered him the choice of either fighting again in the arena to earn the money he owed them for killing Lictor, or to just leave. Fett responded by telling the criminal to keep the credits and walked away, something the Kanji did not like.\nSometime later, the rebels Luke Skywalker, Chewbacca, and C-3PO traveled to Nar Shaddaa after hearing of a sighting of Fett on the moon. The three met with Chewbacca's contact, Sagwa, and made their way to the arena where they asked a Pa'lowick attendant about Fett. The Pa'lowick alerted the Kanji criminal and their associates, and they arrived shortly after. The criminal, still mad at Fett's killing of Lictor and not making it up to them, insisted that the rebels tell them where Jango was or they make up for his debts. Skywalker informed the criminal that they were not friends of Jango and were in fact trying to find his location, to which the Kanji responded that Skywalker and his companions were now property of the Hutts of Nar Kanji and that they would have to continue the discussion at their place.\nSkywalker drew his lightsaber and insisted that he and his friends were leaving, and that the Kanji should not try to stop them. The criminal told his group to kill Chewbacca, Skywalker, and Sagwa and to bring C-3PO to their place as they could slice the droid to find out what he knew. After Skywalker deflected multiple shots, the criminal came to believe he was a Jedi, and recalled that the Empire had never canceled their bounty for Jedi. The criminal then came up with a new plan of capturing the Jedi so they could collect the bounty on him, and also called for reinforcements. Despite the Kanji's efforts, they were unable to capture Skywalker, who escaped with his companions aboard the Millennium Falcon. As the rebels left, the Kanji criminal informed a member of their crew to call the Imperial Garrison on Vandor to provide them with information about the Jedi, which they thought they might be paid for.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/Kanji_Criminal_Enterprise",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Pit_fighting",
  "/wiki/Wyrmen_Lictor",
  "/wiki/Gender",
  "/wiki/Currency",
  "/wiki/Garkata_Fighting_Arena",
  "/wiki/Smuggler",
  "/wiki/Moon",
  "/wiki/Nar_Shaddaa",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Jango_Fett",
  "/wiki/Death",
  "/wiki/Credit",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Luke_Skywalker",
  "/wiki/Chewbacca",
  "/wiki/C-3PO",
  "/wiki/Mission_to_Nar_Shaddaa_(Rebel_Alliance)",
  "/wiki/Sagwa",
  "/wiki/Unidentified_Pa%27lowick_attendant",
  "/wiki/Pa%27lowick",
  "/wiki/Luke_Skywalker%27s_yellow_lightsaber",
  "/wiki/Slicer",
  "/wiki/Droid",
  "/wiki/Lightsaber_combat",
  "/wiki/Jedi",
  "/wiki/Bounty",
  "/wiki/Millennium_Falcon",
  "/wiki/Imperial_Garrison_(Vandor)",
  "/wiki/Vandor",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Unidentified_Kanji_criminal",
  "/wiki/War_of_the_Bounty_Hunters_Alpha_1",
  "/wiki/Star_Wars_(2020)_13",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}