{
 "name": "Unidentified_Tarasin_Force_ghost",
 "display_name": "Unidentified Tarasin Force ghost",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 21 BBY",
      "Cularin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tarasin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wyrd"
     ]
    }
   ]
  }
 ],
 "content": "In around 21 BBY female Tarasin was killed and transformed into a dark side spirit by the Wyrd witch coven. The spirit became a guard of a Wyrd enclave on the volcano Cloud Mountain on the planet Cularin and attacked a group of freelance agents that ventured to Cloud Mountain to challenge the witches. However, the Tarasin spirit was assaulted and vanquished by the Wookiee Force ghost Risstenni.\nA Force-sensitive Tarasin female lived on the planet Cularin during the time of the Clone Wars and became a Force Adept. Around 21 BBY, the Tarasin was targeted by the Wyrd, a coven of Tarasin Force witches, and placed within the Hand artifact, an ancient dark side artifact situated in a cavern on the dormant Cularin volcano Cloud Mountain. The Hand artifact allowed its users to enhance their own strength by drawing on the life force of a victim placed within; the Tarasin was subjected to this rite and killed, transforming her into a dark side spirit. The Tarasin Force Adept's ghost subsequently lingered at the Wyrd enclave on Cloud Mountain, serving the witches as a guard to the dark side relic that had taken her life.\nFollowing the establishment of the Wookiee colony Kiirloor close to Cloud Mountain, the Wyrd schemed to use the Hand artifact to trigger a volcanic eruption from Cloud Mountain and wipe the settlement away. A group of freelance agents arrived at the Wyrd enclave to challenge the witches and the Tarasin spirit determined to prevent the operatives from interfering with the Wyrd's plans to activate the volcano.\nAs the agents conversed with Risstenni, a Wookiee turned into a Force ghost by the Hand artifact, the Tarasin spirit manifested nearby. In an attempt to lure the operatives to the dark side of the Force, the Tarasin proclaimed her lamentation of the fate that had befallen her and the other victims of the Hand artifact and dared the agents to attack the Wyrd witches. A fight soon broke out between the Tarasin spirit and the freelance operatives and the Tarasin attempted to possess one of the agents. After some time, Risstenni joined the fracas and pounced upon the spirit, allowing the agents to pass and confront the Wyrd witches. The two spirits became locked in combat and the Tarasin spirit was eventually defeated and vanquished by the Wookiee ghost.\nFollowing her transcendence into the form of a dark side spirit, the Tarasin retained many of the mental attributes that she had held in life. As a spirit she was invulnerable to physical attacks.\nThe Tarasin spirit was familiar with the use of the Force to cast illusions and to influence the minds of others.\nThe Tarasin dark side spirit appeared within From the Trees, a 2003 roleplaying adventure by Ed Gibson and set within Star Wars Legends continuity that formed part of RPGA's Living Force campaign. In the adventure, the players roleplay as the freelance agents that the spirit encounters on Cloud Mountain. The Tarasin ghost attempts to possess the player character that is most concerned by the plight of the Wookiees of Kiirloor, or alternatively the player character most moved by the spirit's speech to the agents, or otherwise just a random member of the group. The Tarasin's name is not revealed in From the Trees.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Tarasin",
  "/wiki/Gender/Legends",
  "/wiki/Wyrd",
  "/wiki/From_the_Trees",
  "/wiki/Death/Legends",
  "/wiki/Force_ghost",
  "/wiki/Witch/Legends",
  "/wiki/Coven/Legends",
  "/wiki/Cloud_Mountain_Wyrd_enclave",
  "/wiki/Volcano/Legends",
  "/wiki/Cloud_Mountain",
  "/wiki/Planet/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Wookiee/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Risstenni",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force_Adept",
  "/wiki/Hand_artifact",
  "/wiki/Dark_side_artifact",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Kiirloor",
  "/wiki/Mind_trick/Legends",
  "/wiki/2003",
  "/wiki/Roleplaying_game",
  "/wiki/Ed_Gibson",
  "/wiki/RPGA",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance"
 ]
}