{
 "name": "Unidentified_Destroyer-Level_Craft_Operations_professor",
 "display_name": "Unidentified Destroyer-Level Craft Operations professor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Royal Imperial Academy",
      "Royal Imperial Academy"
     ]
    }
   ]
  }
 ],
 "content": "A male human professor taught the Destroyer-Level Craft Operations class at the Royal Imperial Academy on the planet Coruscant during the reign of the Galactic Empire. Some years before the Battle of Yavin, the professor asked his students during class which of the three methods of self-destruct should be used in a situation when a Imperial-class Star Destroyer has been taken over by enemies. One of the cadets, Thane Kyrell, suggested the automatic self-destruct, which would give the longest time to detonation, allowing more troops to evacuate in the escape pods. The professor, not satisfied with the answer, turned to Kyrell's classmate Ciena Ree, who suggested that the Destroyer's captain should signal for all to abandon ship, seal herself on the bridge, provide cover for escape pods, and ultimately crash the vessel into the nearest object and die with the vessel. The professor, satisfied with the answer congratulated Ree and awarded her with one of his rare smiles.\nThe professor first appeared in the 2015 junior novel Lost Stars, by Claudia Gray.. While the professor's species was not identified in the book, it was later confirmed to be human in a 2017 chapter of the book's Japanese webcomic adaptation, written and illustrated by Yusaku Komiyama.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Royal_Imperial_Academy",
  "/wiki/Destroyer-Level_Craft_Operations",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Imperial_Era",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Professor",
  "/wiki/Self-destruct_mechanism",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Imperial_cadet",
  "/wiki/Thane_Kyrell",
  "/wiki/Troop",
  "/wiki/Escape_pod",
  "/wiki/Ciena_Ree",
  "/wiki/Captain",
  "/wiki/Bridge_(starship)",
  "/wiki/Death",
  "/wiki/2015",
  "/wiki/Lost_Stars",
  "/wiki/Claudia_Gray",
  "/wiki/2017",
  "/wiki/Lost_Stars_(webcomic)",
  "/wiki/Yusaku_Komiyama",
  "/wiki/Lost_Stars_(audiobook)"
 ]
}