{
 "name": "Unidentified_female_dueling_fan",
 "display_name": "Unidentified female dueling fan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "During the Jedi Civil War between the Galactic Republic and Sith Empire, a Human female dueling fan lived on the Outer Rim city planet of Taris. In 3956 BBY, she was unable to get tickets for a dueling match in the Upper City Cantina and was forced to watch it on a viewscreen.\nA Human female dueling fan lived on the Outer Rim city world of Taris during the Jedi Civil War between the Galactic Republic and Sith Empire. In 3956 BBY, she and another fan were unable to get tickets for a match between Deadeye Duncan and Gerlon Two-Fingers in the Upper City Cantina's dueling ring. The other fan claimed that missing a duel between Duncan and Gerlon wasn't something to care about, but she told him to stop complaining and watch the viewscreen as it was about to start. The two patrons began watching as the announcer introduced the duelists and the duel began. Upon pulling out his blaster, Duncan dropped it and was defeated by Gerlon within seconds. The announcer assured the audience that he was just unconscious, and the duel came to an end.\nFormer Dark Lord of the Sith Revan, who had lost his memories and had the personality of a Republic soldier, survived the attack on the Endar Spire above the planet and eventually found himself at the Upper City Cantina. After talking to Ajuur the Hutt, he agreed to become a duelist under the name of the \"Mysterious Stranger.\" He approached the dueling fan, who talked about the other duelists. After Revan had won several matches, the woman became a fan of him, and mentioned such when she saw him again.\nThe dueling fan was a Human female with short brown hair, dark skin, and gray eyes.\nThe woman spent time in the Upper City Cantina where she enjoyed watching duels in person, and was frustrated when she was unable to get tickets. Her favorite duelist was the Rodian Twitch, as she liked how wild he was. She also liked watching the female duelist Ice, feeling that she proved dueling wasn't exclusive to men. The fan believed that Deadeye Duncan was terrible and wondered why he didn't just give up.\nThe woman wore an orange and yellow tunic with a green and mauve belt. She also wore black pants and yellow knee length boots.\nThe dueling fan appeared as a non-player character in the 2003 video game Star Wars: Knights of the Old Republic, developed by BioWare. She appears in a cutscene when the player enters a room in the Upper City Cantina. Additional interactions are optional and no dialogue affects plot, quest, or alignment.\nHer dialogue changes when the player wins dueling matches and when they become champion. She will also remark if they kill Bendak Starkiller in a death match, which gives dark side points and is thus considered non-canon in the Star Wars Legends continuity.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Taris/Legends",
  "/wiki/3956_BBY",
  "/wiki/Upper_City_Cantina",
  "/wiki/Viewscreen/Legends",
  "/wiki/Unidentified_male_dueling_fan",
  "/wiki/Deadeye_Duncan",
  "/wiki/Gerlon_Two-Fingers",
  "/wiki/Taris_dueling_ring",
  "/wiki/Unidentified_announcer",
  "/wiki/Blaster/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Canon",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Amnesia/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Attack_on_the_Endar_Spire",
  "/wiki/Endar_Spire",
  "/wiki/Planet/Legends",
  "/wiki/Upper_City",
  "/wiki/Cantina/Legends",
  "/wiki/Ajuur",
  "/wiki/Hutt/Legends",
  "/wiki/Mysterious_Stranger",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Twitch_(Rodian)",
  "/wiki/Ice_(duelist)",
  "/wiki/Clothing/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Boot/Legends",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Gorse_Bendak",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_New_Essential_Chronology"
 ]
}