{
 "name": "Unidentified_Ithorian_(Force_student)",
 "display_name": "Unidentified Ithorian  (Force student)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "N/A"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Shon-Ju's Force school"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Shon-Ju"
     ]
    }
   ]
  }
 ],
 "content": "A male Ithorian Force-user was a student of Shon-Ju. The Ithorian trained with Shon-Ju on the moon of Cavamina Minor with the other two other students. He assisted the Jedi Knight Aayla Secura when she was pursued by the mercenary Sabat. Later his master joined with Secura to arrest the mercenary Attuma Duum, although Shon-Ju betrayed Secura. Secura cut off Shon-Ju's hands, forcing him to flee. The Ithorian student later presided over the fitting of new prosthetics to Shon-Ju.\nAround 21 BBY, a male Ithorian was a student of Shon-Ju, a Force-user who had been rejected by the Jedi Order. Shon-Ju had spent time in exile forging a new way to use The Force, channeling it through his hands. He taught this Ithorian and two other students.how to use the Force in a similar way at Shon-Ju's castle on the moon of Cavamina Minor. One day, the Jedi Knight Aayla Secura crash-landed on the moon and was pursued by the mercenary Sabat. Shon-Ju and his students intervened on her behalf, charging directly at Sabat's men. This Ithorian used his Force powers to subdue two of Sabat's men, one of which was a Gungan. An injured Secura then collapsed from her injuries and was taken back to Shon-Ju's castle to recover. She and Shon-Ju agreed to join forces and take down the mercenary Attuma Duum, Sabat's employer.\nShon-Ju later betrayed Secura and tried to kill Duum to humiliate the Jedi Order. When Secura stopped him, he attacked her instead. Secura cut off Shon-Ju's hands to show him how powerless he was without them. He ran off in tears and was lost in the flames. Both Duum and Secura escaped Duum's asteroid base. Shon-Ju made his way back to his castle, and the Ithorian student and a 2-1B medical droid attended to him, giving him new prosthetic hands. The Ithorian commented that his master was whole again, but Shon-Ju used his hands to shear through the droid, declaring he was something more.\nThe Ithorian student proficiently channeled the Force through his hands in combat. He wore Jedi-style robes. Shon-Ju told Aayla Secura he was learning as much from his students, including this Ithorian, as they were from him.\nThis Ithorian appears sporadically throughout the 2010 graphic novella, The Clone Wars: Deadly Hands of Shon-Ju.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Shon-Ju%27s_Force_school",
  "/wiki/Shon-Ju",
  "/wiki/The_Clone_Wars:_Deadly_Hands_of_Shon-Ju",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Cavamina_Minor",
  "/wiki/Unidentified_Zabrak_(Force_user)",
  "/wiki/Unidentified_male_(Force_user)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Sabat_(mercenary)",
  "/wiki/Battle_of_Cavamina_Minor",
  "/wiki/Attuma_Duum",
  "/wiki/21_BBY/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Hand",
  "/wiki/Shon-Ju%27s_castle",
  "/wiki/Unidentified_one-eyed_Gungan",
  "/wiki/Attuma_Duum%27s_headquarters",
  "/wiki/2-1B/Legends",
  "/wiki/Medical_droid/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/2010"
 ]
}