{
 "name": "Unidentified_Dulok_(diamond)",
 "display_name": "Unidentified Dulok  (diamond)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Forest Moon of Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dulok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.35 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "King Gorneesh"
     ]
    }
   ]
  }
 ],
 "content": "As a member of King Gorneesh's tribe from the Forest Moon of Endor, one Dulok distinguished himself from the other members of his species via a yellow diamond shape emblazoned on his torso. He was otherwise a typical green-furred Dulok, although he sometimes wore a white cloth around his left arm and another on his right knee. By 3 ABY, the Dulok had become a warrior in his tribe, a position that allowed him to participate in assignments for King Gorneesh. These missions targeted the Ewoks of Bright Tree Village, a settlement near the Dulok Swamp. In one instance, the diamond-marked Dulok rode aboard the Ewok battle wagon after his tribe stole it from the Ewoks—although the Dulok fighter fell off the vehicle during an assault on the Ewoks' Soul Trees, items of great religious importance to the Duloks' rivals. On another occasion, the Dulok accompanied others in a hunting expedition, only to be defeated by the rogue Ewok Asha and her companions.\nAs a member of a tribe of Duloks led by King Gorneesh, one Dulok male distinguished himself from his fellows via a yellow diamond shape marked onto the fur of his torso. Like the other males who lived in the Dulok Swamp on the Forest Moon of Endor, the diamond-emblazoned Dulok participated in various tasks set out for him by the King. In 3 ABY, he joined several tribemates as they mounted a siege weapon known as a battle wagon, which they had stolen from its Ewok creators. In a bid to destroy the Ewoks' Soul Trees, natural trees that were of great spiritual significance to the Ewoks, the Dulok rode on the contraption's top deck as his comrades steered it to the forest around the Ewoks' home settlement, Bright Tree Village. Before the battle wagon could reach the site, however, a pair of Ewok children—Malani and Wicket W. Warrick—boarded the vehicle and attempted to stop the Dulok attack. When the Ewoks reached the top level, Gorneesh ordered the Duloks present to stop them. After another Dulok charged the enemies and fell to the forest floor, the diamond-marked Dulok followed suit and inadvertently fell off the wagon. In the end, the Ewoks disabled the device, a move that saved their Soul Trees and forced the Duloks to retreat to their swamps.\nThat winter, the diamond-marked Dulok participated in a hunting party with three others—a Dulok marked with an X, one marked with an O, and one with no markings—as they stalked a horned, bipedal creature known as a maramu. With club in hand, the Dulok with the diamond marking on his chest helped chase the maramu to the edge of a precipice, only to fall back down the slope when the the X-marked Dulok stumbled and fell backward into his compatriots. They clambered back up the slope and netted the creature, but a savage howl sounded from the trees nearby. Then a red-furred figure—called by the Duloks \"the Red Ghost,\" but actually a lone Ewok named Asha—appeared and snagged one of the Duloks with a lasso, pulled him into the tree, and dropped him onto his fellow hunters. Spooked by the apparition, the diamond-marked Dulok and his companions fled.\nHe next followed King Gorneesh and the shaman Umwak, along with his fellows with the X and O, the unmarked Dulok, and another member of the tribe with arrows marked on his chest, as they pursued quarry through the winter snows. The group captured several small creatures, which they placed in boxes, and another maramu, which the diamond-marked Dulok helped subdue with ropes. As if from nowhere, the Red Ghost appeared and casually strode into the Duloks' midst to free the maramu and other creatures from their traps. On Gorneesh's orders, the Duloks with the X, O, and diamond marked on them captured the Ewok with lassos, but she grabbed their ropes, spun the Duloks in a circle, and flung them into a snowbank. The King ordered another attack, but the Ewok stepped aside, and the Duloks collided with one another. She then roped a Dulok with arrows marked on him and flung him into the pile of downed foes. The hunting party fled the scene and stumbled onto a hollow log, which the diamond-marked Dulok sat astride with his fellows as they slid down the snowy slope and off the side of a cliff. A body of water broke their fall, but the King swore not to hunt in the forest again, lest he once more face the wrath of the Red Ghost.\nThe diamond-marked Dulok served his tribe as a warrior and hunter. He was familiar with the use of clubs, lassos, and spears. He was ambidextrous, sometimes wielding weapons in his left hand, others in his right. He was particularly adept with the lasso, able to capture a fleeing maramu from a distance. Nevertheless, he was a bit clumsy; in one instance, he and his fellows collided with one another while pursuing an enemy. While riding the Ewok battle wagon, he so zealously attacked his Ewok enemies that he overestimated his own momentum and fell to the forest floor.\nThe diamond-marked Dulok served King Gorneesh loyally, doing the ruler's bidding with little hesitation. The Dulok, like many of his compatriots, took delight in inflicting pain and suffering on others. When his hunting party captured a female Ewok, the diamond-marked Dulok laughed with the others at the Ewok's plight.\nA yellow diamond shape on his torso distinguished the Dulok from the other members of his tribe. In addition, he tied a strip of white cloth across his left upper arm and another around his right knee. Otherwise, he appeared virtually identical to the other members of his tribe, with green fur, gray skin, brown eyebrows, pink eyes, snarly teeth, and a lanky frame that stood him about 1.35 meters tall.\nThe Ewoks animated television series introduced the Dulok character with the diamond shape on his torso with the November 9, 1985, airing of \"Wicket's Wagon,\" an episode written by Paul Dini and directed by Raymond Jafelice. The Dulok was later featured in the November 30, 1985, episode, \"Asha,\" also by Dini and Jafelice. The DVD feature film Tales from the Endor Woods, first released in 2004, includes edited versions of both episodes. Adaptations of the stories and supplemental sources indirectly mention the Dulok by referencing the hunting parties and war bands in which he participated.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Endor/Legends",
  "/wiki/Dulok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/King/Legends",
  "/wiki/Gorneesh",
  "/wiki/Gorneesh%27s_tribe",
  "/wiki/Species/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Limb/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/City/Legends",
  "/wiki/Dulok_Swamp",
  "/wiki/Ewok_battle_wagon",
  "/wiki/Second_Battle_of_the_Soul_Trees",
  "/wiki/Soul_Tree",
  "/wiki/Hunting/Legends",
  "/wiki/Asha",
  "/wiki/Tree/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Malani",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Unidentified_Dulok_(O)",
  "/wiki/Winter/Legends",
  "/wiki/Unidentified_Dulok_(X)",
  "/wiki/Unidentified_Dulok_hunter",
  "/wiki/Maramu",
  "/wiki/Club/Legends",
  "/wiki/Rope/Legends",
  "/wiki/Shaman/Legends",
  "/wiki/Umwak",
  "/wiki/Unidentified_Dulok_(arrows)",
  "/wiki/Arrow/Legends",
  "/wiki/Water/Legends",
  "/wiki/Spear/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/November_9",
  "/wiki/1985",
  "/wiki/Wicket%27s_Wagon",
  "/wiki/Paul_Dini",
  "/wiki/Raymond_Jafelice",
  "/wiki/November_30",
  "/wiki/Asha_(episode)",
  "/wiki/Star_Wars_home_video_releases",
  "/wiki/Tales_from_the_Endor_Woods",
  "/wiki/2004",
  "/wiki/Wicket%27s_Wagon_(book)",
  "/wiki/The_Red_Ghost:_An_Ewok_Adventure",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Castaways_of_Endor",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology"
 ]
}