{
 "name": "Unidentified_Twi%27lek_bodyguard",
 "display_name": "Unidentified Twi'lek bodyguard",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A female Twi'lek bodyguard protected Baron Administrator Lando Calrissian in the Bespin settlement of Cloud City. In 1 ABY, she accompanied Calrissian to the city's maintenance levels, after the bounty hunter Bossk had sent a fake emergency report to lure him into a trap. The Twi'lek bodyguard and members of the Bespin Wing Guard engaged in combat against the mercenaries and cutthroats whom Bossk brought to the city, while Calrissian fled the ambush through a hangar.\nA female Twi'lek bodyguard protected Baron Administrator Lando Calrissian in Cloud City, a Tibanna mining colony on the planet Bespin. In 1 ABY, during the Galactic Civil War, former Baron Administrator Dominic Raynor, who had gambled away the city in a game of sabacc against Calrissian, hired the bounty hunter Bossk to hunt down the new Administrator because he believed that Calrissian had cheated in order to win their game.\nBossk brought a band of mercenaries and cutthroats—a Twi'lek scoundrel, another scoundrel of the same species, a Duro mercenary, and a Quarren assassin—to the city and set a trap for Calrissian. Impersonating the city's chief engineer, the bounty hunter reported that a primary repulsorlift pod was about to break down—a failure that would drop the floating city into the gas giant's molten core. In response, Calrissian went to the city's lower levels to check the pod, taking his Twi'lek bodyguard and four Bespin guards along as a precautionary measure.\nAfter Calrissian's group entered the maintenance level, a blast door suddenly shut behind them, and the Twi'lek and her companions came under fire from Bossk's ad hoc bounty hunter group. Calrissian's escorts decided to hold them off while the Baron Administrator escaped through a nearby hangar, and the Twi'lek engaged her opponents with a quarterstaff in the combat that erupted. Thanks to the distress call sent by a member of Calrissian's party, a quartet of Wing Guards, concerned by the sound of the firefight, arrived to assist the Baron Administrator, who fled the ambush through a nearby hangar.\nThe Twi'lek appeared in Sore Loser's Revenge, a Wizards.com online scenario written by Eric Cagle for the Star Wars Miniatures collectible tabletop strategy game in 2004. She was represented by a generic Twi'lek Bodyguard miniature figurine from the Miniatures set Rebel Storm. The survival of the character depends on the players' actions. Bossk kills the Twi'lek and captures Calrissian in an alternate ending to the scenario, but the short story Lando Calrissian: Idiot's Array rendered this ending non-canon by featuring Calrissian unharmed a few days after Bossk's ambush.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/City/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bossk/Legends",
  "/wiki/Bespin_Wing_Guard/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Ambush_in_Cloud_City",
  "/wiki/Hangar/Legends",
  "/wiki/Tibanna/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Baron/Legends",
  "/wiki/Administrator/Legends",
  "/wiki/Dominic_Raynor",
  "/wiki/Gambling/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Unidentified_Twi%27lek_1_(Ambush_in_Cloud_City)",
  "/wiki/Unidentified_Twi%27lek_2_(Ambush_in_Cloud_City)",
  "/wiki/Species/Legends",
  "/wiki/Unidentified_Duros_(Ambush_in_Cloud_City)",
  "/wiki/Unidentified_Quarren_(Ambush_in_Cloud_City)",
  "/wiki/Cloud_City_chief_engineer",
  "/wiki/Bounty/Legends",
  "/wiki/Repulsorlift/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Rethin_Sea",
  "/wiki/Blast_door/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Quarterstaff/Legends",
  "/wiki/Lightfight",
  "/wiki/Sore_Loser%27s_Revenge",
  "/wiki/Wizards.com",
  "/wiki/Eric_Cagle",
  "/wiki/Star_Wars_Miniatures",
  "/wiki/2004",
  "/wiki/Rebel_Storm",
  "/wiki/Lando_Calrissian:_Idiot%27s_Array",
  "/wiki/Canon",
  "/wiki/Lady_Luck_(comic)",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/StarWars.com",
  "/wiki/Unbound_Worlds"
 ]
}