{
 "name": "Unidentified_Mon_Calamari_admiral",
 "display_name": "Unidentified Mon Calamari admiral",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mon Calamari"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "A Mon Calamari female admiral served in the Alliance to Restore the Republic. She was present at a summit on the world of Zastiga when the Alliance's top admirals and generals learned of the existence of the Galactic Empire's second Death Star superweapon. As the group discussed how the Alliance might attack the weapon, she inquired how the fleet could assemble without alerting the Empire.\nShe received an answer from fellow Mon Calamari Gial Ackbar, who explained that they had discovered a hyperspace route called the Sanctuary Pipeline, which would allow them to accomplish both tasks. The Alliance would assemble the fleet at the planet Sullust, and would travel from there across the pipeline to the Forest Moon of Endor, where they would attempt to destroy the Empire's Death Star.\nA Mon Calamari female admiral of the Rebel Alliance was present during an emergency summit in 4 ABY on the remote trade world of Zastiga shortly before the Battle of Endor. At the meeting, the existence of the Galactic Empire's second Death Star was revealed, and Alliance High Command, along with the Alliance's top admirals and generals, discussed how they would go about attacking it.\nThe admiral raised her hand and asked how the Alliance Fleet would be able to assemble, since the Forest Moon of Endor was far from the main trade routes. She also inquired how the Alliance would be able to keep the Empire from learning about the impending attack. After the admiral spoke, Princess Leia Organa, a rebel leader who was also present at the meeting, admitted to herself that she did not know the admiral.\nThe Mon Calamari was answered by Gial Ackbar, commander of the Alliance Fleet, who showed a holographic map of the galaxy. He explained that rebel agents had discovered a secret hyperspace route that the Empire had created using S-thread boosters. The route, named the Sanctuary Pipeline, ran from the edge of the galaxy to the planet Sullust. The admirals, including the Mon Calamari female, muttered amongst themselves, wondering about the exorbitant cost of such a project. Ackbar further explained that the rebel fleet would gather over Sullust.\nAs the Empire needed to be kept unaware of the fleet's assembly, Organa suggested that she offer herself as bait for the Imperials. Although the admirals and generals were initially skeptical that a politician such as her should be telling them what to do, Organa was able to convince them that her plan, called Operation Yellow Moon, had merit, although Chancellor Mon Mothma required more time to make an executive decision. After the meeting, Mothma approved the mission, which successfully diverted the Empire's attention from the amassing of the fleet. The Rebellion later gained a decisive victory at the Battle of Endor, where they destroyed the second Death Star.\nThe admiral appeared in the 2015 junior novel Moving Target: A Princess Leia Adventure, which was co-written by Cecil Castellucci and Jason Fry.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Mon_Calamari",
  "/wiki/Mon_Calamari",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Planet",
  "/wiki/Zastiga",
  "/wiki/Admiral",
  "/wiki/General",
  "/wiki/Galactic_Empire",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Battle_of_Endor",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Gial_Ackbar",
  "/wiki/Hyperspace_route",
  "/wiki/Sanctuary_Pipeline",
  "/wiki/Sullust",
  "/wiki/Endor",
  "/wiki/Death_Star",
  "/wiki/4_ABY",
  "/wiki/Alliance_High_Command",
  "/wiki/Limb",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Supreme_fleet_commander",
  "/wiki/Hologram",
  "/wiki/Map",
  "/wiki/The_galaxy",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/Hyperspace",
  "/wiki/S-thread_booster",
  "/wiki/Galaxy",
  "/wiki/Fleet",
  "/wiki/Politics",
  "/wiki/Operation_Yellow_Moon",
  "/wiki/Chancellor_(Rebel_Alliance)",
  "/wiki/Mon_Mothma",
  "/wiki/Time",
  "/wiki/2015",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Cecil_Castellucci",
  "/wiki/Jason_Fry",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi"
 ]
}