{
 "name": "Unidentified_Naboo_artist",
 "display_name": "Unidentified Naboo artist",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "During the waning years of the Galactic Republic, a male human artist lived and worked on Naboo. In his studio at the base of an abandoned castle just outside the capital city of Theed, the artist repeatedly painted images of nothing but suns and moons. While visiting a bazaar in the city during the Clone Wars, the artist exchanged brief glances with the planet's senator, Padmé Amidala. Following the encounter, the artist was consumed by visions of Amidala and her unborn twin children. For twenty-four weeks afterward, the artist painted nothing but pictures of the senator, in the hope that he would be able to understand his visions. He eventually reached an epiphany and raced back to Theed, where he saved Amidala's life during an invasion of the city by the Confederacy of Independent Systems. After the incident, the artist became intrigued by the planet Alderaan.\nIn the final years of the Old Republic, a male human lived as an artist on the Mid Rim world of Naboo. This artist was a recluse and resided in his studio at the base of an abandoned castle located just north of Naboo's capital city of Theed. His mind was constantly occupied by images of suns and moons, and as a result he painted nothing but those celestial bodies. During the Clone Wars between the Republic and the Confederacy of Independent Systems, the artist traveled to a popular bazaar on the outskirts of Theed.\nCoincidentally, the senator of Naboo, Padmé Amidala, was also visiting the bazaar that day. While perusing the marketplace, the artist happened to exchange a glance with Amidala before she continued to shop. The encounter had a profound effect on him. Instead of experiencing images of suns and moons, the artist was consumed by visions of Amidala and her unborn twins. He lost all perception of the world around him, only able to see the senator and her children in his mind's eye. The artist was barely able to depart the bazaar and return to his studio, where he contemplated the meaning of the images. In an attempt to decipher what message they held, the artist painted for twenty-four consecutive weeks. The walls of his studio became so cluttered with his paintings of Amidala that many were relegated to simply resting on the floor.\nThe artist eventually reached an epiphany. In his visions, he had foreseen that the senator would be in danger, so he raced back to Theed to save her. The artist arrived in the city during a Confederate invasion and was forced to search the abandoned streets for his muse. The artist found her attempting to flee a force of B1-Series battle droids and OG-9 homing spider droids; however, before he could reach her, the droids opened fire. To save the senator's life, the man stepped in front of the laser fire and was gunned down. He survived the incident and later recovered, but he continued to paint based on his foreboding visions. His next inspiration was the peaceful Core World of Alderaan.\nThe Naboo artist was a reclusive man who spent much of his time alone in his abandoned castle-turned-studio. Although he was first obsessed with the idea of painting suns and moons, his encounter with Senator Padmé Amidala had a profound impact on him. He became fixated by the thought of her and her as-of-yet unborn children, much to his confusion. His drive to uncover the meaning behind the visions pushed him into twenty-four straight weeks of painting, followed by a heavy personal sacrifice in the name of saving his muse. The artists premonitions of Amidala's imminent danger were similar to those granted by the Force. The artist had light skin and a thick, darkly colored beard.\nThe artist owned an extensive collection of painting brushes, canvases, and colors. As his obsession with Amidala grew, he decorated the walls of his castle with framed portraits of the senator. The artist wore a wide-brimmed hat and a white shirt with a black coat and pants.\nThe artist's first and only appearance was in the short comic entitled The Artist of Naboo. The comic was written and illustrated by Erik Tiemens, a concept artist who worked on Star Wars: Episode III Revenge of the Sith. The Artist of Naboo was included in the trade paperback comic book Star Wars: Visionaries, published by Dark Horse Comics on April 2, 2005. Prior to that, the artist was mentioned in a preview for Visionaries published on StarWars.com on March 15 earlier that year.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Artist/Legends",
  "/wiki/The_Artist_of_Naboo",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Abandoned_Naboo_castle",
  "/wiki/Capital/Legends",
  "/wiki/City/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Star/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Invasion_of_Theed_(Clone_Wars)",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Mid_Rim",
  "/wiki/B1-Series_battle_droid",
  "/wiki/OG-9_homing_spider_droid/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Force_vision/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Erik_Tiemens",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Visionaries",
  "/wiki/Dark_Horse_Comics",
  "/wiki/April_2",
  "/wiki/2005",
  "/wiki/StarWars.com",
  "/wiki/March_15",
  "/wiki/Star_Wars_Insider",
  "/wiki/Drawn_By_The_Force",
  "/wiki/Star_Wars_Insider_82",
  "/wiki/The_Essential_Atlas"
 ]
}