{
 "name": "Unidentified_Clone_Commander_(13th_Battalion)",
 "display_name": "Unidentified Clone Commander  (13th Battalion)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Albedo Brave",
      "Bracca system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "13th Battalion",
      "13th Battalion"
     ]
    }
   ]
  }
 ],
 "content": "A Clone Commander was the clone trooper officer of the 13th Battalion who served under Jedi General Jaro Tapal during the Clone Wars and held the military rank of Clone Commander. The Commander helped Cal Kestis train aboard the Venator-class Star Destroyer Albedo Brave with Tapal, and was beside the two once they received their next orders.\nHowever, just as the new orders came in, Jedi Master Tapal felt a disturbance in the Force, and the Clone Commander received Order 66 from Supreme Chancellor Sheev Palpatine. The Commander immediately raised his blaster at Tapal, but the Jedi managed to kill him as he fired, cutting through his chest.\nCreated on the planet Kamino from the DNA of Jango Fett, a bounty hunter who became the template of the clone trooper army, the clone served as a Clone Commander in the Grand Army of the Republic by the end of the Clone Wars between the Galactic Republic and the Separatist Alliance as the clone commanding officer of the 13th Battalion that was led by Jedi General Jaro Tapal and his Padawan, Jedi Commander Cal Kestis.\nShortly prior to the end of the Clone Wars, the Jedi, the Clone Commander, and their unit participated in the Bracca Invasion, and were later stationed aboard the Albedo Brave after Bracca was secured. At this time, Tapal conducted some Jedi training with Kestis, and one exercise consisted of the Clone Commander firing his weapon at Kestis so that Kestis could deflect the harmless blaster bolts, although he surprised him with the timing. After Kestis finished the exercise and met with Tapal and the Commander in the training room's observation platform, Tapal informed Kestis that they were going to be relocating to Mygeeto and participate in the battle there.\nAt that moment, Tapal sensed a disturbance in the Force as Supreme Chancellor of the Republic Sheev Palpatine, secretly the Dark Lord of the Sith Darth Sidious, relayed Order 66, turning the clones against the now treasonous Jedi Order. The Clone Commander received a transmission from Palpatine on his holoprojector, which caused his inhibitor chip to activate, which made him see the two Jedi in front of him as traitors who should be executed. After acknowledging the order, the Commander raised his blaster towards Tapal. Reacting to the threat, Tapal deflected the bolt and sliced across the Commander's chest, killing him. Kestis, in a state of confusion, asked why the Commander attempted to kill him, to which Tapal responded that there were no answers to his questions and instructed him on how to escape, with a skirmish erupting on the Star Destroyer.\nAs a clone of Jango Fett, the Clone Commander was a human male who stood at 1.83 meters. The Commander found it humorous when he was able to fire cheap shots at Cal Kestis during training. When Order 66 was enabled, the Clone Commander did not disobey the command.\nAs a clone trooper officer, the Clone Commander was trained in combat and leadership.\nThe commander wore standard Phase II clone trooper armor with markings similar to the military unit led by Jedi General Chiata. Despite being an officer, the Clone Commander did not customize his armor, so that he looked like a normal clone trooper.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Clone_Commander",
  "/wiki/Kamino",
  "/wiki/19_BBY",
  "/wiki/Albedo_Brave",
  "/wiki/Bracca_system",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Galactic_Republic",
  "/wiki/13th_Battalion",
  "/wiki/Clone_trooper_officer",
  "/wiki/Jedi_General",
  "/wiki/Jaro_Tapal",
  "/wiki/Clone_Wars",
  "/wiki/Military_rank",
  "/wiki/Clone_Commander",
  "/wiki/Commander",
  "/wiki/Cal_Kestis",
  "/wiki/Jedi_training",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Jedi_Master",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/The_Force",
  "/wiki/Order_66",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Blaster",
  "/wiki/Jedi",
  "/wiki/Death",
  "/wiki/Planet",
  "/wiki/DNA",
  "/wiki/Jango_Fett",
  "/wiki/Bounty_hunter",
  "/wiki/Clone_template",
  "/wiki/Clone_trooper",
  "/wiki/Army",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Commanding_officer",
  "/wiki/Padawan",
  "/wiki/Jedi_Commander",
  "/wiki/Bracca_Invasion",
  "/wiki/Bracca",
  "/wiki/Time",
  "/wiki/Mygeeto",
  "/wiki/Fourth_Battle_of_Mygeeto",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Treason",
  "/wiki/Holoprojector",
  "/wiki/Skirmish_aboard_the_Albedo_Brave",
  "/wiki/Star_Destroyer",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/Chiata%27s_unit",
  "/wiki/General",
  "/wiki/Chiata",
  "/wiki/Officer",
  "/wiki/Armor",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_Art_of_Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones"
 ]
}