{
 "name": "Unidentified_Sanyassan_prison_warden",
 "display_name": "Unidentified Sanyassan prison warden",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sanyassa IV",
      "Endor"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 96 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sanyassan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sanyassan Marauders"
     ]
    }
   ]
  }
 ],
 "content": "An elderly Sanyassan was one of the Marauders, a band of pirates who crash landed on Endor in the first century before the Battle of Yavin. He resided in the Marauders' Stronghold with his fellow castaways and acted as a prison warden for their leader, the self-appointed King Terak.\nBy 3.5 ABY, the warden was tasked with watching Terak's prisoners in the Stronghold's cellblocks, along with a black-bearded colleague. As the two Sanyassans were playing cards, the Ewok Wicket Warrick and his companions sneaked into the dungeons and rescued their Human friend, the young Cindel Towani.\nAround 96 BBY, a group of Sanyassan pirates known as the Marauders tried to avoid the space law forces aboard their stolen starship. Due to the stellar anomalies of the Endor system, the Marauders were stranded on the green moon of Endor, and were forced to establish a new Sanyassan civilization there. This white-haired individual was one of them. For many decades, the Marauders brought terror to the Ewoks, a peaceful species who called Endor home.\nSeveral months before the destruction of the second Death Star, this white-haired Sanyassan was in charge of guarding the prisoners of King Terak, the brutal leader of the Marauders. When the old Human hermit Noa Briqualon, the Ewok Wicket Wystri Warrick and Teek sneaked into the dungeon to rescue their friend Cindel Towani, the warden was playing cards with a fellow Maurauder.\nThe tiny Teek scurried across the floor to untie the keys from the warden's belt. Then he pulled a card off the table and slipped it up the old Marauder's sleeve. When the elderly warden won the next game, he pounded the table in triumph. The hidden card fell out of his sleeve, and a brawl ensued, as his opponent called him a cheater. Both Sanyassans drew their blasters and fired at the same time, and both passed out and fell on the floor.\nAccording to Towani's rescue team, the card players were two of the meanest-looking, ugliest Marauders they had ever met. He had a thick, bushy white mustache and a few locks of thinning hair.\nLike most Sanyassans, the warden had a short temper. When the black-bearded Marauder accused him of being a cheater, he was immediately filled with anger. The warden quickly rose up on his feet and drew his blaster, ready to take on his opponent.\nThis elderly Marauder was a minor character in the 1985 made-for-TV film Ewoks: The Battle for Endor. He only appeared in a one-minute scene towards the last third of the movie. It is known that the two card players were portrayed by Michael Pritchard and Johnny Weissmuller Jr., but their roles were only credited as \"Card Player #1\" and \"Card Player #2\".\nThe movie leaves unclear of the Sanyassan died from the blaster shot he sustained. The children's book adaptation The Ring, the Witch, and the Crystal: An Ewok Adventure, however, states that he merely \"collapsed on the floor.\" The Sanyassans are known to have tougher hides than Humans, which mean the warden may have resisted the blaster's lethal energetic damage.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sanyassa_IV",
  "/wiki/Endor/Legends",
  "/wiki/96_BBY",
  "/wiki/Sanyassan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sanyassan_Marauders",
  "/wiki/The_Ring,_the_Witch,_and_the_Crystal:_An_Ewok_Adventure",
  "/wiki/Pirate/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Terak%27s_Keep",
  "/wiki/King/Legends",
  "/wiki/Terak",
  "/wiki/3_ABY/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Unidentified_black-mustachioed_Sanyassan",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cindel_Towani",
  "/wiki/Law_enforcement_agency/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Endor_system/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Species/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Noa_Briqualon",
  "/wiki/Teek",
  "/wiki/Blaster/Legends",
  "/wiki/1985",
  "/wiki/Ewoks:_The_Battle_for_Endor",
  "/wiki/Michael_Pritchard",
  "/wiki/Johnny_Weissmuller_Jr.",
  "/wiki/Databank_(original)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Illustrated_Star_Wars_Universe",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Endor_and_the_Moddell_Sector",
  "/wiki/Star_Wars_Gamer_9"
 ]
}