{
 "name": "Unidentified_stormtrooper_commander_(Lothal)",
 "display_name": "Unidentified stormtrooper commander  (Lothal)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "In the years prior to the Battle of Yavin, this Stormtrooper Commander was stationed at an Imperial facility of landed TIE fighters on the planet Lothal. During one of his patrols, he encountered the Mandalorian explosive artist and rebel from the Ghost crew Sabine Wren.\nThe Stormtrooper Commander was stationed outside an Imperial outpost of landed TIE fighters on the planet Lothal a few years before the Battle of Yavin. A Lothal citizen was in the area, and the commander assaulted him before ordering him to leave the restricted area. Shortly thereafter, a rebel named Sabine Wren snuck into the facility and drew the attention of two stormtroopers, including TK-626, who called for reinforcements. The commander and several other troopers arrived and searched for Wren in the facility, before finding an explosive that she had attached to the wing of a TIE fighter, in the center of graffiti art she had painted onto the side of the ship. Wren set off the explosive, destroying the TIE fighter and covering all of the troopers with paint. The explosion caused the distracted stormtroopers to miss the rebel starship Ghost, on which Wren was a crew member; the Ghost used the explosion as a diversion to fly away without being seen.\nThe Stormtrooper Commander donned an orange pauldron, to distinguish himself from the lower ranked troopers. He also equipped an E-11 medium blaster rifle.\nThe Stormtrooper Commander was voiced by Greg Weisman, one of the executive producers of Star Wars Rebels.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper_Corps",
  "/wiki/Art_Attack",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Planet",
  "/wiki/Lothal",
  "/wiki/Mandalorian",
  "/wiki/Artist",
  "/wiki/Ghost",
  "/wiki/Sabine_Wren",
  "/wiki/Stormtrooper_Commander",
  "/wiki/Commanding_officer",
  "/wiki/Stormtrooper",
  "/wiki/TK-626",
  "/wiki/Trooper",
  "/wiki/Starfighter",
  "/wiki/Graffiti",
  "/wiki/Starship",
  "/wiki/Spectres",
  "/wiki/Color",
  "/wiki/Military_rank",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/E-11_medium_blaster_rifle",
  "/wiki/Greg_Weisman",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Rise_of_the_Rebels",
  "/wiki/Sabine%27s_Art_Attack",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/2016",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/StarWars.com",
  "/wiki/File:Greg_Weisman_Stormtrooper_Voice_Tweet.png"
 ]
}