{
 "name": "Unidentified_Jedi_Master_(Kamino)",
 "display_name": "Unidentified Jedi Master  (Kamino)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple and green-yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "A humanoid Jedi Master served the Jedi Order during the Clone Wars. At the end of the conflict, the Jedi was stationed in Tipoca City, the capital of Kamino, the planet where the Grand Army of the Republic's clone troopers had been created. When Order 66, a secret command ordering the execution of all Jedi as traitors, was issued by Darth Sidious, they were among those killed. Subsequently, the members of the irregular clone commando unit Clone Force 99—most of whom were immune to the command due to genetic defects or cybernetics—saw the Jedi Master's corpse being carried through landing bay one-tac-one by Coruscant Guard shock troopers upon their return to Tipoca City, witnessing the dead Jedi's lightsaber falling from their hand.\nA Jedi Master served the Jedi Order during the final years of the Republic Era and the Clone Wars between the Galactic Republic and the Confederacy of Independent Systems. In 19 BBY, near the war's end, the Jedi was stationed in Tipoca City, the capital of the extragalactic planet Kamino, home to the Kaminoans who had created the clone troopers of the Grand Army of the Republic. Unbeknownst to the Jedi, who were aware the clone army had been commissioned by the deceased Jedi Master Sifo-Dyas, the clones' creation had been hijacked by the Sith, their ancient enemy, who had the clones engineered to execute them via the secret command Order 66, which also declared all Jedi to be traitors. When the command was given by Darth Sidious—publicly the Republic's Supreme Chancellor Palpatine—the Jedi Master was one of the many casualties, dying with their lightsaber in their hand.\nShortly after the issuance of Order 66, Clone Force 99—an irregular clone commando unit nicknamed the \"Bad Batch\"—returned to Kamino from a battle on Kaller. Four of the squad's five members were immune to the Order 66 mind control due to either their status as genetically defective clones or extensive cybernetic implants, and they were thus deeply confused by the situation, having witnessed the murder of Jedi Master Depa Billaba at the hands of her own troops. Landing their starship, the Marauder, in landing bay one-tac-one, the commandos were struck by the presence of Coruscant Guard shock troopers, before noticing two troopers carrying the Jedi Master's cloth-draped corpse through the hangar on a stretcher. The Jedi's left hand, clutching their lightsaber, slipped out from underneath the shroud, and the weapon fell to the floor. A nearby shock trooper officer picked up the lightsaber, before pointedly asking Clone Sergeant Hunter, the Batch's leader, if there was a problem due to the way he and his squad were staring. Hunter responded that there was no problem, and the officer stated that there would be a mandatory briefing at 1500 before leaving, following the troopers carrying the body.\nThe Jedi Master was a humanoid with a feminine body shape. Their skin was purple on the back of the hand and a greenish yellow on the palms, which had four fingers and a thumb.\nThe Jedi Master owned a lightsaber with a silver hilt and gold accents.\nThe Jedi Master appeared, unidentified, as a corpse in \"Aftermath,\" the first episode of the animated television series Star Wars: The Bad Batch, which premiered on Disney+ on May 4, 2021. Lucasfilm Story Group member Pablo Hidalgo later revealed that the Jedi Master was a new character who had been named in the episode's script, though Hidalgo did not say what the name was, stating he preferred to let someone closer to the show reveal the information.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Unidentified_Jedi_Master",
  "/wiki/19_BBY",
  "/wiki/Kamino",
  "/wiki/Humanoid",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Clone_Wars",
  "/wiki/Jedi",
  "/wiki/Tipoca_City",
  "/wiki/Capital",
  "/wiki/Planet",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_trooper",
  "/wiki/Cloning",
  "/wiki/Order_66",
  "/wiki/Death_penalty",
  "/wiki/Treason",
  "/wiki/Darth_Sidious",
  "/wiki/Death",
  "/wiki/Clone_commando",
  "/wiki/Clone_Force_99",
  "/wiki/Genetically_defective_clone",
  "/wiki/Cybernetics",
  "/wiki/Jedi_Master",
  "/wiki/Landing_bay_one-tac-one",
  "/wiki/Coruscant_Guard",
  "/wiki/Imperial_shock_trooper",
  "/wiki/City",
  "/wiki/Lightsaber",
  "/wiki/Standard_year",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Extragalactic",
  "/wiki/Kaminoan",
  "/wiki/Army",
  "/wiki/Sifo-Dyas",
  "/wiki/Sith",
  "/wiki/Behavioral_modification_biochip",
  "/wiki/Supreme_Chancellor",
  "/wiki/Limb",
  "/wiki/Conquest_of_Kaller",
  "/wiki/Kaller",
  "/wiki/Squad",
  "/wiki/Brain",
  "/wiki/Depa_Billaba",
  "/wiki/Gender",
  "/wiki/Depa_Billaba%27s_second_battalion",
  "/wiki/Starship",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Commando",
  "/wiki/Trooper",
  "/wiki/Hangar",
  "/wiki/Weapon",
  "/wiki/Unidentified_shock_trooper_quartermaster",
  "/wiki/Clone_Sergeant",
  "/wiki/Hunter",
  "/wiki/Officer",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Aftermath_(episode)",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Disney%2B",
  "/wiki/May_4",
  "/wiki/2021",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Category:Images_of_unidentified_Jedi_Master_(Kamino)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Orders"
 ]
}