{
 "name": "Unidentified_human_male_(Sullust)",
 "display_name": "Unidentified human male  (Sullust)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "A human male was at the planet Sullust's capital Pinyumb during the Galactic Empire's lockdown in 3 ABY. While at the public bathhouse with a number of injured when the rebels Nien Nunb and Hazram Namir arrived to help out. Blaming the Rebel Alliance's presence on Sullust for the Imperial lockdown, the man tried to reject the rebels, and expressed his beliefs to them.\nThe human male was present at the planet Sullust's capital city Pinyumb during the Galactic Civil War. In 3 ABY, the Galactic Empire locked the city down after the Rebel Alliance's 61st Mobile Infantry captured the nearby Inyusu Tor mineral processing facility. During the curfew, many residents were injured by Imperial crackdowns and some were tended to at a blue pool in a public bathhouse.\nThe man was at the pool when the 61st soldier and the Alliance's Sullustan resistance fighter Nien Nunb arrived to help the victims. He questioned why the pair were allowed to help, openly blaming them for the Imperial lockdown. When the man confronted Namir, telling the soldier that he and Nunb should not be at the bathhouse, the rebel replied that he his people had not caused anything. The man, though insisted that Namir's people were to blame. The two rebels continued to tend to the injured and eventually moved on.\nThe human male believed that the Rebel Alliance was to blame for the Empire's curfew and crackdowns at Pinyumb by being deployed to Sullust. He questioned the rebels' presence at the public bathhouse and scowled at Namir when telling the soldier that the rebels should not be there. The man was broad-shouldered, leather-faced, and had the carriage of a trained soldier to Namir.\nThe man appeared in the 2015 novel Battlefront: Twilight Company, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Planet",
  "/wiki/Sullust",
  "/wiki/Capital",
  "/wiki/Pinyumb",
  "/wiki/Galactic_Empire",
  "/wiki/3_ABY",
  "/wiki/Unidentified_public_bathhouse",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Nien_Nunb",
  "/wiki/Hazram_Namir",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/City",
  "/wiki/Galactic_Civil_War",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/Inyusu_Tor_mineral_processing_facility",
  "/wiki/Rebel_trooper",
  "/wiki/Sullustan_resistance",
  "/wiki/2015",
  "/wiki/Alexander_Freed",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Mission_to_Mustafar",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}