{
 "name": "Unidentified_Pa%27lowick_attendant",
 "display_name": "Unidentified Pa'lowick attendant",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pa'lowick"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow with purple spots"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kanji Criminal Enterprise"
     ]
    }
   ]
  }
 ],
 "content": "A Pa'lowick attendant worked in the registration center of the Garkata Fighting Arena on the moon Nar Shaddaa at some point between 3 ABY and 4 ABY. They gave the bounty hunter Boba Fett information about the fights when he had decided to enter the events. The attendant later betrayed the Jedi apprentice Luke Skywalker and his companions when they inquired for information about Fett, instead selling them out to the Kanji Criminal Enterprise.\nSometime between 3 ABY and 4 ABY, a Pa'lowick attendant worked in the registration center of the Garkata Fighting Arena in Wormtown, an area on the smuggling moon Nar Shaddaa. When the bounty hunter Boba Fett entered the fights in the arena under the name \"Jango,\" the Pa'lowick gave him information about the events' organization and collected the registration fee.\nA while later, the Jedi apprentice Luke Skywalker, the Wookiee Chewbacca, and Skywalker's protocol droid, C-3PO, arrived on Nar Shaddaa to investigate the mysterious fighter \"Jango,\" who they suspected to be Boba Fett. After meeting Sagwa, a Wookiee who worked as a guard at the arena, they asked for information from the Pa'lowick, but the attendant replied that information had a price. After being paid, however, the Pa'lowick did not give the promised answers and instead betrayed and sold the group out to the Kanji Criminal Enterprise that arrived to kill them. After an intense fight, Skywalker and his friends were forced to flee aboard their starship, the Millennium Falcon.\nThe Pa'lowick attendant had yellow skin with purple dots and blue eyes. Despite receiving the required credits for the requested information, the Pa'lowick betrayed Skywalker and his group, showing their allegiance to the Kanji. They also claimed that on Nar Shaddaa, business and betrayal were equal.\nThe attendant wore a pink hat decorated with a flower and a pink and golden-colored necklace. They also wore four golden bracelets and a red skirt.\nThe Pa'lowick attendant first appeared in the one-shot comic War of the Bounty Hunters Alpha 1, published by Marvel Comics on May 5, 2021. The comic was written by Charles Soule and illustrated by Steve McNiven and Laura Martin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Unidentified_Pa%27lowick",
  "/wiki/Pa%27lowick",
  "/wiki/Color",
  "/wiki/Kanji_Criminal_Enterprise",
  "/wiki/Garkata_Fighting_Arena",
  "/wiki/Moon",
  "/wiki/Nar_Shaddaa",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Gender",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Luke_Skywalker",
  "/wiki/Wormtown",
  "/wiki/Smuggler",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Mission_to_Nar_Shaddaa_(Rebel_Alliance)",
  "/wiki/Sagwa",
  "/wiki/Security_guard",
  "/wiki/Death",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Eye",
  "/wiki/Credit",
  "/wiki/Hat",
  "/wiki/Flower",
  "/wiki/Necklace",
  "/wiki/Gold",
  "/wiki/Bracelet",
  "/wiki/Clothing",
  "/wiki/Star_Wars_comic_books",
  "/wiki/War_of_the_Bounty_Hunters_Alpha_1",
  "/wiki/Marvel_Comics",
  "/wiki/May_5",
  "/wiki/2021",
  "/wiki/Charles_Soule",
  "/wiki/Steve_McNiven",
  "/wiki/Laura_Martin",
  "/wiki/Category:Images_of_unidentified_Pa%27lowick_attendant",
  "/wiki/Star_Wars_(2020)_13",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}