{
 "name": "Unkar_Plutt",
 "display_name": "Unkar Plutt",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Crul",
      "Jakku"
     ]
    },
    {
     "name": "Born",
     "values": [
      "16 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Crolute"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "113 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unkar's thugs"
     ]
    }
   ]
  }
 ],
 "content": "Unkar Plutt, a male member of the Crolute species, resided on the remote, lawless world of Jakku approximately 30 years after the Battle of Endor. The Crolute was a junk boss who bought weapons, gears and scraps of Rebel and Imperial ships which had crashed during the Battle of Jakku. The ruthless Unkar used hired thugs to enforce his stranglehold on barter, sending them to punish any scavenger who dared dabble in unauthorized trades or negotiated too aggressively. The Blobfish—as scavengers called him behind his broad back—had collected all manner of weapons, gears, and ships over the years, including a battered Corellian freighter he kept under a tarp on the outskirts of Niima Outpost. From his Concession Stand in Niima Outpost, he ruled over the lives of the scavengers, buying and selling scrap and doling out survival rations.\nUnkar Plutt was born on the aquatic world of Crul in 16 BBY. He claimed to have left after a business deal fell through, then drifted from place to place until eventually ending up on Jakku.\nUnkar Plutt established himself on Jakku sometime after the Battle of Jakku, making a living trading salvage for food rations to local scavengers and reselling the parts to spacers that wanted to buy parts off-the-books. In 21 ABY, a youngling who called herself Rey was left with him on Jakku by her parents in order to protect her from her grandfather Darth Sidious, the Sith Lord who ruled the Galactic Empire. Rey worked for Unkar directly until she began coordinating with other scavengers. The young teen eventually struck out on her own, becoming one of the best scavengers on Jakku. Because of that, Unkar's thugs had orders to make sure she was left alone.\nOn one occasion, when Rey was thirteen years old, the young scavenger asked Unkar if he felt cold, something which Plutt hadn't. Unknown to both of them, Rey had experienced a Force-bond with Ben Solo, who was fighting against Ren on the moon of Minemoon.\nAt some point in his career, Unkar stole a YT-1300 light freighter from the Irving Boys, which turned out to be the Millennium Falcon. He discovered the Smuggler's Guide in the Falcon and made notes how the Falcon didn't look like much and that he could only make some money if navigation computer and engines were pushed. If no one made an offer, the ship would have been stripped for parts. Over Rey's objections, Unkar installed a compressor and primer in the ship's systems. The ship would sit in Unkar's yard for years under a tarp. Aside the compressor, like all previous owners of the Falcon, Plutt made some other unadvised modifications to the ship, which wouldn't be removed until many years later. Plutt also organized a failed mission to collect valuables from Carbon Ridge, rumored to house a hidden Imperial base. Stung by the failure, Plutt never talked about it again. Plutt arranged for a shuttle depositing credits with an offworld banking service to be robbed, crippling the small minority of scavengers who chose to sell their scrap to offworlders for currency instead of going to him.\nAbout 30 years after the Battle of Endor, Unkar had bought out or driven out his competition in Niima Outpost, creating a monopoly for his business. Even the Constabulary answered to him. Unkar had total control over Niima Outpost. He controlled the most water, and the most wealth, of anyone on Jakku.\nAs Niima Outpost's only junk boss, Unkar spent most of his time doling ration packs to scavengers from his stall in the Concession Stand in exchange for their salvage. He almost never left the stand, because the harsh environment of Jakku disagreed with his aquatic nature. It was widely believed that most of his resources were stored in the stand, although some suspected the real wealth was hidden elsewhere.\nSometime before the attack on Tuanul, Plutt was kidnapped by Zool Zendiat and his gang, who were searching for a J9 droid which had been sold to Plutt.\nAt some point, two of Plutt's minions attempted to acquire info from him using a sophisticated AI. Plutt captured them and took the AI for himself as an assistant, although he often threatened to delete it.\nOne day, Rey came to sell salvage accompanied by a droid, one that Unkar recognized as being one wanted by the First Order. He offered to buy the droid for 60 portions, but Rey refused. Again, he bargained the droid for 100 portions, but to no avail. Refusing to take no for an answer, Unkar dispatched two of his thugs to steal the droid. However, Rey easily subdued them.\nUnkar didn't have a chance to form another plan to steal Rey's droid, since almost immediately after Rey defeated his thugs, the First Order began attacking on Niima Outpost. In the commotion of the stormtroopers and TIE fighters, Unkar watched as Rey, the droid, and a defecting stormtrooper named Finn hijacked the Millennium Falcon from his yard. His screams that the ship was his were ignored. At the same time, Plutt lost the Smuggler's Guide that would be later recovered by Han Solo.\nUnwilling to lose the Millennium Falcon, Unkar and his thugs trailed the ship to Takodana Castle. There, he assaulted Rey physically, wanting the ship back and revenge on his former scavenger and the droid for the misery they caused him. Rey attempted to fight back, but neglected to remove the safety on her blaster. The commotion, however, caught the attention of the Wookiee Chewbacca, one of Rey's new friends, who had recovered the Falcon along with Han Solo shortly after Rey and Finn's departure from Jakku. When Chewbacca indicated that he would fight him if he did not release Rey, Plutt laughed it off, wondering what a lone Wookiee could do against him and his thugs, for which reason he started to touch repeatedly the Wookiee's injured arm. Furious, Chewbacca demonstrated succinctly why it wasn't wise to upset a Wookiee by ripping off one of Plutt's arms, which landed in a near table at the castle.\nLater, when experiencing her Force vision in the basement of Maz Kanata's castle after touching the Skywalker's lightsaber, Rey saw her childhood self being left in Unkar's charge for the first time. A year later, at the insistence of Kylo Ren, Rey experienced the same vision upon realizing that her parents didn't abandon her for drinking money but instead to protect her.\nA hulking Crolute, Unkar Plutt was the ruthless junk boss of Jakku, often using hired muscle to enforce his stranglehold on barter and sending his thugs to punish any scavenger who dared dabble in unauthorized trades or negotiated too aggressively. This attitude eventually earned him the nickname of \"The Blobfish\" by many scavengers behind his broad back.\nDespite his attitude, Unkar used to be somewhat polite when doing business sometimes, especially with Rey, calling her \"My Girl\" or \"Sweetheart\" when dealing with her, like when he negotiated with her the possibility of selling BB-8, though she ultimately refused. He didn't like, however, to have scavengers disputing the value of their finds.\nUnkar also was not used to taking orders or respecting anyone, a trait that was demonstrated when he ignored the Wookiee Chewbacca's warning about not harming Rey, taking advantage of the injured shoulder of Rey's friend, touching repeatedly the bandage that covered the Wookiee's wound. This, however, cost Unkar one of his arms, as the Wookiee ripped it off for his insolence.\nUnkar Plutt wore a metal apron with yellow patterning.\nUnkar Plutt was portrayed by Simon Pegg in Star Wars: Episode VII The Force Awakens. Pegg is a frequent collaborator with director J.J. Abrams and his production company, Bad Robot Productions, having also appeared as Benji Dunn in Abrams's Mission: Impossible trilogy and Scotty in his Star Trek films. Plutt is Pegg's second Star Wars role; he had previously provided the voice of Dengar in two episodes of Star Wars: The Clone Wars. Pegg was also initially announced to be reprising his role as Unkar in Star Wars: Episode VIII The Last Jedi, but neither he nor his character were featured in the finished version of the film, though Unkar still got a mention in Jason Fry's novelization for the film.\nIn the animated microseries Star Wars: Forces of Destiny and the non-canon video game Disney Infinity 3.0, Unkar Plutt is voiced by Dee Bradley Baker.\nIn the film's novelization, Rey refuses Plutt's offer to purchase BB-8, instead bargaining upward before finally accepting a much higher offer. She then, however, changes her mind. When Plutt gets upset, she puts him in his place, earning the respect of many other individuals at the Niima Outpost, but likely burning her bridges with him for good. This likely plays a large part in the confrontation with him at Maz Kanata's castle that later occurs in the novelization. The novelization also describes in detail Rey's general disgust with Plutt and his operation. In the junior novelization, Rey bargains up to 100 portions, which is quickly accepted. However, when Plutt tells her \"That's my girl,\" she changes her mind and tells him that \"conditions have changed,\" feeling that turnabout is fair play, given the number of times he's changed deals on her. He tells her that she's nothing, but she ignores him and walks away, earning glances of respect from many of the others in Niima Outpost. A scene in which Chewbacca rips off Plutt's arm was filmed for The Force Awakens, but ultimately deleted from the final cut. This scene was included in the film's novelization.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/Destroyer_Down",
  "/wiki/The_Happabore_Hazard",
  "/wiki/Choose_Your_Destiny:_A_Scavenger_Mission",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Databank_A-Z",
  "/wiki/Force_Collector",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Crul",
  "/wiki/Jakku",
  "/wiki/16_BBY",
  "/wiki/Crolute",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Unkar%27s_thugs",
  "/wiki/Species",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Endor",
  "/wiki/Junk_boss",
  "/wiki/Battle_of_Jakku",
  "/wiki/Scavenger",
  "/wiki/Millennium_Falcon",
  "/wiki/Niima_Outpost",
  "/wiki/Concession_Stand",
  "/wiki/Reproduction",
  "/wiki/Water",
  "/wiki/Foodstuff",
  "/wiki/Spacer",
  "/wiki/21_ABY",
  "/wiki/Youngling",
  "/wiki/Rey_Skywalker",
  "/wiki/Dathan",
  "/wiki/Miramir",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_Lord",
  "/wiki/Galactic_Emperor",
  "/wiki/Galactic_Empire",
  "/wiki/28_ABY",
  "/wiki/Force-bond",
  "/wiki/Ben_Solo",
  "/wiki/Ren_(human)",
  "/wiki/Moon",
  "/wiki/Minemoon",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Irving_Boys",
  "/wiki/Smuggler%27s_Guide",
  "/wiki/Navigation_computer",
  "/wiki/Engine",
  "/wiki/Compressor",
  "/wiki/Starship",
  "/wiki/Carbon_Ridge",
  "/wiki/Ration_pack",
  "/wiki/Attack_on_Tuanul",
  "/wiki/Kidnapping_of_Unkar_Plutt",
  "/wiki/Zool_Zendiat",
  "/wiki/J9_worker_drone",
  "/wiki/Tanandra_Frullich",
  "/wiki/BB-8",
  "/wiki/First_Order",
  "/wiki/Escape_from_Jakku",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/TIE/fo_space_superiority_fighter",
  "/wiki/Finn",
  "/wiki/Han_Solo",
  "/wiki/Takodana_Castle",
  "/wiki/Safety",
  "/wiki/Blaster",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Force_vision",
  "/wiki/Maz_Kanata",
  "/wiki/Skywalker_lightsaber",
  "/wiki/35_ABY",
  "/wiki/Boss",
  "/wiki/Simon_Pegg",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/J.J._Abrams",
  "/wiki/Bad_Robot_Productions",
  "/wiki/Dengar",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Jason_Fry",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars:_The_Force_Awakens_(novelization)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Forces_of_Destiny:_Daring_Adventures:_Volume_1",
  "/wiki/True_Love",
  "/wiki/Tales_from_a_Galaxy_Far,_Far_Away:_Aliens:_Volume_I",
  "/wiki/Before_the_Awakening",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Better_the_Devil_You_Know,_Part_I",
  "/wiki/Star_Wars_Adventures_(2017)_1",
  "/wiki/Better_the_Devil_You_Know,_Part_II",
  "/wiki/Star_Wars_Adventures_(2017)_2",
  "/wiki/Forces_of_Destiny:_The_Rey_Chronicles",
  "/wiki/Star_Wars_Adventures:_Destroyer_Down",
  "/wiki/Force_Collector_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens_(audiobook)",
  "/wiki/Star_Wars:_The_Force_Awakens:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Force_Awakens:_Rey%27s_Story",
  "/wiki/The_Force_Awakens:_Rey%27s_Story_(audiobook)",
  "/wiki/The_Force_Awakens:_Finn%27s_Story",
  "/wiki/Rey_Meets_BB-8",
  "/wiki/Finn_%26_Rey_Escape!",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_1",
  "/wiki/The_Force_Awakens_Adaptation_2",
  "/wiki/The_Force_Awakens_Adaptation_3",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/Star_Wars:_Forces_of_Destiny%E2%80%94Rey",
  "/wiki/Tracker_Trouble",
  "/wiki/Age_of_Resistance_-_Rey_1",
  "/wiki/Star_Wars:_The_Last_Jedi:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Last_Jedi:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Resistance_Rises",
  "/wiki/Rey_Strikes_Back",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars:_Puzzle_Droids",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_161",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Force_Awakens:_Incredible_Cross-Sections",
  "/wiki/Rey%27s_Survival_Guide",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2015_Topps_Star_Wars:_The_Force_Awakens_Series_1",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_VII:_The_Force_Awakens",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_The_Force_Awakens_Beginner_Game",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_6",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Meet_the_Heroes",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars_Helmet_Collection_43",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_45",
  "/wiki/Star_Wars_Helmet_Collection_47",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/StarWarsKids.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_38",
  "/wiki/Starfighter_Aces",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Disney%2B",
  "/wiki/Databank_(website)",
  "/wiki/34_BBY",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Jedi_Temple_of_Luke_Skywalker",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/0_BBY",
  "/wiki/The_Rise_of_Kylo_Ren_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/January_30",
  "/wiki/2017",
  "/wiki/Entertainment_Weekly",
  "/wiki/October_18",
  "/wiki/2016",
  "/wiki/August_17",
  "/wiki/2020"
 ]
}