{
 "name": "Urai_Fen",
 "display_name": "Urai Fen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Talortai"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zann Consortium"
     ]
    }
   ]
  }
 ],
 "content": "Urai Fen was a Force-sensitive male Talortai who served as Tyber Zann's loyal bodyguard, lieutenant, friend, and second in command of the Zann Consortium. At some point, he did something that caused IG-88 to owe him a favor.\nA member of the avian Talortai race, Fen served an important role in Zann's conquest and was old enough to have lived through one of the Sith Wars. He was the only person Zann trusted to handle a Sith holocron stolen from Jabba the Hutt, right before Zann's capture. Concerned for the survival of the Consortium, Fen contacted unknown allies on Kamino. They were willing to harbor the remnants of the Consortium, so Fen moved Consortium forces from Ryloth to Kamino. Fen then attacked the Imperial forces on Kamino, defeated them, and laid low until Tyber Zann was ready.\nUrai meanwhile had discovered that the Sith holocron dates back to the Sith Wars, making it over 4,000 years old. He had learned that it was some sort of data storage device, but he also believed it to serve another unknown purpose. Urai then persuaded Han Solo and Chewbacca to come to Kessel and rescue Tyber Zann. After killing a bounty hunter, Urai and Tyber created a prison riot and used the distraction to reach the Millennium Falcon. Urai Fen also took part in the mission to intimidate the Noghri homeworld of Honoghr. Eventually he also took part in the intimidation of Governor Koong Eeth and the Battle of Saleucami, and also scouted out the destroyer droid factory that Jabba the Hutt found on Hypori.\nUrai accompanied Zann on his quest to find a Force user on Dathomir who could unlock the Sith artifact. Ever wary of the Nightsister Silri who they found, Urai constantly asked if he could kill her as he thought she may harm Tyber. Other known Consortium acts he helped in were stealing tibanna gas from Bespin for Prince Xizor, raiding Emperor Palpatine's vaults on Coruscant, and searching the Eclipse for information on the Emperor's other vaults across the galaxy.\nUrai was an ancient and proud warrior, who preferred to simply kill enemies rather than seeing the purpose of letting them live. Despite this, to an extent, Urai seemed to have a sense of honor and was actually in favor of allying with the Rebels against the Empire, though he stated it would only be for practical purposes since they would prove a powerful ally, he believed. Also unlike Tyber, he seemed willing to accept a lot more responsibility for the well being of others, often volunteering himself for the more dangerous objectives in a mission, though this could, again be done out of practicality or a will to test himself.\nHe preferred melee combat and the use of his unique heavy blades over blasters. These blades proved to be sharper and more powerful than most others and could destroy vehicles, as well as decimate infantry. In battle, he and Zann were equipped with personal cloaking devices. He also either had a special sonic device which was able to stun another or possibly, being Force-sensitive, had the ability to stun enemies with the Force  Urai Fen, like many of his race, was sensitive to the Force, although he was not known to manipulate it.\nHe was extremely loyal to Zann, who saw Urai Fen as his only true friend. Urai also despised Silri and they were often at each other's throats. Urai assured Tyber that he would gladly kill her at any time should he command it. Tyber reluctantly admitted that Silri was growing on him, but still found that knowledge comforting.\nThe game manual misspells his name \"Urai Fenn\". However the official website and in-game description proves Urai Fen is the correct spelling.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Urai_Fen",
  "/wiki/Talortai/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Zann_Consortium/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Tyber_Zann",
  "/wiki/Lieutenant/Legends",
  "/wiki/IG-88A/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Kamino/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Chewbacca/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Unidentified_Mustafarian_bounty_hunter",
  "/wiki/Kessel_Insurrection",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Koong_Eeth",
  "/wiki/Battle_of_Saleucami_(Zann_Consortium)",
  "/wiki/The_Force/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Silri",
  "/wiki/Tibanna/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Xizor/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Eclipse_(Eclipse-class)",
  "/wiki/The_galaxy/Legends",
  "/wiki/Force_Adept",
  "/wiki/Urai_Fen%27s_blades",
  "/wiki/Personal_cloaking_device",
  "/wiki/Force_Stun",
  "/wiki/Ysalamir",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption",
  "/wiki/Star_Wars:_Empire_at_War:_Forces_of_Corruption_Expansion:_Prima_Official_Game_Guide",
  "/wiki/News_from_the_Underworld:_Vol._1,_Issue_1"
 ]
}