{
 "name": "Uran_Lavint",
 "display_name": "Uran Lavint",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bespin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Uran Lavint was a female smuggler from Bespin during the Second Galactic Civil War. She owned a ship called the Breathe My Jets.\nLavint owed money to the Hutt Blatta and he became her co-pilot during a large smuggling operation consisting of a small fleet. They were captured by the Anakin Solo after Uran sold them out to the Galactic Alliance to pay her debts. Later she would ask Jacen Solo for any other assignments, which he refused. She then asked for her ship to be given back to her, which request was also refused and she was saddled instead with a YV-666 light freighter called the Duracrud. She resented this and didn't know that Solo had ordered her hyperdrive to be sabotaged after she had insulted him so that her hyperdrive would only work once.\nAfter she jumped to an empty place, she failed to repair the hyperdrive. However, Alema Rar had stowed away in the hold and helped her repair the hyperdrive in exchange for Lavint helping Alema to find the Solos. Uran brought Alema to the Errant Venture to find the Solos, while there, Lavint gambled, sometimes with the aid of Alema, and drank often. Once while drunk, Jacen approached her again in order to smuggle him to a secret meeting of the Confederation at Gilatter VIII. She agreed after Jacen gave her a new ship, a Gallofree Yards medium transport. Later Alema would steal the Duracrud to escape the Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Uran_Lavint",
  "/wiki/Bespin/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Breathe_My_Jets",
  "/wiki/Hutt/Legends",
  "/wiki/Blatta",
  "/wiki/Anakin_Solo_(Imperial_II-class_Star_Destroyer)",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Darth_Caedus",
  "/wiki/YV-666_light_freighter/Legends",
  "/wiki/Duracrud",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Alema_Rar",
  "/wiki/Errant_Venture/Legends",
  "/wiki/Confederation",
  "/wiki/Gilatter_VIII",
  "/wiki/Gallofree_Yards,_Inc./Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Legacy_of_the_Force:_Exile",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}