{
 "name": "Urana_Kiel",
 "display_name": "Urana Kiel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Reddish Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Taris Resettlement Initiative"
     ]
    }
   ]
  }
 ],
 "content": "Urana Kiel was a Human female refugee who lived on Taris during the Cold War between the Galactic Republic and the resurgent Sith Empire. She settled on the planet as part of the Taris Resettlement Initiative, but she and her fellow settlers were forced out of their homes by Republic forces when the pirate threat in the area grew out of control.\nIn 3643 BBY, Urana Kiel was a Human female who lived on Taris as part of the Republic resettlement project. A war refugee, she and her mother were part of a group of settlers who were forced out of their settlement by Republic troops because the area was plagued by scavengers. She asked a traveling hero to help recover items from the settlement for her fellow refugees Fayem Schall, Vidas Kawats, Semist Bada, and Leisha Vamden.\nThe hero succeeded, defeating the scavengers and clearing out the settlement long enough to recover the microgenerator, nadu seeds, novel datafile, pazaak decks, and tools that the settlers had requested. When they returned to Olaris, where the settlers were staying, the hero gave the settlers their items and Urana promptly ran off with the nadu seeds to her mother, forgetting to thank the stranger. Leisha told the hero that Urana was just very eager and happy, and sure enough she returned a minute later to thank the hero profusely.\nUrana Kiel appears in the BioWare MMORPG Star Wars: The Old Republic on the Republic faction's version of Taris. She gives the player the mission \"Prized Possessions\", where the player must fight their way through scavengers in the settlers' abandoned camp to recover five items, at which point the player returns to Urana for a reward.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Taris_Resettlement_Initiative",
  "/wiki/Refugee/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Planet/Legends",
  "/wiki/3643_BBY",
  "/wiki/Fayem_Schall",
  "/wiki/Vidas_Kawats",
  "/wiki/Semist_Bada",
  "/wiki/Leisha_Vamden",
  "/wiki/BioWare",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}