{
 "name": "Uray",
 "display_name": "Uray",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "New Republic Defense Fleet",
      "New Republic Defense Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Uray was a Pantoran male who served as an ensign in the New Republic Starfleet during the Galactic Civil War against the Galactic Empire. He served aboard the frigate Sunspire during the rebellion on Akiva.\nUray was a Pantoran male who served in the New Republic Defense Fleet following the Battle of Endor. He served on board the frigate Sunspire under Commander Kyrsta Agate during the Rebellion on Akiva. When the Republic began to claim the upper hand he reported it to Agate, who ordered that her crew not let up against the Imperials until victory was secured. He also informed her that Norra Wexley, the pilot of one of the TIE/ln space superiority starfighters involved in the battle had contacted the Sunspire and claimed to be a Republic pilot from Gold Squadron. Uray thought the pilot's claims were unlikely, but Agate ordered they support and contact her just in case. The pilot turned out to be telling the truth and went on to aid the Republic in winning the battle.\nUray was a blue-skinned Pantoran man who held the rank of Ensign in the New Republic Starfleet. While he believed that his forces were winning during the rebellion on Akiva, his Commander Agate counselled him that winning did not mean won and told him to keep up the pressure. Uray also knew how to operate the Sunspire's intercom and intercepted message from the New Republic starfighter pilot Norra, who had commandeered a TIE fighter.\nUray first appeared in the novel Aftermath, which was written by Chuck Wendig and released in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Pantoran",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Defense_Fleet",
  "/wiki/Ensign",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Sunspire_(New_Republic)",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Akiva",
  "/wiki/Battle_of_Endor",
  "/wiki/Frigate",
  "/wiki/Commander",
  "/wiki/Kyrsta_Agate",
  "/wiki/Norra_Wexley",
  "/wiki/Pilot",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Aftermath_(novel)",
  "/wiki/Chuck_Wendig",
  "/wiki/2015",
  "/wiki/Aftermath_(audiobook)"
 ]
}