{
 "name": "Urgah",
 "display_name": "Urgah",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Forest Moon of Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Dulok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Less than 1.35 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Green",
      "lavender",
      "brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pink"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gorneesh's tribe"
     ]
    }
   ]
  }
 ],
 "content": "Urgah, also known as Urgah Lady Gorneesh, was the queen of a tribe of Duloks on the Forest Moon of Endor. She was the mate of the tribe's leader, King Gorneesh, and the mother of several children, including Prince Boogutt. At her home in the Dulok Swamp, Urgah's high status made her one of the tribe's three primary leaders, along with King Gorneesh and the shaman Umwak. In this capacity, she helped lead the Duloks in their longstanding feud with the Ewoks of nearby Bright Tree Village. Many of these altercations occurred in 3 ABY. On one occasion, she joined her tribemates in bathing with stolen Ewok soap, which turned them invisible and let them spook the Ewoks. When Gorneesh and his cronies stole an Ewok battle wagon as part of another plot, Urgah rode atop the contraption as it barreled toward the Ewoks' Soul Trees. The queen later rode aboard a Dulok battleship in an attempt to disrupt the Ewoks' Fishing Festival. Nevertheless, each of these schemes was foiled due to bumbling by Urgah's tribe mates and counter-tactics from members of the Ewok tribe.\nDespite her elevated station, Urgah was often relegated to carrying out menial chores, such as cooking and babysitting. For instance, when Gorneesh agreed to let the Tulgah witch Morag keep a Phlog child at the swamp—part of a scheme to infuriate the baby's father and mother into blaming the Ewoks for the kidnapping—Urgah was given the seemingly never-ending task of cooking for the enormous infant. Nevertheless, Urgah played upon Gorneesh's devotion to her—his \"little swamp bunny\"—henpecking her husband to get out of at least some undesirable work. For example, when her brood of Dulok pups became too unruly, Urgah threatened to stop cooking for her husband unless he found her a babysitter. The Ewok Latara was kidnapped to that end until her friends mounted a rescue with the help of an itinerant band of entertainers known as the Travelling Jindas. Later, on the anniversary of Urgah's marriage to Gorneesh, she demanded that the king give her a substantial present; his underlings returned with a large gem and two Ewok servants, Shodu Warrick and Wicket W. Warrick. The queen's mood soured when the gem proved in reality to be an egg, which hatched into a surly serpent and gave the Ewoks a chance to escape.\nUrgah was a female Dulok who hailed from the Forest Moon of Endor. By 3 ABY, she had married a male Dulok named Gorneesh. At some point, Gorneesh became the king of Urgah's tribe, making her queen of the large band and making her Urgah Lady Gorneesh. The royal couple took up residence in a hollowed-out tree in their village in the Dulok Swamp. Urgah received a throne made of stone, which sat beside her husband's; from it, she helped preside over the tribe's affairs as one of the three highest-ranked members of the group alongside Gorneesh and the shaman, Umwak. She performed religious duties at times.\nHowever, Urgah suffered from the prejudices of her species that relegated females to domestic and reproductive roles: she was expected to cook, wash dishes, and take care of her children. Indeed, by 3 ABY, Urgah had borne Gorneesh several pups, including at least two boys—one burly, the other thinner—and a girl. One of the couple's children was Prince Boogutt, the heir apparent to lead the tribe in 3 ABY.\nUrgah's tribe had a generations-long history of warfare with the tribe of Ewoks that inhabited nearby Bright Tree Village. As such, her husband was constantly hatching schemes to get the best of these rivals. During the summer of 3 ABY, Gorneesh sent the Dulok shaman, Umwak, to steal a bar of Ewok soap from Bright Tree Village; with it, the Duloks could clean their fur and repel the pesky insects that infested them. However, Umwak and his cohort returned with a different type of soap. As the Duloks bathed in the swamp, Urgah was the first to notice its peculiar properties: it turned the bather invisible. After the Duloks' initial shock, Urgah found that washing again with water returned the bather to a normal state of visibility. Gorneesh declared a raid on the Ewok village, with the invisible Duloks impersonating tree spirits.\nThe raid went well at first, but the Ewoks soon discovered the ruse, and a scramble ensued over possession of the invisibility soap. The Ewok Wicket W. Warrick ended up with it, but Urgah, Gorneesh, Umwak, and several Dulok warriors intercepted him at the bank of a river. Gorneesh shook him until a bar was dislodged, which Urgah grabbed. The Duloks departed and attempted to repeat their raid by bathing to become invisible. However, they soon discovered that the bar the queen had swiped was a third type of soap: one that attracted insects. Urgah and the others dived for cover as Logray and the other Ewoks released swarms of insects upon them and forced the Duloks to flee back to their swamp.\nAnother day, the Tulgah witch Morag dropped off a baby Phlog named Nahkee at the Dulok Swamp and used threats of magical retaliation if Gorneesh and his tribe did not babysit him. Thereafter, she convinced the infant's parents that the Ewoks of Bright Tree Village were behind his disappearance. Urgah helped with the childcare duties, cooking a gray stew called glock, which Nahkee ate by the cauldron-ful. When Gorneesh grew tired of the attention that the Phlog gave him—the youngling was particularly enamored of the Dulok king and treated him like a pet—he attempted to tie the baby down and take a nap, but the Phlog escaped. Urgah cooked up a batch of glock so that the smell would draw the baby back. Indeed, the baby Phlog returned—with three young Ewoks in tow: Wicket W. Warrick, Teebo, and Malani. Gorneesh immediately ordered the new arrivals to take over babysitting duties until he could ransom them later. When the Ewoks' friends, Kneesaa a Jari Kintaka and Latara, came looking for them, they were also captured and forced to join in the Phlog's care.\nUrgah heard Kintaka humming a lullaby and taunted the Ewok princess into serenading the Dulok village with the song. Kintaka did so, with Latara accompanying her on flute. Meanwhile, Teebo had secured the help of several humming peepers; the combination of music and the birds' fast-beating wings lulled the Duloks into a slumber, allowing the Ewoks to escape with the Phlog. When Gorneesh awoke to find their captives missing, he stirred Urgah and the others for an attack on Bright Tree Village. However, they were greeted there not by Ewoks but by full-grown Phlogs: baby Nahkee's father Zut, mother Dobah, and brother Hoom—by this point fully aware of Morag and the Duloks' role in Nahkee's kidnapping. The Phlogs attacked, forcing Urgah and her tribemates to flee.\nThe incident with Nahkee was not to be the last of Urgah's babysitting dilemmas; three of her own children proved too much for her to handle when they began to climb on her, pull her ears, and bite her tail. Urgah thus demanded that Gorneesh find her a babysitter or she would not cook him dinner. The hungry king complied, sending two scouts on the mission, one marked by an X and the other with an O. They returned with the Ewok Latara, whom they had kidnapped while she was running away from her village as a member of the Travelling Jindas, a band of wandering Jinda entertainers. Latara's itinerant allies arrived at the Dulok Swamp soon thereafter, and their leader, Bondo, offered to perform for the Duloks in exchange for a night's hospitality. Urgah, finding the Jindas cute, begged her husband to let them stay. The king acquiesced.\nThat night, Urgah sat with Gorneesh, her three cubs, and their Ewok babysitter directly in front of the Jindas' stage. The rest of the tribe proved a less-than-hospitable audience, however, jeering and throwing things at the performers. When Bondo asked for Latara's assistance during the act of Trebla the magician, Gorneesh ordered her to mount the stage. Unbeknownst to the Duloks, Bondo had brought several of Latara's friends to the venue in an attempt to rescue her. However, their ploy floundered, so Latara stalled for time by playing her flute. The tribe reacted with boos, but Urgah begged Gorneesh to silence them so she could hear the \"love song\"; the king did as she asked. The Ewok escape plan failed again, as Latara's friends fell from the stage's rafters, and Gorneesh ordered them captured. Nevertheless, the Jinda and Ewok allies evaded the Duloks and escaped.\nGorneesh tasked Umwak with investigating a battle wagon that a Dulok scout had espied being repaired in the forest by Wicket W. Warrick, so Urgah accompanied the shaman to discuss the device with his uncle, Murgoob, curious to see the tribe's reclusive oracle. At Murgoob's lair, the oracle refused to come out, but he insulted his nephew, \"little Umwak,\" and told the queen and shaman that the Ewok Erpham Warrick had used the battle wagon long ago to thwart a Dulok attack on the Ewoks' Soul Trees and to drive the Duloks back into the swamp. However, by obtaining the weapon for themselves, the Duloks could take over the forest.\nGorneesh and a group of warriors stole the wagon. Back at the swamp, Urgah joined her husband and Umwak in provisioning the ramming weapon. She then witnessed as Wicket W. Warrick, disguised as Murgoob, goaded Gorneesh into sallying forth in the war machine—with a trajectory that sent Gorneesh and the other riders into the waters of the swamp. Nevertheless, the Duloks captured the impostor and imprisoned him aboard the vehicle as Gorneesh ordered an attack on the Soul Trees; Urgah and Umwak joined him at his command post from inside the bantha skull atop the wagon. They first encountered a group of young Ewoks, who warned their tribe about the attack. Urgah joined her husband in defying the Ewoks who met them with weapons and demanded the release of Warrick and the Duloks' immediate retreat. Instead, Gorneesh ordered attack after attack, ramming through Ewok defenses. However, the battle was lost when the Ewok Malani reached the battle wagon, helped free Warrick, and joined her tribe mate in ejecting the Dulok passengers from the weapon except for Urgah and Gorneesh. With the removal of the battle wagon's master support peg, Warrick caused the contraption to collapse with the king and queen still aboard.\nLater that year, Urgah and Gorneesh celebrated their marriage anniversary. To mark the occasion, Gorneesh gave Urgah a gift—which she promptly rejected as inadequate. Her ire was so great that she ejected the king from their home, throwing things at him and warning him not to return until he found a suitable gift for her.\nThe king sent Umwak and two scouts to bring back a present for his wife. The trio tracked the Ewoks Kneesaa a Jari Kintaka, Latara, Teebo, and Wicket W. Warrick, who were on their own quest to find a birthday present for Warrick's mother, Shodu Warrick. The Duloks saw the Ewoks emerge from a hidden temple with a blue gemstone; Umwak thought it would be perfect for the queen, but his efforts to obtain it proved fruitless. Instead, Umwak followed the Ewoks back to their village, where he captured Wicket W. Warrick and his mother Shodu. He brought them to the Dulok village and presented them to Urgah as servants—along with the blue gemstone.\nUrgah wasted no time showing her new servants their places: she demanded they hand over the jewel and that the older Ewok bow to her. The Ewoks attacked the king and queen instead, but Gorneesh and his guards deflected their assaults. Gorneesh asked his wife what punishment she would like to mete out to the two, but before the queen could pronounce her sentence, the jewel—actually an egg—hatched into a serpent and bit the queen's nose. In the ensuing chaos, the Ewoks escaped. The queen, enraged once again, chased her husband through the swamp as he pursued the shaman, each blaming the other for the catastrophe.\nUrgah later performed a ritual at the Dulok Swamp with Umwak, while other Duloks drummed and Gorneesh presided from his throne. While Urgah danced and held a stone, the shaman wore a ceremonial headdress. However, the ritual was cut short when the Stranger, a Wizard of the Night Spirit, appeared and frightened the queen into hiding. The Stranger then demanded the aid of the Dulok king to storm Bright Tree Village and steal the Sunstar, a powerful Ewok artifact.\nDuring the Bright Tree Ewoks' Fishing Festival of 3 ABY, Urgah boarded the Dulok battleship captained by her husband to disrupt the Ewok festivities and steal the fish that they had caught. From her seat at the ship's stern, Urgah pleaded to steer the vessel, but Gorneesh chose to test out the battleship by destroying a nest of skibs with the ship's onboard catapult. Urgah remained on the ship with the king when it ran aground on a sandbar, and the other Duloks got out to free it. Over the course of the voyage, Urgah joined the Duloks as they stole the Ewoks' lucky prow carving, captured and pressed into rowing the Ewoks Kneesaa a Jari Kintaka, Latara, Teebo, and Wicket W. Warrick, and came under attack by water-squirting skibs retaliating for their destroyed nest. Indeed, Urgah and the others were plunged into the river when Warrick and Teebo convinced the skibs to overturn the boat. When the Ewoks ran for the catapult, Urgah chased them, but she overshot her targets and fell into the water. The Ewoks then catapulted a rock at the ship's deck, sinking it.\nCirca 4 ABY, Urgah's village suffered another invasion, this time by the forces of the Galactic Empire, which sought to build a shield generator bunker on the site to protect their Death Star II battlestation in orbit of the moon. The strangers from the stars used their weaponry to wreak havoc in the Dulok Swamp and the surrounding area. They captured much of Urgah's tribe and awakened a subterranean creature known as the Griagh with their destruction. The captive Duloks were later freed when a group of Ewoks from Bright Tree Village attacked their captors, but the Ewoks inadvertently led the Griagh back to the site, where it killed many Duloks. Although the Griagh was defeated, Urgah's tribe remained in disarray for at least some time afterward.\nUrgah placed great importance on material wealth and appearance. For instance, she merrily primped and preened when the Duloks stole soap from the Ewoks of Bright Tree Village. Likewise, she refused her husband's anniversary gifts in 3 ABY until he presented her with what she took to be a valuable gem. She found the Traveling Jindas to be cute—especially those who were actually Ewoks in disguise. The queen normally wore a patchwork pink shawl around her shoulders and fastened with a curved bone or horn, a gold-colored band around her ankle, and a ring through her brown-colored nose. She bound the hair on top of her head with pink beads, and that of her jowls with cord. She had pink eyes, green fur, gray skin, and brown eyebrows. Her lips were red, and the fur around her eyes was lavender. The queen owned a two-piece bathing suit that she wore during a voyage of Gorneesh's battleship.\nUrgah took pleasure in the misfortune of others. For instance, she laughed when Murgoob the oracle insulted his nephew, Umwak, and again when her husband destroyed a skibs' nest with his battleship. She sometimes taunted others, as when she sarcastically demanded that Kneesaa a Jari Kintaka serenade the Dulok village with a song. However, Urgah had her softer side. She enjoyed live entertainment, so she was welcoming to traveling performers, especially if they sang love songs. She was one to appreciate and smell fresh-cut flowers. Urgah was curious about the Dulok oracle and accompanied the shaman to see the recluse.\nUrgah took great pains to make others respect her elevated position within the tribe. On one occasion, she ordered Shodu Warrick and Wicket W. Warrick to bow to her as servants. However, the queen was never quite content with her station. Like other Dulok females, Urgah was often relegated to the duties of childcare, breeding, and housekeeping. She was tasked with cooking for Gorneesh and with caring for their children at least on occasion; these tasks forced her to endure her children's misbehavior and abuse. In another instance, Urgah had to prepare cauldron after cauldron of glock for the infant Phlog Nahkee. Nevertheless, Urgah knew how to bend her husband to her will by begging, cajoling, and sweet-talking him. She called him by the pet name \"Gorneeshy,\" and he called her his \"little swamp bunny.\" At other times, she henpecked the king and levied ultimatums. For instance, she threatened to withhold Gorneesh's dinner when her children gave her too much trouble. She was quick to flee when frightened, trusting her husband to protect her, as when the Stranger appeared in the Dulok village.\nThe queen's voice was a high-pitched screech at times, an even timbre at others. Her laugh was a cackle.\nPaul Dini created Urgah during his tenure as the associate producer and story editor of Ewoks, an animated cartoon created for CBS by the animation studio Nelvana. For inspiration on the series, Dini turned to a 1984 storybook by Joe Johnston, The Adventures of Teebo: A Tale of Magic and Suspense. The book had introduced the Duloks, the mean-spirited cousins of the Ewoks, but the plot also had killed off their ruler, Vulgarr. To use the Duloks as major villains in his television cartoon, Dini thus created three new Dulok leaders to serve as major antagonists: Urgah; her husband, Gorneesh; and the Dulok shaman, Umwak. Later sources have revealed that Endor's Duloks were not united under a single leader; rather, they were divided into several clans and tribes. Therefore, conclusively identifying Vulgarr's tribe as the same tribe to which Urgah belonged is not possible.\nFor the first season of Star Wars: Ewoks, Urgah was voiced by Melleny Brown. She appeared in the show's inaugural episode, \"The Haunted Village,\" written by Dini and directed by Raymond Jafelice. The episode first aired on American television on September 14, 1985. Dini wrote her into two other first-season episodes, while writer Bob Carrau featured her in one. For the series' second season, which first aired in 1986, Dini featured Urgah in two episodes he wrote and Carrau one. The show's voice cast changed during its second season, and the credits failed to specify individual performers.\nIn 1985, Kenner released an Urgah action figure as part of the Ewoks toy line, under the name \"Urgah Lady Gorneesh.\" The action figure packaging is the only source to refer to the character as \"Lady Gorneesh.\" In 1986, Urgah featured as part of \"The Ewoks and the Magic Sunberries,\" a short, live-action ice-skating segment that toured with the Ice Capades. Artist and author Zack Giallongo features Urgah's village prominently in his 2013 comic book, Star Wars: Ewoks—Shadows of Endor, although Urgah herself does not make an appearance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Endor/Legends",
  "/wiki/Dulok/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Gorneesh%27s_tribe",
  "/wiki/Queen/Legends",
  "/wiki/King/Legends",
  "/wiki/Gorneesh",
  "/wiki/Parent/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Boogutt",
  "/wiki/Gorneesh%27s_hut",
  "/wiki/Dulok_Swamp",
  "/wiki/Shaman/Legends",
  "/wiki/Umwak",
  "/wiki/Ewok%E2%80%93Dulok_wars/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Shadowroot_soap",
  "/wiki/Ewok_battle_wagon",
  "/wiki/Second_Battle_of_the_Soul_Trees",
  "/wiki/Soul_Tree",
  "/wiki/Dulok_battleship",
  "/wiki/Fishing_Festival",
  "/wiki/Bright_Tree_Village_tribe",
  "/wiki/Tulgah/Legends",
  "/wiki/Witch/Legends",
  "/wiki/Morag",
  "/wiki/Phlog/Legends",
  "/wiki/Nahkee",
  "/wiki/First_Phlog_crisis",
  "/wiki/Zut",
  "/wiki/Dobah",
  "/wiki/Latara",
  "/wiki/The_Travelling_Jindas",
  "/wiki/Marriage/Legends",
  "/wiki/Shodu_Warrick",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Egg/Legends",
  "/wiki/Unidentified_serpent_species",
  "/wiki/Time/Legends",
  "/wiki/Species/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Unidentified_Dulok_cub_1",
  "/wiki/Unidentified_Dulok_cub_3",
  "/wiki/Unidentified_Dulok_cub_2",
  "/wiki/Ewok_soap",
  "/wiki/Tree/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Insect/Legends",
  "/wiki/Unidentified_Dulok_scout_(soap_raid)",
  "/wiki/Water/Legends",
  "/wiki/Ghost_(folklore)/Legends",
  "/wiki/Unidentified_Endor_river",
  "/wiki/Bug-attracting_soap",
  "/wiki/Logray/Legends",
  "/wiki/Rampage_of_the_Phlogs",
  "/wiki/Standard_day/Legends",
  "/wiki/Magic",
  "/wiki/Stew/Legends",
  "/wiki/Glock",
  "/wiki/Teebo/Legends",
  "/wiki/Malani",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Kneesaa%27s_lullaby",
  "/wiki/Latara%27s_flute",
  "/wiki/Humming_peeper",
  "/wiki/Music/Legends",
  "/wiki/Bird/Legends",
  "/wiki/Sleep/Legends",
  "/wiki/Hoom",
  "/wiki/Ear/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Unidentified_Dulok_(X)",
  "/wiki/Unidentified_Dulok_(O)",
  "/wiki/Travelling_Jindas",
  "/wiki/Jinda/Legends",
  "/wiki/Bondo",
  "/wiki/Trebla",
  "/wiki/Flute/Legends",
  "/wiki/Unidentified_Dulok_scout_(wagon_spy)",
  "/wiki/Murgoob",
  "/wiki/Dulok_oracle",
  "/wiki/Murgoob%27s_lair",
  "/wiki/Erpham_Warrick",
  "/wiki/First_Battle_of_the_Soul_Trees",
  "/wiki/Bantha/Legends",
  "/wiki/Skeleton/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Birthday/Legends",
  "/wiki/Lost_Temple",
  "/wiki/Gemstone/Legends",
  "/wiki/Nose/Legends",
  "/wiki/Stranger",
  "/wiki/Wizard_of_the_Night_Spirit",
  "/wiki/Battle_of_Bright_Tree_Village_(Stranger_War)",
  "/wiki/Sunstar/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Fish/Legends",
  "/wiki/Skib",
  "/wiki/Catapult/Legends",
  "/wiki/Prow_carving",
  "/wiki/4_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Endor_shield_generator_bunker",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battlestation",
  "/wiki/Orbit/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Star/Legends",
  "/wiki/Destruction_of_the_Dulok_Swamp",
  "/wiki/Griagh",
  "/wiki/Death/Legends",
  "/wiki/Skirmish_at_the_Endor_shield_bunker",
  "/wiki/Piercing/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Flower/Legends",
  "/wiki/Paul_Dini",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/CBS",
  "/wiki/Nelvana",
  "/wiki/1984",
  "/wiki/Joe_Johnston",
  "/wiki/The_Adventures_of_Teebo:_A_Tale_of_Magic_and_Suspense",
  "/wiki/Vulgarr",
  "/wiki/Ewoks:_Season_One",
  "/wiki/Melleny_Brown",
  "/wiki/The_Haunted_Village",
  "/wiki/Raymond_Jafelice",
  "/wiki/September_14",
  "/wiki/1985",
  "/wiki/Bob_Carrau",
  "/wiki/Ewoks:_Season_Two",
  "/wiki/1986",
  "/wiki/Kenner_Products",
  "/wiki/Star_Wars:_Ewoks_(toy_line)",
  "/wiki/The_Ewoks_and_the_Magic_Sunberries",
  "/wiki/Zack_Giallongo",
  "/wiki/2013",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Ewoks%E2%80%94Shadows_of_Endor",
  "/wiki/Category:Images_of_Urgah",
  "/wiki/The_Haunted_Village_(book)",
  "/wiki/The_Haunted_Village_(film)",
  "/wiki/Wicket%27s_Wagon",
  "/wiki/Wicket%27s_Wagon_(book)",
  "/wiki/Tales_from_the_Endor_Woods",
  "/wiki/A_Gift_for_Shodu",
  "/wiki/Night_of_the_Stranger",
  "/wiki/Prow_Beaten",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Star_Wars_CELibration",
  "/wiki/Star_Wars_Insider_27",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars:_The_Action_Figure_Archive",
  "/wiki/20_Most_Memorable_Moments_of_the_Expanded_Universe",
  "/wiki/Star_Wars_Insider_83",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/25_Years_of_Collecting_Droids_and_Ewoks!",
  "/wiki/Star_Wars:_The_Ultimate_Action_Figure_Collection",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/Castaways_of_Endor",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Ewoks_13",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/Starlog_(magazine)",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Abel_G._Pe%C3%B1a"
 ]
}