{
 "name": "Urias_Xhaxin",
 "display_name": "Urias Xhaxin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark blue"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Prosthetic left hand"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Urias Xhaxin was a male Human privateer and pirate working for the Alliance to Restore the Republic during the Galactic Civil War. He primarily operated in the Mid Rim, including the Ado sector. His success as a privateer gained him placement on the Empire's Most Wanted list and a posted bounty of 250,000 credits.\nXhaxin was one of the first to encounter the Yuuzhan Vong in battle and survive.\nXhaxin's background was largely unknown to the Alliance, though Alliance Intelligence marked the man as a \"penitent obsessive,\" unable to forgive himself for past indiscretions. At some point, his left hand was replaced with a cybernetic prosthesis that concealed a hidden heavy blaster.\nSometime before the Battle of Endor, he acquired his ship, the modified Nebulon-B escort frigate Free Lance, from a Hutt arms dealer. The core members of his often-rotating crew were First Mate Khwir, Quartermaster Cotetchtle, Engineer Rabby Mortunk, Pilot/Astrogator Kandar, Gunnery Sergeant Mirip Pag, and Surgeon Anet Karl.\nDuring his privateer activities for the Alliance, Xhaxin acquired thousands of tons of Imperial cargo and several combat starships for the Alliance, and earned from them no less than three letters of marque and reprisal. During his third letter of marque, his Alliance observer was Special Agent Hast.\nAt some point during his career, a holojournalist came to report on Xhaxin's activities. According to the pirate captain, the actual work of a privateer disappointed her and she instead constructed a romantic fantasy to peddle. Xhaxin dismissed the holodrama the holojournalist eventually had made about him as \"purest fiction.\"\nAfter the Battle of Endor, the New Republic no longer condoned Xhaxin's privateering, but turned a blind eye to his piracy as they continued to battle the various heirs of the Empire. Even following the Pellaeon–Gavrisom Treaty, Xhaxin continued to raid the Empire, concentrating his efforts on unreconstructed Imperials attempting to relocate to Imperial Space. However, six years after the treaty had been signed, those pickings had become slim.\nIn 25 ABY, Xhaxin concocted a scheme he hoped would provide enough money for himself and his crew to retire. He allowed a few Imperial ships to go free as they were traveling together, then set up a service that claimed to organize convoys through deep space to the Imperial Remnant. Unreconstructed Imperials eager to journey to Bastion paid well to be allowed to join, but Xhaxin intended to raid the entire convoy at once just before it departed for Imperial Space.\nInstead of a monetary coup, what awaited the pirate captain was a Yuuzhan Vong warship. The Free Lance was nearly destroyed in the opening moments of the encounter; rather than lose his crew, Xhaxin made a blind hyperspace jump, followed by a second blind jump that wrecked the hyperdrive motivators and compounded the structural damage. The Free Lance eventually ended up in a system that was used as a navigational point between Bastion and the Corporate Sector, where it was discovered by Rogue Squadron. Xhaxin surrendered to New Republic Admiral Traest Kre'fey, who promptly had the old pirate escorted to guest quarters and began to debrief him for intelligence on the Yuuzhan Vong.\nXhaxin kept his hair and beard neatly trimmed, and only wore white, black, or gray clothing. Some of his affectations included a corusca gem and mythra cloak brooch that included an integrated comlink, and a gray bantha-hide glove worn over his left hand prosthesis that earned him the nickname \"Grayclaw.\"\nClassified as a penitent obsessive by the Alliance, Xhaxin's obsessiveness manifested in his precision, control, and effectiveness as a privateer. While his strikes pushed his ship and crew to optimum performance, he nonetheless kept a reasonable margin of error, and he used straightforward tactics to capture his prey. He ran a tight ship, and followed a strict code of conduct summed up in his \"Dozen Rules.\" He was devoted to his crew and was willing to take extreme risks such as a blind hyperspace jump in order to secure a chance for their survival against impossible odds.\nXhaxin was a cunning pirate, able to enact a long-term scheme that centered on creating the false impression a convoy would be safe from his depredations, then setting up a convoy service where unreconstructed Imperials would unwittingly pay for the privilege to be his prey. He was a capable tactician, able to recognize when he was outclassed and successfully judge what actions were necessary in order to survive.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Rebel_privateer",
  "/wiki/Pirate/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Ado_sector",
  "/wiki/Empire%27s_Most_Wanted",
  "/wiki/Bounty/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Alliance_Intelligence",
  "/wiki/Blaster/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Starship/Legends",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Free_Lance",
  "/wiki/Hutt/Legends",
  "/wiki/Arms_dealer/Legends",
  "/wiki/First_Mate/Legends",
  "/wiki/Khwir",
  "/wiki/Quartermaster/Legends",
  "/wiki/Cotetchtle",
  "/wiki/Engineer/Legends",
  "/wiki/Rabby_Mortunk",
  "/wiki/Pilot/Legends",
  "/wiki/Kandar",
  "/wiki/Mirip_Pag",
  "/wiki/Anet_Karl",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Letter_of_marque_and_reprisal",
  "/wiki/Alliance_observer",
  "/wiki/Special_Agent/Legends",
  "/wiki/Hast_(Human)",
  "/wiki/Holojournalist/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Holodrama/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Pellaeon%E2%80%93Gavrisom_Treaty",
  "/wiki/Imperial_Space",
  "/wiki/Standard_year/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Currency/Legends",
  "/wiki/Bastion/Legends",
  "/wiki/Skirmish_in_the_Outer_Rim",
  "/wiki/Warship/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Hyperdrive_motivator/Legends",
  "/wiki/Corporate_Sector/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Second_skirmish_in_the_Outer_Rim",
  "/wiki/Admiral/Legends",
  "/wiki/Traest_Kre%27fey",
  "/wiki/Clothing/Legends",
  "/wiki/Corusca_gem/Legends",
  "/wiki/Mythra/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Bantha/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Dozen_Rules",
  "/wiki/The_New_Jedi_Order:_Dark_Tide_I:_Onslaught",
  "/wiki/Emissary_of_the_Void",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Threats_of_the_Galaxy",
  "/wiki/The_Force_Unleashed_Campaign_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}