{
 "name": "Uriah",
 "display_name": "Uriah",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Uriah was a male Twi'lek who lived on Taris during the Old Sith Wars. He was present in 3956 BBY when Darth Malak's Sith Empire imposed a planet-wide quarantine on the ecumenopolis. He frequented Javyar's Cantina in the Lower City, and would sell Pazaak cards there.\nUriah was born on the urban Outer Rim planet of Taris and lived during the Old Sith Wars. The rich human population of Taris was very humanocentric and discriminatory of the poor and beings of other species, and as such, Uriah was forced to live in poor conditions in the Lower City. He spent much of his time at Javyar's Cantina in the Lower City. He sold cards for Pazaak, a gambling card game played by many sentients at the time.\nIn 3956 BBY, the Hammerhead-class cruiser Endar Spire, belonging to the Galactic Republic, was ambushed by Darth Malak's Sith Empire and destroyed. The Jedi Padawan Bastila Shan, who was on board, was unable to use her Battle meditation, due to the sudden attack. Shan, along with several soldiers, including Carth Onasi and Revan, jettisoned in the escape pods, crashing to the planet below. In response to this, the Sith imposed a planet-wide quarantine of the planet, hoping to trap and locate Shan.\nWhile Shan crashed into the planet's undercity, Revan and Onasi instead crashed into the Upper City, and decided to look for Shan. Uriah was present in Javyar's cantina when Revan visited, searching for information of Shan. He was approached by Revan, who asked questions about the Lower City and the crashed escape pods in the Undercity. While he was willing to impart his limited knowledge of most subjects, he refused to talk about the crime lord Davik Kang, as Zax the Hutt, who worked for Kang, was in the nearby bounty office.\nUriah was still present on Taris during its bombardment and destruction by the Sith Fleet, after Malak was unable to find Bastila Shan.\nUriah was a male Twi'lek with green skin and gray eyes. He wore his lekku around his neck, like many other males of his species. While in the cantina, he wore a brown tunic and orange pants. He believed the streets were safer when the Hidden Beks swoop gang was in charge, and disliked the Black Vulkars. He thought Brejik to be ruthless, and even a little insane. He was wary not to talk poorly of Davik Kang near any of his associates. He could understand basic, but spoke in Huttese.\nUriah appeared as a non-player character in the 2003 roleplaying game Star Wars: Knights of the Old Republic. His dialogue is optional, and the player is not required to interact with Uriah at all. No dialogue options further the plot or any quests, nor do they affect the player's alignment.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Pazaak/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Old_Sith_Wars",
  "/wiki/3956_BBY",
  "/wiki/Darth_Malak",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Ecumenopolis/Legends",
  "/wiki/Javyar%27s_Cantina",
  "/wiki/Lower_City",
  "/wiki/City/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Human/Legends",
  "/wiki/Humanocentrism",
  "/wiki/Speciesism",
  "/wiki/Species/Legends",
  "/wiki/Time/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Hammerhead-class_cruiser",
  "/wiki/Endar_Spire",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Attack_on_the_Endar_Spire",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Battle_meditation",
  "/wiki/Carth_Onasi",
  "/wiki/Escape_pod/Legends",
  "/wiki/Canon",
  "/wiki/Undercity_(Taris)",
  "/wiki/Upper_City",
  "/wiki/Cantina/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Davik_Kang",
  "/wiki/Zax",
  "/wiki/Hutt/Legends",
  "/wiki/Zax%27s_bounty_office",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Destruction_of_Taris",
  "/wiki/Fleet/Legends",
  "/wiki/Gender",
  "/wiki/Eye/Legends",
  "/wiki/Lekku/Legends",
  "/wiki/Hidden_Beks",
  "/wiki/Swoop_gang/Legends",
  "/wiki/Black_Vulkars/Legends",
  "/wiki/Brejik",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/2003",
  "/wiki/Roleplaying_game",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/The_New_Essential_Chronology"
 ]
}