{
 "name": "Urk_G%27lar",
 "display_name": "Urk G'lar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ongree"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Anklebiter Brigade"
     ]
    }
   ]
  }
 ],
 "content": "Urk G'lar was an Ongree male from the planet Coruscant, who during his childhood served as a member of the Anklebiter Brigade, a group of rebel children who opposed the Galactic Empire during the Galactic Civil War. In the year 5 ABY, G'lar was among a group of six brigade members who managed to break a laundry vacu-tube in the Imperial Palace on Coruscant that led directly into the quarters of Mas Amedda, Grand Vizier and supposed leader of the Empire.\nThe children then climbed through the tube and surrounded Amedda while he slept; however, once he woke the vizier begged the children for death and they quickly realized he was a powerless captive of his own troops. G'lar and then the other children began expressing doubt about the use of killing him and once the leader Iggs agreed, Amedda proposed a deal: If the children could rescue him from the palace by killing the guards outside his room then he would surrender the entire Empire to the New Republic, their enemy in the civil war. G'lar and the others agreed and successfully freed Amedda, who was true to his word and represented the Empire in the signing of the Galactic Concordance peace treaty.\nDuring the Galactic Civil War between the New Republic and the Galactic Empire, the Ongree, male child Urk G'lar joined the Anklebiter Brigade, a group of children led by the human Iggs who were rebelling against the Empire on G'lar's homeworld Coruscant. In the year 5 ABY, G'lar was one of six members of the brigade who infiltrated the Imperial Palace on Coruscant to assassinate Grand Vizier Mas Amedda, head of state for the Empire since the death of the Galactic Emperor Palpatine.\nThe group, led by Iggs, managed to break a laundry vacu-tube within the palace that was big enough for them to crawl through and led directly to Amedda's room. Several days after they broke the tube, the group climbed up and entered Amedda's room while he slept. Unbeknownst to the children, Amedda in fact no longer held any power within the Empire, and was kept as a prisoner within his own room by troops loyal to the true Imperial leader, Counselor to the Empire Gallius Rax.\nThe children surrounded Amedda in his bed and took aim at him with blasters, but when the vizier awoke he simply requested that they get it over with. G'lar then began questioning whether killing Amedda would actually be beneficial at all, and after Iggs agreed that there seem to be no point, Amedda begged them to end his life. The six brigade members then tried to figure out their new course of action, introducing themselves to Amedda and explaining how they had reached him after he asked.\nAmedda then asked the children to help him escape, an idea they initially rejected until the vizier explained that if he could reach the New Republic he would be able to surrender the Empire to them, as he still had control in the eyes of the public. After the brigade members reminded him he would not fit through the vac-tube, he suggested they instead kill the guards outside his room so that they would have access to the building's turbolifts. The Anklebiters agreed in the knowledge that they might well die attempting to free Amedda and knowing that the vizier might well betray them.\nG'lar and his teammates were ultimately successful in getting Amedda to freedom, and the vizier safely reached the New Republic, where he recounted the story of his rescue with full credit given to the Anklebiter Brigade. As Rax had died during the Battle of Jakku, Amedda was able to successfully surrender the Empire and represent them in signing the Galactic Concordance, which officially ended the Galactic Civil War.\nUrk G'lar was a filthy, bug-eyed child at the time that he infiltrated the Imperial Palace. After seeing the pitiful state Amedda was in, he twisted his mouth and was the first member of the brigade to voice his concerns about killing the clearly powerless vizier. After Amedda proposed his plan of escape to the brigade, G'lar was unsure as to whether they should trust the Imperial.\nUrk G'lar first appeared during an interlude in the 2017 novel Aftermath: Empire's End, which was written by Chuck Wendig.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Coruscant",
  "/wiki/Ongree",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Anklebiter_Brigade",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/Galactic_Civil_War",
  "/wiki/Standard_year",
  "/wiki/5_ABY",
  "/wiki/Imperial_Palace",
  "/wiki/Mas_Amedda",
  "/wiki/Grand_Vizier",
  "/wiki/Death",
  "/wiki/Iggs",
  "/wiki/New_Republic",
  "/wiki/Galactic_Concordance",
  "/wiki/Youngling",
  "/wiki/Human",
  "/wiki/Homeworld",
  "/wiki/Assassin",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Standard_day",
  "/wiki/Sleep",
  "/wiki/Prisoner",
  "/wiki/Troop",
  "/wiki/Counselor_to_the_Empire",
  "/wiki/Gallius_Rax",
  "/wiki/Blaster",
  "/wiki/Eye",
  "/wiki/Turbolift",
  "/wiki/Battle_of_Jakku",
  "/wiki/Time",
  "/wiki/Mouth",
  "/wiki/2017",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Chuck_Wendig",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}