{
 "name": "Ursa_Wren",
 "display_name": "Ursa Wren",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Krownest"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.85 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "House Vizsla",
      "Clan Wren",
      "Clan Wren"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Death Watch",
      "Mandalore resistance",
      "Nite Owls",
      "Nite Owls",
      "Galactic Empire",
      "Mandalorian resistance"
     ]
    }
   ]
  }
 ],
 "content": "Ursa Wren was a human female Mandalorian warrior, the wife of Alrich Wren, the mother of Tristan and Sabine Wren, and the leader and Countess of Clan Wren. She was part of Death Watch, a Mandalorian splinter group that took over Mandalore during the Clone Wars. In 19 BBY, Ursa took part in the Siege of Mandalore under the command of Bo-Katan Kryze of the Nite Owls, with the aid of the 332nd Company of the Galactic Republic, under the leadership of former Jedi Padawan Ahsoka Tano and Clone Commander Rex. Once Maul was successfully captured, Mandalore was then occupied by the Galactic Empire after the war's end, and Sabine Wren attended the Imperial Academy on the planet. Wren fled the Academy, however, bringing shame upon her family.\nDue to her daughter's actions, Clan Wren were treated with suspicion by the other clans. Ursa's husband was kept as a hostage by Viceroy Gar Saxon to ensure her family's cooperation while her son Tristan was forced to join the Imperial Super Commandos. In an effort to protect Sabine, Ursa did not search for her daughter. In public, Ursa sided with the Empire and the Emperor's Hand Saxon. In 2 BBY, Ursa was reunited with her daughter Sabine in the Wren Stronghold on Krownest, who had joined the rebellion and had returned to seek her family's support for the rebels.\nUnwilling to antagonize Saxon, Ursa was initially cold towards her daughter and the rebel emissaries, Kanan Jarrus and Ezra Bridger. Ursa's pragmatism clashed with Sabine's idealism. In an attempt to save Sabine's life, Ursa attempted to trade the rebels and the Darksaber to Saxon, in exchange for Sabine's pardon. However, Saxon betrayed Ursa, reneged on the offer, and ordered his men to exterminate Clan Wren for their crimes against Mandalore and the Empire. Ursa and the rest of Clan Wren joined forces with the rebels and the Mandalorian Protector Fenn Rau, who was able to sneak into the compound and reacquire the rebels' weapons, and fought in a skirmish against Saxon's forces. Saxon's forces were soon overpowered, and Sabine and Saxon engaged in a duel, with Sabine defeating Saxon, but sparing his life. When Saxon tried to kill Sabine, Ursa shot and killed Saxon, ending the skirmish. With Saxon's death, Mandalore would fall into civil war once more, with Sabine vowing to find Mandalore's rightful leader.\nAs Countess, Ursa led her clan's warriors against the forces of Clan Saxon and the Empire, though they faced overwhelming odds. When Ezra came to Krownest seeking their aid, she initially refused as her own forces were stretched too thin, but after witnessing her daughter prepare to leave she relented and allowed them to take any ships and warriors able and willing to help, citing that she owed the rebels for restoring her family. Her clan's aid allowed some rebels to escape total destruction at the Battle of Atollon and some of them returned the favor by coming to Mandalore to help rescue her husband. Ursa and Tristan were nearly killed by Sabine's resurrected weapon, \"the Duchess,\" but the Countess was reunited with her husband and provided technical support on a mission to destroy the weapon.\nUrsa Wren was a member of Death Watch, a group of Mandalorian warriors who opposed Mandalore's pacifist government during the Clone Wars. She was the head of Clan Wren and married Alrich. One year into the war, her daughter, Sabine Wren, was born. Ursa later bore a son named Tristan. In 19 BBY, Death Watch—with the help of the Sith Lord Maul and his Shadow Collective—took over Mandalore. Maul slew the leader of Death Watch, Pre Vizsla, and ruled Mandalore for the remainder of the Clone Wars. Ursa deserted Death Watch and allied with the Nite Owls, led by Bo-Katan Kryze, who opposed Maul's rule. While doing reconnaissance on Oba Diah, Wren encountered former Jedi Padawan and Pyke prisoner Ahsoka Tano and the Martez sisters. Wren discussed Tano's presence with Kryze and they decided to keep an eye on her. The trio of warriors kept an eye on the Jedi, and when Tano, Rafa, and Trace returned to Trace Martez's repair shop on Coruscant, the Nite Owls tracked them there. Kryze invited Tano to join them to face their common enemy Maul, and they departed on their starship.\nAt the end of the war, Mandalore was besieged by the Galactic Republic's 332nd Division, a division led by Tano. Together, Republic and Mandalorian forces began their landing on Sundari. As their forces approached, Wren, sent ahead to Mandalore, tracked Maul, but was unable to locate his specific location, and communicated such to Kryze via hologram. When Tano arrived at the Sundari shipping docks, Wren and her forces emerged to back her up against the Shadow Collective's super commandos. Tano later sent Clone Commander Rex to back Wren up at the docks in order to lessen the possibility of Maul escaping. Meanwhile, their forces claimed control of the upper city as Maul's forces retreated into the Undercity.\nAfter Tano defeated Maul in a duel and captured him, the renegade Sith Lord was imprisoned in a Mandalorian vault, a Force-proof capsule designed to imprison Jedi. Kryze and Wren escorted their imprisoned foe to a Republic transport shuttle so he could be transported back to Coruscant. Tano and some of her forces departed, but the Republic was soon thereafter transformed into the Galactic Empire following the execution of the Jedi and the end of the war. The new regime would occupy the planet.\nDuring the Imperial Era, Ursa's daughter Sabine enlisted in Mandalore's Imperial Academy, however she fled the Academy after the Empire forced her to build weapons which they used on the Mandalorian people. One of these weapons was the Arc Pulse Generator known as \"the Duchess,\" which was capable of reacting with the beskar alloy inside Mandalorian armor and incinerating the wearers. When Sabine spoke up against the Empire, Ursa and the rest of her family stood by the Empire and denounced her daughter.\nWren's desertion shamed her family, prompting Ursa to join the Empire. Ursa's husband was made a hostage of Governor Gar Saxon, the Viceroy of Mandalore and the Emperor's Hand. Her son Tristan was forced to join Saxon's Imperial Super Commando. Meanwhile, after working as a bounty hunter for a time, the young Wren joined a group of rebels who operated against the Empire on the planet Lothal, and eventually became part of a larger rebel movement. For years, Ursa did not search for her daughter in order to protect her from Saxon, who was seeking every opportunity to destroy Clan Wren.\nIn the hopes of gathering up Mandalorian warriors for an attack on Lothal, Sabine, Ezra Bridger, Kanan Jarrus and the Mandalorian Protector Fenn Rau set out on a mission to Krownest to recruit Sabine's clan in a fight against the Empire. However, as Sabine expected, her clan set up an ambush for the rebels' ship, which was forced to crash-land on the snowy surface of the planet. After meeting Sabine's brother Tristan, she and the rest were taken before Ursa, who almost had Sabine placed into a cell before she stopped upon seeing the darksaber. She then demanded that the Jedi surrender their lightsabers before she spoke with her daughter.\nUrsa then told Sabine about Clan Wren's alliance with the Empire, her husband's imprisonment, and opposed joining the rebellion. Ursa also regarded Fenn Reu and his Protectors as traitors who had met their fitting end. Despite their disagreements, both Ursa and Sabine wanted to save Mandalore. Ursa was summoned by Viceroy Gar Saxon, and she informed him that her daughter and the Jedi were present, and also informed him of the Darksaber. She told Saxon that she would give him the two Jedi and the Darksaber if he agreed to spare her daughter, Saxon agreed, and informed Ursa that he would soon be there. When Saxon and his Imperial Super Commandos arrived, Ursa gave him the Jedi and the Darksaber. However, Saxon betrayed her and ordered the extermination of Clan Wren on the pretext of colluding with rebels. Ursa was shown to be furious at this treachery.\nTristan, a member of the Imperial Super Commandos, attempted to convince Saxon not to go ahead with the massacre, but Saxon merely gave him the option of staying with him or perishing with his family. Tristan initially seemed to take the former option by holding his blaster on Sabine, to Ursa's sorrow, but then decided to remain loyal to his clan and prepared to die fighting. At that moment, Fenn Rau crashed through the windows of the compound, and returned the lightsabers to the Jedi. A skirmish broke out between Clan Wren, the rebels, and Fenn Rau, against Gar Saxon and his forces, with Ursa herself shooting down one of his lackeys with her twin blasters. Saxon, in possession of the Darksaber, saw the opportune moment to kill Ursa by stabbing her from behind, yet she was saved when Sabine took Bridger's lightsaber and intercepted the blow. Sent crashing out of the compound, Sabine fought Saxon with Ursa and the others looking on. Ezra attempted to help her, but Ursa stopped him by stating that Mandalorian custom and law dictated single-combat duels could not be interfered with, but was left speechless when Kanan inquired if she though custom was more important than her daughter's life. After a brutal fight, Sabine disarmed Saxon and regained the darksaber, holding it and Bridger's lightsaber to his throat and telling Saxon to yield. Saxon stated that she would have to kill him in order for her to win, yet Sabine spared Saxon's life, stating that it's not her way anymore. As Sabine was leaving, Saxon pulled his blaster and attempted to shoot her from behind but before he could shoot Sabine, Ursa outdrew and killed him with a single shot through the heart. Ursa, reconciled with her daughter, then agreed to help Sabine find a worthy leader for Mandalore.\nFollowing Gar Saxon's death, Ursa's Clan Wren was locked in civil war against Clan Saxon, which was backed by the Galactic Empire. Clan Wren's forces were stretched thin defending what little ground they had. Due to the dire circumstances facing her clan, Ursa was unwilling to send forces to help Phoenix Cell and General Jan Dodonna's Massassi Group, which were being besieged on Atollon by Grand Admiral Thrawn's Seventh Fleet.\nHowever, when her daughter Sabine insisted on following Ezra and the rebel droid Chopper back to Atollon, Ursa relented and allowed several volunteers and ships to accompany them. She stated that Clan Wren had a debt of honor to the rebels for bringing back her daughter Sabine, and that they will return the favor. Fenn Rau and several Mandalorian warriors arrived with Fang fighters to Atollon and succeeded in destroying Thrawn's second Interdictor vessel; giving the rebel survivors a small window to escape. Following the battle, Ursa expressed her condolences to Phoenix Leader Hera Syndulla for her forces' losses on Atollon.\nIn 1 BBY, Ursa, her children, Fenn Rau, Clan Wren's forces, and several Spectres went to Mandalore to rescue her husband Alrich. Since Alrich was being held at a prison outpost, Ursa dispatched Sabine and a joint rebel and Mandalorian force to rescue Alrich. However, Ursa subsequently received intelligence that Alrich had already been transported to the capital Sundari for execution and that Governor Tiber Saxon had set a trap. Unable to contact Sabine due to Imperial jamming, Ursa sent Lady Bo-Katan Kryze and her Nite Owls to warn and aid Sabine's forces.\nAfter Lady Bo-Katan had aided Sabine's forces, Ursa and Tristan arrived and informed Sabine and her companions about Alrich's predicament. While Sabine's forces rescued Alrich from an Imperial convoy, Ursa and her son led Clan Wren forces in combat against Clan Saxon's Imperial Super Commandos. Clan Wren's forces gained the advantage over the Imperials. Sabine subsequently contacted her mother to inform her about the success in rescuing Alrich. Ursa was pleased with these two victories. However, Tristan then reported that the Empire had dispatched a modified AT-DP walker. This walker was equipped with a powerful energy weapon that Sabine had built during her Imperial Academy days known as the \"Duchess.\" This weapon was capable of turning Mandalorian armor against their wearers by reacting with the beskar alloy, incinerating them and leaving charred armor behind. Unaware of the imminent danger, Ursa remarked on the laughable reinforcements before ordering it destroyed.\nBefore they were cut off, Sabine managed to warn Ursa and Tristan to take shelter. This proved timely as \"the Duchess\" wiped out Ursa's forces on the battlefield. Despite surviving the attack, the Countess was wounded. Ursa and Tristan were later rescued by Sabine's forces, who evacuated the battlefield aboard one of Lady Bo-Katan's ships. During the journey, Ursa and the others were present when Sabine discussed the mechanics of the Duchess. After arriving at Bo-Katan's camp, several of the Nite Owls denounced Sabine as a traitor. Ursa sprung to her daughter's defense and warned that attacking Sabine would bring down the wrath of Clan Wren on the perpetrators.\nUrsa and her family were present during a meeting in which Sabine outlined a plan to infiltrate Tiber Saxon's Star Destroyer and destroy the Duchess along with all associated data. Ursa volunteered to lead the team to destroy the weapon, eager for revenge, but Fenn Rau pointed out that she could barely hold a blaster. Though she confidently claimed herself just as good with her left hand, her husband Alrich and son Tristan held her back before she could argue further. Ursa and her husband stayed behind at Bo-Katan's camp while Sabine and Tristan accompanied the strike team to Tiber Saxon's Star Destroyer, which was docking above Sundari. After Sabine's strike team destroyed the weapon and all data, the Wrens joined the other Mandalorian clans in pledging allegiance to Lady Bo-Katan, who inherited the Darksaber and the mantle of Mandalorian leadership.\nUrsa Wren was a strong and pragmatic leader who was concerned about the well-being of her clan. She was a human woman with black hair and brown eyes. Ursa often wore Mandalorian armor while serving her duties as Countess and leader of Clan Wren. Ursa's desire to preserve her clan led her to acquiesce to the Galactic Empire and their puppet ruler, Viceroy Gar Saxon. Ursa disagreed with the abuses that occurred under Imperial rule but did not publicly voice dissent in order to safeguard her family and clan. Ursa was disappointed and angry with her daughter Sabine's decision to abandon her training at the Imperial Academy of Mandalore since it endangered the interests of Clan Wren and hurt her family. Ursa's husband was held as a hostage of Gar Saxon while her son Tristan was dragooned into the Imperial Super Commandos in order to guarantee Clan Wren's cooperation. For years, Ursa struggled to maintain the image of Clan Wren as a loyal clan to Gar Saxon and his Imperial backers. Although siding with the Empire in an effort to protect her clan, Ursa's hatred for them lived on and pushed her to extremes along with many fellow Mandalorians.\nWhile Ursa loved her family including Sabine, she disapproved of her daughter's decision to join the rebellion. Ursa feared that aligning Clan Wren with the rebellion would incur the wrath of the Galactic Empire and Gar Saxon. Ursa regarded her daughter as a naïve idealist whose alleged selfishness had endangered the interests of her family and clan. She also regarded Fenn Rau and his Protectors as traitors for colluding with the rebellion. Ursa' preoccupation with protecting Clan Wren led Sabine to accuse her of prioritizing politics and power over family. Ursa's pragmatism and desire to protect Sabine led her to attempt to trade the Darksaber and the Jedi Kanan and Ezra to Gar Saxon. After Saxon betrayed their agreement and ordered the destruction of Clan Wren, Ursa and her clan joined forces with the rebels and Fenn Rau to defeat Saxon's Super Commandos. When Saxon tried to kill Sabine, Ursa chose her daughter over the Empire and killed the Viceroy.\nUrsa believed that Mandalore needed to experience chaos in order for a true leader to arise in the wake of Saxon's death. Ursa agreed to help her daughter Sabine find a worthy leader for Mandalore. While she gained a greater sense of respect for Sabine's rebel comrades, Ursa thought that Clan Wren and the Mandalorians were not yet in a position to render assistance to the rebellion.\nUrsa also had a deep sense of honor and held the Phoenix Squadron in high esteem for reuniting her back with her daughter Sabine. Though Clan Wren's forces were stretched, she allowed Sabine and Fenn Rau to depart with several volunteers to aid the rebels during the Battle of Atollon. This small Mandalorian contingent helped the rebels to escape into space. Following the battle, Ursa expressed her condolences to Phoenix Leader Hera Syndulla for the heavy losses sustained by the rebels.\nUrsa was a competent and stalwart commander who led her troops to victory. She was also protective of Sabine and warned that anyone who harmed her daughter risked the wrath of Clan Wren. Though Ursa wanted to lead the strike team to destroy the Duchess, she relented due to her injuries and allowed Sabine to assume that responsibility. Ursa was also an ally of Lady Bo-Katan Kryze and joined the other Mandalorian clans in recognizing her leadership.\nUrsa Wren was the matriarch of Clan Wren, and was a capable leader. She knew how to operate twin WESTAR-35 blasters and knew the importance of the darksaber. Ursa was an expert marksman, using her blaster to shoot several Imperial Super Commandos quite accurately, including Gar Saxon when he tried to murder her daughter, Sabine.\nUrsa Wren was first referenced in \"The Protector of Concord Dawn,\" an episode of the animated television series Star Wars Rebels' second season, revealing that she was a member of Death Watch. In the behind-the-scenes Rebels Recon video for the episode, series executive producer Dave Filoni stated that, in his mind, Ursa was likely one of the Death Watch members present in the Mandalorian throne room in the Star Wars: The Clone Wars episode \"Shades of Reason,\" when Maul killed Pre Vizsla. Her name was revealed in an interview Filoni gave to Amy Ratcliffe of Nerdist. Ursa Wren first appeared in \"Legacy of Mandalore\" voiced by Sharmila Devar. For her appearance in \"Dangerous Debt\" in the Star Wars: The Clone Wars seventh season, she was added to the episode as one of Kryze's lieutenants to create a link between the two series, rather than create a new Nite Owls character, according to Dave Filoni.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Krownest",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/House_Vizsla",
  "/wiki/Clan_Wren",
  "/wiki/Death_Watch",
  "/wiki/Mandalore_resistance",
  "/wiki/Nite_Owls",
  "/wiki/Galactic_Empire",
  "/wiki/Mandalorian_resistance",
  "/wiki/Mandalorian",
  "/wiki/Alrich_Wren",
  "/wiki/Parent",
  "/wiki/Tristan_Wren",
  "/wiki/Sabine_Wren",
  "/wiki/Count",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Mandalore",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY",
  "/wiki/Siege_of_Mandalore",
  "/wiki/Bo-Katan_Kryze",
  "/wiki/332nd_Company",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Clone_Commander",
  "/wiki/Rex",
  "/wiki/Maul",
  "/wiki/Imperial_Academy_of_Mandalore",
  "/wiki/Planet",
  "/wiki/Viceroy",
  "/wiki/Gar_Saxon",
  "/wiki/Imperial_Super_Commando",
  "/wiki/Emperor%27s_Hand",
  "/wiki/2_BBY",
  "/wiki/Wren_Stronghold",
  "/wiki/Kanan_Jarrus",
  "/wiki/Ezra_Bridger",
  "/wiki/Darksaber",
  "/wiki/Mandalorian_Protectors",
  "/wiki/Fenn_Rau",
  "/wiki/Skirmish_on_Krownest",
  "/wiki/Mandalorian_Civil_War_(Imperial_Era)",
  "/wiki/Battle_of_Atollon",
  "/wiki/Arc_Pulse_Generator",
  "/wiki/New_Mandalorians",
  "/wiki/Standard_year",
  "/wiki/Reproduction",
  "/wiki/Sith_Lord",
  "/wiki/Shadow_Collective",
  "/wiki/Death",
  "/wiki/Pre_Vizsla",
  "/wiki/Cloning",
  "/wiki/Oba_Diah",
  "/wiki/Pyke",
  "/wiki/Trace_Martez%27s_repair_shop",
  "/wiki/Coruscant",
  "/wiki/Kom%27rk-class_fighter/transport",
  "/wiki/332nd_Division",
  "/wiki/Sundari",
  "/wiki/Hologram",
  "/wiki/Sundari_shipping_docks",
  "/wiki/Mandalorian_super_commando",
  "/wiki/Undercity",
  "/wiki/Mandalorian_vault",
  "/wiki/Rho-class_transport_shuttle",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_Academy",
  "/wiki/Beskar",
  "/wiki/Mandalorian_armor",
  "/wiki/Governor",
  "/wiki/Bounty_hunter",
  "/wiki/Time",
  "/wiki/Spectres",
  "/wiki/Lothal",
  "/wiki/Phantom_II",
  "/wiki/Lightsaber",
  "/wiki/Prison",
  "/wiki/Ezra%27s_second_lightsaber",
  "/wiki/Mand%27alor",
  "/wiki/Clan_Saxon",
  "/wiki/Phoenix_Cell",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Massassi_Group",
  "/wiki/Atollon",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/7th_Fleet",
  "/wiki/C1-10P",
  "/wiki/Fang-class",
  "/wiki/Interdictor_vessel",
  "/wiki/Phoenix_Leader",
  "/wiki/Hera_Syndulla",
  "/wiki/1_BBY",
  "/wiki/Mandalore_prison_outpost",
  "/wiki/Tiber_Saxon",
  "/wiki/All_Terrain_Defense_Pod",
  "/wiki/Armor",
  "/wiki/Tiber_Saxon%27s_Star_Destroyer",
  "/wiki/Nite_Owl_helmet",
  "/wiki/WESTAR-35_blaster_pistol",
  "/wiki/The_Protector_of_Concord_Dawn",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Rebels_Recon",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Shades_of_Reason",
  "/wiki/Amy_Ratcliffe",
  "/wiki/Legacy_of_Mandalore",
  "/wiki/Sharmila_Devar",
  "/wiki/Dangerous_Debt",
  "/wiki/The_Clone_Wars:_Season_Seven",
  "/wiki/Category:Images_of_Ursa_Wren",
  "/wiki/Together_Again",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/Shattered",
  "/wiki/Imperial_Supercommandos",
  "/wiki/Trials_of_the_Darksaber",
  "/wiki/Zero_Hour",
  "/wiki/Star_Wars_Rebels:_Heroes_of_Mandalore",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_74",
  "/wiki/Databank_A-Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/The_Mandalore_Plot",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Lothal_Calendar",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_3",
  "/wiki/Ahsoka_(novel)",
  "/wiki/Out_of_Darkness",
  "/wiki/Blood_Sisters",
  "/wiki/Art_Attack",
  "/wiki/Fire_Across_the_Galaxy",
  "/wiki/February_17",
  "/wiki/2017",
  "/wiki/June_16",
  "/wiki/2018",
  "/wiki/Star_Wars"
 ]
}