{
 "name": "Usan_Ollin",
 "display_name": "Usan Ollin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation"
     ]
    }
   ]
  }
 ],
 "content": "Usan Ollin was a Neimoidian female who served the Trade Federation. When the Trade Federation invaded Naboo, Ollin was placed in charge of Camp Four. When her battle droids captured the Royal Handmaiden Saché sneaking around the camp, Ollin told the droids to bring her to the overseer's office to torture her for information regarding the planned uprising.\nUsan Ollin was a Neimoidian female who worked for the Trade Federation. When the Federation successfully invaded the planet Naboo in 32 BBY, Ollin became overseer of Camp Four, a prison camp set up in one of the market squares of the city of Theed. The square's market office was converted into a small office for her to use, as well as a charging station for the battle droids guarding the camp. The prisoners held in the camp were all staff of Royal House of Naboo, including members of the Royal Naboo Security Forces and two of the Queen of Naboo's handmaidens; Yané and Saché.\nOllin came to suspect that the adult prisoners of the camp were conspiring against her after a piece of fabric concealing a coded message was discovered. The following day, Saché was brought before the overseer by a patrol of droids who had spotted the handmaiden moving frequently between the tents of the camp. Knowing that Saché was delivering the messages, but assuming that the twelve year old girl was simply being used by the adults, Ollin tried to convince Saché that the other prisoners were putting her in danger and encouraged her to reveal how to decipher the coded messages or who was giving them to her. Saché, who was in fact fully aware of what the messages said and had volunteered to be deliver them, pretended to be surprised and not know how to decipher them. The handmaiden tricked the overseer into admitting the camp would soon face a food shortage and also falsely claimed that she did not remember who had given her the messages as the other prisoners in the camp were strangers to her, including Yané. Ollin fell for the lie, but still believed that Saché was hiding something, and so had the battle droids take Saché to an interrogation room they had recently finished but not yet tested.\nAfter Ollin uploaded a series of questions for them to ask, the droids tortured the child there using fire for three hours. The handmaiden revealed nothing and was released back to her tent, as the Neimoidian was eventually convinced that Saché really was as ignorant as she claimed to be. Shortly before the Battle of Naboo, in which the natives of Naboo rose up to fight off the Trade Federation occupation, several of the prisoners escaped from Camp Four using the nearby sewer system. Two of these prisoners—Captain Mariek Panaka and Sergeant Tonra—returned during the battle and attacked the droid forces in the camp, causing the remaining prisoners to also turn on their captors. Amidst the fighting, Ollin stood in the door of her office and shrieked orders at her droids, although they were too busy to listen. Panaka saw this as an opening and charged across the market square, choosing not to pick up a blaster, but instead tackle the droid nearest Ollin and then punch the overseer in the face. Ultimately the Trade Federation forces were defeated and their leadership arrested and handed over to the Galactic Republic.\nUsan Ollin attempted to manipulate the twelve year old Saché into betraying her allies, but was tricked into accidentally revealing information to the child and fell for her feigned ignorance. The Neimoidian was surprised at how small a human child was.\nUsan Ollin appeared in the novel Queen's Peril, which was written by E. K. Johnston and released physically and as an audiobook in 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Neimoidian",
  "/wiki/Gender",
  "/wiki/Trade_Federation",
  "/wiki/Sach%C3%A9",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Naboo",
  "/wiki/Camp_Four",
  "/wiki/OOM-series_battle_droid",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Planet",
  "/wiki/32_BBY",
  "/wiki/City",
  "/wiki/Theed",
  "/wiki/Battle_droid",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Royal_Naboo_Security_Forces",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Yan%C3%A9",
  "/wiki/Droid",
  "/wiki/Torture",
  "/wiki/Standard_hour",
  "/wiki/Battle_of_Naboo",
  "/wiki/Captain",
  "/wiki/Mariek_Panaka",
  "/wiki/Sergeant",
  "/wiki/Tonra",
  "/wiki/Blaster",
  "/wiki/Galactic_Republic",
  "/wiki/Queen%27s_Peril",
  "/wiki/E._K._Johnston",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/2020",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}