{
 "name": "Utrop",
 "display_name": "Utrop",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Blimph 3"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Jokhalli"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jokhalli"
     ]
    }
   ]
  }
 ],
 "content": "Utrop was a male Jokhalli who served as the leader of the Jokhalli on Blimph 3.\nUtrop captured Lando Calrissian some time after the Battle of Hoth for intruding on Jokhalli territory. After introducing Calrissian to the Jokhalli camp, Calrissian shocked Utrop by speaking Baragwinian and recognizing the Jokhalli's valued game of divot. Calrissian proved to be an excellent player and won his freedom from the Jokhalli after besting the Jokhalli champions. Calrissian then revealed to Utrop that the Jokhalli's trade partner, Quaffug the Hutt, was exploiting and cheating them in their current agreement. Calrissian convinced Utrop and the Jokhalli to overthrow Quaffug and form a new trade agreement with friends of Calrissians. Utrop helped subdue Quaffug's guards and was preparing to kill the treacherous Hutt when Calrissian intervened, challenging Utrop to an honor duel for the Hutt's life. Utrop agreed, and a hand to hand combat ensued. The fight was one-sided as Utrop had four hands and was able to overpower Calrissian. Unfortunately, Calrissian had a blaster hidden in his sleeve which changed the balance of the fight. Utrop yielded, and Quaffug was allowed to go free.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Blimph_3",
  "/wiki/Jokhalli",
  "/wiki/Gender/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Baragwinian",
  "/wiki/Divot/Legends",
  "/wiki/Quaffug",
  "/wiki/Hutt/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/The_Bounty_Hunters:_Scoundrel%27s_Wages",
  "/wiki/Star_Wars:_The_Comics_Companion"
 ]
}