{
 "name": "Vaabesh",
 "display_name": "Vaabesh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gand"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Jabiim"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gand"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Vaabesh was a male breather Gand Padawan serving the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars.\nA Force-sensitive Gand, Vaabesh was educated in the ways of the Force by the Jedi Order during the decade marked by the Separatist Crisis. Selected as a Padawan, Vaabesh constructed a green-bladed lightsaber which he wielded in battle. When the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Vaabesh took up the rank of Commander within the Grand Army of the Republic. Along with his master, Vaabesh was assigned to the planet Jabiim where they were to join other Jedi in a months-long battle with the Confederacy-backed Jabiimi Nationalists.\nDuring the fighting, Vaabesh's master was slain and command was turned over to Obi-Wan Kenobi who ordered that their small force remain behind the main battle line until the main Republic force could overrun the main weapons emplacement of the Jabiimi Military. Along with other masterless apprentices, Vaabesh became known as a member of the so-called Padawan Pack. General Kenobi ordered Vaabesh to ambush the retreating soldiers as they fled along the flanks of the main column of the Republic army. Separated from the rest of his group after the battle, Vaabesh eventually regrouped with the other Padawans as they made for the main outpost of the Grand Army.\nAs the Padawan Pack made a break for the main Republic outpost they came into open conflict with Jabiimi Nationalist leader Alto Stratus. Fighting alongside Aubrie Wyn for four days on the battlefield, Vaabesh's containment suit was breached during the fighting and he would slowly die of oxygen poisoning. As he lay dying, Wyn asked him for his lightsaber to fend off Stratus. While Wyn ultimately was killed, she managed to kill the Jabiimi leader with her and Vaabesh's weapon as she took her last breath.\nWhen the fighting finally concluded, Vaabesh's death would be memorialized in the wings of a memory moth within a monument on New Holstice.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gand_(planet)/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Jabiim/Legends",
  "/wiki/Gand/Legends",
  "/wiki/Breather_Gand",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Aubrie_Wyn",
  "/wiki/Star_Wars:_Republic:_The_Battle_of_Jabiim",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Jabiim",
  "/wiki/Jabiimi_Nationalists",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jabiimi_Military",
  "/wiki/Padawan_Pack",
  "/wiki/Jedi_General/Legends",
  "/wiki/Alto_Stratus",
  "/wiki/Memory_moth/Legends",
  "/wiki/Jedi_Monument_(New_Holstice)",
  "/wiki/New_Holstice/Legends",
  "/wiki/Republic_56",
  "/wiki/Republic_57",
  "/wiki/Republic_58",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Heroes_on_Both_Sides"
 ]
}