{
 "name": "Vaala_Razelle",
 "display_name": "Vaala Razelle",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Arcona"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "About a head shorter than Kenth Hamner"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Vaala Razelle was an Arcona Jedi Knight of the New Jedi Order. In 44 ABY, she was stationed alongside Yantahar Bwua'tu to guard the entrance to the Operations Hangar in the Jedi Temple while the Jedi prepared to launch a strike team of StealthXs to help Grand Master Luke Skywalker in his dealings with the Lost Tribe of Sith. They were confronted by Kenth Hamner, who had recently been removed from the position of acting Grand Master by the rest of the Jedi Council. He claimed that by letting the StealthXs launch, Razelle and Bwua'tu were committing an act of treason. When Razelle and Bwua'tu refused to stand down, he knocked them unconscious. However, Hamner failed to prevent the starfighters from launching. Later, she took part in the Jedi mission to liberate the planet Coruscant from the Sith Tribe, who had infiltrated the world.\nVaala Razelle was a female Arcona Force-sensitive who rose to the rank of Jedi Knight in the New Jedi Order by 44 ABY. At that time, the Galactic Federation of Free Alliances was in conflict with the Jedi Order due to several Jedi Knights falling prey to a Force psychosis. Meanwhile, exiled Grand Master Luke Skywalker encountered a new Sith Tribe, and the Jedi decided that they needed to send a strike team of StealthXs to assist him; however, the Galactic Alliance Sixth Fleet remained in orbit over the planet Coruscant, ready to engage the Jedi fighters in fear that the strike would be against the Galactic Alliance.\nFollowing a fall-out between acting Grand Master Kenth Hamner and the rest of the Jedi Council, Razelle was stationed alongside fellow Jedi Knight Yantahar Bwua'tu outside of the entrance to the Operations Hangar of the Jedi Temple while the StealthXs prepared to launch. Hamner had been confined to his quarters following the Council's vote of no-confidence in his leadership, but he escaped and made his way to the hangar, confronting Razelle and Bwua'tu. Razelle began to reach for her comlink, but Hamner used the Force to knock aside her hand. He insisted that by allowing the StealthXs to launch they were committing an act of treason against the Galactic Alliance, but neither Jedi Knight responded.\nWhen Hamner neglected to call either Jedi by name, Bwua'tu supplied Razelle's—Hamner apologized, and after learning that Bwua'tu was a relative of Alliance Admiral Nek Bwua'tu, he attempted to play on his relation. When Bwua'tu remained resolute, Hamner requested one last time that they step aside, but Razelle suggested that he return to his quarters. Angered, Hamner suddenly attacked them, knocking Razelle unconscious with a punch to the sensitive organ between her eyes and subduing Bwua'tu with a blow to his jaw. Hamner nevertheless failed to stop the launch and died in the attempt.\nThe Jedi Order later departed Coruscant in an attempt to lure the Sith Tribe into a trap. Razelle was one of the many Jedi who led the efforts to liberate Coruscant from the Sith. She traveled with Jedi Knights Bazel Warv and Seff Hellin—to get past the Sith agents who had infiltrated the planet, Warv posed as a renowned wrestler, Hellin as his manager, and Razelle as the manager's assistant. As they moved through the immigration inspection line at the Galactic Center Spaceport, however, they noticed that two nearby Jedi, Yantahar Bwua'tu and Yaqeel Saav'etu, had come under suspicion by Sith Captain Suhale.\nRazelle and Hellin tried to keep Warv moving, but he refused to leave his friends behind. Much to Razelle's dismay, Warv ignored their pleas and took several cases of spice from a group of four Ishi Tib smugglers by pretending to be their contact. Razelle and Hellin quickly caught on to his plan, and helped him take the cases. Warv promised to meet them at the rendezvous point, and he successfully to tricked the Sith into thinking that Saav'etu and Bwua'tu were simply spice smugglers.\nVaala Razelle was loyal to the Jedi Order, standing up to Kenth Hamner when he declared that what she was doing was an act of treason against the Galactic Alliance. When Hamner apologized for not knowing her name and explained that it was difficult to recognize all of the Jedi in the Order, she simply nodded, accepting his explanation. Razelle recognized the threat that the Sith presented to the galaxy and refused to step aside to let Hamner into the hangar, even suggesting that he return to his quarters, where he was supposed to be confined. Hamner grew angry after she called him \"Master\" and insisted that his title was \"Grand Master\"; however, when she began to apologize, she was cut off by his attack.\nDuring the early stages of the liberation of Coruscant, Razelle objected to Warv's desire to interfere with the Sith who were inspecting Saav'etu and Bwua'tu. She felt that a last-minute change to the plan was a bad idea, and that they would draw attention to themselves. However, when she recognized Warv's plan to convince Suhale that the suspicion she was feeling for the two Jedi was because they were spice smugglers, she assisted him in commandeering the spice.\nRazelle was short in stature for an Arcona—the top of her head only reaching Hamner's chin—and had bright green eyes that betrayed the fact that, unlike many members of her species, Razelle managed to avoid addiction to salt.\nThe Arcona Vaala Razelle completed her training as a Jedi and achieved the rank of Jedi Knight by 44 ABY. When confronted by Kenth Hamner, she sensed that he was about to attack and attempted to warn Bwua'tu, but the warning came too late—Hamner used the Force to disarm them and quickly knocked both unconscious. For the mission to free Coruscant from the Sith, Razelle and the rest of the Jedi studied how to conceal lies and their Force presences from the Sith who had infiltrated the planet.\nVaala Razelle first appeared briefly in Troy Denning's Fate of the Jedi: Vortex, book six in the Fate of the Jedi series, released November 30, 2010. She later received a small role in Denning's Fate of the Jedi: Apocalypse, the ninth and final Fate of the Jedi novel, released March 13, 2012.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Arcona/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kenth_Hamner",
  "/wiki/Green_(disambiguation)",
  "/wiki/New_Jedi_Order",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/44_ABY",
  "/wiki/Yantahar_Bwua%27tu",
  "/wiki/Jedi_Temple",
  "/wiki/New_Jedi_Temple",
  "/wiki/Jedi/Legends",
  "/wiki/StealthX",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Treason/Legends",
  "/wiki/Skirmish_in_the_Operations_Hangar",
  "/wiki/Starfighter/Legends",
  "/wiki/Liberation_of_Coruscant_(Lost_Tribe_of_Sith_emergence)",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Force_psychosis",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Galactic_Alliance_Sixth_Fleet",
  "/wiki/Orbit/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vote_of_No_Confidence/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Nek_Bwua%27tu",
  "/wiki/Unarmed_combat",
  "/wiki/Eye/Legends",
  "/wiki/Death/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Bazel_Warv",
  "/wiki/Seff_Hellin",
  "/wiki/Galactic_Center_Spaceport",
  "/wiki/Yaqeel_Saav%27etu",
  "/wiki/Captain/Legends",
  "/wiki/Suhale",
  "/wiki/Spice/Legends",
  "/wiki/Ishi_Tib/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Species/Legends",
  "/wiki/Salt/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Force_sense/Legends",
  "/wiki/Troy_Denning",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/November_30",
  "/wiki/2010",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/March_13",
  "/wiki/2012",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)"
 ]
}