{
 "name": "Vacander",
 "display_name": "Vacander",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Filar-Nitzan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Vacander was a Filar-Nitzan spy.\nA gaseous being, almost impossible to detect and even more difficult to stop, Vacander was an expert stealing information. However, Vacander's modus operandi avoided any damage to people or equipment: He only stole information.\nAs a spy, Vacander was associated with several Imperial high-ranking officers, important gangsters and the SoroSuub Corporation; Siin Suub considered Vacander one of his favorite industrial spies. However, neither Suub nor the others knew Vacander's true aspect or even identity.\nAlthough Vacander never worked against the interests of the Rebel Alliance, the Rebel Alliance Task Force considered Vacander a potential threat, so they destined a five-month research led by Lieutenant Colonel P. Essex Yerac. The resulting dossier was scarce, including a bank account on Eczar and several message drop points through the galaxy. Yerac, however, met Vacander once while tracking independent bounty hunters through the fog banks of Karap Valley, on Hewl. Disguised as the fog, Vacander suddenly revealed his red eyes to Yerac and told him to keep his distance.\nVacander was believed to be a male, and was known to be a polyglot, speaking Galactic Basic Standard, Sullustese and Nikto language. While Vacander was knowledgeable with the criminal underworld in general, he was specially acquainted with the illicit activities in Kintan, the Nikto homeworld.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Filar-Nitzan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Lieutenant_Colonel/Legends",
  "/wiki/Palpatine_Essex_Yerac",
  "/wiki/Alliance_Intelligence_Reports",
  "/wiki/Spy/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Siin_Suub",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Eczar",
  "/wiki/The_galaxy/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Karap_Valley",
  "/wiki/Hewl",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Sullustese/Legends",
  "/wiki/Nikto_(language)",
  "/wiki/Kintan/Legends",
  "/wiki/Nikto/Legends",
  "/wiki/StarWars.com"
 ]
}