{
 "name": "Vaclen_Tor",
 "display_name": "Vaclen Tor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial NavyCoruscant Third Fleet",
      "Coruscant Third Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Vaclen Tor was a Human male captain, who served in the Navy of Darth Krayt's Galactic Empire.\nIn 137 ABY, the Human male captain was in command of the Ardent-class fast frigate Steadfast. Assigned to the Coruscant Third Fleet, Steadfast was tasked with protecting the planet Ralltiir, when the Galactic Alliance Remnant and the Empire-in-exile launched a surprise attack on the planet, intending to seize as many Imperial ships as possible.\nWhen fleet's commander admiral Peto Kelsan realized that his forces were overwhelmed, he agreed to the ultimatum of admiral Edouard Fenel and ordered the fleet to surrender. However, Vaclen Tor refused to do so, reminding him of his duty and saying their fleet should self-destruct. Admiral Fenel retaliated by ordering Tor's crew to rise up in mutiny against him. The captain counteracted by reiterating that his crew were loyal to him and the Imperial throne, adding that they would not obey orders from renegades.\nFurious at this act of defiance, Fenel ordered all his ships including Kelsan's vessels to fire on the Steadfast, but Tor made a clever move and managed to position one of Ralltiir's moons between his ship and Fenel's fleet. After that Peto Kelsan ordered his men to set their ships for self-destruct and then leave them in the escape pods. Kelsan himself choose to stay on the Avenger and perished along with his fleet.\nHowever, Steadfast took some damage and its lifepods were offline, as was the self-destruct mechanism. Admiral Gar Stazi of the Galactic Alliance Remnant decided to deposit both Vaclen Tor and his crew to the surface of Ralltiir and then send the ship to Emperor Roan Fel as a gift. This effectively denied Fenel custody of Tor and his crew while affirming that the Alliance were allies but not Fel's vassals.\nBy 138 ABY, Captain Tor remained within the Sith Empire's Navy. He was present during the Sith Imperial assault against the Hidden Temple of the Jedi Order on Taivas, in command of the Intruder. During the space battle against the combined forces of the Galactic Alliance fleet and Fel loyalist vessels, the Intruder sustained severe damage and was destroyed.\nAs a competent military officer, Captain Vaclen Tor remained true to the codes of honor and duty even in the face of great adversity. Despite great odds and the prevailing unpopularity of Darth Krayt's Galactic Empire, Tor remained loyal to his masters. Thus, he also rejected any moves towards compromising or submitting to his government's foes—the Bastion resistance and the Galactic Alliance Remnant.\nWhen his superior officer Admiral Peto Kelsan ordered his fleet to surrender following a coordinated Alliance-Fel Empire attack, Tor maintained his allegiance to the throne by disregarding the former's orders. Realizing that the Alliance and Fel's Empire intended to seize the vessels of the Coruscant Third Fleet intact, he ordered his crew to activate self-destruct devices and to bail out over Ralltiir. This brave tactic won the respect of both Kelsan as well as his Alliance adversaries Admiral Stazi and Captain Bey who proceeded to support him when Fenel ordered the destruction of all life-pods from the Coruscant Third Fleet.\nVaclen Tor was introduced in the 36th issue of Star Wars: Legacy, Renegade, published by Dark Horse Comics. Created by series writer John Ostrander for the issue, the character of Vaclen Tor was drawn by established Legacy penciler Omar Francia. Kelsan was colored by Brad Anderson, who had worked on every comic in the series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tor_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Coruscant_Third_Fleet",
  "/wiki/Captain/Legends",
  "/wiki/137_ABY",
  "/wiki/Ardent-class_fast_frigate",
  "/wiki/Steadfast_(Ardent-class)",
  "/wiki/Planet/Legends",
  "/wiki/Ralltiir/Legends",
  "/wiki/Galactic_Alliance_Remnant",
  "/wiki/Empire-in-exile",
  "/wiki/Battle_of_Ralltiir_(Second_Imperial_Civil_War)",
  "/wiki/Admiral/Legends",
  "/wiki/Peto_Kelsan",
  "/wiki/Edouard_Fenel",
  "/wiki/Escape_pod/Legends",
  "/wiki/Gar_Stazi",
  "/wiki/Emperor/Legends",
  "/wiki/Roan_Fel",
  "/wiki/138_ABY",
  "/wiki/Attack_on_the_Hidden_Temple",
  "/wiki/Hidden_Temple",
  "/wiki/New_Jedi_Order",
  "/wiki/Taivas",
  "/wiki/Intruder_(Ardent-class)",
  "/wiki/Galactic_Alliance_Core_Fleet",
  "/wiki/Jhoram_Bey",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Legacy_(2006)_36",
  "/wiki/Dark_Horse_Comics",
  "/wiki/John_Ostrander",
  "/wiki/Omar_Francia",
  "/wiki/Brad_Anderson",
  "/wiki/Legacy%E2%80%94War_4"
 ]
}