{
 "name": "Vadon_Lenitor",
 "display_name": "Vadon Lenitor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Swinif Organization",
      "Granse Confederacy"
     ]
    }
   ]
  }
 ],
 "content": "Vadon Lenitor was a female Rodian bounty hunter and a member of the Granse Confederacy.\nThe only child of legendary ghestslayer Kalon Lenitor, she was not raised to become a bounty hunter, but instead was taught to hunt ghests in the island, south-east of Equator City, where her family lived. She had a difficult childhood, but was raised with loving parents who taught her community sense. Thus, she became an intelligent, hard-working and refined Rodian, with a completely un-Rodian attitude.\nNevertheless, she left Rodia and became a bounty hunter. She worked for the Swinif Organization and left with their sympathies; she also was in good terms with several syndicates in the Mid Rim. She was not even wanted by the Rebel Alliance, because she only claimed bounties for criminals and groups wanted by both the Rebel Alliance and the Galactic Empire - however, Task Force on Alliance Security would have liked to interrogate her because of her supposed presence in the events that led to the Mapuzo break-in.\nShe eventually joined the Granse Confederacy. Due to her behavior, unusual for a Rodian, she became good friends with Granse leader Callandri.\nShe was known to use Rodian razor-sticks.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Swinif_Organization",
  "/wiki/Granse_Confederacy",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Ghestslayer",
  "/wiki/Kalon_Lenitor",
  "/wiki/Ghest/Legends",
  "/wiki/Equator_City",
  "/wiki/Mid_Rim",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Task_Force_on_Alliance_Security",
  "/wiki/Mapuzo_break-in",
  "/wiki/Callandri",
  "/wiki/Rodian_razor-stick",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}