{
 "name": "Valco",
 "display_name": "Valco",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Valco was a human male who was an explorer during the Imperial Era. He was an ally of the fugitive Jedi F, having been a friend of her Jedi Master. Valco summoned F to the planet Keelia, where local raiders using salvaged Separatist battle droids threatened Meevai Village; though the raiders wanted to take its chief as collateral, his granddaughter, Haru offered to take his place. At the celebration for the marriage between Haru and Asu, Valco revealed what was to come for Haru, attempting to lead F into stepping in and saving the village.\nThough F was aware of what Valco was trying to do and was hesitant, she eventually changed her mind, intervening when the raiders, led by Lord Izuma, arrived to take Haru. As F revealed herself as a Jedi to the raiders, Valco fired upon the battle droids using a sniper rifle. Valco then threw his helmet, containing explosives, to the ground below, destroying the raider's starship and deactivating the remaining droids. F defeated Izuma, saving Haru and the village, before departing the planet while Valco remained behind with the villagers.\nValco appeared in \"The Village Bride,\" a short film in the Star Wars: Visions series written by Takahito Oonishi and Hitoshi Haga, directed by Haga, produced by Kinema Citrus, and released on Disney+ on September 22, 2021. He was voiced by Takaya Kamikawa in the original Japanese and by Cary-Hiroyuki Tagawa in the English dub. While his name is listed as Vaan in the Japanese voice cast credits, the English credits and the episode guide for \"The Village Bride\" identify him as Valco.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Galactic_Empire",
  "/wiki/Moff",
  "/wiki/Valco_Pandion",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/The_Village_Bride",
  "/wiki/Imperial_Era",
  "/wiki/Jedi",
  "/wiki/F",
  "/wiki/Unidentified_Jedi_Master_(F)",
  "/wiki/Planet",
  "/wiki/Keelia",
  "/wiki/Pirate",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/B1-series_battle_droid",
  "/wiki/Meevai_Village",
  "/wiki/Chief",
  "/wiki/Haru",
  "/wiki/Marriage",
  "/wiki/Asu",
  "/wiki/Lord",
  "/wiki/Izuma",
  "/wiki/Battle_droid",
  "/wiki/Sniper_rifle",
  "/wiki/Helmet",
  "/wiki/Izuma%27s_starship",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Valco",
  "/wiki/Kinema_Citrus_Co.",
  "/wiki/Disney%2B",
  "/wiki/September_22",
  "/wiki/2021",
  "/wiki/Cary-Hiroyuki_Tagawa",
  "/wiki/Category:Images_of_Valco",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_Visions_Season_One_Companion",
  "/wiki/Star_Wars_Insider_210"
 ]
}