{
 "name": "Valen_Rudor",
 "display_name": "Valen Rudor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Starfighter Corps",
      "Imperial Starfighter Corps"
     ]
    }
   ]
  }
 ],
 "content": "Valen Rudor, operating number: \"LS-607,\" was a male human TIE fighter pilot from Corulag in service to the Galactic Empire on Lothal 5 years prior to the Battle of Yavin as a Baron of the Empire. He and several stormtroopers were assaulted by Garazeb Orrelios when the latter became lost in the streets of Lothal's Capital City. Rudor then attempted to call for reinforcements, but his request was met with indifference by his commanding officer. Sometime later his TIE/ln space superiority starfighter was defeated by the Ghost and found in the fields by local con artist Ezra Bridger, who pretended to try to help him in order to rob him, and sell pieces of the ship in the black market. Years later, he was given ownership of Old Jho's Pit Stop by the Empire after Jho was arrested during an Imperial raid and executed for treason.\nBaron of the Empire Valen Rudor, a human male, was a TIE fighter pilot in the Imperial Navy in 4 BBY. His operating number was \"LS-607.\" After establishing factories on the Outer Rim planet Lothal, the ship production company Sienar Fleet Systems was able to convince Rudor to travel to Lothal and test out products that had been built in Lothal's most productive factories. Rudor's decision to go to Lothal was used by the Galactic Empire in HoloNet News propaganda reports.\nOn Lothal, while inspecting a TIE fighter on a landing platform in Capital City, Rudor was confronted by Garazeb Orrelios, who was being pursued by two stormtroopers. Rudor was briefly knocked out after being tossed across the platform by the Lasat warrior, but came to once more when a blaster slid towards him, after it had been knocked out of the hands of a stormtrooper. The TIE pilot regained his footing as Orrelios fought with a small squad of stormtroopers, before pointing the blaster at the Lasat and calling for reinforcements. The Imperial commander who replied questioned how many intruders were on the landing pad, leading Rudor to balk at the question and demand reinforcements. While waiting for other Imperial troops to arrive, Rudor attempted to shoot Orrelios, but the Lasat was able to evade him. Orrelios managed to make it to the top of the TIE fighter, and from there he grabbed Rudor and threw him back across the landing area. The stormtrooper reinforcements arrived shortly thereafter, but their firefight with Orrelios triggered an explosion when their blaster fire hit a fuel leak on the TIE fighter, causing it to explode. Rudor survived the explosion, while Orrelios also managed to escape.\nSometime after the incident with Orrelios, Rudor flew a TIE fighter that engaged in battle with the Ghost, the ship on which the Lasat served. The Ghost shot Rudor's fighter down, and it crashed outside Capital City while the rebel ship escaped. The crash was witnessed by Ezra Bridger, an orphaned Lothal citizen who lived in a nearby tower. When Bridger approached and asked if Rudor was still alive, Rudor reacted angrily to Bridger's presence, telling him to move away from the TIE fighter as it was property of the Empire.\nBridger managed to open the TIE fighter's hatch and jumped into the fighter, pretending to help the pilot while secretly stealing parts from the ship to sell on the black market. He then stole Rudor's helmet and left the pod. Rudor fired the fighter's laser cannons at Bridger, but the boy was able to use the Force to evade the blaster fire. Ezra was not yet aware that he was Force-sensitive, and Rudor did not realize there was anything unusual about the boy's dodging skills. Bridger fired back with his energy slingshot and knocked Rudor unconscious, giving the boy an opportunity to escape unharmed.\nSome time after his encounter with Bridger, who had now joined Orrelios' rebel cell, the Spectres, Rudor met Orrelios again in Kothal, being cornered by two stormtroopers. Looking to settle the score with the Lasat, Rudor targeted Orrelios in his TIE fighter and ordered the troopers to arrest him. But Orrelios leaped onto his fighter and tossed Rudor out, taking it for his own and using it to rescue Bridger.\nDuring the Empire Day ceremony of 4 BBY in Capital City, Valen Rudor was tasked with flying a prototype TIE Advanced v1 starfighter that was fresh from the factory. Before he could commence with the test demonstration, the Spectres destroyed the ship and then fled offworld with the fugitive Tseebo, who held vital Imperial secrets.\nThree years later, in 1 BBY, Rudor was given ownership of the cantina Old Jho's Pit Stop by the Empire after Jho, a member of the Lothal resistance group, was executed for treason for attempting to aid potential rebels during a raid carried out by the Imperial Security Bureau. A few days later, Ezra and Sabine Wren, disguised as civilians, entered, searching for the Lothal resistance. When the two rebels came to the bar to get drinks, Rudor found Ezra vaguely familiar from their encounters years before. However, he did not realize who Ezra was. When Ezra and Sabine attempted to leave, Rudor, suspicious, attempted to order their arrest, but the two rebels were quickly extricated by Lothal resistance member Jai Kell, who had been sent to the cantina by Ryder Azadi to watch for the Spectres. Later, after the Spectres and Jai had escaped into Jhothal's sewers via a hatch located in the Pit Stop, Rudor informed death trooper DT-L21 that he had not known that the hatch was unsealed.\nValen Rudor was a human TIE fighter pilot from Corulag who moved to Lothal during the Age of the Empire. He was a skilled and famous starfighter pilot who worked as a test pilot for the Imperial factory on the Outer Rim world of Lothal. As an Imperial starfighter pilot, Rudor was capable of physical combat but prove no match for the Lasat warrior Zeb. He was protective of his TIE fighter which he regarded as Imperial property. Due to his status as a renowned pilot, Rudor was given the honor of flying a prototype TIE Advanced model.\nRudor was later placed in charge of managing the late rebel Jho's cantina, which he turned into a haunt for Imperial personnel. Rudor regarded the late Jho as a traitor. Rudor also recognized Ezra Bridger but could not remember who exactly the boy was. Rudor later led a hunt for the Spectres and Jai Kell but failed to account for an unsecured hatch in his cantina. This enabled the rebels to escape and link up with Ryder Azadi.\nValen Rudor first appeared as a minor character in the first season of the Disney XD animated television series Star Wars Rebels in late 2014. He was originally intended to return in the third season episode \"The Antilles Extraction\" as instructor of the Skystrike Academy, but his role was ultimately filled by Vult Skerris.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Corulag",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Lothal",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Baron_of_the_Empire",
  "/wiki/Stormtrooper",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Capital_City",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Ghost",
  "/wiki/Ezra_Bridger",
  "/wiki/Starfighter",
  "/wiki/Black_market",
  "/wiki/Old_Jho%27s_Pit_Stop",
  "/wiki/Jho",
  "/wiki/Treason",
  "/wiki/Imperial_Navy",
  "/wiki/4_BBY",
  "/wiki/Operating_number",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Sienar_Fleet_Systems",
  "/wiki/HoloNet_News",
  "/wiki/Propaganda",
  "/wiki/Lasat",
  "/wiki/Blaster",
  "/wiki/LothalNet_comm_tower_E-272",
  "/wiki/The_Force",
  "/wiki/Force-sensitive",
  "/wiki/Energy_slingshot",
  "/wiki/Spectres",
  "/wiki/Kothal",
  "/wiki/Empire_Day",
  "/wiki/TIE_Advanced_v1",
  "/wiki/Tseebo",
  "/wiki/1_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Cantina",
  "/wiki/Lothal_resistance_group",
  "/wiki/Raid_on_a_suspected_rebel_cell",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Standard_day",
  "/wiki/Sabine_Wren",
  "/wiki/Jai_Kell",
  "/wiki/Ryder_Azadi",
  "/wiki/Jhothal",
  "/wiki/Death_trooper",
  "/wiki/DT-L21",
  "/wiki/Maketh_Tua",
  "/wiki/Imperial_Era",
  "/wiki/Star_Wars_Rebels_Season_One",
  "/wiki/Disney_XD",
  "/wiki/Star_Wars_Rebels",
  "/wiki/2014",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/The_Antilles_Extraction",
  "/wiki/Skystrike_Academy",
  "/wiki/Vult_Skerris",
  "/wiki/HoloNet_News_(Tumblr)",
  "/wiki/HoloNet_News_Special_Report:_Famed_Imperial_Pilot_Moves_to_Lothal",
  "/wiki/Rise_of_the_Rebels",
  "/wiki/Entanglement",
  "/wiki/Zeb_to_the_Rescue",
  "/wiki/Property_of_Ezra_Bridger",
  "/wiki/Ezra_and_the_Pilot",
  "/wiki/Ezra%27s_Gamble",
  "/wiki/Fighter_Flight",
  "/wiki/Empire_Day_(episode)",
  "/wiki/Path_of_the_Jedi:_A_Star_Wars_Rebels_Cinestory_Comic",
  "/wiki/Ezra%27s_Duel_with_Danger",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/The_Occupation",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Star_Wars_Rebels:_The_Visual_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Rebels_Recounted",
  "/wiki/Star_Wars_Insider_156",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Rebels:_Visual_Guide:_Epic_Battles",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_X-Wing_Miniatures_Game",
  "/wiki/Inquisitor%27s_TIE_Expansion_Pack",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/X-Wing_Second_Edition_Core_Set",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_37",
  "/wiki/Starfighter_Aces",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Melee_and_Ranged_Weapons",
  "/wiki/Databank_(website)",
  "/wiki/November_19",
  "/wiki/File:Valen_Rudor_Facebook.png"
 ]
}