{
 "name": "Valin_Hess",
 "display_name": "Valin Hess",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 ABY",
      "Morak"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.88 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Valin Hess's division",
      "Valin Hess's division",
      "Morak Imperial remnants"
     ]
    }
   ]
  }
 ],
 "content": "Valin Hess was a human male general who served in the Imperial Army of the Galactic Empire. He participated in carrying out Operation: Cinder on the planet Burnin Konn, where he chose to sacrifice his own division in wiping out a city. In 9 ABY, after the fall of the Empire, Hess served with Imperial remnants stationed at the rhydonium refinery on the planet Morak. One day, he noticed the disguised infiltrators Migs Mayfeld and Din Djarin.\nHess questioned Djarin, and Mayfeld gave their alleged designations as well as further fabricated details on Djarin. The general then prevented the pair from leaving and invited them for a drink. Sitting with the two \"troopers,\" Hess wanted a new subject to toast to, and Mayfeld brought up Operation: Cinder, revealing that he had survived Burnin Konn. After the infiltrator questioned whether the outcome was good for those who had died, the general celebrated that they had outlived those victims. Hess proposed a toast to the Empire, but Mayfeld instead shot the officer in the chest, killing him.\nDuring the reign of the Galactic Empire, Valin Hess served as a general in the Imperial Army and the commanding officer of a division. Following the death of Emperor Palpatine in 4 ABY, the Imperial contingency plan known as Operation: Cinder was ordered, and Hess led his division in an attack on the planet Burnin Konn.\nDuring the attack, the civilians in a city defended their homes from the Imperial forces, leading Hess to make the decision to wipe out the entire city. In the process, he sacrificed his division, numbering between 5,000 and 10,000 people, along with the city. In the late days of the Empire's war with the New Republic, Hess played a key role in multiple attacks, which caused a great deal of destruction. However, the war ended in 5 ABY with the defeat of the Empire's loyalist forces above the planet Jakku.\nIn 9 ABY, during the era of the New Republic, Hess served remnants of the old Galactic Empire that operated out of a rhydonium refinery run by former Imperial Security Bureau officers on the planet Morak. One day, a group of Shydopp pirates attacked the HCVw A9.2 juggernaut transports transporting rhydonium to the refinery. Juggernaut Five was the only transport to make it to the base and was celebrated by the personnel there. At that time, Hess sat at the officers' mess, conversing with another officer. His attention was soon caught when one of the Juggernaut Pilots from Juggernaut Five entered the room and then immediately turned back around. The pilot was Migs Mayfeld, a former member of Hess's division and survivor of Burnin Konn who was infiltrating the base disguised in armor stolen from a pilot.\nFearing being recognized by his former commanding officer Hess, Mayfeld made his accomplice Din Djarin enter the room and access the terminal as part of their mission. Hess, having watched them converse outside the mess, observed Djarin enter and give a salute before going to the terminal. Continuing to watch, the general saw Djarin attempt a facial scan with his helmet on. However, as the terminal would not register his face with the helmet on, Djarin had to remove it to complete the scan. Hess called over to Djarin, who was still masquerading as a Juggernaut Pilot, and Djarin did not respond to the call. The general thus rose from his seat and walked over to Djarin, telling him off for not paying attention and asking his TK number.\nDjarin hesitated and did not provide a TK number, leading Mayfeld to chime into the exchange, introducing Djarin as TK-593 and himself as Lieutenant TK-111. Mayfeld further claimed that Hess had to speak up to Djarin as the latter's hearing had been damaged after his starship had allegedly lost pressure at the planet Taanab. Raising his voice, the general asked for Djarin's name, to which the apparent pilot again hesitated before Mayfeld said that the \"trooper\" was referred to as \"Brown Eyes.\" Mayfeld then attempted to leave with Djarin, providing the excuse that they needed to fill out TPS reports, but Hess insisted that they were not dismissed. After confirming that the pair had driven Juggernaut Five, the general told the two to have a drink with him.\nHess and the two supposed pilots sat at a private table, where the general poured each of them a glass of wine. While he poured the wine, Hess asked what the three should toast to, wishing to toast to something less repetitive than health or success. Subsequently, he asked \"Brown Eyes\" where the alleged trooper was from, but Mayfeld interjected again, suggesting a toast to Operation: Cinder and revealing that he had been at Burnin Konn. Hess claimed he had made \"unpleasant decisions\" that day, and Mayfeld recounted the events and his fallen comrades, whom the general called heroes of the Empire.\nAfter Hess referred to his decisions at Burnin Konn as for the \"greater good,\" Mayfeld stated that it depended on who they asked. The general inquired for Mayfeld to elaborate, and the \"trooper\" asked if the sacrifice was good for those who had died at Burnin Konn and their families. Hess, however, added that they had outlasted those who had died and that the Imperial remnant was growing stronger in the face of a New Republic that was \"in disarray.\" He further brought up the prospect of using the rhydonium that Juggernaut Five had delivered to create more havoc than had been made at Burnin Konn, hoping that people would realize as a result that they wanted order.\nHess raised his cup to the Empire, but Mayfeld instead raised his SE-14r light repeating blaster and shot the general through the chest. As Hess fell dead onto the floor, the rest of the room froze, and Mayfeld proceeded to gun down the other personnel in the officers' mess, with Djarin retrieving Hess's own repeating blaster to join his accomplice. The pair then escaped the base with the help of their allies, and Mayfeld detonated one of the rhydonium transports, damaging a portion of the refinery.\nValin Hess was a human male, standing at 1.88 meters tall  with light skin, brown hair, and blue eyes. He believed in the Empire's mission of bringing order to the galaxy, disregarding who was hurt in the process, even if it was his own troops, whom he viewed as expendable. Hess therefore chose to wipe out an entire city on Burnin Konn at the expense of his division, considering it a small sacrifice for the greater good. The general thought that although some yearned for freedom, they would eventually realize that they wanted order and come running back to the Empire.\nHess curiously observed Migs Mayfeld and Din Djarin upon first seeing them and pressed the latter on who he was after watching him fumble at a terminal, scolding him for not paying attention to him at first as if he had not been used to being ignored before. When he was reminded of Burnin Konn by Mayfeld, the general slid a smile and reflected on his decisions during the attack there as unpleasant. Although Mayfeld argued that the decision had not been good for those who had died as a result, Hess, unphased by Mayfeld's challenges, celebrated that they had outlived the victims and that the New Republic was in disarray, eating itself up. After finishing his speech, the officer gave a broad grin as he raised his glass for a toast.\nValin Hess wore a gray-green Imperial officer's uniform, including an Imperial kepi with an officer's disk, black Imperial-issue boots and black gloves, a brown communications belt with a silver buckle and compartments, and a code cylinder attached below his left shoulder. He wore a rank insignia plaque on his left breast with four red bars above four blue. Hess also had a SE-14r light repeating blaster, which he kept holstered on his right hip.\nValin Hess first appeared in \"Chapter 15: The Believer,\" the seventh episode of the second season of the Disney+ television series The Mandalorian. The episode was directed by Rick Famuyiwa and released on December 11, 2020. He was played by Richard Brake, with Dane Farwell serving as a stunt double. When filming the conversation between Hess, Djarin, and Mayfeld, Famuyiwa wanted to present a more quiet scene to contrast the frequent action typically shown in Star Wars and also present a tense exchange between people with competing agendas who are trying to \"figure each other out.\" The director's ultimate goal for the episode was to present a moral gray area in the use and transfers of power.\nIn \"Chapter 15: The Believer,\" Hess pours a drink for Mayfeld and Djarin himself, whereas in Joe Schreiber's 2022 junior novelization of The Mandalorian Season Two, the general has another officer pour them their drinks. This article uses the information from Chapter 15.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Valin",
  "/wiki/9_ABY",
  "/wiki/Morak",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Valin_Hess%27s_division",
  "/wiki/Morak_Imperial_remnants",
  "/wiki/File:WhatTheyReallyWant.ogg",
  "/wiki/General",
  "/wiki/Imperial_Army",
  "/wiki/Attack_on_Burnin_Konn",
  "/wiki/Operation:_Cinder",
  "/wiki/Planet",
  "/wiki/Burnin_Konn",
  "/wiki/Death",
  "/wiki/City",
  "/wiki/Rhydonium",
  "/wiki/Morak_Imperial_refinery",
  "/wiki/Standard_day",
  "/wiki/Mission_to_Morak",
  "/wiki/Migs_Mayfeld",
  "/wiki/Din_Djarin",
  "/wiki/Operating_number",
  "/wiki/Trooper",
  "/wiki/Toast_(ritual)",
  "/wiki/Imperial_officer",
  "/wiki/File:UnpleasantDecisions.ogg",
  "/wiki/Imperial_Era",
  "/wiki/Commanding_officer",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/4_ABY",
  "/wiki/Contingency",
  "/wiki/Division",
  "/wiki/Galactic_Civil_War",
  "/wiki/New_Republic",
  "/wiki/5_ABY",
  "/wiki/Battle_of_Jakku",
  "/wiki/Jakku",
  "/wiki/File:DrinkBrownEyes.ogg",
  "/wiki/New_Republic_Era",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Shydopp_pirates",
  "/wiki/HCVw_A9.2_juggernaut_transport",
  "/wiki/Transport",
  "/wiki/Refinery",
  "/wiki/Juggernaut_Five",
  "/wiki/Time",
  "/wiki/Officer",
  "/wiki/Juggernaut_Pilot",
  "/wiki/Pilot",
  "/wiki/Armor",
  "/wiki/Helmet",
  "/wiki/Lieutenant",
  "/wiki/Starship",
  "/wiki/Taanab",
  "/wiki/TPS_report",
  "/wiki/File:WeGrowStronger.ogg",
  "/wiki/Wine",
  "/wiki/SE-14r_light_repeating_blaster",
  "/wiki/Repeating_blaster",
  "/wiki/File:WhenASuperiorAddresses.ogg",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/The_galaxy",
  "/wiki/File:PaleByComparison.ogg",
  "/wiki/Imperial_officer%27s_uniform",
  "/wiki/Imperial_kepi",
  "/wiki/Officer%27s_disk",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Belt",
  "/wiki/Code_cylinder",
  "/wiki/Rank_insignia_plaque",
  "/wiki/Breast",
  "/wiki/Blaster",
  "/wiki/Holster",
  "/wiki/Chapter_15:_The_Believer",
  "/wiki/The_Mandalorian_Season_Two",
  "/wiki/Disney%2B",
  "/wiki/The_Mandalorian",
  "/wiki/Rick_Famuyiwa",
  "/wiki/December_11",
  "/wiki/2020",
  "/wiki/Richard_Brake",
  "/wiki/Dane_Farwell",
  "/wiki/Star_Wars",
  "/wiki/Joe_Schreiber",
  "/wiki/2022",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Category:Audio_files_of_Valin_Hess",
  "/wiki/Category:Images_of_Valin_Hess",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Graphic_Novel_of_Season_2",
  "/wiki/The_Mandalorian:_The_Path_of_the_Force",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_203",
  "/wiki/Worldwide",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Databank_(website)",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_213",
  "/wiki/Mission_to_Arvala-7",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Second_rescue_of_Grogu",
  "/wiki/Chapter_16:_The_Rescue",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars_Battlefront_II",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Victory%27s_Price",
  "/wiki/Smuggler%27s_Run:_A_Han_Solo_%26_Chewbacca_Adventure",
  "/wiki/Star_Wars:_The_Mandalorian_Season_Two_Companion"
 ]
}