{
 "name": "Valik",
 "display_name": "Valik",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Palliduvan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Warbird gang",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Valik was a female Palliduvan pirate who was a member of Kragan Gorr's Warbird gang.\nBy 34 ABY, Valik was a part of Kragan Gorr's Warbird gang. Prior to the outbreak of the First Order-Resistance War, the Warbirds were hired by the First Order to raid the Colossus, a refueling platform on the planet Castilon. The First Order wanted to use the Colossus as a military supply line for their invasion of the galaxy.\nAfter Commander Pyre and Captain Phasma hired Captain Gorr to kidnap Torra Doza in order to convince her father Captain Imanuel Doza to accept First Order protection, she and Drell were sent to infiltrate the Colossus in cargo containers. There, they met up with the Warbird spy Synara San at Colossus' loading docks.\nWith Synara's help, Valik and Drell managed to infiltrate Doza Tower and kidnap Torra. Though Synara managed to warn Kazuda Xiono and Captain Doza, Valik and Drell managed to evade Ace Squadron and Xiono and took their captive back to the Warbird gang's headquarters, the Galleon. Shortly later, Major Elrik Vonreg arrived in an Upsilon-class command shuttle and rescued Torra, shooting Drell and the Trandoshan Skreek in the process. By staging Torra's rescue, the First Order was able to convince Captain Doza to accept their offer of \"protection\".\nLater, onboard the Galleon, Valik intercepted an encoded transmission sent from the Colossus, which she brought to Kragan. When she decoded the message, it turned out to be a transmission sent to the Resistance by Kazuda Xiono, calling for help.\nValik was a Palliduvan female with chalk skin, red eyes' and bony fingers. She had a line of black spikes protruding from her the top of her head, resembling a mohawk. Valik also had black markings on her face and torso.\nValik was skilled at breaching security systems and secure fortifications like Doza Tower.\nValik first appeared in the Star Wars Resistance episode \"The Doza Dilemma\". She is voiced by Jennifer Hale.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Palliduvan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Warbird_gang",
  "/wiki/First_Order",
  "/wiki/Pirate",
  "/wiki/Kragan_Gorr",
  "/wiki/34_ABY",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Colossus",
  "/wiki/Castilon",
  "/wiki/The_galaxy",
  "/wiki/Commander",
  "/wiki/Pyre",
  "/wiki/Captain",
  "/wiki/Phasma",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Torra_Doza",
  "/wiki/Imanuel_Doza",
  "/wiki/Synara_San",
  "/wiki/Colossus_loading_docks",
  "/wiki/Doza_Tower",
  "/wiki/Kazuda_Xiono",
  "/wiki/Ace_Squadron",
  "/wiki/Galleon",
  "/wiki/Major",
  "/wiki/Elrik_Vonreg",
  "/wiki/Upsilon-class_command_shuttle",
  "/wiki/Trandoshan",
  "/wiki/Skreek",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Resistance",
  "/wiki/Star_Wars_Resistance",
  "/wiki/The_Doza_Dilemma",
  "/wiki/Jennifer_Hale",
  "/wiki/Descent_(episode)",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/The_Engineer",
  "/wiki/Kaz%27s_Curse",
  "/wiki/The_Mutiny",
  "/wiki/Databank_(website)",
  "/wiki/Triple_Dark",
  "/wiki/The_New_Trooper"
 ]
}