{
 "name": "Valion_Pyron",
 "display_name": "Valion Pyron",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Valion Pyron was a Human male Moff of the resurgent Sith Empire and an ally to Darth Nox during the Galactic War.\nValion Pyron was one of the youngest officers to achieve the position of Moff, when the resurrected Sith Empire was still in flux. At first, he thought his duty as a soldier was not to meddle with Sith affairs. His dream project was the Silencer, a megalaser that could destroy an entire fleet.\nPyron was forced to change his mind about getting involved in Sith affairs when Darth Thanaton cancelled his pet project and started preaching that the Force and the ancient Sith traditions would win wars, which in Pyron's opinion prevented the Empire from crushing the Republic. Pyron decided to seek new allies, and he contacted Lord Kallig, a rising Sith Inquisitor and Thanaton's nemesis, whom he believed would be better suited to leading the Empire in the Galactic War against the Republic. The latter agreed to retrieve the CN-12 chip, the last piece of technology required to complete the construction, with the aid of the Cult of the Screaming Blade, Kallig's servants on Nar Shaddaa. The completed Silencer was mounted aboard an Imperial battleship, the Doombringer; when it was ready, Pyron called Lord Kallig to the ship along with fellow Moffs Dolus and Graham and various senior officers to test it against a small Republic fleet. After the successful test, and Lord Kallig's pledge that the commanders present would receive Silencers for their own forces, they all pledged to join Pyron in supporting Kallig for the battle against Thanaton.\nThanaton soon called a Kaggath against Kallig on Corellia, which he broadcast across the HoloNet. Pyron offered his assistance against Thanaton in the midst of waging war against the Republic. He met with Kallig in the Incorporation Islands, informing his ally that Thanaton has cut off transportation via rocket trams in and out of the sector. He suggested seeking the aid of Darth Charnus to rectify that problem. He also informed Kallig that Thanaton's apprentice, Lord Skar, is in the area and advised defeating and interrogating him for Thanaton's plans. Some time later, Kallig informed Pyron that Thanaton intends to destroy the fuel refinery in Labor Valley intended to refuel their arriving fleet. Aghast that Thanaton would destroy allied resources, Pyron advised haste in saving the refinery, for a Sith who could not protect his or her own resources was easily despised.\nAfter saving the refinery, Kallig wanted to bring the full might of the fleet to bear on Thanaton. Pyron gave the location of Thanaton's base of operations in Axial Park, formerly a Republic stronghold that few know about its change of allegiance. However, the base was protected by a powerful shield generator, requiring a strike team to break through. Pyron had no capable troops on hand but suggested that a base in Axial Park may be of use.\nJust after destroying the base, the Republic, who viewed Kallig as a threat, attacked Pyron's base in The Government sector, killing many of his soldiers and badly damaging his base. Pyron then noted that Thanaton has just disappeared. His base then received a holotransmission from Thanaton, mocking Kallig before inviting his rival for a final showdown in the government plaza.\nUltimately, Thanaton chose to flee to Korriban to seek the aid of the Dark Council. Kallig followed, defeated him and assumed his seat on the Council as Darth Nox. Upon returning to Dromund Kaas, Pyron was among those who pledged allegiance to the new Dark Lord of the Sith.\nLater on during the Galactic War, Pyron was informed by Nox's apprentice, Ashara Zavros, that the Order of Revan had infiltrated the Empire, prompting the Moff to begin a discreet investigation for potential infiltrators. He later called Nox via holo, updating the Sith on his investigation, the progress of the war, including how the Republic is adapting to the Silencers. The last matter he brought up was Lord Veijel, a favorite of Thanaton's, who was on Rishi. Darth Nox was interested in Veijel's plan to bring him immortality and agreed to grant him resources for his quest. The Moff was contacted, and duly sent the fleets and scientists Nox had summoned to explore the Rishi Maze.\nFollowing the war of conquest by the Eternal Empire of Zakuul, Moff Pyron and his fleet disappeared, believed to have fled into hiding from the onslaught of the Eternal Fleet. He would later reemerge in the renewed war against the Galactic Republic, leading the Sith Empire's Silencer fleet against the Republic above Corellia during the Meridian Complex assault.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Valion_Pyron",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Moff/Legends",
  "/wiki/Darth_Nox",
  "/wiki/Galactic_War",
  "/wiki/Soldier/Legends",
  "/wiki/Silencer_(superweapon)",
  "/wiki/Fleet/Legends",
  "/wiki/Darth_Thanaton",
  "/wiki/The_Force/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Sith_Inquisitor",
  "/wiki/CN-12_sensor_chip",
  "/wiki/Cult_of_the_Screaming_Blade",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Harrower-class_dreadnought",
  "/wiki/Doombringer",
  "/wiki/Dolus",
  "/wiki/Graham",
  "/wiki/Kaggath",
  "/wiki/Corellia/Legends",
  "/wiki/HoloNet/Legends",
  "/wiki/Incorporation_Islands",
  "/wiki/Rocket_tram",
  "/wiki/Darth_Charnus",
  "/wiki/Skar_(Sith)",
  "/wiki/Labor_Valley",
  "/wiki/Axial_Park",
  "/wiki/Korriban",
  "/wiki/Dark_Council",
  "/wiki/Dromund_Kaas",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Ashara_Zavros",
  "/wiki/Order_of_Revan",
  "/wiki/Veijel",
  "/wiki/Rishi_Maze/Legends",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/Eternal_Empire",
  "/wiki/Zakuul",
  "/wiki/Eternal_Fleet",
  "/wiki/Third_Galactic_War",
  "/wiki/Meridian_Complex_assault",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught"
 ]
}