{
 "name": "Valkorion",
 "display_name": "Valkorion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zakuul"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Centuries before 3636 BBY",
      "3636 BBY",
      "Zakuul"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "later gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Valkorion was a male Human warrior from the planet Zakuul who lived centuries before the Galactic War. When the Force entity known as Vitiate arrived on Zakuul, he chose Valkorion to become his new host body, and took possession of the man's physical form. The mind of the original Valkorion was completely suppressed, and his identity was used by Vitiate to build and rule over an Eternal Empire based on Zakuul. Sustained by Vitiate's immense power, the Valkorion body lived for centuries, earning him the title of Immortal Emperor. Using his Valkorion body, Vitiate fathered three children with his bodyguard and consort Senya Tirall—Arcann, Thexan, and Vaylin—who were biologically children of the Human Valkorion, but inherited their strength in the Force from the Force entity that inhabited him. In 3636 BBY, the body of Valkorion finally died in a battle between Vitiate, Arcann, and the figure later known as the Commander. In death, the Human exploded in a blast of Force energy, though Vitiate—who bound himself to the Outlander in order to survive—continued to wear the image of his former host when he appeared in visions and as a ghost-like apparition. Over a decade later, in circa 3626 BBY, the likeness of Valkorion was recreated in the mind of Satele Shan, used by Tenebrae to attempt to restore his dead spirit.\n\"Valkorion\" first appeared in \"Sacrifice,\" a cinematic trailer for the Knights of the Fallen Empire expansion of the video game Star Wars: The Old Republic In both the trailer and the game, Valkorion is made out to be simply a name adopted by Vitiate, the former Sith Emperor. It was not until Chapter II of the later Knights of the Eternal Throne expansion that Vitiate identifies his Human host as the original Valkorion, whose identity and body he took for his own.\nValkorion is voiced by Darin De Paul.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Protection_policy#Semi-protection",
  "/wiki/Tenebrae",
  "/wiki/Emperor%27s_Voice_(Sith_Empire)",
  "/wiki/Zakuul",
  "/wiki/3636_BBY",
  "/wiki/Human/Legends",
  "/wiki/Zakuulan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Human",
  "/wiki/Planet/Legends",
  "/wiki/Standard_century/Legends",
  "/wiki/Galactic_War",
  "/wiki/The_Force/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Senya_Tirall",
  "/wiki/Arcann",
  "/wiki/Thexan",
  "/wiki/Vaylin",
  "/wiki/Death/Legends",
  "/wiki/Assassination_of_Valkorion",
  "/wiki/Alliance_Commander",
  "/wiki/3626_BBY",
  "/wiki/Mission_to_Kira_Carsen%27s_ship",
  "/wiki/Mindscape",
  "/wiki/Satele_Shan",
  "/wiki/Sacrifice_(cinematic_trailer)",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Darin_De_Paul",
  "/wiki/Betrayed",
  "/wiki/Brothers_(short_story)",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/3630_BBY",
  "/wiki/Standard_year/Legends",
  "/wiki/3631_BBY"
 ]
}