{
 "name": "Valorum_(The_Star_Wars)",
 "display_name": "Valorum  (The Star Wars)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Respirator"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Knights of Sith",
      "Knights of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Valorum was a Prince and a member of the Knights of Sith, the primary enforcers of the New Galactic Empire and bitter opponents of the Jedi-Bendu. During the campaign waged against the Aquilaean system, he was summoned by General Darth Vader to act as his huntsman, being tasked with tracking down the rebels' General Luke Skywalker.\nAs one of a number of Knights of the Sith, Prince Valorum was a bodyguard to Emperor Cos Dashit and a nonstandard commander of the Imperial Space Force, having ousted and supplanted the rival sect known as Jedi-Bendu following the Great Jedi Rebellion. Enjoying an infamous reputation, the Prince's exploits as one of the Emperor's huntsmen were legendary.\nAfter Emperor Dashit mandated the completion of the Jedi-Bendu purge and the annexation of Aquilae, Prince Valorum's presence was requested aboard the Space Fortress by the General Darth Vader as it became apparent that the insurgents' General Luke Skywalker had survived the self-destruction of the Hidden Fortress. The Sith Knight then told the cyborg commander that he would need a tie-in to the computer network, a control center, and all-communications access for his assignment, adding he wouldn't have been present if he didn't think Skywalker had been a Jedi-Bendu.\nEventually becoming disillusioned with the Galactic Empire, Prince Valorum turns his back on his masters and joins Annikin Starkiller and his ragtag rebel team.\nValorum was a character in the rough draft of what would eventually become Star Wars, as well as the Dark Horse Comics adaptation of the script, known as The Star Wars. In the development notes for the script, George Lucas compared Valorum's change of heart to that of \"a Green Beret who realizes wrong of empire. \"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Breath_mask/Legends",
  "/wiki/New_Galactic_Empire",
  "/wiki/Knights_of_Sith",
  "/wiki/Prince/Legends",
  "/wiki/Jedi-Bendu",
  "/wiki/Aquilaean_system",
  "/wiki/General/Legends",
  "/wiki/Darth_Vader_(New_Galactic_Empire)",
  "/wiki/Luke_Skywalker_(The_Star_Wars)",
  "/wiki/Emperor_(The_Star_Wars)",
  "/wiki/Cos_Dashit",
  "/wiki/Imperial_Space_Force",
  "/wiki/Great_Jedi_Rebellion",
  "/wiki/Aquilae_(The_Star_Wars)",
  "/wiki/Space_Fortress",
  "/wiki/Hidden_Fortress",
  "/wiki/Annikin_Starkiller",
  "/wiki/Star_Wars",
  "/wiki/Dark_Horse_Comics",
  "/wiki/The_Star_Wars",
  "/wiki/The_Star_Wars_3",
  "/wiki/The_Making_of_Star_Wars:_The_Definitive_Story_Behind_the_Original_Film"
 ]
}