{
 "name": "Vana_Sage",
 "display_name": "Vana Sage",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "62 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mercenary",
      "Trade Federation",
      "Royal Naboo Security Forces",
      "Lok Revenants"
     ]
    }
   ]
  }
 ],
 "content": "Vana Sage was a female Human pilot and mercenary, who hindered the Trade Federation around the time of the Invasion of Naboo.\nSage left her home planet of Alderaan at fifteen to become a starfighter pilot. She served for a time with the Naboo Royal Security Forces, but left in disgust after her attempts to get the Naboo to increase their weak defenses were rebuffed. As she grew older, Sage became a mercenary and took a job as a \"troubleshooter\" for the Trade Federation, testing the abilities of new Trade Federation equipment. Around this time, she contracted a rogue Xi Char engineer to create the Guardian Mantis. She also obtained the bomber of the Feeorin pirate Nym.\nWhile testing the Scarab craft, she intercepted an incriminating transmission sent to the Trade Federation. The federation then attempted to have her terminated. She soon teamed up with Bravo Pilot Rhys Dallows and Nym to stop the Federation's invasion of Naboo.\nFollowing the battle, Sage accepted a pardon from the Galactic Senate and a position in the Royal Naboo Security Forces. In 24 BBY, at the request of Queen Padmé Amidala, she compiled information on Nym to be sent to Jedi Master Adi Gallia.\nTwo years later, Sage reunited with Nym in time to help the Lok Revenants reclaim their base on Lok from Trade Federation forces under Cavik Toth's command. Following that battle, Sage departed to track down Reti, last seen fleeing the bounty hunter Jango Fett to regions unknown.\nAfter the defeat of the Trade Federation, Vana Sage stayed with the Lok Revenants, serving as Nym's head of security for years. Following the Clone Wars, Nym assumed the leadership of the planet Lok and ruled the planet for decades. At the height of the Galactic Civil War, Lok had fallen under the control of the Galactic Empire, but Nym remained the effective ruler of the planet.\nIn 1 ABY, Vana Sage discovered that an Imperial starship had crashed-landed in the deserts of Lok after it took off from a secret Imperial mining installation on the planet. As the Revenants had never been able to infiltrate the Imperial mine, Sage realized that the cargo could contain valuable information regarding Imperial activities on Lok. However, the cargo of the crashed ship was soon salvaged by enemies of the Lok Revenants, the Sulfur Lake Pirates.\nVana Sage therefore organized an operation to raid the Sulfur Lake Pirate Hideout. She recruited a group of skilled spacers who recently arrived on Lok and offered them to join the Lok Revenants. Using the knowledge of the engineer Choster, the spacers broke through the defenses of the hideout and attacked the pirates. Finally, they collected the memory module of an Imperial droid that was present in the crashed ship and brought it back to Vana Sage.\nFollowing the attack on the Sulfur Lake Pirate Hideout, the tensions between the Lok Revenants and the Sulfur Lake Pirates turned to open war. After some setbacks, the pirates set up an elaborate plan to directly attack Nym in his palace. They hijacked a shuttle carrying an envoy of Tatooinan politicians to a meeting with Nym. As the shuttle landed in the courtyard of Nym's palace, Nym and the other leaders of the Lok Revenants—Vana Sage, Kole and Jinkins—arrived to greet the Tatooinan envoy. A battle subsequently erupted in the palace when the Sulfur Lake Pirates emerged unexpectedly from the shuttle and attacked the Revenants. However, the superior fighting skills of Nym's henchmen allowed them to eliminate every Sulfur Lake Pirate. Nym, Vana Sage, and the other leaders of the Lok Revenants survived the attack.\nVana Sage was voiced by Lisa Fuson in Star Wars: Starfighter and Star Wars: Jedi Starfighter.\nVana Sage appeared as a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. In the original release of the game, Vana Sage appeared as a lieutenant of the Royal Naboo Security Forces in Keren, on Naboo, where she proposed three minor quests to players. This character was removed from the game upon the release of the \"Game Update 16\" on March 23, 2010. With this update, Vana Sage was included in the revamped \"Nym's Theme Park\" as the head of security of the Lok Revenants.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vana",
  "/wiki/Alderaan/Legends",
  "/wiki/62_BBY/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Lok_Revenants/Legends",
  "/wiki/Nym/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Choster",
  "/wiki/Planet/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Xi_Char/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Guardian_Mantis",
  "/wiki/Bomber/Legends",
  "/wiki/Feeorin/Legends",
  "/wiki/Scarab-class_droid_starfighter",
  "/wiki/Bravo_Flight/Legends",
  "/wiki/Rhys_Dallows",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Lok/Legends",
  "/wiki/Cavik_Toth",
  "/wiki/Reti",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Imperial_Mine_(Lok)",
  "/wiki/Sulfur_Lake_Pirates",
  "/wiki/Sulfur_Lake_Pirate_Hideout",
  "/wiki/Memory_module",
  "/wiki/Droid/Legends",
  "/wiki/Nym%27s_Base",
  "/wiki/Shuttle/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Kole",
  "/wiki/Jinkins",
  "/wiki/Lisa_Fuson",
  "/wiki/Star_Wars:_Starfighter",
  "/wiki/Star_Wars:_Jedi_Starfighter",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Lieutenant/Legends",
  "/wiki/Keren/Legends",
  "/wiki/March_23",
  "/wiki/2010",
  "/wiki/Single_Cell",
  "/wiki/Star_Wars_Tales_7",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Starfighter:_Crossbones_1",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Online_Adventures",
  "/wiki/Star_Wars_Insider",
  "/wiki/Gamescape",
  "/wiki/Star_Wars_Insider_50",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars_Starfighter:_Starfighter_Aces",
  "/wiki/Star_Wars_Gamer_2",
  "/wiki/Starfighter:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Star_Wars_Insider_53",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/CorSec_Database_H-Z",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_of_Intrigue",
  "/wiki/Databank_(original)",
  "/wiki/Who%27s_Who_in_Star_Wars_Galaxies",
  "/wiki/Star_Wars_Insider_65",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}