{
 "name": "Vanden_Willard",
 "display_name": "Vanden Willard",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Yavin's Hope",
      "near the Mako-Ta Space Docks"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.90 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Massassi Group",
      "Alliance High Command",
      "Delta Group",
      "Massassi Group",
      "Alliance High Command",
      "Delta Group"
     ]
    }
   ]
  }
 ],
 "content": "Vanden Willard was a human male who served as a commander and later general in the Rebel Alliance. He served at the Rebel base on Yavin 4 during the Battle of Yavin. He was killed when his cruiser Yavin's Hope was attacked by the Executor near the Mako-Ta Space Docks.\nVanden Willard was a commander and later general in the Rebel Alliance at the time of the Battle of Yavin. After Princess Leia Organa was rescued from aboard the Galactic Empire's Death Star by Luke Skywalker, Han Solo, Chewbacca, C-3PO, and R2-D2, and returned to the hidden rebel base on Yavin 4, Willard greeted them and was glad to know Organa was safe, as when they heard about the destruction of Alderaan, they feared the worst.\nWhen it was discovered that the ship they had used, the Millennium Falcon, was tracked and that the Death Star had arrived. Willard was responsible for reviewing the flight simulator records of any pilot who wished to fly an X-wing starfighter for the Rebel Alliance prior to granting their recruitment. Willard later helped coordinate the battle against the superweapon. During the battle, Willard was in the war room with a Control Officer, General Jan Dodonna, Colonel Bandwin Cor, and Organa. When Dodonna asked whether there were any other reversion signatures, Willard replied that it was just the Death Star's. A partial transcript of recordings from the war room, which included Willard's comment, was eventually placed in The Rebel Files.\nAfter a failed meeting with Regent Dors Urtya on Mon Cala in an attempt to recruit the Mon Cala Mercantile Fleet, Willard was present at the Mako-Ta Space Docks in a meeting of Alliance High Command when Chancellor Mon Mothma requested the report on Mon Cala by Organa. As Organa stated that Urtya would never lead a mutiny against the Empire, Willard reacted with disappointment. Organa continued, and outlined her plan to rescue King Lee-Char, in order to secure an alliance with the Mon Calamari and incorporate the fleet into their own naval forces.\nEventually, Organa and her team were able to breach a prison on Strokill Prime and find Lee-Char. Too injured to move, they recorded his final words before he was killed by Imperial stormtroopers. Although Urtya was able to recover the recordings from Organa, he sent the message to the Fleet Captains of the Mon Cala fleet, resulting in their mutiny and defection to the Rebel Alliance.\nAfter the mutiny, Willard was given command of Yavin's Hope that had been refitted for combat by the Kingdom of Shu-Torun, by order of Queen Trios. Willard utilized the cruiser as the flagship of Delta Group and remained present at the Mako-Ta Space Docks during a ceremony celebrating the new Alliance Fleet and for rebel personnel and rebel allies to witness the dispersal of the rebel naval forces. During the ceremony, Willard invited Organa to his cruiser, but she turned down the request, preferring to be with Mothma just in case she was needed.\nPrior to launch, Organa asked for a check-in of sub-groups, and Willard was the final one to confirm that group had no issues. Willard also told Organa to tell Mothma good luck for her speech, believing that she would stun the crowd. After Organa informed Mothma that the fleet was ready, she also mentioned Willard's statement, and told Mothma that he knew he would be impressed.\nAs the ships were ready to launch into hyperspace, an error prevented the launch of the Willard's cruiser, as well as all the other ships that had been refitted with Shu-Torun technology. The fault resulted in the failure of all launches, lost communications, disabled armament, and the ships being unable to launch their starfighters. At the same time, Death Squadron, under the command of the Sith Lord Darth Vader, arrived and fired on the nearest cruiser, Willard's starship.\nAs Willard's cruiser was attacked by the Executor and an accompanying Imperial-class Star Destroyer, Mothma, Organa, General Davits Draven, and other rebel personnel watched on in horror from the base. Consistently pummeled by laser fire, Willard ordered all power to be routed to the deflector shields, but a crewmember stated that they were quickly losing them. In response, Willard ordered that the ship be abandoned, but the ship was quickly annihilated as Willard told his crew that may the Force be with them all.\nAn enormous eruption engulfed the cruiser, and Darth Vader looked on from the bridge of the Executor, satisfied that the rebels now understood and that he felt their terror.\nWillard, a human male, had fair skin, graying hair, and dark eyes.\nAs a general, Willard was able to command others. When his cruiser was attacked, he recognized that the shields required full power, but was not able to recognize earlier that the cruiser had to be evacuated. Willard had the ability to review flight simulator records, and make a determination on whether pilots were able to fly X-wing starfighters before recruiting them.\nAs an Alliance officer, Willard was dressed in officer fatigues and wore the command insignia of a general on the left side of his chest. While in command of Beta Group, Willard utilized a cruiser as his flagship.\nWillard first appeared in Star Wars: Episode IV A New Hope, where he was physically portrayed by Irish actor Eddie Byrne and voiced by Michael Bell. The character was named after screenwriter Willard Huyck, who, along with his wife Gloria Katz, helped George Lucas put finishing touches on the revised fourth draft of A New Hope's script. Willard's first name was first mentioned in Star Wars: A New Hope junior novelization, which was released in 2017 and authored by Ryder Windham and edited by Emil Fortune.\nStar Wars lead writer Kieron Gillen was the one who came up with killing off Willard, as he thought about how the heroes rose through the ranks so quickly.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Vanden_Willard",
  "/wiki/Vanden_Willard/Legends",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/The_Rebel_Alliance",
  "/wiki/Alderaan",
  "/wiki/1_ABY",
  "/wiki/Yavin%27s_Hope",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Human",
  "/wiki/Alderaanian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Massassi_Group",
  "/wiki/Alliance_High_Command",
  "/wiki/Delta_Group",
  "/wiki/Commander",
  "/wiki/General",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Battle_of_Yavin",
  "/wiki/Death",
  "/wiki/Executor",
  "/wiki/Time",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Galactic_Empire",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/C-3PO",
  "/wiki/R2-D2",
  "/wiki/The_Disaster",
  "/wiki/Starship",
  "/wiki/Millennium_Falcon",
  "/wiki/Death_Star",
  "/wiki/Flight_simulator",
  "/wiki/Pilot",
  "/wiki/X-wing_starfighter",
  "/wiki/Superweapon",
  "/wiki/Jan_Dodonna",
  "/wiki/Colonel",
  "/wiki/Bandwin_Cor",
  "/wiki/The_Rebel_Files",
  "/wiki/Regent",
  "/wiki/Dors_Urtya",
  "/wiki/Mon_Cala",
  "/wiki/Mon_Cala_Mercantile_Fleet",
  "/wiki/Chancellor_(Rebel_Alliance)",
  "/wiki/Mon_Mothma",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/Mon_Calamari",
  "/wiki/Fleet",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Heroes_of_Yavin",
  "/wiki/Unidentified_Imperial_base_(Strokill_Prime)",
  "/wiki/Strokill_Prime",
  "/wiki/Stormtrooper",
  "/wiki/Fleet_Captain",
  "/wiki/Mutiny_on_Mon_Cala",
  "/wiki/Kingdom_of_Shu-Torun",
  "/wiki/Queen",
  "/wiki/Trios",
  "/wiki/Cruiser",
  "/wiki/Flagship",
  "/wiki/Navy",
  "/wiki/Hyperspace",
  "/wiki/Shu-Torun",
  "/wiki/Starfighter",
  "/wiki/Death_Squadron",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Davits_Draven",
  "/wiki/Laser",
  "/wiki/Deflector_shield",
  "/wiki/May_the_Force_be_with_you",
  "/wiki/Darth",
  "/wiki/Bridge_(starship)",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Alliance_officer",
  "/wiki/Officer",
  "/wiki/Rebel_command_insignia",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Eddie_Byrne",
  "/wiki/Michael_Bell",
  "/wiki/Willard_Huyck",
  "/wiki/George_Lucas",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Star_Wars:_A_New_Hope_(paperback_novel)",
  "/wiki/2017",
  "/wiki/Ryder_Windham",
  "/wiki/Emil_Fortune",
  "/wiki/Star_Wars_(Marvel_Comics_2015)",
  "/wiki/Kieron_Gillen",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy",
  "/wiki/A_New_Hope:_The_Princess,_the_Scoundrel,_and_the_Farm_Boy_(audiobook)",
  "/wiki/Star_Wars_(LINE_Webtoon)",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_(2015)_50",
  "/wiki/Disney_Magic_Kingdoms",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_General%27s_Voice",
  "/wiki/Star_Wars_Insider_196",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_ABY",
  "/wiki/Star_Wars_(2015)_48",
  "/wiki/Star_Wars_(2015)_49",
  "/wiki/Homing_Beacon_(newsletter)",
  "/wiki/File:KieronGillen-Death-January-10-2019.png"
 ]
}