{
 "name": "Vane%C3%A9",
 "display_name": "Vaneé",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black",
      "red",
      "green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Sith Order",
      "Acolytes of the Beyond",
      "Acolytes of the Beyond"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Vader"
     ]
    }
   ]
  }
 ],
 "content": "Vaneé  was a human male attendant who served Darth Vader in the Sith Lord's castle on the planet Mustafar. Created when an Imperial Inspector was driven mad by lava fumes, Vaneé since became a devoted servant to the Sith Lord. He, along with his master, witnessed many attacks by the Mustafarian, one by Criakan and another by Mother Sssl. In 0 BBY Vaneé approached Vader—who was meditating in a rejuvenation chamber—to inform him that Director Orson Krennic had arrived to discuss the Death Star. Later, he was present when a group of Rebels, led by Lina Graf, infiltrated the fortress. They escaped, but Vader captured Thom Hudd, whom Vaneé ruthlessly tortured for months. Lina Graf returned and helped Hudd, and together they escaped Fortress Vader, with Vaneé punished by Vader by being attached to the torture web. Later, sometime between 3 and 4 ABY, Vaneé witnessed the Knights of Ren attack the castle, and informed Vader about the intruders. At some point, Vaneé greatly angered Vader, causing Vader to lock him in a pit, only to eventually escape after the Battle of Endor. Learning his master was dead, Vaneé got worried, only for Vader's voice to speak to him. Attempting to resurrect his master, Vaneé inflicted nightmares upon the galaxy. Eventually, all of Vaneé's enemies arrived, and Vaneé tried to sacrifice and use Lina Graf as the new host for Vader's spirit. It all turned out to be a hallucination caused by lava fumes, and Vaneé was trapped by his enemies and had to live with his nightmares for the rest of his life, and eventually, disappeared.\nAccording to a story told by Mustafarians, shortly after the construction of Fortress Vader, an Imperial inspector for Imperial Command was sent by Moff Seward to Mustafar with his droid, See-Seven, to determine why several of the garrison's stormtroopers had gone mad. He and See-Seven examined a trooper of the castle's garrison that had been exposed to the lava fumes and became a lunatic. During his questioning, the trooper attacked the Inspector and warned him not to go inside of the castle. He saw that the trooper was just weak-minded. The inspector entered the castle, looked around and searched for the Sith Lord Darth Vader. He found Lord Vader in a bacta tank.\nHe told Lord Vader that the castle was not safe, should be evacuated and have environmental filters installed. Although he stated filters could be installed eventually, Vader refused for the time being, and the old man argued against it until the fumes affected him. He saw hallucinations and Vader offered him a position as his attendant. The inspector heard the hallucinations telling him what Vader needed. The inspector tried to convince himself that the hallucinations were not real and tried to laugh at them. He laughed for days until his laughter became real. Vaneé agreed to become Lord Vader's attendant at the castle and told him his name.\nAfter taking his position as attendant for Lord Vader at Fortress Vader, Vaneé was captured by a horde of Mustafarians who had invaded the fortress in hopes of destroying it and its master. Vaneé began to say mercy but was interrupted by the Mustafarian leader, who grabbed him by his robe and mocked his pleas of mercy. However, with a dark smile, Vaneé informed the Mustafarian that he was not speaking to him as Darth Vader appeared behind the Mustafarians with his lightsaber drawn and proceeded to kill the invading Mustafarians.\nVaneé stood on the lower level of an audience chamber within Fortress Vader near Imperial advisor Rersey as his master stood on the upper level looking out the room's window with two Imperial Royal Guards standing below. Rersey was demanding an explanation from Vader, which angered Vaneé due to the advisor's lack of respect towards his master. Vaneé reminded Rersey that he was a guest in his master's residence and would act accordingly, which Rersey rebuffed. Vader halted the pair's squabbling as he felt a disturbance in the Force moments before a chilling scream echoed in the chamber, startling all but Vader.\nVaneé and Rersey followed Vader and the two guards as they went to investigate the source of the scream. Rersey remarked how the fortress was supposed to be secured, to which Vaneé quietly suggested that Rersey secure his own mouth. A loud heavy booming sound echoed through the corridor. Arriving at the fortress' entrance, Rersey demanded to know what was going on. Vaneé answered that the castle was under attack as a horde of plague-infested Mustafarians and a lava flea broke through the doors. Vaneé looked on in shock as his master and the guards engaged the rampaging horde, which included an infected Lava Trooper. After Vader was bitten by the infected trooper, Vaneé cried out in horror to Rersey that they had to escape, only to look on in horror as the horde and Vader slowly advanced on them until he was halted by Mother Sssl of Clan Rrrt.\nAs Rersey confronted Sssl, Vaneé cautiously advised him to be careful, as she controlled the infected. After the advisor snidely asked Sssl what secrets she was protecting, Vaneé pointed out to Rersey that Sssl would not tell them. Vaneé and Rersey recoiled in fear as Sssl commanded Vader to kill the both of them as Vaneé cried out in fear. Rersey shoved Vaneé to the floor between him and Vader as he told the Dark Lord he needed to resist Sssl's power over him. As Vader advanced towards them, Vaneé cowered in fear on the floor until the Dark Lord revealed he was not under Sssl's power by levitating her off the ground.\nGetting up off the ground, Vaneé revealed to Sssl that it had all been a trap to lure her into attacking the castle. As Sssl struggled in Vader's grip, Vaneé gleefully told her that she was no match for his master's ingenuity and power. Vaneé watched as Vader willed Sssl to order her horde to drag her into the lava and followed his master and Rersey outside as they watched Sssl and her infected horde burn in the lava. Once the ordeal was over, Vaneé congratulated his master, stating how all Mustafarians would tremble at the very mention of his name. Vader informed Vaneé that it was of no importance before telling Advisor Rersey that his shuttle was waiting for him to take him back to the Emperor. Vaneé looked on Rersey with an expression of exasperation as the traumatized advisor continually recounted the sight of Mother Sssl being dragged into the lava.\nVaneé was present on the landing pad of the castle when Director Orson Krennic disembarked his shuttle after arriving on Mustafar in 0 BBY. Without a word, Vaneé led Krennic into the castle and took him deep into the facility until they had arrived in a rotunda that looked out onto Mustafar's landscape. He motioned for the Director to wait, which irritated Krennic, before he proceeded to leave via a door on the other side of the chamber.\nVaneé made his way to Vader's private rejuvenation chamber and entered, passing through the chamber's two sets of security doors. Approaching the bacta tank centered in the middle of the chamber, Vaneé knelt with his head bowed. As he stated that Krennic had arrived at the castle, Vaneé looked up directly to the tank to see Vader's form emerge from within the bacta. Vaneé bowed his head as the tank started to drain.\nMoments later, Vaneé returned to the rotunda and made his way past Krennic without speaking to him, which Krennic barely noticed. He then disappeared into the corridor. After Vader's meeting with Krennic, Vaneé met Krennic as the man stumbled out from the rotunda. Silently tipping his head, he motioned for the Director to follow him as he led Krennic back down the same path they had taken before. After a few moments as they walked, Vaneé spoke for the first time, telling Krennic that he was one of the few individuals who had had the honor of seeing Vader in his sanctum. Upon reaching the door of the landing pad, Vaneé advised that the Director tell nobody about what he saw.\nVaneé, who protected Fortress Vader from prying eyes, was in an upper floor control room informing Vader via comlink that spy droids had detected rebel forces within the castle when Gee-Three and Skritt came upon him. Fearful when he saw Gee-Three aiming at him, Vaneé quickly alerted his master that the rebels had found him. After Gee-Three demanded to know what the Empire was doing on Mustafar, Vaneé merely chuckled and replied he would like to see him try to shoot him just before the droid was lifted off the floor. Vaneé laughed after Gee-Three asked he was lifting him and responded that it was his master's doing. With a sadistic smile, Vaneé watched as Gee-Three was ripped apart and fell to the floor in pieces.\nMoments later, Vaneé, wielding an ax, confronted rebel Commander Lina Graf and Skritt in one of the castle's corridors after the pair had been surrounded by the castle's security droids. He asked Graf if she was sure ghosts did not exist as he ominously claimed that the lost souls of his master's victims roam the castle's hallways included that of their comrade, the thief. After Graf identified the supposed thief as their colleague Thom Hudd, Vaneé revealed that Hudd had paid the price for trying to take something that was not his and he had not been the first to meet that fate. Vaneé then told Graf and Skritt the story of the first Mustafarian raid on the fortress and how the forces were eventually slaughtered by his master. Even after Vaneé told the rebels such would be their fate, Graf replied that he did not frighten them as she pulled her blaster on him, stating she had faced real monsters. Vaneé informed Graf that she would know fear as he introduced her to his master, Darth Vader, who had appeared behind her. Vaneé smiled as he watched Vader deflect Graf's blaster shot and hurl the bisected torso of her droid Crater at her.\nThe Sith Lord approached Vaneé and voiced his disappointment in his attendant by chiding his fear of the rebels. Cowering, Vaneé replied how the rebels had tried to steal Vader's treasures after breaking into the castle. Vaneé watched as his master used the Force to lift Graf but was suddenly shoved by Crater, knocking him against Vader, giving the rebels a chance to escape. A short time later, Vaneé informed Vader that the castle was under attack by an AT-ST Skritt had commandeered.\nVaneé leered before Lieutenant Hudd, who was restrained by shackles upright. Holding an ax, the servant expressed his glee that Hudd had regained conscious and remarked on his stamina to resist pain unlike previous prisoners. Asking Hudd if he knew why he was restrained, Vaneé stated how he was looking forward to what was in store for the captured rebel. Vaneé went on to explain that he knew how others thought of him but that he did not care; he lived to serve his master and he had his stories. Pressing a button on a nearby control panel, Vaneé projected five distorted holograms of frightening figures including one of his master and stated that he knew stories that were true nightmares. With dark glee, the servant asked Hudd if he would like to hear one of his stories and proceeded to tell him the tale of the horned devil on the planet of Lotho Minor. As he finished his tale, Vaneé commented on the nature of greed as he deactivated the hologram and concluded how it never ended well before pointing an accusing figure at the restrained Lieutenant Hudd, who knew this as he tried to steal from his master.\nWith sadistic joy, Vaneé watched as Hudd continued to be shocked within the torture web. Turning the device off, Vaneé thanked the captured rebel for being able to inform his master that the torture web was still operational before subjecting Hudd to another round of electric torture. Vaneé's habit of telling nightmarish stories made Hudd recall a story told to him by Commander Cremp. Hearing Hudd speak quietly to himself after recalling the tale, Vaneé asked him if he had anything to say. Receiving no answer, Vaneé activated the torture web but heard no reaction from the captured rebel. Turing, Vaneé was shocked to see Hudd had escaped from his shackles. Vaneé pursued Hudd, promising the lieutenant that he could not hide from him and would experience new levels of pain.\nWith ax in hand, Vaneé made his way down a corridor where Hudd was hiding behind a curtain. Hearing the man behind the curtain, Vaneé sliced through it, driving Hudd from hiding. Hudd the threw the curtain at Vaneé as a distraction, giving him time to make a run for it. After pulling the curtain off, Vaneé stood motionless and informed Hudd that he was fooling himself trying to escape and how he would never give up hunting him. Stalking down the hall, Vaneé told Hudd that the lieutenant's suggestions of hobbies made him laugh but that one's nature did not allow them to change. This prompted Vaneé to ask Hudd if he had told him the tale of the assassin who became a bounty hunter as he continued his hunt. As he finished his tale, Vaneé concluded that the dark side always wins in the end just as he came upon Hudd in a control room trying to find a way out of the castle, who accidentally activated two Imperial training droids.\nVaneé commanded that the droids stop attacking Hudd, as Vaneé considered it his job to hurt Hudd. While Vaneé brought Hudd back to the torture web, Hudd told Vaneé about the story of the Hutt Crakka. Vaneé expressed boredom upon hearing the story, and said that he wanted to hear Hudd scream. While Hudd pleaded, Vaneé was interrupted by Lina Graf, who was impersonating the inquisitor the Fourth Sister, who claimed that the Emperor wanted Hudd transported to Coruscant.\nVaneé shouted that the Inquisitorius had no authority over Fortress Vader, attacking Graf with his axe. Graf defended herself with her force pike, claiming that the Emperor's elite have authority everywhere. Graf easily disarmed Vaneé, referring to him as a mere servant. He responded by suggesting that they were all servants of the Galactic Empire, and told Graf about Rersey's visit years prior. He then knocked Graf into the torture web with his axe, electrifying her and revealing who she really was. Graf asked how Vaneé knew she was a fake, to which Vaneé responded by pointing out that Graf didn't have a lightsaber. As the two of them dueled, Hudd reactivated Vaneé's distorted holograms, distracting Vaneé long enough for them to escape in a Sentinel-class landing craft. Despite not wanting his master to find out what happened, Vader was angered by Vaneé's failure and attached him to the torture web.\nSometime later, Fortress Vader was infiltrated by Ren and his knights, who were there to steal a device called the Screaming Key for Crimson Dawn. Vaneé confronted the knights and informed them that his master would learn of their visit. When the knights fired upon him, he was protected by a shield, allowing him to sound an alarm which summoned the castle's security. Vaneé then retreated as the knights were chased from the fortress by Vader and his troops.\nAt some point before Darth Vader's death and redemption in 4 ABY, Vaneé again angered Vader, although the servant insisted the incident was not his fault. As punishment, Vader locked him in a pit in the bowels of the castle, where Vaneé remained with only spark-roaches for company and food for some time. Still trapped even after Vader's death, he was finally freed when two young Mustafarians named Tuttel and Giggek arrived at the castle and planned to blow up the fortress. Vaneé, pretending to be a poor old man, convinced Giggek to help him. He expressed surprise upon finding out that Vader had died, and told the Mustafarians about Restin's attempted assassination of Vader.\nAs the Mustafarian reached down for his hand, Vaneé pulled him down the pit and climbed up to take care of Tuttel. Giggek, however, was still alive and told his friend to run away as far as possible and tell everybody of what they did before detonating the bombs, blowing up the bottom of the castle. Vaneé escaped the explosion, and as he limped from the fire, a voice came to him that sounded like Vader's. Asking who he was, the apparent ghost of Vader told Vaneé that he knew him and was the same voice who was speaking to him at the bottom of the pit. The voice told Vaneé that Vader would come back to life out of the lava river and become more powerful than ever. In truth, the supposed voice of Vader was merely Vaneé again going mad from the unfiltered lava flumes.\nIn 5 ABY, Vaneé was preparing a ritual. Before he started, he told Vader that all in the galaxy believe that he was dead. Vader replied that the Sith could never be defeated because it was the will of the dark side. Vaneé then called upon the Immortal Gods of the Sith to summon vengeance on everyone in and imprinted illusion nightmares on everyone across the galaxy. A dream was planted on the mind of Milo Graf, of a bunch of zombified droids. After explaining the dream to Crater, he told him he would never think of him the same way. Crater, who was somehow controlled by Vaneé, stunned Milo, explaining that it indeed was a dream and that he wouldn't hurt anybody, but would do so if his master commanded it. A controlled Crater took an unconscious Milo to Mustafar. Upon arriving on the fiery planet, Crater handed Milo to Vaneé, who said that soon all of the people who wronged him would come and experience real fear.\nFinally, the people whom Vaneé wanted to come arrived. As they went through the castle, Crater, who was still controlled by Vaneé and dressed as Vader, attacked them. They toppled his head off, turning him back to normal. He led them down the chamber, in which they found Milo in a bacta tank. Jaxxon, who followed Lina on the journey, tried to let Milo out of the bacta tank. They instead got zapped, and Vaneé had Lina strapped to a chair. When she asked where she was and what he was doing, Vaneé said it was her destiny and his master's revenge.\nLina demanded to be released, but Vaneé replied not until after the ritual is done, with all of Lina's crew behind him, trapped. Milo apologized that it was his fault, with Lina replying it was Vaneé's, that he was controlling Crater and using Milo as bait. Vaneé cackled, saying to his master that they thought he only controlled the droid, while in truth they were all puppets whom he use to draw back to the castle. As Vaneé conducted the ritual, Lina told him that Darth Vader was dead, with Vaneé replying that as they were there when he perished, so they would be there when he rose again. Vaneé expressed out loud that he could hear his master's voice. He then said to his master that he would release the vapors just as he taught him.\nLava fumes rose out of the pit in front of the crew. Lina said it was just pure madness. Vaneé said to his master that she doubted him, but that she would know his true power as the fumes went up through her. Vaneé then proclaimed that Vader was reborn. Vaneé heard Vader's voice, saying that he could hear him and that he lived as illusions upon the minds of the prisoners. Vaneé, in excitement, celebrated that Vader had returned. Lina tried to tell him that Vader was not coming back before she breathed the lava fumes. Acting out as Vader, Lina demanded for him to be released. A nervous Vaneé released Lina, and Vaneé asked what terror they would unleash upon the galaxy. Lina, still acting out as Vader, told him that they would need to take care of the prisoners first.\nLina freed all her companions, and told Vaneé that he has been driven mad over the years, and that his master that has seemingly risen from the dead was nothing more than an illusion. Milo pushed Vaneé onto the chair, trapping him as the rest escaped the castle. Left behind, Vaneé said he wanted to be released, with the illusion of Vader saying that they would be together for all eternity, with Vaneé crying in horror. Unknown to the servant, his master, having been redeemed to the light side of the Force before his death, then appeared as a Force spirit to guide the visitors out of the castle once and for all.\nVaneé was a male human with white hair and light skin. His eyes were originally black, but later turned red and then green. Afterwards, Vaneé's eyes returned to red. He was insane due to breathing in the lava fumes. He was rather sadistic, taking delight in the pain of others. He claimed he was quite content with being Vader's servant.\nVaneé was portrayed by British actor Martin Gordon in the 2016 Star Wars Anthology film Rogue One: A Star Wars Story. He was scripted as appearing in Star Wars Rebels Season Four, but as the story concept evolved he was replaced with Veris Hydan.\nA character similar in appearance to Vaneé appears in Darth Vader  8, informing Vader on Coruscant that the Imperial Security Bureau had discovered evidence of a Jedi Knight in Galactic City. According to a story told by Lellis in Star Wars Adventures: Shadow of Vader's Castle, however, Vaneé did not begin serving Vader until after the construction of Fortress Vader, meaning that the servant in Dark Lord of the Sith 8 cannot be him. When Cavan Scott was asked of this on Twitter, he simply said that the unidentified Sith assistant is part of the same semi-religious order as Vaneé and that the robes the servant was wearing is the robes they wear.\nIn the non-canon animated special LEGO Star Wars Terrifying Tales, Vaneé was the main antagonist and was voiced by Tony Hale. In the beginning of the episode, Vaneé surprised and scared Emperor Palpatine with a crackle of lightning. Vader's servant tells him that his \"bath\"  was ready for him as he handed Vader a rubber duckie. Palpatine told Vader that they have more important things to do, and told Vaneé  to look over the castle, in which he took delight as he cackled. In contrast to canon, Vaneé still served at Vader's fortress, which was still standing in 35 ABY. Resistance pilot Poe Dameron and droid BB-8 crash-landed on Mustafar and ended up in Castle Vader. Graballa the Hutt was making a hotel in the castle and set up a lava fountain at the entrance. Vaneé's protocol droid assistant NI-L8 informed him about the arrival of Poe, to which Vaneé replied that he might be the one to fulfill the Prophecy of Mustafar, in which a fearless pilot would enter with the strength to unlock the treasures of Fortress Vader. Poe and a boy named Dean were about to leave the castle, but were blocked by Vaneé and his droid NI-L8, though was acting friendly. Graballa warned Vaneé not to sneak up on people, and apologized for the servant who is the \"creepy caretaker of the castle. Vaneé sniffed Poe, and told him that he had something show the Resistance pilot. Dameron explained to Vaneé that he was in a rush, but Vaneé had NI-L8 show him the helmet of Ren, the former leader of the Knights of Ren before Kylo Ren rose to power, who was responsible for the creation of Kylo, which interested Poe and asked Poe if he would like to hear its tale. Graballa reminded him that Dameron was in a hurry, but Poe got interested and asked Vaneé to tell him of its tale. Vaneé replied that it was the story of a boy who longed for more. After finishing the story, Poe Dameron asks if the story was meant to scare him. Vaneé tells him that the story was to remind him that there is much to be taken by those unafraid to use it. He hands the helmet back to NI-L8. Vaneé led his guests to a large door, claiming that Sith artifacts lie behind it. He says that the Prophecy of Mustafar foretells the arrival of a fearless stranger with the strength to open it. The gate is marked with the symbol of the Old Empire. Vaneé suggests that a brave pilot who has fought many battles is worthy of opening the gate. When Dean reminds Poe about the X-wing, Poe says that if Vaneé is telling the truth, he is not willing to let a Hutt get his hands on Sith artifacts.\nPoe enlists Dean's help in unlocking the gate. Vaneé leads them into the chamber. Graballa's Iktotchi minions Raam and Baash are spooked by a shadow that turns out to be a mouse droid. Graballa tells Raam and Baash that they could add a business center and gym to these vast chambers. Meanwhile, Poe chats with Dean about the latter's ambitions to be a pilot. When Poe asks how Dean ended up working for Graballa, Dean explains that he is saving for his family. His mother had a shop on Arkanis. However, the First Order accused her of helping the Resistance and destroyed it. People got scared and wouldn't hire her anymore, leaving him as the breadwinner. Dean fears that if he loses this job, his family will have nothing.\nPoe comforts Dean, telling the boy that he had a tough childhood. He adds that it is a big galaxy and that you can't let fear get to you. They are surprised by Graballa, who is obsessed with turning the chamber into luxury suites. Vaneé leads his guests into the lightsaber repository, telling them that they are looking for something very special. He finds the Saber of Scardont, which he describes as a Sith lightsaber of unusual power. To Vaneé's horror, Graballa toys with it and breaks the hilt. Graballa demands that Dean fix it, but Poe reminds Dean that it is a Sith lightsaber, and Dean responds that he must keep his job. While Dean works on the damaged Saber, Vaneé asks if they are interested in hearing the Tale of the Saber of Scardont. Poe is not surprised about what Vaneé has to offer. Vaneé claims that it is a tale of two monstrosities , leading to the crackling of lightning inside the chamber, which startled Baash, Raam, and Poe. After finishing the tale, Dean finished fixing the lightsaber, but is interested in the dark-side artifact. Vaneé explains that Maul learned that power comes not from serving others but from serving yourself. Dean appears to get the message, and Vaneé tells him to follow where the saber leads him. Dean uses the Saber of Scardont to unlock a second chamber. Vaneé suggests to NI-L8 that he placed his hopes in the wrong pilot, which the droid agrees with.\nThe possessed Dean leads the others to the first Temple of Mustafar. Poe says he has a bad feeling about this but BB-8 rolls in. Vaneé explains that the Temple of Mustafar was built generations ago as as a repository of ancient lore. The temple is littered with treasure. Graballa tells Baash and Raam to pack it up. Graballa grabs the Saber of Scardont, claiming it as the property of \"Graballa the Hutt Enterprises, LLC.\" Poe tells Graballa that they need to talk but the Hutt thinks that he doesn't need a spokesman anymore with all the Sith treasure they have found.\nPoe tries to warn about the danger of the Sith treasure but Graballa is only concerned about making money. Dean hears Maul's voice calling out to him from a Sith holocron inside a pillar, telling him to seize the power to free his mother. Vaneé is pleased that Dean has found the holocron. He tells Dean that this holocron has the power to make any dream come true. Graballa is dismissive about the holocron having the power to grant wishes. Dean says that a Wookiee's paw can do that.\nVaneé surmises that the child is aware of the Wookiee's paw. Dean explains that the pilots who came to his mother's shop would tell stories. Poe says that he heard those stories but thinks they are are made up. Addressing Dean, Vaneé tells them the tale of a boy searching for a better life, much like him. After explaining the story, Dean asks if that is really what happened. Poe says this is not true, prompting Graballa to asks if he means that Luke did not blow up the Death Star. Poe says that Luke destroyed the Death Star but not in the way that Vaneé told the story. Vaneé says that just as the Wookiee's paw gave Skywalker all that he wanted, he claims that the holocron will give him what he desires. Poe warns Dean that the story is a warning about being careful what he wishes for.\nVaneé tells Dean that he understands that the boy wants his family to be safe. He tells the boy to open it and he won't have to worry about them again. Poe tries to plead with Dean but he is accosted by NI-L8. Vaneé tells Dean to open the holocron with his heart. The boy unlocks the holocron but nothing happens. When Dean confronts Vaneé, the Sith servant reveals that it makes his dreams come true before snatching it out of the boy's hand. Vaneé reveals that his plan was to manipulate Dean into unlocking the holocron and tells the boy that he is strong with the Force.\nVaneé uses the holocron to summon the various objects in the Sith chamber including Ren's mask and the Saber of Scardont to form a giant armored suit. Poe, Dean and BB-8 realize that the three stories that Vaneé told were for himself. Vaneé vows to make the galaxy fear him. When Poe asks him and what army, NI-L8 arms herself. Poe is dismissive of the droid, but NI-N8 activates an army of B1-series battle droids. Vaneé orders NI-L8 and her droids to annihilate his enemies. Poe decides to fight back and tells Dean that they have to remove Vaneé's holocron from his armor. Poe shoots the holocron off Vaneé's armor and flees with Dean and BB-8. Vaneé orders NI-L8 to recover the holocron since his power is dependent on it. He orders his droid army to get them. Vaneé eventually caught up to Dean and Poe down the hallway, and beheads the Darth Vader puppet, which says that he \"finds his lack of souvenirs disturbing.\" As Dean and Poe were running down the Iron Tree forest, Poe was determined to escape offworld with the Sith holocron. Dean blames himself for fixing the lightsaber and opening the holocron because he was scared. Poe reassures him that everyone gets scared. Dean says that Poe doesn't, but the fighter pilot disagrees, admitting he is scared. He tells Dean that they can't control fear but they can choose what to do with it. He says that without fear, they can't have courage. BB-8 warns that the battle droids are approaching their X-wing.\nBB-8 looses his grappling cable to swing himself around the rampaging battle droids, knocking several out. Poe and Dean climb into the starfighter only to discover the X-wing hasn't been repaired. While Poe grumbles, Dean volunteers to repair the starship. Poe decides to buy Dean time to fix the starfighter. He returns to Castle Vader, where Vaneé is growing enraged by the loss of the holocron. Poe attacks Vaneé's battle droids with a parked AT-ST walker. Graballa, Baash, and Raam cower while Poe's AT-ST engages with NI-L8's AT-AT walker, pushing it to the edge of the walkway.\nVaneé attacks Poe's walker from behind, slicing off one of its joints. Both walkers fall over the edge into the lava below, where they are destroyed. Poe survives and climbs to the top only to be confronted by battle droids. Dean arrives in Poe's X-wing and strafes the battle droids. He lands the starfighter nearby. Vowing to rule the galaxy, Vaneé grabs Poe with his metallic body. He threatens to throw Poe into the lava below unless Dean gives him the holocron. Poe tells Dean to fly away since Vaneé is getting weaker in his armored body. As Vaneé threatened to throw Poe over the edge. Dean considers the ultimatum but recalls the moral of the story of the Wookiee's paw, which is to be careful what you wish for. He throws the holocron over the edge of the walkway into the lava below. Vaneé jumps after the holocron and is consumed by the lava, seemingly killing him. However, this was not the end for Vaneé: as NI-L8 was dragging herself out of the lava, she expressed regret that she failed him, to which Vaneé responds by gripping on to her hand out of the lava, laughing.\nTony Hale inhabited his role with abandon. During recordings, Hale physicalized what Vaneé was doing, and this informed much of the way Vaneé was approached in animation. The producers purposely had Vaneé tell stories spanning all eras of Star Wars so that there would be something for everyone to enjoy. Vaneé introduces the story \"The Wookiee's Paw\" by saying \"Submitted for your approval,\" referencing an iconic line from The Twilight Zone. Vaneé's leap to recover the Sith holocron and subsequent dive in the lava is a reference to when Gollum tried to recover the One Ring in the 2003 film The Lord of the Rings: The Return of the King.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Anakin_Skywalker",
  "/wiki/Kren_Blista-Vanee",
  "/wiki/Imperial_Advisor",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Galactic_Empire",
  "/wiki/Sith",
  "/wiki/Acolytes_of_the_Beyond",
  "/wiki/File:VaneeName.ogg",
  "/wiki/Aide",
  "/wiki/Lord",
  "/wiki/Fortress_Vader",
  "/wiki/Planet",
  "/wiki/Mustafar",
  "/wiki/Lava_fume",
  "/wiki/Sith_Lord",
  "/wiki/Criakan",
  "/wiki/Mother_(title)",
  "/wiki/Sssl",
  "/wiki/0_BBY",
  "/wiki/Bacta_tank",
  "/wiki/Director",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Lina_Graf",
  "/wiki/Thom_Hudd",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Knights_of_Ren",
  "/wiki/Battle_of_Endor",
  "/wiki/The_galaxy",
  "/wiki/Mustafarian",
  "/wiki/Moff",
  "/wiki/Seward",
  "/wiki/See-Seven",
  "/wiki/Fortress_Vader_Imperial_garrison",
  "/wiki/Fortress",
  "/wiki/Robe",
  "/wiki/Darth",
  "/wiki/Darth_Vader%27s_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Death",
  "/wiki/Emperor%27s_adviser",
  "/wiki/Rersey",
  "/wiki/Emperor%27s_Royal_Guard",
  "/wiki/The_Force",
  "/wiki/Unidentified_plague_(Mustafar)",
  "/wiki/Lava_flea",
  "/wiki/Lava_Trooper",
  "/wiki/Clan_Rrrt",
  "/wiki/Magma",
  "/wiki/Theta-class_T-2c_shuttle",
  "/wiki/File:KrennicArrived.ogg",
  "/wiki/ST_149",
  "/wiki/Bacta",
  "/wiki/Comlink",
  "/wiki/Spy_droid",
  "/wiki/Lina_Graf%27s_crew",
  "/wiki/XM-G3",
  "/wiki/Skritt",
  "/wiki/Droid",
  "/wiki/Ax",
  "/wiki/Commander",
  "/wiki/Security_droid",
  "/wiki/Ghost_(folklore)",
  "/wiki/Thief",
  "/wiki/Blaster",
  "/wiki/CR-8R",
  "/wiki/Telekinesis",
  "/wiki/Time",
  "/wiki/All_Terrain_Scout_Transport",
  "/wiki/Lieutenant",
  "/wiki/Hologram",
  "/wiki/Maul",
  "/wiki/Lotho_Minor",
  "/wiki/Torture_web",
  "/wiki/Cremp",
  "/wiki/Asajj_Ventress",
  "/wiki/Imperial_training_droid",
  "/wiki/Hutt",
  "/wiki/Crakka",
  "/wiki/Inquisitor",
  "/wiki/Fourth_Sister",
  "/wiki/Darth_Sidious",
  "/wiki/Coruscant",
  "/wiki/Inquisitorius",
  "/wiki/Force_pike",
  "/wiki/Emperor",
  "/wiki/Standard_year",
  "/wiki/Sentinel-class_landing_craft",
  "/wiki/Ren_(human)",
  "/wiki/Screaming_Key",
  "/wiki/Crimson_Dawn",
  "/wiki/Spark-roach",
  "/wiki/Tuttel",
  "/wiki/Giggek",
  "/wiki/Restin",
  "/wiki/5_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Immortal_gods_of_the_Sith",
  "/wiki/Milo_Graf",
  "/wiki/Jaxxon_T._Tumperakki",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Force_spirit",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Martin_Gordon",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/Veris_Hydan",
  "/wiki/Unidentified_Sith_assistant",
  "/wiki/Darth_Vader_(2017)_8",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Jocasta_Nu",
  "/wiki/Galactic_City",
  "/wiki/Star_Wars_Adventures:_Shadow_of_Vader%27s_Castle",
  "/wiki/Battle_of_Fortress_Vader",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/Tony_Hale",
  "/wiki/35_ABY",
  "/wiki/Resistance",
  "/wiki/Poe_Dameron",
  "/wiki/BB-8",
  "/wiki/Graballa/LEGO",
  "/wiki/NI-L8",
  "/wiki/Dean_(mechanic)",
  "/wiki/Ben_Solo",
  "/wiki/Iktotchi",
  "/wiki/Raam",
  "/wiki/Baash",
  "/wiki/MSE-6_series_repair_droid",
  "/wiki/Arkanis",
  "/wiki/First_Order",
  "/wiki/Grievous",
  "/wiki/Sith_holocron",
  "/wiki/Wookiee",
  "/wiki/Luke_Skywalker",
  "/wiki/Death_Star",
  "/wiki/B1-series_battle_droid",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Star_Wars",
  "/wiki/2003",
  "/wiki/Category:Images_of_Vane%C3%A9",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Rogue_One_Adaptation_4",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_4",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_5",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_1",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_2",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_3",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_4",
  "/wiki/Star_Wars_Adventures:_Return_to_Vader%27s_Castle_5",
  "/wiki/Crimson_Reign_4",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_1",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_2",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_3",
  "/wiki/Star_Wars_Adventures:_Ghosts_of_Vader%27s_Castle_5",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/StarWars.com",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Maul_and_Other_Dark_Side_Followers"
 ]
}