{
 "name": "Vangos_Grek",
 "display_name": "Vangos Grek",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Scarif system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Tierfon Yellow Aces",
      "Blue Squadron",
      "Tierfon Yellow Aces",
      "Blue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Vangos Grek was a human male pilot who served in the Alliance to Restore the Republic during the Galactic Civil War. He was stationed at the launch base on the planet Tierfon and flew as part of the Tierfon Yellow Aces until the base was scuttled and the squadron broken up due to increasing Imperial activity. Grek and three other pilots from the squadron were reassigned to the Alliance's Great Temple headquarters on the moon Yavin 4.\nGrek was made a part of Blue Squadron and flew under the Blue Six callsign during the Battle of Scarif in 0 BBY. When Blue Squadron was ordered to support Alliance forces on the surface of the planet Scarif, Grek raced to make it through the planet's Shield Gate before it could close; however, he lagged behind and was killed when he crashed his T-65B X-wing starfighter into the gate after it had shut.\nThe human male Vangos Grek served as a pilot in the Starfighter Corps of the Alliance to Restore the Republic during the Galactic Civil War. He became a part of the Tierfon Yellow Aces, a squadron based out of the rebel launch base on the Mid Rim planet Tierfon. The squadron flew sortie after sortie from the base until their successes led to increased Imperial activity in the sector. Encroaching Imperial patrols forced the Alliance to scuttle the base and the Aces squadron was broken apart and reassigned to other outposts. Grek was moved to the Alliance's headquarters in the Great Temple on the moon Yavin 4 alongside fellow Yellow Aces Zal Dinnes, Jek Tono Porkins, and Robich Duggsin; the largest contingent of pilots from the squadron to be assigned to the same location.\nGrek and Duggsin became part of Blue Squadron under the command of General Antoc Merrick, while Dinnes and Porkins joined Red Squadron. In 0 BBY, Blue Squadron was among the forces scrambled by Admiral Raddus to aid a group of rebels attempting to steal the plans to the Death Star superweapon on the planet Scarif. With Grek flying a T-65B X-wing starfighter under the callsign Blue Six, the Alliance Fleet dropped out of hyperspace in the Scarif system and engaged the Imperial forces stationed there. Raddus gave the order for Blue Squadron to support the ground forces during the battle, meaning the squadron would need to pass through the Imperial Shield Gate that acted as the only entry point through Scarif's planetary shield.\nMerrick gave the order for the squadron to form up on him, and the pilots began racing through the gate before it could be shut. Grek and Barion Raner, flying as Blue Four, lagged behind some of the other pilots as part of a second wave, but were determined to make it through; however, as Grek shouted at his engines to speed up, Raner realized they were not going to make it. Pulling up, he called a warning to Grek over comms, but Blue Six kept going and, alongside another pilot, he crashed into the gate, which had finished closing.\nThe first fleet casualty of the battle, Grek was killed as his vehicle exploded into a bright ball of fire, leaving Merrick to wonder if the pilot had kept his X-wing at full speed the entire time or whether another second of acceleration might have made a difference. The Alliance ultimately managed to steal the plans during the battle, but all members of Blue Squadron who had made it through the gate before Grek, including Merrick, also perished.\nGrek urged his vehicle to hurry while trying to make it through the gate, but then screamed as he realized he was going to crash. He had light skin.\nGrek's K-22995 light flight helmet was gray and red and bore two of the bright yellow starbirds of the Tierfon Yellow Aces, which were common among those who had served at Tierfon. He also wore a blue flight suit with a white flight harness and a gray Diagnostech life support unit.\nVangos Grek was created for the Star Wars Anthology Series film Rogue One: A Star Wars Story, which was released on December 16, 2016. The character was first revealed in the second trailer for the film on October 13 of that year. Grek was not identified in the film, but the accompanying junior novelization by Matt Forbeck identified the character by the callsign Blue Six.\nThe accompanying reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was written by Pablo Hidalgo, identified Blue Six as Vangos Grek as part of the label for an image of the helmet worn by Grek. A separate unnamed pilot featured in promotional imagery for the film has also been shown wearing the same helmet. The adult novelization of Rogue One incorrectly states that Grek is the only pilot to crash into the Shield Gate even though a second vessel crashing is clearly visible in the film.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Grek_(disambiguation)",
  "/wiki/0_BBY",
  "/wiki/Scarif_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Tierfon_Yellow_Aces",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/File:Grek-ComeOn.ogg",
  "/wiki/Rebel_pilot",
  "/wiki/Galactic_Civil_War",
  "/wiki/Tierfon_Launch_Base",
  "/wiki/Planet",
  "/wiki/Tierfon",
  "/wiki/Squadron",
  "/wiki/Galactic_Empire",
  "/wiki/Pilot",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Blue_Squadron",
  "/wiki/Blue_Six",
  "/wiki/Callsign",
  "/wiki/Battle_of_Scarif",
  "/wiki/Rogue_One",
  "/wiki/Scarif",
  "/wiki/Shield_Gate",
  "/wiki/Death",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/File:Raddus-BlueSquadron.ogg",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Sector",
  "/wiki/Zal_Dinnes",
  "/wiki/Jek_Tono_Porkins",
  "/wiki/Robich_Duggsin",
  "/wiki/Commanding_officer",
  "/wiki/General",
  "/wiki/Antoc_Merrick",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Alliance_Military",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Hyperspace",
  "/wiki/Imperial_Navy",
  "/wiki/Alliance_Army",
  "/wiki/Planetary_shield",
  "/wiki/File:Raner-Grek.ogg",
  "/wiki/Golan_M3185_space_station",
  "/wiki/Barion_Raner",
  "/wiki/Blue_Four",
  "/wiki/Engine",
  "/wiki/Space_station",
  "/wiki/Fleet",
  "/wiki/Fire",
  "/wiki/Time",
  "/wiki/Standard_second",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Starbird_(symbol)",
  "/wiki/Flight_suit",
  "/wiki/Flight_harness",
  "/wiki/Diagnostech_life_support_unit",
  "/wiki/Flight_helmet",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/December_16",
  "/wiki/2016",
  "/wiki/October_13",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel",
  "/wiki/Matt_Forbeck",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(novelization)",
  "/wiki/Category:Audio_files_of_Vangos_Grek",
  "/wiki/Category:Images_of_Vangos_Grek",
  "/wiki/Rogue_One:_A_Star_Wars_Story_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_Rogue_One_Graphic_Novel_Adaptation",
  "/wiki/Rogue_One_Adaptation_6",
  "/wiki/Grounded",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/From_a_Certain_Point_of_View_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_10",
  "/wiki/Starfighter_Aces",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Disney%2B",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Birth_of_the_Rebellion",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/StarWars.com",
  "/wiki/Rogue_One:_A_Star_Wars_Story_-_The_Official_Mission_Debrief"
 ]
}