{
 "name": "Vansk",
 "display_name": "Vansk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1 ABY",
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Blackguard"
     ]
    }
   ]
  }
 ],
 "content": "Vansk was a female Near-Human leader of the Force organization the Blackguard, which operated on the planet Mustafar. She along with a large number of other Blackguard were killed by spacers during the Blackguard Purge.\nVansk was a Force-sensitive Near-Human female who became a member of the Force-using organization known as the Blackguard on the planet Mustafar. She became one of the most dangerous members of the group and was amongst its leadership along with the male Human San'sii, who was the Kursk of the Blackguard while she was a member. In 1 ABY during the Galactic Civil War, a Sullustan Archaeologist called Mi Fon Lu wished to carry out research in the Southern Jedi Ruins where the Blackguard were based. Not wanting to be attacked while working there, Fon Lu hired a group of spacers to clear out the ruins and kill all Blackguard inside. Vansk was killed in the ensuing battle along with all other present members of the Blackguard including San'sii, in what became known as the Blackguard Purge.\nVansk generally used a single-handed lightsaber with a red blade in combat, but also owned a blade known as the Blade of the Betrayer, which was taken as loot by the spacers who killed her. Instead of the masked uniform worn by most members of the Blackguard, Vansk wore a hooded Dark Jedi robe.\nVansk first appeared as an enemy in the MMORPG Star Wars Galaxies as part of the Trials of Obi-Wan expansion released in 2005. In game she appeared as an elite enemy whom players had to kill as part of the quest \"An Archaeologist's Problem.\" Star Wars Galaxies was shut down on December 15, 2011. She also received a card in the Squadrons Over Corellia expansion of the Star Wars Galaxies Trading Card Game released in 2008. Vansk is sometimes erroneously identified as Vanst in the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Mustafar/Legends",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Blackguard_(Mustafar)/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Human/Legends",
  "/wiki/San%27sii",
  "/wiki/Kursk",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Archaeologist/Legends",
  "/wiki/Mi_Fon_Lu",
  "/wiki/Southern_Jedi_Ruins",
  "/wiki/Lightsaber/Legends",
  "/wiki/Color/Legends",
  "/wiki/Blade_of_the_Betrayer",
  "/wiki/Video_game#Massively_multiplayer_online_role-playing_game",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies:_Trials_of_Obi-Wan",
  "/wiki/2005",
  "/wiki/December_15",
  "/wiki/Squadrons_Over_Corellia",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/2008",
  "/wiki/Template:SWGTCG"
 ]
}