{
 "name": "Varg",
 "display_name": "Varg",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Clawdite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dok-Ondar's Den of Antiquities"
     ]
    }
   ]
  }
 ],
 "content": "Varg was a Clawdite male and ex-bounty hunter employed by Dok-Ondar as a \"fixer\" in Black Spire Outpost on Batuu, which brought him into conflict with the Kendoh Gang as they attempted a theft from Dok-Ondar's Den of Antiquities. Using his shapeshifting abilities, Varg pretended to be Remex Io, another Clawdite who was part of the gang. His impersonation was successful at tricking the Aqualish Wooro into given the stolen item, the Sword of Khashyun hilt, to him. Varg then returned the hilt to Dok-Ondar.\nVarg was a Clawdite male and former bounty hunter who worked for the collector Dok-Ondar as the latter's \"fixer\" in Black Spire Outpost on Batuu. When Kendoh Voss and the Kendoh Gang came to Black Spire Outpost, Varg reported one of their members, another Clawdite named Remex Io, to the 709th Legion of stormtroopers of the First Order. Shortly after Io narrowly evaded the 709th and sent them on a fruitless search to Batuu's spaceport, Varg attacked him and grabbed him by the throat. Varg strongly implied that he knew Io's fellow gang members were about to pull a heist against his boss. He shapeshifted into Io and knocked him out, then impersonated him to meet Voss at Oga's Cantina. As Voss met with Hondo Ohnaka to discuss his role in their heist, Varg waited with Wooro, who did not suspect that Io was being impersonated. Unaware of how they planned the heist, Varg asked Wooro why Voss was hiring a pilot, and when Wooro asked why he had not remembered their plan, Varg cryptically replied that it had been a long day.\nWhen Voss and Wooro stole the hilt of the Sword of Khashyun, Wooro fled Dok-Ondar's Den of Antiquities and passed the hilt to Varg, believing him to be Io. Varg then doubled back to the Den of Antiquities, returning the hilt to Dok-Ondar.\nVarg first appeared in the theme park Star Wars: Galaxy's Edge through his voice, which was provided by Lucasfilm Story Group member Matt Martin. He was first pictured in Galaxy's Edge 3, a comic written by Ethan Sacks, illustrated by Will Sliney, and published on June 26, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Clawdite",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Dok-Ondar%27s_Den_of_Antiquities",
  "/wiki/Bounty_hunter",
  "/wiki/Dok-Ondar",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Batuu",
  "/wiki/Kendoh_Gang",
  "/wiki/Remex_Io",
  "/wiki/Aqualish",
  "/wiki/Wooro",
  "/wiki/Sword_of_Khashyun",
  "/wiki/Collector",
  "/wiki/Kendoh_Voss",
  "/wiki/709th_Legion",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/First_Order",
  "/wiki/Spaceport_(Batuu)",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Varg",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Matt_Martin",
  "/wiki/Galaxy%27s_Edge_3",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Ethan_Sacks",
  "/wiki/Will_Sliney",
  "/wiki/June_26",
  "/wiki/2019",
  "/wiki/Category:Images_of_Varg",
  "/wiki/Galaxy%27s_Edge_4",
  "/wiki/Galaxy%27s_Edge_5",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/File:MonkeyLizardSighting1-GEDatapad.png",
  "/wiki/File:MonkeyLizardSighting2-GEDatapad.png",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Marvel_Comics"
 ]
}