{
 "name": "Varin_Arabella",
 "display_name": "Varin Arabella",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Golden"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Barnaba"
     ]
    }
   ]
  }
 ],
 "content": "Varin Arabella was the High Lady of House Barnaba during the time of the Galactic Civil War.\nArabella ascended to head of her house when she was only 17 years old, after her parents mysteriously fell ill and died. Some suspect that their deaths were part of a plot by House Mecetti to destabilize House Barnaba. Lady Arabella was the natural successor to her parents, although the house high council was concerned that her age would weaken Barnaba's position. They appointed her confident that they could control her from behind the scenes. Varin, however, was not content to be a puppet of the council. This brought her into conflict with them on many issues since they had quite different political views.\nShe was popular with the people and her age did not detrimentally affect her house. Varin was a formidable diplomat; she strengthened ties with House Melantha and secretly began to make moves towards an alliance with House Cadriaan.\nLady Arabella was an attractive woman with long golden hair. Before she was called to leadership, Varin served in the House Guard. Even as head of House Barnaba, she kept herself in top physical condition and practiced often with a variety of weapons. She had a kind nature and a strict moral code, although she was headstrong and shared her house's passion for opulence.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Barnaba",
  "/wiki/High_Lord",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/House_Mecetti",
  "/wiki/House_Melantha",
  "/wiki/House_Cadriaan",
  "/wiki/House_Guard",
  "/wiki/West_End_Games",
  "/wiki/The_Event_of_the_Season",
  "/wiki/Tapani_Sector_Instant_Adventures",
  "/wiki/Lords_of_the_Expanse",
  "/wiki/Player%27s_Guide_to_Tapani"
 ]
}