{
 "name": "Varko_(Human)",
 "display_name": "Varko  (Human)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sith armada",
      "Sith armada"
     ]
    }
   ]
  }
 ],
 "content": "Varko was a Human male who served as an admiral for Dark Lord of the Sith Darth Malak's Sith Empire during the final year of the Jedi Civil War. He assumed Saul Karath's position as Malak's second-in-command when Karath was slain by Galactic Republic commander Carth Onasi and two Jedi, Bastila Shan and Revan, aboard the Leviathan, Malak's flagship. Shortly after Varko reported on the status of the Star Forge, the Rakatan space station fueling the Sith Empire's war effort, Malak was slain by the redeemed Jedi Revan, and the Empire which Varko served was defeated at Rakata Prime.\nDuring the Jedi Civil War, a conflict between the Sith Empire and the Galactic Republic, the Human male Varko served the Sith as an officer in the Empire's Navy, rising to the rank of admiral by 3956 BBY.\nIn that year, Varko was promoted to second-in-command of the Sith armada, after his predecessor, Saul Karath, was killed by two Jedi—Revan and Bastila Shan—and the Republic commander Carth Onasi aboard Dark Lord of the Sith Darth Malak's flagship the Leviathan. The position put Varko next in line to command the Empire after Malak. Sometime later aboard the Star Forge, the Rakatan space station that was fueling the Sith war effort, Varko informed Darth Malak that the superweapon was operating at 300% of the Sith's projections.\nAfter the Admiral advised Malak that the Sith fleet had regrouped to the Star Forge and was awaiting the Sith Lord's instructions, Malak revealed his plan to use Shan, whom he had captured and turned to the dark side of the Force, to focus her power with battle meditation against the Republic, eventually conquering the Core Worlds. Varko was then dismissed by the Dark Lord. Shortly after that, Malak was slain by the redeemed Jedi Padawan Revan, and his Sith Empire was defeated by the Republic at Rakata Prime.\nVarko was a Human male who, after assuming control over the Sith armada, made it a point to inform Darth Malak of the status of both the Star Forge and the fleet. During his conversation with Malak, the Dark Lord noted his impatience. Varko was momentarily startled when Malak revealed his lack of a jaw, which was normally covered by a cybernetic jaw casing. However, that did not prevent him from saluting Malak after the conversation's end. Before the events of the Sith Empire's defeat, Varko was balding; the hair that he did possess was gray in color. He had brown eyes, and was dark-skinned in appearance.\nVarko wore a gray Sith officer's uniform that included gray gloves with a black bandolier, black boots, and black pauldrons.\nVarko appeared in the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic, developed by BioWare. Although not stated in-game, Varko's name was revealed if the player reads the dialogue box after the cutscene in which Varko appears. In-game, Varko is referred to as a commander by Darth Malak; however, the dialogue box showed that the character was an admiral. This article treats the latter reference as the correct one.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Varko",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Sith_armada_(Jedi_Civil_War)",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Admiral/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Malak",
  "/wiki/3956_BBY",
  "/wiki/Jedi_Civil_War",
  "/wiki/Saul_Karath",
  "/wiki/Skirmish_aboard_the_Leviathan",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Carth_Onasi",
  "/wiki/Jedi/Legends",
  "/wiki/Bastila_Shan",
  "/wiki/Revan/Legends",
  "/wiki/Leviathan_(Interdictor-class_cruiser)",
  "/wiki/Flagship/Legends",
  "/wiki/Star_Forge",
  "/wiki/Rakata/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Battle_of_Rakata_Prime",
  "/wiki/Lehon",
  "/wiki/File:Malak_Jawless.jpg",
  "/wiki/Sith_officer",
  "/wiki/Navy/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Superweapon/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Battle_meditation",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Bandolier/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/2003",
  "/wiki/Xbox",
  "/wiki/Personal_computer",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/3958_BBY",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Death/Legends"
 ]
}