{
 "name": "Varner_Hilts%27_mother",
 "display_name": "Varner Hilts' mother",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Prior to 3060 BBY",
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Prior to 3000 BBY",
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "The mother of the Sith Varner Hilts was a Force-sensitive Human female member of the Lost Tribe of Sith on the planet Kesh. She married a man of the Hilts family, and with him, she gave birth to Varner in 3060 BBY. Sometime prior to 3000 BBY, her husband died after an accident in which his weapon fell from his sheath and stabbed him. Just one week after his death, the widow planned to seduce the same Sith her husband had planned to assassinate with his shikkar. She sneaked into the Sith's chamber concealed in an urn, but the urn's lid failed to open. Unbeknownst to her, her target was actually out of town for one month, so she died in the urn.\nA female Human was born on the planet Kesh sometime prior to 3060 BBY. A Force-sensitive, the woman was a member of the Lost Tribe of Sith—descendants of a group of Sith who were stranded on Kesh following the crash-landing of their vessel there in 5000 BBY. She married a member of the Hilts family, with whom she gave birth to a son, Varner, in 3060 BBY.\nSometime before 3000 BBY, her husband—who had hoped to assassinate the leader of one of the Tribe's factions—was killed after his weapon fell from his sheath and lodged in his ankle. However, his death did not much affect her, as just one week later she attempted to seduce the leader for her own purposes. She concealed herself in a large ceremonial urn and had several underlings deliver her to the Sith's chambers. However, they neglected to inform her that the head of the faction was out of town campaigning and was not to return for a month. Furthermore, the urn's lid refused to open, and she died inside of it, at under the age of sixty. The cleaning servants were horrified when they finally found her body.\nThe mother of Varner Hilts was very ambitious, much like the rest of the Hilts family. She was not overly distraught by her husband's accident; within a week of his death she even plotted to surprise and seduce the Sith who her husband had hoped to kill.\nVarner Hilts' mother is first mentioned in the eighth eBook of the Star Wars: Lost Tribe of the Sith series, Secrets, written by John Jackson Miller and released March 5, 2012.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kesh",
  "/wiki/3060_BBY",
  "/wiki/3000_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Sith/Legends",
  "/wiki/Varner_Hilts",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Slippery_Hilts",
  "/wiki/Hilts_family",
  "/wiki/Reproduction/Legends",
  "/wiki/Death/Legends",
  "/wiki/Shikkar",
  "/wiki/Standard_week/Legends",
  "/wiki/Unidentified_faction_leader",
  "/wiki/Assassin/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Time/Legends",
  "/wiki/Omen",
  "/wiki/5000_BBY/Legends",
  "/wiki/Beray_faction",
  "/wiki/Slavery/Legends",
  "/wiki/EBook",
  "/wiki/Star_Wars:_Lost_Tribe_of_the_Sith",
  "/wiki/Lost_Tribe_of_the_Sith:_Secrets",
  "/wiki/John_Jackson_Miller",
  "/wiki/March_5",
  "/wiki/2012",
  "/wiki/Lost_Tribe_of_the_Sith:_Precipice"
 ]
}