{
 "name": "Varth",
 "display_name": "Varth",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Alliance Starfighter Corps",
      "Alliance Starfighter Corps",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Commander Varth was an X-wing Wing Commander who was in charge of the Atrivis sector's starfighter wing.\nVarth was a male Human starfighter pilot who served with the Alliance Starfighter Corps during the Galactic Civil War. Holding the rank of Wing Commander, he was assigned to Generis base, the headquarters of the Alliance to Restore the Republic's Atrivis Sector Force, and was in command of all starfighters in the sector. Varth's position in the Atrivis sector chain-of-command was loosely defined; he was under the command of the local Commander-in-Chief, Travia Chan, in regards to offensive operations, but was also answerable to Alliance Sector Command in regards to the defense of the Outer Rim Command Center. Additionally, Varth was also under the authority of Starfighter Command for combined operations with the starfighters from other sectors.\nVarth's command was officially equipped with a full fighter wing of thirty-six starfighters, but, in reality, only around eighteen were available for operational deployment at any one time. Six fighters were required to be fully armed and fuelled, ready to launch in defense of the base and the Outer Rim Communications Center at a moment's notice. Flights of starfighters were also constantly being pulled away from Atrivis by Starfighter Command for other operations. Varth's command also suffered from primitive maintenance facilities, and a lack of competent pilots.\nBy 7 ABY, Varth's command included Cracken Flight Group, under the command of Pash Cracken. While the majority of the New Republic Defense Fleet were hunting for Warlord Zsinj, Varth and his unit was pulled coreward, staging from Commenor's moon, Folor, to protect sectors where Zsinj had operated in.\nIn 9 ABY, Varth was back in the Atrivis sector, and was present when Grand Admiral Mitth'raw'nuruodo assaulted Generis. The Imperials captured the Outer Rim Comm Center, but Cracken and General Kryll were able to spirit away Travia Chan and her staff. Varth's disposition after the battle was unclear; Cracken hoped he had been able to punch through the assault and hook up with units at either Fedje or Ketaris.\nVarth was a bitter individual, taciturn and a strict disciplinarian. He was hated by the pilots under his command, but they tolerated him because, despite his attitude, he was a brilliant soldier and commander, whose tactical prowess kept them alive and victorious against overwhelming odds.\nVarth was trained in the use of blaster, as well as unarmed combat. He was also familiar with bureaucratic procedure, alien languages, and star systems. A skilled pilot, Varth was also able to plot courses through hyperspace, operate the weapons and deflector shield systems on larger vessels, and perform repairs and maintenance on starfighters. A brilliant starfighter tactician, his skill kept his pilots alive and winning even when the odds were against them. Varth was also trained in survival techniques, computer programming and repair, application of first aid, and bypassing security equipment.\nVarth wore a standard issue Alliance flight suit, and carried a blaster pistol and comlink.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Varth_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Alliance_Starfighter_Corps",
  "/wiki/New_Republic/Legends",
  "/wiki/X-Wing:_Rogue_Squadron",
  "/wiki/Commander/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Wing_Commander/Legends",
  "/wiki/Atrivis_sector/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/X-Wing:_The_Bacta_War",
  "/wiki/Pilot/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Generis_base",
  "/wiki/Atrivis_Sector_Force",
  "/wiki/Commander-in-Chief/Legends",
  "/wiki/Travia_Chan/Legends",
  "/wiki/Sector_Command_(Alliance)/Legends",
  "/wiki/Outer_Rim_Command_Center/Legends",
  "/wiki/Starfighter_Command_(Rebel_Alliance)",
  "/wiki/Sector/Legends",
  "/wiki/Fighter_wing/Legends",
  "/wiki/Flight_group/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Cracken_Flight_Group",
  "/wiki/Pash_Cracken",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Hunt_for_Zsinj",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Commenor/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Folor",
  "/wiki/9_ABY/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Fall_of_Generis",
  "/wiki/General/Legends",
  "/wiki/Kryll",
  "/wiki/Fedje",
  "/wiki/Ketaris/Legends",
  "/wiki/The_Last_Command",
  "/wiki/Blaster/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Alien/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Flight_suit/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/X-Wing:_Rogue_Squadron_(unabridged_audiobook)",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/The_Last_Command_(unabridged_audiobook)",
  "/wiki/The_Rebel_Alliance_Sourcebook",
  "/wiki/The_Last_Command_Sourcebook",
  "/wiki/The_Rebel_Alliance_Sourcebook_(Second_Edition)",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}