{
 "name": "Vaskel_Savill",
 "display_name": "Vaskel Savill",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Melantha",
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Vaskel Savill was a high-ranking Lord of House Melantha and member of High Lord Bal Jaset's Privy council during the Imperial Period. Vaskel was a tall, handsome man who often wore short sleeve shirts which allowed for his muscular arms. He was an accomplished big game hunter and crack shot, often favoring archaic guns and bows to increase the thrill of a hunt.\nLord Savill was the leader of a small but influential faction within the Melanthan privy council who believed that Melantha would be strengthened by an Imperial invasion, due to its many contacts on Coruscant. Savill was the mastermind behind a plot to blow up an Imperial Torpedo Sphere docked at Tallaan for maintenance. In doing so Savill hoped to quicken the imperial invasion of the sector. His unlikely allies in this plot were factions within the the Mining Guild and the JAN. The Expanse Mining companies hoped to benefit from an Imperial invasion of the Freeworlds Territory by lobbying the Empire to lift crippling tariffs imposed by the freeworlds. The Justice Action Network  were naturally keen to participate in any plot that involved blowing up one of the largest weapons in the Empire's arsenal. The Mining Guild was represented in this plot by Annora Calandra and the JAN by Dr. Arkeld.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Melantha",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lord/Legends",
  "/wiki/High_Lord",
  "/wiki/Bal_Jaset",
  "/wiki/Privy_council",
  "/wiki/Imperial_Period",
  "/wiki/Unidentified_Torpedo_Sphere_(Tallaan)",
  "/wiki/Tallaan",
  "/wiki/Mining_Guild/Legends",
  "/wiki/Justice_Action_Network",
  "/wiki/Freeworlds_Territory",
  "/wiki/Annora_Calandra",
  "/wiki/Arkeld",
  "/wiki/Lords_of_the_Expanse"
 ]
}