{
 "name": "Vassal_Two_(Whetstone)",
 "display_name": "Vassal Two  (Whetstone)",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kilji"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kilji Illumine"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Nakirre"
     ]
    }
   ]
  }
 ],
 "content": "\"Vassal Two\" was a Kilji male who served the Kilji Illumine government as a Kilji vassal, a follower of the Kilji religion. Around 18 BBY, he served under the command of the leader of the Illumine, Generalirius Nakirre, aboard his Kilji war cruiser Whetstone. Vassal Two reported the arrival of the Chiss heavy cruiser Springhawk at the Unknown Regions planet Zyzek to his master and later was surprised after seeing the massive Grysk warship named the FateSpinner.\nA male Kilji known as \"Vassal Two\" served the Kilji species' government of the Kilji Illumine as a Kilji vassal, a follower of the Kilji beliefs. He served as the sensor station's operator under the leader of the Illumine, Generalirius Nakirre, aboard his Kilji war cruiser Whetstone. Around 18 BBY, during Nakirre's alliance with the Grysk operative Jixtus and the Whetsone's stay at the Unknown Regions planet Zyzek, Vassal Two informed the generalirius that a new starship of unknown configuration, which unbeknownst to Vassal Two at the moment was the Chiss heavy cruiser Springhawk, had arrived. Shortly after, the generalirius and the Springhawk's commander, Senior Captain Mitth'raw'nuruodo, engaged in a confrontation through comm.\nLater, the Whetstone traveled to a star system where Jixtus promised Nakirre's questions would be answered; however, instead of answering the generalirius's inquiries, the Grysk's flagship, the Shatter-class WarMaster FateSpinner, appeared. Vassal Two's skin then rippled against his clothing, and he called his master with a strangled voice after seeing the FateSpinner. The Grysk and his ally then discussed their alliance.\nThe vassal appeared in the 2021 novel Thrawn Ascendancy: Lesser Evil, the final volume in the Star Wars: The Ascendancy Trilogy written by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Vassal_Two",
  "/wiki/Kilji",
  "/wiki/Kilji_Illumine",
  "/wiki/Nakirre",
  "/wiki/Gender",
  "/wiki/Kilji_vassal",
  "/wiki/Kilji_way_of_order_and_enlightenment",
  "/wiki/18_BBY",
  "/wiki/Commanding_officer",
  "/wiki/Generalirius",
  "/wiki/Kilji_war_cruiser",
  "/wiki/Whetstone",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Springhawk",
  "/wiki/Unknown_Regions",
  "/wiki/Planet",
  "/wiki/Zyzek",
  "/wiki/Grysk",
  "/wiki/Warship",
  "/wiki/FateSpinner",
  "/wiki/Species",
  "/wiki/Sensor",
  "/wiki/Jixtus",
  "/wiki/Starship",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Confrontation_at_Zyzek",
  "/wiki/Comm_unit",
  "/wiki/Unidentified_star_system_(FateSpinner)",
  "/wiki/Flagship",
  "/wiki/Shatter-class_WarMaster",
  "/wiki/Clothing",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Template:LesserEvilDate"
 ]
}