{
 "name": "Vastil",
 "display_name": "Vastil",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Citizens' Militia"
     ]
    }
   ]
  }
 ],
 "content": "Vastil was a Human male who lived on the Outer Rim planet of Tatooine during the Cold War between the Galactic Republic and the Sith Empire. A native of the settlement Espelar, he joined the Citizens' Militia to defend the area from attack. When a Republic-allied individual offered to train the new recruits, Vastil accompanied the individual against the native Tusken Raiders in the area, and also to rescue a group of militiamen from the militia's Manister Base. The base had been overrun by a hive of Geonosians, a species from the nearby planet Geonosis, and the recruits helped get the injured militia members to safety while individual held off the enemy. Thanks to the Republic individual's training and his own bravery, Vastil was fully inducted into the militia.\nA male Human, Vastil lived on the Outer Rim planet of Tatooine during the Cold War between the Galactic Republic and the Sith Empire. He was a native of Espelar, a settlement in the northern Jundland Wastes region just south of the city of Anchorhead. In the year 3643 BBY, Vastil joined the Espelar branch of the Citizens' Militia, the regional militia.\nNot long after Vastil joined the militia, a Republic-allied individual was sent by the former Jedi Galen Besk to stop Imperial saboteurs from destroying Espelar's trading post. The individual defeated the saboteurs and traveled to Espelar itself, where they spoke with Mayor Airen. Airen asked them to talk to Junter Galt, the head of the Espelar branch of the militia, and the individual offered to help train the new recruits. The individual led Vastil and two other recruits into the Wastes, where they fought the native Tusken Raiders to increase the recruits' combat skills.\nWhen the group returned to Espelar, they received a distress call from Cole Darba. A member of the militia, Darba and his men had been stationed at Manister Base to the south, which had been overrun by a hive of Geonosians from the nearby planet Geonosis. The individual led Vastil and the others to Manister, where they found Darba and his men holed up in one of the base's buildings. Many of Darba's forces were injured, and Darba didn't believe that they would be able to withstand another assault. When the individual told Darba that they would push back the Geonosians while the militiamen fled to Outpost Largona to the south, Vastil thought that he and his men should stay behind and help. However, the individual knew that Vastil was still inexperienced, and that he would likely die in the attack, so they refused to let the recruit help.\nWhile the individual drove back the Geonosians from around the building and recovered what was left of the base's supplies, Vastil and Darba led the remaining militia to Outpost Largona. The group headed to the settlement's medcenter, where the injured were treated by the Bith Doctor Aidarro. Later, the individual would arrive at Largona to check up on Vastil and his men, who informed the individual that the group had made it out safely, and that the militia would head back to Espelar as soon as possible. Vastil also told them that thanks to the individual's training and efforts, Vastil was to be fully initiated into the Anchorhead militia. That was a choice of which the individual approved, and told Vastil to continue the work that he had been doing.\nA fair-skinned male Human with blond hair and blue eyes, Vastil joined the Anchorhead militia to protect his family and fellow settlers. Although he was initially very eager and overconfident, Vastil came to realize that his superior Junter Galt was right—Vastil and his fellow recruits were vastly under-trained. Thanks to the training of a Republic-allied individual, Vastil and the other recruits were able to hold their own against the native Tusken Raiders.\nVastil also developed a strong sense of loyalty to his fellow militiamen, and begged the individual to let him stay and help hold off the Geonosians instead of fleeing Manister Base with the others. However, the individual knew that Vastil would not survive and refused to let the young human sacrifice himself. Vastil later contacted the individual and thank them for stopping him, as he came to realize that his recklessness would have endangered his fellow militiamen.\nVastil was created for Star Wars: The Old Republic, a massively multiplayer online role-playing game released by BioWare on December 20, 2011. He first appears in the Republic Tatooine mission \"Militia Training,\" where Republic players lead Vastil and two other militiamen into the Jundland Wastes to eliminate eighteen Tusken Raiders. This leads directly to the mission \"Militia's Trial,\" where the player can choose to tell Vastil to leave for light side points, or to let him stay and die for dark side points. As only Republic players can complete this mission, it is assumed that the light side path is taken.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Citizens%27_Militia",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Camp_Karnori",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Manister_Base",
  "/wiki/Geonosian_hive/Legends",
  "/wiki/Geonosian/Legends",
  "/wiki/Species/Legends",
  "/wiki/Geonosis/Legends",
  "/wiki/Jundland_Wastes/Legends",
  "/wiki/City/Legends",
  "/wiki/Anchorhead/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Jedi/Legends",
  "/wiki/Galen_Besk",
  "/wiki/Saboteur/Legends",
  "/wiki/Mayor/Legends",
  "/wiki/Airen",
  "/wiki/Junter_Galt",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Cole_Darba",
  "/wiki/Outpost_Largona",
  "/wiki/Death/Legends",
  "/wiki/Medcenter/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Aidarro",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}