{
 "name": "Vaverone_Zare",
 "display_name": "Vaverone Zare",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sith Order",
      "Sith Order"
     ]
    }
   ]
  }
 ],
 "content": "Vaverone Zare was a Human female Sith living around the time of the Cold War. She was sent to Tatooine to retrieve the holocron of Darth Nihilus, all the while attempting to beat the Jedi Knight Nariel Pridence to the prize.\nIn 3643 BBY, Zare came to the planet Tatooine in search of the holocron of Darth Nihilus, which was in the possession of the gangster Diago Hixan. Zare sought to make contact with Diago by sending Geonosians to raid his spice warehouse on the edge of the Jundland. At the same time, a smuggler captain seeking a sensor computer from Diago, investigated on behalf of Diago's lieutenant, Tookreek, to claim a krayt dragon fang. Zare attempted to persuade the smuggler to arrange a meeting with Diago, but was refused, forcing her to disarm her opponent. She spared the smuggler, leaving with a reminder that her offer was still open.\nZare later sent Imperial commandos to attack Diago's summer palace, where the smuggler was meeting with Tookreek. After the smuggler fended off the attack, Zare contacted them via holo, restating her offer, but again was refused, forcing her to order a renewed attack, but the smuggler survived that too.\nZare eventually tracked the smuggler to Diago's oasis, called the Lightspring, where Jedi Knight Nariel Pridence was waiting. Additionally, Diago's delirium compelled to order his droids to kill on sight, resulting in an all out brawl between all four parties. Zare was killed in the fighting, along with Diago.\nIf the smuggler player character is a male and sided with Zare against Pridence, he can become intimate with her. A smuggler who chose to side with Zare would later receive a message from her. In the message, Zare told the player that she took on the title \"Darth Alluress\" after retrieving the holocron. A neutral option of ignoring both can be chosen, that results in Zare's victory as well.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sith_Order_(Sith_Empire)",
  "/wiki/Nariel_Pridence",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Darth_Nihilus%27_holocron",
  "/wiki/Darth_Nihilus",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Diago_Hixan",
  "/wiki/Geonosian/Legends",
  "/wiki/Jundland",
  "/wiki/Voidhound",
  "/wiki/Tookreek",
  "/wiki/Krayt_dragon/Legends",
  "/wiki/Diago_Hixan%27s_palace",
  "/wiki/Lightspring",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Galactic_Standard_Calendar"
 ]
}