{
 "name": "Vaz_Traniff",
 "display_name": "Vaz Traniff",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cathar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  }
 ],
 "content": "Vaz Traniff was a male Cathar thief living during the Galactic War between the Sith Empire and the Galactic Republic. During the opening stages of the conflict, Darmas Pollaran arranged for Traniff and his friend Combo to team up with a smuggler to raid the Imperial treasury ship King's Ransom.\nIn 3642 BBY, during the Galactic War, Traniff teamed up with the legendary smuggler later known as the Voidhound, credited for finding Nok Drayen's treasure, to raid an Imperial treasury starship King's Ransom. However, in order to accomplish this, they first had to rescue Traniff's vault cracker, Combo, who was being held by the Hutts on Nar Shaddaa and about to be sold to Rogun the Butcher. Traniff arrived after Voidhound interrupted the exchange between Rogun's man, Strilth, and Raskurro the Hutt. He suggested that they kill everyone, including Raskurro, to set the Hutt Cartel against Rogun but the Voidhound refused. Raskurro agreed to slither away while Rogun's men were killed.\nNow free to begin their mission, Traniff and Combo hide in a cargo container while the Voidhound flew them to the King's Ransom in a stolen Imperial shuttle. But just after they started raiding the vaults, the Voidwolf opened fire on the ship in response to the Voidhound's presence. The smuggler narrowly escaped the treasury ship's destruction alive. Once back on the Smuggler's Moon, Traniff expressed confusion as to why the Voidwolf would turn on his own people. He and the Voidhound then split their plunder evenly.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Vaz_Traniff",
  "/wiki/Cathar/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Scoundrel",
  "/wiki/Galactic_War",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Darmas_Pollaran",
  "/wiki/Combo",
  "/wiki/Voidhound",
  "/wiki/Raid_on_the_King%27s_Ransom",
  "/wiki/Treasury_ship",
  "/wiki/King%27s_Ransom_(treasury_ship)",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3642_BBY",
  "/wiki/Smuggler/Legends",
  "/wiki/Nok_Drayen",
  "/wiki/Starship/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Rogun_Matt%27rik",
  "/wiki/Strilth",
  "/wiki/Raskurro",
  "/wiki/Hutt_Cartel",
  "/wiki/Shuttle/Legends",
  "/wiki/Harridax_Kirill",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}