{
 "name": "Vect_Nokru",
 "display_name": "Vect Nokru",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "9 BBY",
      "Daiyu"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Head implants"
     ]
    }
   ]
  }
 ],
 "content": "Vect Nokru was a human male mercenary during the early reign of the Galactic Empire. In 9 BBY, he and two other mercenaries were hired by the Third Sister of the Empire's Jedi-hunting group the Inquisitorius to kidnap the ten year-old Princess Leia Organa of the planet Alderaan and use her as bait for the fugitive Jedi Obi-Wan Kenobi. The trio captured the girl on Alderaan and took her to a spice den on the planet Daiyu.\nNokru and his assailants locked Leia away and set a trap for Kenobi with a decoy. The Jedi fell for the bait and was held at gunpoint by the mercenaries, Nokru taunting his new captive. However, Kenobi used a vial of spice to intoxicate the trio and escape, rescuing Leia in the process. The Third Sister reached Nokru to find her target had escaped and eventually used the mercenary to send a bounty on the Jedi across the city on Daiyu. The Grand Inquisitor, who had arrived to intervene with the Third Sister's unsanctioned actions, then apprehended Nokru. Interrogating the mercenary the Inquisitor demanded Kenobi's location before killing the mercenary with his lightsaber.\nDuring the time of the Galactic Empire, Vect Nokru worked as a mercenary. In 9 BBY, he and two assailants, a Falleen and another alien, were hired by the Third Sister, a member of the Imperial Jedi-hunting group known as the Inquisitorius, to kidnap Leia Organa, the ten year-old daughter of Queen Breha Organa and Senator Bail Organa of the planet Alderaan. The purpose of the kidnapping was to draw out the fugitive Jedi Obi-Wan Kenobi from hiding, the Third Sister understanding that Kenobi had fought alongside Bail before the fall of the Jedi Order ten years before. The mercenary trio traveled to the grounds of the Royal Palace of Alderaan and Nokru observed the young Leia get brought into the palace by her mother and two Alderaan guards after the girl had run off to watch starships take off.\nNokru and his accomplices waited by the tree in the woods where Leia frequented until the ten-year old returned after running out of the palace again. The mercenaries greeted his target, who wondered why the man was there. As Nokru's two assailants crept behind the girl, he revealed he was there for her, and Leia, finding herself surrounded, began running from them. Nokru signaled the other two to make chase, and the two other mercenaries pursued Leia through the woods. The pair were unable to catch the girl, who found an Alderaan guard who was searching for her. Nokru then intervened and shot the guard with his blaster pistol, and his accomplices surrounded and captured Leia.\nThe mercenaries brought Leia aboard their ship and departed for the planet Daiyu, hiding their vessel's signature behind a freighter. Nokru had the alien mercenary tie her to a chair in a cell and lock her away. As the starship approached Daiyu, Nokru went to check on his captive, finding her using her toy droid Lola to try and escape. Leia proclaimed that she was not afraid the mercenary, who told her to \"give it time\" and smashed Lola on the ground. The girl threatened that Bail Organa would send an army to save her, but Nokru told her no one was coming and left her alone in the cell again. He also contacted the Third Sister, questioning whether Kenobi would come for Leia. The Inquisitor assured him the plan would work, adding that the Jedi would not be able to help it.\nMeanwhile Bail had been able to find the signature of Nokru's ship and track it to Daiyu and convinced Kenobi to leave his hiding place on the planet Tatooine to help rescue Leia. Nokru brought Leia to The Den, a spice den in Daiyu's city, and locked her in a cell, leaving a derelict droid under a cloak as a decoy in another as a trap. Arriving on Daiyu himself, Kenobi was able to located the decoy cell and found the fake Leia. With the Jedi in their trap, Nokru's two companions held Kenobi at gunpoint before Nokru himself entered the room. The mercenary stated how surprised he was that the Jedi had fell for it and added that he thought his new captive would be smarter, punching kenobi in the gut.\nThe Falleen mercenary handed Nokru Kenobi's lightsaber, and he gloated that the Third Sister had figured the Jedi out and would arrive soon, making the mercenaries rich. Kenobi only questioned where Leia was, Nokru insisting that it did not matter. The mercenary claimed his captive was no longer a Jedi and added that Kenobi was bleeding all over the floor. In a witty response, Kenobi revealed a vial of red spice and smashed it on the floor, putting his breath mask on as a spice cloud went everywhere. Nokru covered his face when the Jedi grabbed back his lightsaber and kicked the mercenary, leaving the room with the door shut.\nNokru and his accomplices were intoxicated by the spice cloud and lay on the floor in a drugged state. The mercenary leaned on the door until the Third Sister arrived, demanding to know where Kenobi was. The Inquisitor left and was met by three other Inquisitors—the Grand Inquisitor, Fourth Sister and Fifth Brother—who had learned of her unsanctioned mission to capture Kenobi. After the Grand Inquisitor told her to stand down, the Third Sister disobeyed her superior's orders and contacted Nokru, who had recovered from the spice. The Third Sister ordered him to send out a bounty on Kenobi under the Inquisitor out to every bounty hunter in the city. The mercenary was skeptical on whether the hunters would be able to catch a Jedi, but the Third Sister specified that she only wanted the \"low-lifes\" to squeeze her target until he revealed himself.\nNokru complied and sent the bounty out, catching the attention of all the bounty hunters, who began there search for Kenobi. However, the Grand Inquisitor also learned of the bounty and apprehended the mercenary, interrogating him on the street. Pulling Nokru towards his double-bladed spinning lightsaber with the Force, the Grand Inquisitor demanded to know where Kenobi was. The mercenary stressed that he did not know, only to be caught by the spinning lightsaber and killed.\nVect Nokru was a human male with light skin, blue eyes and gray, balding hair. He frequently taunted his captives, insisting that they would not be able to escape and how they were doomed. Nokru was doubtful that Kenobi lacked intelligence enough to take his bait in the formed of Leia Organa, but was surprised to see that the plan had worked. He was further skeptical that any bounty hunter would be able to capture a Jedi. The mercenary panicked as he was interrogated by the Grand Inquisitor at the Inquisitor's lightsaber blade iterating his answers more slowly as death close in on him.\nNokru wore a yellow shirt and green trousers. He also donned a black jacket and brown boots and used a blaster pistol. The mercenary had a pair of cybernetic implants in the back of his head.\nVect Nokru first appeared in \"Part I\" of the Disney+ live-action television series Obi-Wan Kenobi, directed by Deborah Chow and released on May 27, 2022. Portrayed by Flea, the bassist in the band Red Hot Chili Peppers, his first name was revealed in the subtitles of the episode, while his last name was revealed by the subtitles of the following episode, \"Part II,\" directed again by Chow and premiered alongside \"Part I\" on the same day. Prior to the premiere of the two episodes, footage of Nokru was featured in the teaser trailer for Obi-Wan Kenobi, published on YouTube on March 9 of that year.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/9_BBY",
  "/wiki/Daiyu",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Mercenary",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Reva_Sevander",
  "/wiki/Jedi",
  "/wiki/Hunting",
  "/wiki/Inquisitorius",
  "/wiki/Kidnapping_of_Leia_Organa",
  "/wiki/Standard_year",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Planet",
  "/wiki/Alderaan",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/The_Den",
  "/wiki/Hunt_for_Obi-Wan_Kenobi",
  "/wiki/Mission_to_Daiyu",
  "/wiki/Spice",
  "/wiki/Bounty",
  "/wiki/Daiyu_city",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Death",
  "/wiki/The_Grand_Inquisitor%27s_lightsaber",
  "/wiki/Unidentified_Falleen_mercenary",
  "/wiki/Unidentified_mercenary_(Vect)",
  "/wiki/Alderaanian_monarchy",
  "/wiki/Breha_Organa",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Jedi_Order",
  "/wiki/Royal_Palace_of_Alderaan",
  "/wiki/Youngling",
  "/wiki/Alderaan_guard",
  "/wiki/Starship",
  "/wiki/Tree",
  "/wiki/Blaster_pistol",
  "/wiki/Freighter",
  "/wiki/Toy_droid",
  "/wiki/L0-LA59",
  "/wiki/Tatooine",
  "/wiki/Droid",
  "/wiki/Obi-Wan_Kenobi%27s_third_lightsaber",
  "/wiki/Breath_mask",
  "/wiki/Lightsaber",
  "/wiki/Fourth_Sister",
  "/wiki/Fifth_Brother",
  "/wiki/Grand_Inquisitor",
  "/wiki/Bounty_hunter",
  "/wiki/City",
  "/wiki/The_Force",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Double-bladed_spinning_lightsaber",
  "/wiki/Jacket",
  "/wiki/Boot",
  "/wiki/Blaster",
  "/wiki/Pistol",
  "/wiki/Part_I",
  "/wiki/Disney%2B",
  "/wiki/Obi-Wan_Kenobi_(television_series)",
  "/wiki/Deborah_Chow",
  "/wiki/May_27",
  "/wiki/2022",
  "/wiki/Flea_(actor)",
  "/wiki/Part_II",
  "/wiki/March_9",
  "/wiki/Category:Images_of_Vect_Nokru",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Order_66",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Leia,_Princess_of_Alderaan"
 ]
}