{
 "name": "Veedo_Vaocan",
 "display_name": "Veedo Vaocan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Rodia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Veedo Vaocan was a Rodian male who served as a doctor and a member of the Rebel Alliance during the Galactic Civil War. Unlike most members of his species, Veedo was a pacifist.\nVaocan was a life-long critic of mainstream Rodian society. Even as a youth, he protested popular Rodian celebrations of violence such as the Day of the Hunter Ceremony and the Great Protector's Gladiatorial Festival. Eventually, he was driven off Rodia.\nAfter a series of misadventures, Vaocan found a new home as part of the Rebel Alliance. After taking refuge with the Alliance, he studied medicine and signed on as a combat medic and surgeon. Vaocan soon became one of the Alliance's best medical officers, earning the nickname \"Doc Rodian\" from the troops he treated. He rose to become the chief surgeon of the Tierfon Rebel Outpost, a starfighter base in the Sumitra sector. He had to stretch his pacifist ethics to join a paramilitary group, but he reasoned that helping the Rebels win the Galactic Civil War would prevent many people from being harmed by Imperial oppression. Even in combat situations, however, he refused to carry any kind of weapon and resolved to offer no resistance if captured.\nVaocan was a tall Rodian with light green skin, bulbous red eyes, and a short snout. At some point, injuries from a battlefield explosion destroyed one of Vaocan's antennae, leaving him deaf on one side. On missions, he carried a comlink and his customized medical kit  He was also accompanied by a medical droid. Vaocan was once pictured next to the Mon Calamari medic Ahleazah, who he may have worked with.\nVeedo Vaocan is a worked example of the \"Rodian Pacifist\" character template in Star Wars: Heroes and Rogues, a supplement for Star Wars: The Roleplaying Game. Vaocan's backstory and personality differ slightly from the default description in the character template, however. For example, Vaocan was driven off Rodia, while the default template is a voluntary exile. Vaocan is presented as a serious character who becomes a successful military medic, while the default template describes a more quixotic and eccentric pacifist who does not start play with any advanced medical skills. Finally, the character illustrated in the template description has both antennae, and unlike the unarmed doctor carries a holstered weapon \nWhile the text describes Vaocan as only able to hear on his left side, his left antenna is missing in his picture.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gran/Legends",
  "/wiki/Veedo",
  "/wiki/Rodia/Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Species/Legends",
  "/wiki/Day_of_the_Hunter_Ceremony",
  "/wiki/Great_Protector%27s_Gladiatorial_Festival",
  "/wiki/Tierfon_Rebel_Outpost",
  "/wiki/Starfighter/Legends",
  "/wiki/Sumitra_sector",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Medpac/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Medical_droid/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Ahleazah",
  "/wiki/Heroes_%26_Rogues",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Stun_pistol",
  "/wiki/Strongholds_of_Resistance"
 ]
}