{
 "name": "Veertag",
 "display_name": "Veertag",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Veertag was a human male who served the Alliance to Restore the Republic as a General during the Galactic Civil War against the Galactic Empire. He was present for the Royal Award Ceremony held for the heroes of the Battle of Yavin in the Great Temple on the moon Yavin 4, before the Alliance's evacuation of the world. Veertag also attended a meeting between members of the Alliance leadership on the planet Zastiga to discuss the Empire's construction of a second Death Star above the moon Endor.\nVeertag was a fair-skinned human male General in the Alliance to Restore the Republic during the Galactic Civil War against the Galactic Empire. Following the Alliance's victory at the Battle of Yavin, he attended an award ceremony held in the Great Temple on the moon Yavin 4, honoring the actions of the Rebel heroes Luke Skywalker, Han Solo and Chewbacca. Immediately after the conclusion of the ceremony, all Alliance personnel evacuated Yavin 4 in order to avoid the inevitable Imperial counterattack following the destruction of the Death Star.\nShortly after the Battle of Hoth, he was amongst a number of the Alliance's leaders who attended a highly classified meeting in a Rebel safe house on the planet Zastiga concerning the discovery that a second Death Star was being built by the Empire above the moon Endor. At the meeting, the general questioned General Crix Madine on how the Alliance could get a team of commandos onto the moon to disable the Death Star's shield generator. He then suggested that false information be planted to suggest the Alliance had a new principal base which could act as a decoy for the Empire; however, Princess Leia Organa dismissed the idea and instead proposed that she lead a false recruiting mission to the Corva sector, where she would draw the Empire's attention as a moving target. Organa's plan was ultimately approved and carried out successfully, aiding in the Alliance's eventual victory at the Battle of Endor.\nVeertag was first created for the Star Wars Legends comic book Star Wars  65, which was released by Marvel Comics in 1982. He then went on to be given the first name \"Duron\" by author Jason Fry in the Legends sourcebook The Essential Guide to Warfare, who then established with Pablo Hidalgo and Leland Chee that Veertag was one of the unnamed Rebels present for the Royal Award Ceremony shown in Star Wars: Episode IV A New Hope through the Rogues Gallery article in Star Wars Insider 133. Veertag's surname was confirmed to be canon in 2015 by the novel Moving Target: A Princess Leia Adventure, which was written by Fry and Cecil Castellucci.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Veertag",
  "/wiki/Duron_Veertag",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/General",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Royal_Award_Ceremony",
  "/wiki/Battle_of_Yavin",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Evacuation_of_Yavin_4",
  "/wiki/Planet",
  "/wiki/Zastiga",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Endor",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Battle_of_Hoth",
  "/wiki/Rebel_safe_house",
  "/wiki/Crix_Madine",
  "/wiki/Commando",
  "/wiki/Deflector_shield_generator",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Operation_Yellow_Moon",
  "/wiki/Corva_sector",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars_(1977)_65",
  "/wiki/Marvel_Comics",
  "/wiki/1982",
  "/wiki/Jason_Fry",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/2015",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure",
  "/wiki/Cecil_Castellucci",
  "/wiki/The_Odyssey_of_Star_Wars:_An_Epic_Poem",
  "/wiki/Moving_Target:_A_Princess_Leia_Adventure_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Princess_Leia_1"
 ]
}