{
 "name": "Veeter",
 "display_name": "Veeter",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Squib"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Veeter was a Squib trader. In 3 ABY, Veeter thought he traded for a ship held in an Imperial supply station, a Lone Scout-A scout ship. The Imperials did not recognize his claim to the ship, and upon departing with it, he came under fire. He made a blind jump and soon crash-landed on the planet Dalicron-4. There he sought parts to repair the vessel, but to no avail. With no interesting trades to conduct and no ship to fly, he grew increasingly depressed and hid out in the tavern of the town of Dalia.\nIn 3 ABY , Veeter visited Kwenn Space Station en route to another destination. He exercised his Squibbian talent for haggling and made several trades while there. One of these was for a ship and its cargo, which were held in an Imperial supply depot. His new vessel was a Lone Scout-A scout ship.\nThe Imperials apparently saw things differently. As he departed the station, Veeter came under fire and took damage. Panicked, he input random numbers into his nav computer and jumped to lightspeed. When he exited hyperspace, the Squib found himself near a strange world. Veeter set to checking the damage to his new toy, but soon found the Lone Scout headed inexorably toward the planet below. He tried to guide it through the atmosphere, but the ship took considerable wear to its internal systems and its solar fins.\nLuckily, Veeter identified a landing area near a small settlement on the surface and coaxed a crash landing; although this harmed the already fragile ship more, at least he survived. Nevertheless, the Lone Scout had suffered various systems failures, including the hyperdrive.\nVeeter headed into the town and learned that he was in Dalia, the largest settlement on Dalicron-4 in the Outer Rim Dalicron sector. The scavenger asked around for starship components for sale, but in a town with a population of only about 100 sentients, this was no easy task. Striking out, the Squib's mood turned melancholy. He became a regular at Daz's Tavern, where he could lose himself in his mug and forget about his troubles.\nVeeter's inability to repair his ship and the lack of haggling opportunities on Dalicron-4 made his behavior grow most un-Squibbian: he was depressed and withdrawn and did not speak unless spoken to . He hung out at Daz's Tavern on Dalia, drinking his sorrows away. Despite the circumstances that brought him to the remote world, Veeter refused to believe that he had stolen the Lone Scout; in his mind, he had attained it in an honest trade.\nVeeter appears in the adventure Child of Light for the Star Wars Roleplaying Game. He is a background character who can give the player characters information, but who otherwise plays no major role in the story.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Squib/Legends",
  "/wiki/Gender/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Lone_Scout-A",
  "/wiki/Hyperspace/Legends",
  "/wiki/Dalicron-4",
  "/wiki/Dalia_(township)",
  "/wiki/Han_Solo/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Kwenn_Space_Station/Legends",
  "/wiki/Navigation_computer/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Dalicron_sector/Legends",
  "/wiki/Daz%27s_Tavern",
  "/wiki/Child_of_Light",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Light_and_Dark_(adventure)"
 ]
}