{
 "name": "Vega_Sepen",
 "display_name": "Vega Sepen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Uldir Lochett",
      "New Republic"
     ]
    }
   ]
  }
 ],
 "content": "Vega Sepen was a female Corellian spacer, known as a tough, sharp-edged platinum-blonde who served as the first mate of Uldir Lochett's starship, the No Luck Required.\nBorn around 0 ABY, Vega Sepen was orphaned on Eriadu at the age of twelve and forced to fend for herself on that planet's harsh streets for the next three years. At fifteen she stowed away aboard a smuggling vessel and secured her place in the crew by defeating the Nikto first mate in a knife fight. Over the next few years, Sepen had moved from one fringe crew to another, and by 25 ABY she was a junior tactician aboard Urias Xhaxin's pirate frigate, the Free Lance.\nWhen the Free Lance was attacked by the Yuuzhan Vong, Sepen decided that the invaders had to be stopped, reasoning that the situation offered a stark choice between slavery or death and fighting back. She joined the New Republic military—or attempted to—but she washed out quickly due to her inability to submit to military discipline, and she found herself a niche in the Space Rescue Corps instead. By this time Sepen had become an experienced pilot, engineer, sensor operator and fighter, but her ability was borne of a survivor's instinctive wariness and a tough, unsentimental approach to problem-solving. In the crew of the No Luck Required, her abilities and personality secured her the post as Uldir's second-in-command. But beneath her hard-bitten exterior, she seemed to have concealed stronger feelings for her \"Boss-boy\" than he realized.\nAs a result, Sepen reacted with hostility to the growing closeness between Uldir and the Jedi Klin-Fa Gi, but she put aside her suspicions and worked with them to defeat the rogue Jedi Bey Gandan and a Yuuzhan Vong plot to poison the bacta supply on Thyferra.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Uldir_Lochett",
  "/wiki/New_Republic/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Starship/Legends",
  "/wiki/No_Luck_Required",
  "/wiki/Eriadu/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Nikto/Legends",
  "/wiki/25_ABY/Legends",
  "/wiki/Urias_Xhaxin",
  "/wiki/Pirate/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/Free_Lance",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Slavery/Legends",
  "/wiki/Death/Legends",
  "/wiki/Space_Rescue_Corps",
  "/wiki/Pilot/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Klin-Fa_Gi",
  "/wiki/Bey_Gandan",
  "/wiki/Bacta/Legends",
  "/wiki/Thyferra/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Vega_Sepen",
  "/wiki/Emissary_of_the_Void"
 ]
}