{
 "name": "Veijel",
 "display_name": "Veijel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire",
      "Sphere of Ancient Knowledge",
      "Sphere of Ancient Knowledge"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Darth Arctis",
      "Darth Thanaton",
      "Darth Nox"
     ]
    }
   ]
  }
 ],
 "content": "Veijel was a male Human Sith Lord of the reconstituted Sith Empire living during the Galactic War.\nA member of the Sphere of Ancient Knowledge, he followed Darth Arctis, who around 3667 BBY sent Veijel on an assignment to Rishi to watch and observe the Rishi Maze. Veijel spend the next thirty years on Rishi, during which Arctis was replaced by Darth Thanaton, who was in turn replaced by Darth Nox. Arctis and Thanaton believed the Rishi Maze to hold the key to immortality, which Veijel doubted, though he was still provided significant resources.\nVeijel's decades on Rishi were not in vain, as he was able to receive signals from the dwarf galaxy. The messages were in an ancient language that contained words of Sith, Gree and Rakata languages and described instructions on improving the communication arrays that Veijel used. The machines were now able to increase the lifespan of an individual \"twice transmuted and reborn to the Mother\". The latest Dark Councillor of the Sphere of Ancient Knowledge Darth Nox fit that description and Veijel began seeking an audience, refusing to speak of it to anyone else.\nHowever, many others did the same, resulting in Veijel having to wait from Nox's ascension until 3637 BBY, when Nox arrived on Rishi. Veijel finally arranged a meeting through Moff Valion Pyron and presented the Dark Lord his findings. When Nox interacted with the machine build from alien design, the machine provided cellular rejuvenation, increasing the Dark Lord's lifespan by one solar cycle. Veijel was overjoyed to hear of the results and asked his master for additional resources: scientists to replicate the machines, battalions to pacify Rishi and fleets to explore the Rishi Maze. Since each of those would contribute to prolonging the Dark Lord's life, Nox agreed to grant Veijel anything that he required.\nVeijel appears in Star Wars: The Old Republic: Shadow of Revan during the Sith Inquisitor class quest on Rishi. Although it is presumed that Nox took the Dark Side option and gave Veijel all the resources he requested, the Dark Lord also has the option listening to Drellik's advice and give Veijel limited resources, or ordering him to abandon his research and assist Moff Pyron in reorganizing the Sphere of Ancient Knowledge's war effort .",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Veijel",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Sphere_of_Ancient_Knowledge",
  "/wiki/Darth_Arctis",
  "/wiki/Darth_Thanaton",
  "/wiki/Darth_Nox",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/Galactic_War",
  "/wiki/3667_BBY",
  "/wiki/Rishi/Legends",
  "/wiki/Rishi_Maze/Legends",
  "/wiki/Sith_(language)",
  "/wiki/Gree_(language)",
  "/wiki/Rakata_(language)",
  "/wiki/Mother_Machine",
  "/wiki/Dark_Council",
  "/wiki/3637_BBY",
  "/wiki/Valion_Pyron"
 ]
}