{
 "name": "Vel_Sartha",
 "display_name": "Vel Sartha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chandrila"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mon Mothma's family",
      "Luthen Rael's network",
      "Aldhani rebel infiltration team",
      "Aldhani rebel infiltration team"
     ]
    }
   ]
  }
 ],
 "content": "Vel Sartha was a human Chandrilan female who was the cousin of Senator Mon Mothma. In 5 BBY, she led a team of rebels on a mission on Aldhani to steal a quarter's worth of the local sector's payroll. Together with her fellow rebels, Taramyn Barcona, Arvel Skeen, Cinta Kaz, Karis Nemik, and Imperial Lieutenant and inside man Gorn, they planned to infiltrate the Aldhani Garrison, steal the credits, and steal a Max-7 Rono freighter to escape in. However, just three days before the operation, Sartha met with rebel organizer Luthen Rael, who forced her to accept another man into her team, Rael's new acquaintance Cassian Andor, who was introduced as \"Clem.\" Vel was upset by this, but agreed to do it when Rael threatened to call her operation off.\nDespite the additional member, the team pulled off the heist, though they lost Barcona, Nemik, Gorn, and Skeen in the process. Not long after, Vel was tasked by Rael and his assistant, Kleya Marki, to kill Andor, as he knew too much about Luthen and his operation. Alongside Kaz, they began their search on Ferrix, but Sartha left for Coruscant and reunited with her family, Mon Mothma in particular.\nVel Sartha was a female human from Chandrila. She grew up as a rich girl and was a cousin to Mon Mothma and an a first cousin once removed to Leida Mothma, though Leida simply referred to her as an aunt. She later left her home world and began working with Luthen Rael and his network.\nAfter planning a mission to rob the Imperial garrison on the planet Aldhani, Sartha left their camp to meet Luthen, hiking a considerable distance to convene with the man. There, Rael introduced her to a new recruit, Cassian Andor, who he had just rescued from the Preox-Morlana on Ferrix. He introduced Andor as \"Clem,\" and explained that he intended for him to join her team. Sartha was displeased by the idea, but Rael sternly told her that she had to take him in or he would call their operation off. Fuming, Sartha agreed to take him on, and Rael told her to lie to the group and say that his presence was her idea and was planned all along. Sartha then provided Andor with clothes to make him appear as a local and led him back to camp, which was over a day's journey away.\nOn the way there, Sartha questioned Andor about his arm, which was bandaged, but he reassured her that he was fine. When he asked her who Rael was, Sartha responded that he should have asked him when he had the chance and warned him not to mention him to the others, telling him that they would have a \"big problem\" if he did. She then told him about the job robbing the garrison, which Andor was surprised by. After ducking a pair of patrolling TIE fighters, they continued on their way.\nArriving at camp, two of their number, namely Arvel Skeen and Taramyn Barcona, were annoyed by Andor's presence. Barcona asked to speak with Sartha about the matter, but she quickly denied him and told the group to help their new man settle in. When Barcona raised his voice again, Sartha coldly told him and Skeen to go secure the animal pens. Later, when Cinta Kaz was treating Andor's wound, Barcona approached Sartha again and asked how she knew him. Sartha replied that he had come highly recommended, to which Skeen replied by stating that she did not know him. Sartha sternly replied that she knew the group needed another man and that he was good backup and followed up by saying that she would not answer any more questions about his background so as not to violate security. Skeen demanded to know if he trusted the newcomer with their lives, and Sartha stared him down and said that it was her call.\nLater that day, Gorn, Sartha's contact from within the Aldhani Garrison, arrived on a speeder. When Skeen told him about their newest team member, Gorn stormed over to Sartha to voice his displeasure. Sartha told him that it was not a vote and that he had no say in the matter. Gorn demanded to know more about Andor, but Sartha again shut him down and said that he was their much-needed backup and that was all that mattered. When Barcona brought Andor with him to help assist Karis Nemik, Sartha questioned Gorn about Imperial patrols, and Gorn elaborated on recent movements, finishing by saying that he had to be back at base for a midnight inspection.\nSartha gathered the team together in a small hut that had a visualization of the Imperial base and the surrounding terrain. She explained their plan to Andor, who admitted that he did not think that they had much of a chance. The next day, Sartha and Barcona was conversing in one of the huts when she brought Andor in to question him on how to calibrate the weight on a Max-7 Rono freighter, which was the ship the group planned to escape in. Andor asked if he was being tested, but Barcona only insisted he answer the question. Andor then began to doubt that they knew how to fly the freighter, which Sartha denied. However, Andor pointed out that they had to get it off the runway first. When neither Barcona or Sartha responded, Andor all but confirmed that they did not know how to fly it. He told them how to do it and questioned what they would have done without him, to which Sartha retorted that they would have simply figured it out themselves. Andor then stated that he would pilot the ship, and when Sartha refused, he said that if his life was on the line, he wanted to fly. Sartha paused before agreeing to let him fly.\nLater, as Barcona, Skeen, Nemik, and Andor drilled in the fields outside the camp, Sartha and Kaz observed them. Andor asked what they would be doing while the four men entered the garrison posed as Imperial soldiers, but Sartha did not respond, with Barcona stating that Andor needed to worry about his part of the mission only. When Andor suggested that Barcona and Skeen, who were side-by-side at the front of their formation, switch sides due to Skeen being left-handed, he was shut down by Barcona. However, Sartha then spoke up and asked why Andor had said that. Andor said that each man's weapon should be on the outside. Sartha then quizzed him on each member's dominant hand, to which Andor knew each person's preferred hand. Sartha made a face at Barcona, who understood and implemented Andor's suggestion.\nLater, as the group packed up the supplies, Skeen picked up Andor's pack, which Andor took exception to. Sartha arrived to break up the argument. That evening, the group burned their model of the Imperial garrison, with Sartha toasting to the Rebellion. The next morning, the group set their animals loose and began the hike towards the Imperial base. Sartha once again quizzed Andor on the details of the mission. At one point, Andor asked Sartha a question, wanting to know more about Gorn. Sartha stated that it made no difference, but when Andor insisted that everyone else seemed to know what his deal was, Sartha sighed and explained that Gorn had fallen in love with a local woman, and, following her death, had lost interest in serving the Empire.\nWhen the group stopped to eat, Sartha witnessed another incident between Skeen and Andor, the former of who held a knife to the latter's throat before claiming his kyber crystal necklace. He proclaimed to the group that his suspicions were not unfounded and asked what kind of man brought treasure to a robbery, noting that the object was worth at least thirty-thousand credits. When Andor threatened to shoot Skeen, Barcona also drew his blaster, causing Sartha to shout at everyone to stand down. After cooling everyone down, Barcona put his blaster away and Sartha ordered Skeen to give Andor his necklace back. Before they continued on their way, Andor told the group that he was being paid to help them. Sartha explained that she had known but had no choice but to have him join them if they wanted to finish the mission. Skeen said that she should have told them that days ago, to which Sartha admitted that she should have.\nThat night, when they reached the garrison, Barcona signaled to Gorn, who watched him wave a torch through quadnoculars from the base. Then, Sartha instructed Skeen to apologize to Andor by telling him about his stake in the fight. After elaborating about his brother and his death, Andor accepted his apology. Then, Sartha and Kaz loaded up their equipment and prepared to depart. Sartha told the other four that they would see each other the following night before leaving.\nSartha and Kaz holed up inside a small cave near the lake that surrounded the garrison. Donning wetsuits, the two used a small vehicle to travel underwater to the base wall. Climbing up the ladder, Sartha disabled the comms before joining Kaz. Kaz told her to check in with the others, and when Sartha began to stall, Kaz angrily told her to check in. Meanwhile, the rest of the team was in position and waiting for her signal. Sartha eventually gave the go-ahead, and as the others marched toward the base, with Gorn covering their backs, Sartha and Kaz used grappling cables to descend into the base. Sartha followed Kaz to the area where Barcona and the others were located, and Kaz shot and killed the Imperial colonel Petigar, who had a blaster pointed at Nemik's head. They rounded up the other hostages, namely Commandant Jayhold Beehaz and his wife and son. Sartha kept her weapon pointed at Commandant Beehaz and told him that if their mission failed, everyone, including him and his family, would die. She instructed Barcona and Andor to take him upstairs in the lift before going to the vault. Beehaz told her that he could not help them open the vault, but Sartha retorted that she knew he was lying and reminded him the stakes if he did not comply.\nSartha and the others followed them in the lift once the Imperials there had been subdued. Sartha then brought Barcona, Skeen, Andor, Nemik, and Beehaz to the vault room while Kaz stayed with the hostages. The six guards who were there formed up when Barcona, still in uniform, called for an inspection. The others than drew their weapons, forcing them to surrender. Sartha trained her weapon on them as Skeen searched for weapons as Andor and Nemik got the ship ready. Then, Sartha, Barcona, and Skeen forced Beehaz and the other Imperials to load the credits onto the ship. Gorn arrived some time after, but he was followed by a group of Imperials who had noticed the comms being down and overheard communication between Nemik and Kaz mentioning their location in the vault. Gorn attempted to bluff their way out of a fight, but when Beehaz, who had been pulling heavy carts of credits, collapsed, a firefight erupted.\nSartha was pinned down as the Imperials opened fire. Unable to reach the ship, she fired on the Imperials who had been moving the credits before they could escape. When Barcona came out to help her, Skeen failed to cover him and Barcona was gunned down. Sartha eventually made her way to the ship and the group took off with eighty million credits on board. However, due to the speed of the launch, the credits slid around in the hold, with one container crushing Nemik. Sartha and Skeen went to help him as Andor piloted, with Nemik telling Sartha that he could not feel his legs. Sartha quickly reached for a med-spike and jabbed it into Nemik's chest as Skeen held him still. Nemik was then able to help guide Andor to safety through the storm and past the three TIE fighters in pursuit, escaping Aldhani.\nWhen Andor asked where they were going after, Skeen said that they had to go to a doctor to help Nemik and said that Sartha did not want to do that because it could jeopardize the mission. They decided to go to the doctor despite this, with Quadpaw operating unsuccessfully on Nemik, who died despite his best efforts. Sartha watched and later thanked Quadpaw for trying. However, just then, Andor entered with his blaster trained on Sartha. She angrily said that she should have listened to Barcona and then called for Skeen. Andor revealed that he had killed Skeen after he suggested they steal the money for themselves. Sartha responded by saying that Skeen would not have done that, causing Andor to scoff. He said that he wanted his cut before going on his way, giving back the kyber crystal that Rael had given him before the mission and telling Sartha that she could have the rest of the money. Before Andor walked out, Sartha handed him Nemik's manifesto, telling him that Nemik insisted he take it before he died.\nSartha eventually made her way to Coruscant, where she met with Rael's assistant, Kleya Marki, just outside the Coruscant spaceport. Marki warned her that neither of them should be there, but Sartha ignored her and told her that they had done their job. Marki remarked that she had indeed done exceptional work but then asked about loose ends. Sartha told her that the ship was buried and gone for good, but then Marki asked about Clem. She told Sartha that his real name was Cassian Andor and that he had to be tracked down. Sartha inquired if she was being asked to kill Andor, to which Marki affirmed that he could not be out in the galaxy with Rael in his head. Sartha asked about Kaz, to which Marki said that she was doing her job.\nSartha later made it to Ferrix where she reunited with Kaz as they began watching the Andor household. The two discussed Andor and whether he would turn up while Sartha continued to express her doubts and wanted to run away with Kaz who reminded her that the struggle would always have to come before their relationship despite she shared the same feelings towards Sartha. When asking Kaz who she would be she referenced Sartha's own past which bothered her.\nFollowing Kaz's comment and feeling she couldn't avoid her past any longer, Sartha decided to return to her homeworld and her family, first visiting her cousin Mon and her family on Coruscant.\nVel Sartha was a stern and steady leader. Although she was not initially receptive to adding Andor to her team, when given orders by Rael, she willingly followed orders and accepted his presence, agreeing to lie to her team and say that his presence was her idea. When her team questioned why Andor was joining them, Sartha demanded that they respect her decision and vouched for him.\nSartha and Cinta Kaz were a couple. Sartha cared for her team, particularly her girlfriend Kaz, but still had a no-nonsense attitude that allowed her to lead an efficient, and eventually successful operation on Aldhani. She was extremely committed to the cause, willing to sacrifice comfort, relationships, and even her life for the rebellion. She trusted her team greatly, not believing that Skeen would have betrayed them when Andor revealed that he had killed the man after he attempted to convince him to leave Sartha and take the money and the ship. When she witnessed Barcona's death, she was shaken by it. As the survivors escaped Aldhani, Skeen accused Sartha of giving up on saving Nemik, who was mortally wounded, and said that even if she thought that the mission could be compromised, she had to try and help Nemik by going to see a doctor.\nVel Sartha was played by Faye Marsay in the television series Andor. She made her first appearance in \"Aldhani,\" the fourth episode of the first season of Andor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Vel",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/Chandrila",
  "/wiki/Human",
  "/wiki/Chandrilan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Mon_Mothma%27s_family",
  "/wiki/Luthen_Rael%27s_network",
  "/wiki/Aldhani_rebel_infiltration_team",
  "/wiki/Senator",
  "/wiki/Mon_Mothma",
  "/wiki/5_BBY",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani",
  "/wiki/Sector",
  "/wiki/Taramyn_Barcona",
  "/wiki/Arvel_Skeen",
  "/wiki/Cinta_Kaz",
  "/wiki/Karis_Nemik",
  "/wiki/Lieutenant",
  "/wiki/Gorn",
  "/wiki/Aldhani_Garrison",
  "/wiki/Max-7_Rono_freighter",
  "/wiki/Standard_day",
  "/wiki/Luthen_Rael",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Kleya_Marki",
  "/wiki/Ferrix",
  "/wiki/Coruscant",
  "/wiki/Leida_Mothma",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/Preox-Morlana",
  "/wiki/Garrison",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Speeder",
  "/wiki/Starship",
  "/wiki/Pilot",
  "/wiki/Kyber_crystal",
  "/wiki/Quadnoculars",
  "/wiki/Arvel_Skeen%27s_brother",
  "/wiki/Death",
  "/wiki/Colonel",
  "/wiki/Petigar",
  "/wiki/Commandant",
  "/wiki/Jayhold_Beehaz",
  "/wiki/Roboda_Beehaz",
  "/wiki/Leonart_Beehaz",
  "/wiki/Quadpaw",
  "/wiki/Nemik%27s_manifesto",
  "/wiki/Coruscant_spaceport",
  "/wiki/Andor_household",
  "/wiki/Doctor",
  "/wiki/Faye_Marsay",
  "/wiki/Aldhani_(episode)",
  "/wiki/Andor_Season_One",
  "/wiki/The_Axe_Forgets",
  "/wiki/The_Eye",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Andor:_A_Disney%2B_Day_Special_Look",
  "/wiki/Databank_(website)",
  "/wiki/Reckoning_(episode)",
  "/wiki/August_4",
  "/wiki/2022"
 ]
}