{
 "name": "Vel_Ardox",
 "display_name": "Vel Ardox",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Planet in the Ploo sector"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Blubreen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Vel Ardox was a female Blubreen Jedi Knight serving the Jedi Order during the last years of the Republic Classic era. Like all members of her species, Ardox could breathe under water; she was also a skilled technician.\nBrought into the Jedi Order after being discovered to be a Force-sensitive during infancy, Ardox entered into the Jedi Temple's academy to begin her training in the ways of the Force. After graduating and being selected as a Padawan by a master, Ardox traveled the galaxy with her teacher on missions from the Jedi High Council. After passing her Trials of Knighthood, Ardox was elevated to the rank of Jedi Knight and began accepting solo missions.\nDuring her service to the Order, Councilor Adi Gallia went missing during an assignment on Esseles. Under the leadership of Master Qui-Gon Jinn, Ardox joined Padawan Obi-Wan Kenobi and fellow Knight Noro Zak in the search for the High Councilor. While investigating a company called Trinkatta Starships, the Jedi team was ambushed by security droids stationed there. During the commotion, Master Jinn slipped away to locate Gallia while Ardox aided in defeating the droids. As they fought, Master Jinn managed to find Gallia and shut down the droid control center, disabling the Jedi's opponents. Jinn soon picked up his fellow Jedi in a T-16 skyhopper and assigned Ardox and Zak the task of taking Gallia to the Jedi medical academy on Rhinnal.\nLeaving the Master/Padawan team on Esseles, Ardox and Zak flew to Rhinnal with Gallia and were greeted by the healers there. During their stay at the academy, communications were knocked out by a storm, causing the Jedi on Esseles to believe Rhinnal was under attack. Rushing to aid Rhinnal, Jinn and Kenobi found all to be well, with Gallia healing quickly.\nWhile on the planet, Jinn informed Ardox and Zak that a group of Bartokk assassins had stolen several hyperdrive-equipped Vulture-class droid starfighters, modified by Trinkatta, to attack the Academy of Corulag. With Gallia completely healed, the group agreed to meet Grand Master Yoda and Master of the Order Mace Windu on Corulag. Their mission was to rescue the Force-sensitive infant Teela Panjarra from the Chief Scientist of the Academy's Science Services, Frexton. Like the scientist Jenna Zan Arbor, who had held Jinn ten years before, Frexton hoped to unlock the secrets of the Force with the child. While their initial rescue mission was foiled by the Bartokk assassins, Grand Master Yoda found Panjarra and defeated the Bartokk. With Panjarra safe, the Jedi returned to Coruscant.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Vel",
  "/wiki/Ploo_sector",
  "/wiki/Blubreen",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Republic_Classic_era",
  "/wiki/Technician/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/Adi_Gallia/Legends",
  "/wiki/Episode_I_Adventures_1:_Search_for_the_Lost_Jedi",
  "/wiki/Esseles/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Noro_Zak",
  "/wiki/Trinkatta_Starships",
  "/wiki/Security_droid/Legends",
  "/wiki/Droid_control_program",
  "/wiki/T-16_skyhopper/Legends",
  "/wiki/Jedi_chapter_house_(Rhinnal)",
  "/wiki/Rhinnal/Legends",
  "/wiki/Jedi_healer/Legends",
  "/wiki/Bartokk",
  "/wiki/Assassin/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Corulag_Academy",
  "/wiki/Corulag/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Master_of_the_Order/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Teela_Panjarra",
  "/wiki/Frexton",
  "/wiki/Jenna_Zan_Arbor",
  "/wiki/Jedi_Apprentice:_The_Evil_Experiment",
  "/wiki/Coruscant/Legends",
  "/wiki/Episode_I_Adventures_2:_The_Bartokk_Assassins",
  "/wiki/Episode_I_Adventures_3:_The_Fury_of_Darth_Maul",
  "/wiki/Episode_I_Adventures_4:_Jedi_Emergency"
 ]
}