{
 "name": "Velash",
 "display_name": "Velash",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Copper"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Velash was a female Human Sith Lord of the reconstituted Sith Empire who served in the Battle of Corellia against the Galactic Republic.\nIn 3640 BBY, the female Human Sith Lord Velash of the reconstituted Sith Empire was stationed in Labor Valley of Coronet City, the capital of the planet Corellia. She was situated by a tent near the Labor Valley tram station\nAt the time, a battle for control against the Galactic Republic raged across the world, and during Imperial air-strikes against rebel factories in the area, Lord Velash observed several Corellians rebels surviving the firebombing campaign.\nDissatisfied, the Sith sought assistance from an Empire-aligned individual to immediately exterminate a Republic medical camp where the remaining rebels were receiving treatment. Accepting the mission, the Imperial assaulted the multi-tented medical camp, and struck down Republic medtechs, their blue and white-armored Republic troopers, as well as rebel forces in the area.\nThe Imperial then returned to Velash to report of the mission's success. Noting the weakening of the Corellian rebellion, Velash expressed her assurance that the rebels would be reduced to ashes, and provided material reward in the form of credits.\nDriven by a desire to fan the flames of destruction, Lord Velash had an urge of using the Empire's enemies as sacrificial items to be given to death through fire, in the worry that the last embers of mayhem would be lost. Thus, the Sith relished the chaos of battlefields and the unceasing deaths of enemies, holding the blazes in reverence.\nVelash admitted that her mind wandered when \"the flames are close,\" and often speaks dramatically with references to fire. She spoke in Galactic Basic Standard.\nThe female Human Sith Lord had a pair of blue eyes and copper-colored skin, though she lacked hair, with the left side of her face suffered severe burn scars.\nDuring the battle of Corellia, Lord Velash wore a white-colored light Sith armor and donned purple pigment accents beneath her eye sockets.\nVelash first appeared in the 2011 video game Star Wars: The Old Republic as a quest giver, where she is voiced by Kosha Engler.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Battle_of_Corellia",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/3640_BBY",
  "/wiki/Labor_Valley",
  "/wiki/Coronet_City/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Tent/Legends",
  "/wiki/Time/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Bombing_run",
  "/wiki/Factory/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Firebomb",
  "/wiki/Sith/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Republic_trooper",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Fire/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Copper/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Kosha_Engler",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/Battle_of_Ilum",
  "/wiki/Standard_year/Legends",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Written_Word",
  "/wiki/StarWars.com"
 ]
}