{
 "name": "Velpar_Raftin",
 "display_name": "Velpar Raftin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Velpar Raftin was a thin, hawk-faced and quite ambitious Human, who served as the planetary commandant of Sevarcos II during the Galactic Civil War.\nHe was appointed planetary commandant when the former commandant failed to stop a smuggling ring from using his own Imperial capital ships to smuggle spice off-planet. Originally Raftin worked in the Sector Plexus Intelligence network as a Security Major. While investigating the previous commandant, Security Major Raftin obtained access to vital information regarding the local smuggling trade and managed to put a stop to many small time smugglers. This impressed his superiors so much that they promoted him to planetary commandant.\nUpon his promotion he ordered several new Imperial garrisons built, especially along the traditional trade routes of the Sevari, much to the dismay of the spice lords. He also implemented a broad plan including intrinsic investigations and check of his own customs officers, frequent drilling of prison security, and a reformation of close-orbit tactics. He was worried about the power of the local spice lords and opined that the Emperor should strip them of their territories and subject the entire planet to Imperial rule, giving Raftin full governorship of the planet. As planetary commandant, he had direct access to all military material and governed all military units, including the Imperial minetroopers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Planetary_commandant",
  "/wiki/Sevarcos_II",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Sector_Plexus/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Security_Major",
  "/wiki/Sevari",
  "/wiki/Spice_lord",
  "/wiki/Palpatine/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Minetrooper",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Festival_of_High_Winds",
  "/wiki/Star_Wars_Adventure_Journal_12",
  "/wiki/The_Free-Trader%27s_Guide_to_Sevarcos",
  "/wiki/Star_Wars_Adventure_Journal_2",
  "/wiki/West_End_Games",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4"
 ]
}