{
 "name": "Vengnar_Heiff",
 "display_name": "Vengnar Heiff",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vengnar Heiff's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Department of Punishment"
     ]
    }
   ]
  }
 ],
 "content": "Vengnar Heiff, Master Torturer, was the head of the Galactic Empire's Department of Punishment during the early stages of the Galactic Civil War. A cold blooded, reptilian humanoid, Heiff earned a reputation for his brutal and violent methods, giving him the nickname of the Torturer. He was alternatively despised, feared, and respected by the upper echelons of the Imperial Military, though there was a general perception that he was a butcher.\nIn 0 ABY, Heiff was called to the Ithorian herdship Tafanda Bay, on Ithor, to extract information from a group of Ithorian technicians pertaining to the operation of the mammoth craft. After killing twelve of the Ithorians, Heiff was thrust into the middle of a ship-wide uprising. Battling a Rebel agent, Heiff was eventually brutally wounded and arrested by a large group of the normally-peaceful Ithorians.\nSir Vengnar Heiff, Master Torturer of the Galactic Empire's Department of Punishment, rose to infamy throughout the galaxy due to his highly successful track record of extracting information out of his prisoners. During the Galactic Civil War, Heiff helped the war effort by applying his talents to captured leaders of the Alliance to Restore the Republic. During this time, Heiff earned the nickname of \"the Torturer.\" Due to his elevated position, Imperial officers of vaulting ambition would try and curry favor with him.\nDespite being amongst arbiters of massacres and the like, Heiff was considered one of the most fearsome entities in the entire Galactic Empire. In 0 ABY, he was dispatched to the Tafanda Bay, a herdship on Ithor. The officer in charge of the occupied Tafanda Bay, General Olan Dewes, had mentioned in a report that the Ithorian technicians had failed to reveal vital details about the ship, and so the Empire saw fit to dispatch Heiff to encourage them.\nPrior to his arrival, the Heroes of Yavin, along with exiled leader Momaw Nadon, had landed on Ithor, claiming to have been ferrying Heiff himself. Although was aware of this, Heiff was unconcerned, and so went about his work. Setting up in the Tafanda Bay's makeshift prisons, Heiff went through prisoners at a rapid rate, mauling them with his long claws in an attempt to learn more about the herdship. His work made everyone on the Tafanda Bay uncomfortable, as the stereo screams of the technicians echoed throughout the herdship's corridors. He had killed approximately twelve of his prisoners by the time an uprising broke out on the Tafanda Bay. Too immersed in his work to care, Heiff and his guards were eventually attacked by a Rebel agent and a group of Ithorians.\nTurning the tables, Heiff let his stormtrooper escort take the brunt of the attack, while he hid and deactivated the lights in the room. Due to his natural instincts, he was able to detect the smell of his adversaries. While distracting the Rebel with the remainder of his guard, Heiff pounced on his opponent, attacking with his oversized claws. The struggling Rebel, evading Heiff, desperately released all the Ithorian prisoners, forcing Heiff to feign a retreat. Doubling back to finish off the Rebel, he was intercepted mid-leap by his adversary's blaster bolt. Gravely wounded, he begged to be finished off, but the Rebel refused, handing him over to Ithorian custody to be tried and sentenced.\nSir Vengnar Heiff took a great deal of pleasure from his work, although he was exceptionally carefree towards the health of his victims. He would use his own anatomy instead of implements to beat the truth out of the subject, tearing them apart with his large claws. He was described as a butcher by some, being both feared and looked upon with disdain by the Imperial community. Some, such as General Dewes, believed that Heiff would go through torturing the supply of Ithorian prisoners before being able to extract the needed information.\nHeiff wore no clothes, save for a utility belt and a large, flowing red cape. A reptilian lizard-man hailing from an icy planet, he was cold-blooded, and able to use a heightened sense of smell to detect his prey. His claws were considered gargantuan, and were used liberally in the Torturer's line of work to both maim and kill his victims. Heiff also had green skin.\nVengnar Heiff first appeared in Dave Wolverton's Star Wars Missions 7: Ithorian Invasion. Although not mentioned in Wolverton's later work, Star Wars Missions 16: Imperial Jailbreak, it is specified that the Master Torturer is the head of the Department of Punishment, hence the connection in this article. Heiff was not mentioned in canon again, until ten years after Ithorian Invasion, when he was given an entry in 2008's The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Vengnar_Heiff%27s_species",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Department_of_Punishment",
  "/wiki/Master_Torturer",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Ithorian_Herdship/Legends",
  "/wiki/Tafanda_Bay",
  "/wiki/Ithor/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Battle_of_Ithor_(0_ABY)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Sir",
  "/wiki/The_galaxy/Legends",
  "/wiki/General/Legends",
  "/wiki/Olan_Dewes",
  "/wiki/Heroes_of_Yavin/Legends",
  "/wiki/Momaw_Nadon/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Death/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Dave_Wolverton",
  "/wiki/Star_Wars_Missions_7:_Ithorian_Invasion",
  "/wiki/Star_Wars_Missions_16:_Imperial_Jailbreak",
  "/wiki/2008"
 ]
}