{
 "name": "Veni_Ramunee",
 "display_name": "Veni Ramunee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 4010 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tannis"
     ]
    }
   ]
  }
 ],
 "content": "Veni Ramunee was a male Human Padawan of the Jedi Order serving the Galactic Republic during the Great Sith War.\nA Force-sensitive Human, Veni Ramunee was the fifth of eight children born to an Alderaanian family on their homeworld in the decade preceding the Great Sith War. Like his older sister Vici, his Forcefulness was detected by a Jedi Master visiting the planet in search of candidates for Jedi training. Finding them at their family's estate near Lir Lake Master Tannis selected the Forceful siblings to train with the Jedi ; though she deemed the younger Ramunee too young to begin the training and assured him that she would return in two years time to retrieve him upon his ninth birthday.\nTrue to her word, Tannis returned and took Ramunee to the Jedi Praxeum on Teya IV to begin his training in the ways of the Force while his sister continued to excel in her own training. In 4000 BBY, 16-year-old Vici Ramunee reached the end of her training as a Padawan under Mistress Tannis and was tasked with traveling alone to the Cave of Truth and to face her \"greatest foe\" as part of her Jedi Trials. Armed only with her knowledge of the Force, her brother attempted to smuggle her lightsaber into the cave but was turned away by his older sister, who informed him that she must obey her instructions an pass her trials honestly. Ordering her younger brother back to the praxeum, he claimed he did not know the way back and would have to accompany her into the cave.\nWith no choice, the older Ramunee allowed her brother to join with her and they successfully reached the mountains hours later. There, she sensed a large creature approaching and, with no obvious place to hide or flee, activated her lightsaber to protect her and her brother. The large, monstrous creature, however, turned out to be a Duinuogwuin Jedi Master called Willm Lywin. Lywin, amused by Ramunee's attempt to \"protect\" her brother, escorted the pair the rest of the way to Cave of Truth, where Vici Ramunee entered alone and emerged successful in her trials.\nVici Ramunee, who conquered her fears, and Veni Ramunee, who came to his sister's aid, shares their first names with the contents of the latin phrase \"Veni, vidi, vici\", which is commonly attrubuted to Julius Ceasar and translates to \"I came; I saw; I conquered.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/4010_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Tannis_(Jedi)",
  "/wiki/Padawan/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Alderaanian/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Vici_Ramunee",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Lir_Lake",
  "/wiki/Teyan_Praxeum",
  "/wiki/Teya_IV",
  "/wiki/The_Force/Legends",
  "/wiki/4000_BBY/Legends",
  "/wiki/Cave_of_Truth",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Duinuogwuin/Legends",
  "/wiki/Willm_Lywin",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Most_Dangerous_Foe",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/Slaying_Dragons",
  "/wiki/Star_Wars_Adventure_Journal_9"
 ]
}