{
 "name": "Venk",
 "display_name": "Venk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Dreed's Star Destroyer"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Officer Corps",
      "Imperial Navy",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Venk was a human male who served in the Galactic Empire's naval branch as a captain. During the Galactic Civil War, Venk was stationed aboard Commander Dreed's Star Destroyer while the vessel hunted for Alderaanians who had survived the destruction of their homeworld, Alderaan. After Dreed died on the planet Skaradosh in 0 ABY during a prisoner exchange with Princess Leia Organa of the Rebel Alliance, Venk assumed command of the Destroyer and led it to the planet Espirion to try and destroy the Alderaanian fleet gathered there. With the aid of the Espirion Multi, a vessel sent by the Alderaanian-descended inhabitants of Espirion, the Alderaanians destroyed the Star Destroyer and killed Venk.\nVenk was an Imperial officer of the Galactic Empire, serving in the naval branch of the Imperial Military as a captain. During the Empire's war against the Alliance to Restore the Republic, Venk served aboard the Imperial-class Star Destroyer of Commander Dreed and joined him in his hunt for survivors of the planet Alderaan following that world's destruction by the Death Star superweapon.\nIn 0 ABY, after Tula, one of Venk's crewmates, began providing Dreed with intelligence on an ongoing effort by Alderaanian Princess Leia Organa to rescue the survivors, the commander unsuccessfully attempted to halt her mission while she was visiting the Alderaan Enclave on the planet Sullust. During the attempt, Organa learned of Tula's Imperial loyalties, and, no longer seeing her as a useful asset, Dreed had her taken away for processing. To save the traitor, the princess agreed to exchange herself as a captive for Tula on the desert world of Skaradosh, a trade that Dreed chose to personally oversee on the planet's surface.\nWhile Dreed was gone, Venk was given acting command of their Star Destroyer, which soon became permanent when Alderaanian reinforcements killed the commander on the world below in order to rescue Organa. Quickly learning of Dreed's fate, Venk sought to avenge him by killing the Alderaanians as they attempted to flee Skaradosh. The Star Destroyer opened fire on what the Imperials believed to be a starship carrying the Alderaanians but instead unknowingly destroyed a decoy while the real targets escaped on the freighter known as the Mellcrawler.\nBelieving Organa and the others dead, Venk gave the order for the Star Destroyer to travel to the planet Espirion, where Dreed had previously learned that the rest of the Alderaanian fleet was gathering. Upon the Imperials' arrival, they found the Alderaanians waiting for them, thanks to a warning from Organa and the others aboard the Mellcrawler, but still heavily outmatched. Under Venk's command, the Star Destroyer opened fire on the gathered fleet and destroyed a number of the enemy ships while Organa delivered what she thought might be her final speech to the Alderaanians present.\nHowever, the tide turned against Venk when the Alderaanian-descended inhabitants of Espirion, swayed by Organa's words, sent the vessel Espirion Multi to aid the fleet. Still confident of his victory, Venk continued the fight, but he and his ship were soon obliterated by the combined firepower of the enemy vessels. With the Imperials defeated, the Alderaanians celebrated before Organa returned to her place in the Alliance.\nVenk was a human male with light skin who bore several scars across his face. He was overconfident, assuming that it was impossible for Leia Organa to escape him on Skaradosh and then believing he still had the upper hand, even as his ship was destroyed during the battle with the Alderaanians. The captain held great contempt for Organa and her people and felt a desire to kill more Alderaanians in his moment of triumph after supposedly killing the princess.\nCaptain Venk wore a standard gray Imperial officer's uniform, including a black belt and a command cap with an officer's disk, during his service time aboard Commander Dreed's Imperial Star Destroyer.\nVenk first appeared in the final issue of the Star Wars: Princess Leia comic book series, which was written by Mark Waid, illustrated by Terry Dodson, and released on July 1, 2015. Venk's character was not named or given a rank in the issue itself, but editor Jordan D. White later identified him as having been called \"Captain Venk\" in the issue's script.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/0_ABY",
  "/wiki/Dreed%27s_Star_Destroyer",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Captain",
  "/wiki/Galactic_Civil_War",
  "/wiki/Commander",
  "/wiki/Dreed",
  "/wiki/Starship",
  "/wiki/Alderaanian",
  "/wiki/The_Disaster",
  "/wiki/Homeworld",
  "/wiki/Alderaan",
  "/wiki/Death",
  "/wiki/Planet",
  "/wiki/Skaradosh",
  "/wiki/Prisoner",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Espirion",
  "/wiki/Alderaan_Flotilla",
  "/wiki/Espirion_Multi",
  "/wiki/Alder-Espirion",
  "/wiki/Star_Destroyer",
  "/wiki/Imperial_officer",
  "/wiki/Imperial_Military",
  "/wiki/Gender/Legends",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Tula",
  "/wiki/Mission_to_rescue_the_survivors_of_Alderaan",
  "/wiki/Alderaan_Enclave",
  "/wiki/Sullust",
  "/wiki/Desert",
  "/wiki/Freighter",
  "/wiki/Mellcrawler",
  "/wiki/Fleet",
  "/wiki/Imperial_military_uniforms",
  "/wiki/Belt",
  "/wiki/Officer%27s_disk",
  "/wiki/Time",
  "/wiki/Princess_Leia_5",
  "/wiki/Star_Wars:_Princess_Leia",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Mark_Waid",
  "/wiki/Terry_Dodson",
  "/wiki/July_1",
  "/wiki/2015",
  "/wiki/Military_rank",
  "/wiki/Jordan_D._White",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_34",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/File:Venk-Tumblr.png",
  "/wiki/Princess_Leia_3",
  "/wiki/Princess_Leia_4",
  "/wiki/Marvel_Comics"
 ]
}