{
 "name": "Venka",
 "display_name": "Venka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 24 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Venka was a Human male officer in the Imperial Navy during the height of the Galactic Civil War. A native of the Imperial throne world of Coruscant, Venka had a spoiled childhood, raised the son of a wealthy industrialist. Venka attended one of the oldest military training academies in the Core Worlds, where his many connections helped him graduate at the top of his class.\nAfter the Empire's catastrophe at the Battle of Yavin, Venka was one of many non-commissioned personnel promoted to fill the void of so many officers lost in the destruction of the Death Star battlestation. Venka's academy connections earned him a prestigious assignment to the Super Star Destroyer Executor, the personal flagship of the Dark Lord Darth Vader, at the young age of twenty-seven. By 3 ABY, Venka served as a lieutenant on the Executor's bridge, under the command of Captain Firmus Piett.\nWhen Vader killed Admiral Kendal Ozzel, the Executor's commanding officer, for incompetence during the Battle of Hoth, the Executor's admiralty passed to Piett, although Piett denied Venka a corresponding promotion to captain, declaring that the remainder of the Hoth campaign would be a test of Venka's command abilities. Venka secretly detested Piett for the denial, but he nevertheless resolved to do his job the best he could. At the conclusion of the Hoth campaign, which ultimately saw the escape of the Rebel Alliance and Luke Skywalker, Vader's son, Piett finally granted Venka his promotion to captain.\nVenka was a Human male native of the galactic capital planet of Coruscant. He was born circa 24 BBY, in the midst of the Separatist Crisis that spawned the full-blown Clone Wars, leading to the eventual formation of the Galactic Empire. Venka was raised a spoiled child, the son of a wealthy industrialist. He learned military basics at one of the oldest and most prestigious training academies in the Core Worlds, and the many connections he enjoyed at the academy as a result of his privileged upbringing helped Venka graduate at the top of his class.\nThe Imperial defeat at the Battle of Yavin, in which the Rebel Alliance succeeded in destroying the Empire's first Death Star battlestation, created a power vacuum in the Imperial ranks as well as an opportunity for career advancement. Among the many non-commissioned personnel promoted to replace the vast numbers of officers killed in the Death Star disaster was Venka, who found himself appointed to the Super Star Destroyer Executor, the personal flagship of the Dark Lord Darth Vader and the premier command ship of the Imperial Navy, at the ripe age of twenty-seven standard years. Venka worked hard for his transfer to the Executor, but it was the connections from his academy days that won him his prestigious assignment.\nLieutenant Venka served aboard the Executor as a bridge officer under the command of Captain Firmus Piett. In 3 ABY, the raging Galactic Civil War led the Executor and the remainder of Vader's Star Destroyer fleet, the Imperial Death Squadron, to the Hoth system, site of the Rebel Alliance's secret base. At the onset of the resulting Battle of Hoth, Vader executed Admiral Kendal Ozzel, the Executor's commanding officer, for tactical blundering and promoted Piett to admiral to lead the fleet, and much of the operation of the Executor subsequently fell to Venka. However, much to Venka's displeasure, Piett denied him a corresponding promotion to captain, saying that the remainder of the Hoth campaign would be a test of his command abilities. Loathing Piett for the slight, Venka nevertheless vowed to carry out his responsibilities the best he could.\nThe Battle of Hoth soon led Vader's fleet into the Hoth asteroid field in pursuit of the fleeing Rebels Han Solo and Princess Leia Organa aboard Solo's starship, the Millennium Falcon. Disappointed with his crew's inability to capture the Rebel fugitives on their flight from Hoth, Vader summoned a group of six bounty hunters aboard the Executor to bring him the elusive Millennium Falcon where the Imperials had failed. Upon the bounty hunters' arrival, Venka directed the motley group to wait for Vader on the bridge, but Piett warned Venka to watch the bounty hunters' every move, for they were all notorious killers. Together, from a distance, Venka and Piett scrutinized each of the hunters' career merits and the lethality each presented, particularly the notorious Boba Fett.\nWhile the hunters waited for Vader, a tense atmosphere gripped the Executor's bridge. The Executor's crew felt extremely uncomfortable in the bounty hunters' presence, especially Piett, who voiced his displeasure to Venka moments later while Venka was working closely in the bridge's port-side crewman pit with Commander Brandei, the Executor's TIE operations officer. However, Venka temporarily relieved Piett of his concerns with news that the Executor had received a priority signal from the Imperial Star Destroyer Avenger at the forefront of the fleet—Solo and the Millennium Falcon had been found.\nAlthough the Millennium Falcon proceeded to escape the Avenger and the Executor in the Anoat system, Vader's fleet caught up with the Rebels once more above the planet Bespin. With the Executor closing in on the Millennium Falcon, the responsibility fell to Venka to organize a boarding party to capture the Rebels onboard, including Luke Skywalker, Vader's son—the Dark Lord's true target. Arranging the boarding party proved to be Venka's last task as lieutenant, as the Millennium Falcon unexpectedly jumped into hyperspace to escape the Executor's pursuit for good. Afterward, Piett, realizing how lucky he was to avoid execution at Vader's hands for losing the Rebels, finally promoted Venka to captain. Eventually, in the aftermath of the Hoth campaign, captaincy of the Executor passed from Venka to Captain Kallic, who assumed temporary command of Vader's flagship.\nLieutenant Venka secretly despised Firmus Piett for Piett's decision to deny Venka a promotion to captain following Piett's own promotion to admiral. Venka believed Piett was merely lucky to be the next in line to the Executor's admiralty, questioning Piett's true abilities. Still, faced with the Hoth campaign as a test of his own command abilities, Venka buckled down and strove to perform his job the best he could. Venka had light skin, brown hair, brown eyes, and stood 1.8 meters tall.\nVenka possessed knowledge of Imperial Navy bureaucracy as well as planetary systems. He had mechanical ability in capital ship piloting and technical proficiency in capital ship repair.\nDuring the Hoth campaign, Lieutenant Venka wore the standard-issue Imperial officer's uniform while serving aboard the Super Star Destroyer Executor. His equipment included a blaster pistol and comlink.\nLieutenant Venka was first mentioned in the 1989 first edition of the West End Games sourcebook Galaxy Guide 3: The Empire Strikes Back, written by Michael Stern for Star Wars: The Roleplaying Game. The text presents Venka as an example of a standard Star Destroyer officer and provides the character with basic roleplaying statistics. The illustration used to represent Venka was the same image used to represent another character, Captain Gosden, in the same year's first edition of the Galaxy Guide 1: A New Hope sourcebook, also from West End Games. The July 1996 second edition of Galaxy Guide 3 includes a full profile for Venka with a detailed character background as part of a major expansion on the text by Pablo Hidalgo.\nHowever, Galaxy Guide 3 did not explicitly identify Venka as being any character appearing in the corresponding film Star Wars: Episode V The Empire Strikes Back. The \"Lieutenant Venka\" card from the April 1997 Dagobah Limited expansion set of the Star Wars Customizable Card Game was the first source to identify Venka as the film's Imperial officer who informs Admiral Piett that the Executor has received a priority signal from the Star Destroyer Avenger during the search for the Millennium Falcon. According to fan sites, actor Robin Scobey, who is credited in The Empire Strikes Back as one of five \"Other Officers\" in the Imperial Forces, played the Venka character.\nWhile the second edition of Galaxy Guide 3 explains that Venka was Piett's immediate successor to the Executor's captaincy, some sources fail to take into account Venka's involvement. The 2002 The New Essential Guide to Characters and the 2008 The Complete Star Wars Encyclopedia explain that Captain Kallic was Piett's immediate successor, with no mention of Venka.\nAlternatively, The Official Star Wars Fact File 89 and the Admiral Piett character entry in the now-defunct StarWars.com Databank do correctly identify Venka's relationship to Kallic in the Executor's captaincy lineage—Kallic eventually succeeded Venka.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/24_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Coruscanti/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Officer/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battlestation",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Firmus_Piett/Legends",
  "/wiki/Death/Legends",
  "/wiki/Fleet_Admiral/Legends",
  "/wiki/Kendal_Ozzel/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Separatist_Crisis/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Command_ship/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/File:WeDontNeedTheirScum.ogg",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Death_Squadron/Legends",
  "/wiki/Hoth_system/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Hoth_asteroid_field",
  "/wiki/Han_Solo/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Brandei",
  "/wiki/TIE_Series",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Avenger/Legends",
  "/wiki/Anoat_system/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Kallic",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Capital_ship/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Imperial_officer%27s_uniform/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/1989",
  "/wiki/West_End_Games",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/Michael_Stern",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Roleplaying_game",
  "/wiki/Gosden",
  "/wiki/Galaxy_Guide_1:_A_New_Hope",
  "/wiki/July",
  "/wiki/1996",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/April",
  "/wiki/1997",
  "/wiki/Dagobah_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Robin_Scobey",
  "/wiki/2002",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Official_Star_Wars_Fact_File_89",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(junior_novelization)",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(PhotoComic)",
  "/wiki/Therefore_I_Am:_The_Tale_of_IG-88",
  "/wiki/Tales_of_the_Bounty_Hunters",
  "/wiki/Payback:_The_Tale_of_Dengar",
  "/wiki/Of_Possible_Futures:_The_Tale_of_Zuckuss_and_4-LOM",
  "/wiki/William_Shakespeare%27s_The_Empire_Striketh_Back:_Star_Wars_Part_the_Fifth",
  "/wiki/The_Empire_Strikes_Back_Notebook",
  "/wiki/The_Empire_Strikes_Back:_The_National_Public_Radio_Dramatization",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back:_The_Illustrated_Screenplay",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Aurra_Sing:_Dawn_of_the_Bounty_Hunters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_47",
  "/wiki/Star_Wars:_The_Card_Game",
  "/wiki/The_Desolation_of_Hoth",
  "/wiki/Star_Wars_Insider",
  "/wiki/Classic_Moment",
  "/wiki/Star_Wars_Insider_Special_Edition_2014",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2015_Topps_Star_Wars_Illustrated:_The_Empire_Strikes_Back",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/September_22",
  "/wiki/2017"
 ]
}