{
 "name": "Venlana_Sipal",
 "display_name": "Venlana Sipal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Saleucami"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pantoran"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black-blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Zann Consortium",
      "Veiled Sorority"
     ]
    }
   ]
  }
 ],
 "content": "Venlana Sipal was a female Pantoran hailing from the Outer Rim world Saleucami. An underboss for the Zann Consortium, she was stationed in Taleucema during the Galactic Civil War.\nDescended from the Pantorans that first colonized Saleucami, Venlana Sipal was born and raised on the dim, arid world during the time of the Galactic Empire. Entering employment of the Zann Consortium as an underboss, Sipal began to notice shipping losses that exceeded projections during the Galactic Civil War. Suspecting pirate activity, Sipal sought to contract an individual as part of a loss prevention program to hunt down the pirate and recover the stolen cargo. Arranging to meet an interested party at the Paradise cantina, Sipal and her personal assistant Porel explain that a pirate organization known as the Veiled Sorority is behind the attacks. Issuing a bounty on the so-called Queen who leads the Sorority, Sipal ensures the bounty hunter that a significant reward awaits them should they be successful.\nWhen the bounty hunter captures a body double of the Queen, Sipal asks that they redouble their efforts to locate the true Queen and stop further attacks on the Consortium's shipping business.\nShe eventually betrayed the Consortium and worked secretely for the Veiled Sorority.\nAmbitious and merciless, Venlana Sipal wore a mask of polite professionalism at all times to disguise her true, more sinister nature. Dressing in conservative suits, she carried a hold-out blaster as well as a vibroknife for her personal safety. Her melodic voice carried with it an air of confidence and authority.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Saleucami/Legends",
  "/wiki/Pantoran/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Zann_Consortium/Legends",
  "/wiki/Veiled_Sorority/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Taleucema",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Porel",
  "/wiki/Bounty/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Venlana_Sipal",
  "/wiki/Hold-out_blaster/Legends",
  "/wiki/Vibroknife",
  "/wiki/Mask_of_the_Pirate_Queen"
 ]
}