{
 "name": "Venlyss_Pnorr",
 "display_name": "Venlyss Pnorr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gand"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 34 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gand"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Venlyss Pnorr was a well-known male Gand findsman, a Force-sensitive religious tradition of bounty hunters, during the Galactic Civil War. He secretly worked for the Alliance to Restore the Republic where he used his talents to retrieve endangered Rebels or capture Imperial targets.\nVenlyss Pnorr secretly worked for the Rebel Alliance under the guise of a bounty hunter. He \"captured\" endangered Alliance operatives and returned them to safehouses. He also hunted down Imperial targets to deliver to the Alliance however many Imperial captives suffered \"accidents\" that resulted in their termination prior to being turned over to the Rebels. Pnorr refused to elaborate on the cause behind these events and the Alliance chose to overlook the occasional dead body and suspicious circumstances.\nHis most recent mission for the Alliance was to rescue an undercover agent from the Imperial Security Bureau sector headquarters. The agent was \"accidentally\" killed long after pursuit had been abandoned. The body was delivered to the drop-off point and Pnorr then went into hiding. Airen Cracken has ordered him to be brought in for questioning but was unsuccessful believing the Gand was using his Findsman rituals to reveal who was hunting him and thus was able to stay one step ahead of pursuit.\nAlthough he worked for the Alliance, Pnorr seemed to have a hidden agenda as he often killed the Imperials he was supposed to be capturing alive. When his actions resulted in the death of an Alliance agent he wisely went into hiding.\nCompetent at both tracking and combat, Pnorr was a solid bounty hunter. He was not the most skilled tracker in the galaxy but his rituals allowed him to get a huge advantage in finding his targets.\nPnorr carried protective equipment, a heavy blaster pistol, a vibroblade, a datapad and a breathing mask.\nVenlyss Pnorr was designed by Stephen Crane for Cracken's Rebel Operatives, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1994. He was illustrated by Mike Vilardi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Gand_(planet)/Legends",
  "/wiki/34_BBY/Legends",
  "/wiki/Gand/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Findsman/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Operative",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Heavy_blaster_pistol/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Breath_mask/Legends",
  "/wiki/Stephen_Crane",
  "/wiki/Cracken%27s_Rebel_Operatives",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Mike_Vilardi",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}