{
 "name": "Venslas_Beeli",
 "display_name": "Venslas Beeli",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "0 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Solar Terrors"
     ]
    }
   ]
  }
 ],
 "content": "Venslas Beeli was a Human male pirate who served as captain, operating originally in the Outer Rim and later in the Ringali Shell during the Galactic Civil War.\nBeeli's origins were obscure. He signed up as a pirate crewman in the Outer Rim when there was no legitimate commercial work, but found he was a natural at surviving the deadly, rough-and-tumble life of piracy. He became infamous as a two-pistol armed, screaming boarder, and this reputation helped him build up contacts and knowledge.\nAfter his original crew broke up, he rose to be the head of a splinter group, the Solar Terrors. The Terrors operated using up-armed freighters and would attack transports traveling alone. Bereli funneled part of their profits into bribes amongst port and law enforcement officials, making their work easy.\nOver time, the Terrors acquired a CR90 corvette named the Zahtjav, an Etti-class light transport named the Javiq, and the Pyesmev, which was modeled on a light corvette. However, all this success brought the eye of the Galactic Empire.\nAfter three months, Captain Lev Kepzen of the EF76 Nebulon-B escort frigate Feral tracked down Beeli and his base. Beeli was imprisoned following his prompt surrender.\nWhen Captain Kenit learned of Beeli's capture, he concocted a plan. He reassembled the Terrors and their ships, placing Beeli in charge. He gave the pirate a simple mission: find, draw out and destroy or corner the Far Orbit. Beeli and his crew were infected with Vira606, a virus created by the ISB. Since only the Empire held the cure, the pirates had to obey or die.\nThe Terrors entered the Ringali Shell with a vengeance, attacking civilian shipping at Brentaal, Esseles and Rhinnal, and committing various small atrocities. They claimed to be privateers working for the Rebel Alliance. As Kenit intended, their ruthlessness drew the Far Orbit into battle. However, the plan failed, and the Far Orbit destroyed the Solar Terrors and escaped.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Solar_Terrors",
  "/wiki/Pirate/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Ringali_Shell",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Transport/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Zahtjav_(starship)",
  "/wiki/Etti_Lighter",
  "/wiki/Javiq",
  "/wiki/Pyesmev",
  "/wiki/Light_corvette/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lev_Kepzen",
  "/wiki/EF76_Nebulon-B_escort_frigate/Legends",
  "/wiki/Feral_(EF76_Nebulon-B_escort_frigate)",
  "/wiki/Prison/Legends",
  "/wiki/Vocis_Kenit",
  "/wiki/Far_Orbit",
  "/wiki/Vira606",
  "/wiki/Imperial_Security_Bureau/Legends",
  "/wiki/Brentaal_IV/Legends",
  "/wiki/Esseles/Legends",
  "/wiki/Rhinnal/Legends",
  "/wiki/Privateer/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/West_End_Games",
  "/wiki/The_Rival",
  "/wiki/The_Far_Orbit_Project"
 ]
}