{
 "name": "Veraslayn_Kast",
 "display_name": "Veraslayn Kast",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Mandalore"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mandalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Death Watch",
      "Shadow Collective"
     ]
    }
   ]
  }
 ],
 "content": "Veraslayn Kast was a human female artist from the planet Mandalore. A supporter of the Death Watch splinter group and its leader, Pre Vizsla, Kast created art showcasing Mandalorian soldiers in action. She died in the year 19 BBY during the civil war on her homeworld that pitted Mandalorians loyal to the Shadow Collective criminal alliance, of which Death Watch was a founding member, against those who opposed it.\nA human female, Veraslayn Kast was an artist from the planet Mandalore who supported the Death Watch, a Mandalorian terrorist splinter group that opposed the pacifist New Mandalorian government on Mandalore. One of her pieces of art, a propaganda poster, depicted several Death Watch soldiers in action amidst a city and flames, one of several pieces showcasing Mandalorian warriors partaking in battle for the first time in ages.\nKast followed Death Watch leader Pre Vizsla during the Clone Wars, a conflict that saw the rise of the Shadow Collective, a criminal alliance that Death Watch was the first to join. With the aid of the rest of the Shadow Collective, Death Watch managed to seize control of Mandalore in the year 19 BBY; however, Vizsla was slain after betraying the Collective's leader, the renegade Sith Lord Maul, who proclaimed himself the new leader of Death Watch, prompting some members of the organization to reject his rule.\nKast perished during the ensuing civil war on her homeworld, which pitted Mandalorians still loyal to the Shadow Collective against those who opposed Maul's rule. At the Clone Wars' conclusion, the Galactic Empire came into being, and the organization's Imperial Super Commandos, Mandalorian soldiers who served the Empire, destroyed much of the late Kast's work.\nVeraslayn Kast was mentioned in the 2016 book Star Wars Propaganda: A History of Persuasive Art in the Galaxy, written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kast",
  "/wiki/Mandalore",
  "/wiki/19_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Death_Watch",
  "/wiki/Shadow_Collective",
  "/wiki/Artist",
  "/wiki/Planet",
  "/wiki/Pre_Vizsla",
  "/wiki/Mandalorian",
  "/wiki/Soldier",
  "/wiki/Death",
  "/wiki/Standard_year",
  "/wiki/Mandalorian_civil_war_(Clone_Wars)",
  "/wiki/Homeworld",
  "/wiki/Terrorist",
  "/wiki/New_Mandalorians",
  "/wiki/Untitled_Death_Watch_piece",
  "/wiki/Propaganda",
  "/wiki/Painting",
  "/wiki/City",
  "/wiki/Fire",
  "/wiki/Time",
  "/wiki/Clone_Wars",
  "/wiki/Takeover_of_Mandalore",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Galactic_Empire",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Imperial_Super_Commando",
  "/wiki/2016",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Eminence_(episode)",
  "/wiki/Shades_of_Reason",
  "/wiki/The_Lawless",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Imperial_Supercommandos"
 ]
}