{
 "name": "Verena_Talos",
 "display_name": "Verena Talos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Verena Talos was a Human female soldier and operative that was aligned with the Alliance to Restore the Republic. She aided the medical droid MHD-19 and the Mon Calamari marksman Loku Kanoloa in trying to evacuate some colonists from the Empire, they returned to Hoth shortly after the Battle of Hoth forced them to evacuate.\nVerena Talos participated in various operations in the past and had participated in the Battle of Hoth. She was among those who was forced to evacuate from Echo Base by the Galactic Empire as a result of the disastrous ground battle, which also made her very eager to exact revenge when the time came. She later aided some colonists, returned to Hoth with her comrades Loku Kanoloa and MHD-19 shortly after the evacuation.\nTalos was a skilled combatant, having engaged in several vital operations. She also had a lot of hate for the Galactic Empire for the destruction of Echo Base, and was eager to exact revenge on them for it when the time came.\nVerena Talos is one of three hero characters in the Return to Hoth expansion pack for the tactical land-based RPG game Star Wars: Imperial Assault by Fantasy Flight Games.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Operative",
  "/wiki/Medical_droid/Legends",
  "/wiki/MHD-19",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Sniper/Legends",
  "/wiki/Loku_Kanoloa",
  "/wiki/Hoth/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Return_to_Hoth",
  "/wiki/Star_Wars:_Imperial_Assault_(Fantasy_Flight_Games)",
  "/wiki/Fantasy_Flight_Games"
 ]
}