{
 "name": "Verga_Nus",
 "display_name": "Verga Nus",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Verga Mer Mining Company"
     ]
    }
   ]
  }
 ],
 "content": "Verga Nus was one of the founders of the Verga Mer Mining Company around 62 BBY, along with fellow Sullustan businessman Mer Stodiz.\nThey managed to get a quite successful operation on the moon of Tilnes, in the Cularin system, even though they had to stop using droids in it. Motivated by their success and the envy-instigated snub of other mining companies, Mer and Stodiz expanded their interest developing relationships with the Baron Administrators who controlled Cularin's platform cities, and thus obtaining power.\nHowever, when they wanted to expand their constituencies to neighbor planet of Genarius, they simply assumed that a similar tactic would work. Genarius also had cities, but they were too many to be approached at once, and the last ones to be approached later disdained Verga Mer. Besides, the political authority of the cities paled in comparison to crimelord Riboga the Hutt's power. When Nus and Stodiz discovered that and tried to meet with the Hutt, Riboga was displeased and five times refused an audience with the Sullustans. Riboga's successor, Nirama, was even less amiable to them. Their later approach to independent smugglers was also unsuccessful. Nus and Stodiz discovered later that local unaligned pirates were ignoring the Verga Mer outbound shipments while attacking incoming supply shipments, and the Sullustans were worried about this pattern.\nAround 32 BBY, Nus and Stodiz were seen commonly angry with each other in public, at least once literally fighting in Gadrin, but there was speculation about the causes and consequences of this change.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Verga_Mer_Mining_Company",
  "/wiki/62_BBY/Legends",
  "/wiki/Mer_Stodiz",
  "/wiki/Tilnes",
  "/wiki/Cularin_system",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Platform_city",
  "/wiki/Genarius",
  "/wiki/Riboga",
  "/wiki/Hutt/Legends",
  "/wiki/Nirama",
  "/wiki/32_BBY/Legends",
  "/wiki/Gadrin",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Wizards.com",
  "/wiki/Tilnes_Falling"
 ]
}