{
 "name": "Vergost",
 "display_name": "Vergost",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Vergost was a male Human commander of the Sith Empire during the Cold War. He was a Human supremacist and viewed aliens as a blight on the galaxy that needed to to be eliminated. Although respected for his effectiveness by the Moffs, Vergost's obsessions limited his advancement throughout Imperial ranks. However, one day he got an opportunity to vindicate himself and prove the worth of his genocidal beliefs to the Empire. Stationed on Nar Shaddaa, Commander Vergost was tasked to create chemicals inside an extermination factory where he would plan to use it to kill all the Evocii on the moon in order to gain an alliance with the Hutts. His plan was interrupted by a Republic individual who came to prevent the commander from unleashing the chemicals. Vergost and his guards engaged the individual, but were all beaten.\nIn the Nar Shaddaa side mission \"Extermination\", upon being defeated, Vergost insists he knows of other extermination factories the Empire had established on Nar Shaddaa, despite Kalda Biss arguing for his execution. The player can either:",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Commander/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Speciesism",
  "/wiki/Alien",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Death/Legends",
  "/wiki/Evocii",
  "/wiki/Moon/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Kalda_Biss",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}