{
 "name": "Veris_Hydan",
 "display_name": "Veris Hydan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ossus"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Veris Hydan was a human male who served the Galactic Emperor Palpatine as an adviser with the title of minister. Although he didn't have any force powers or wasn't sensitive to the Force, Hydan was an scholar of Jedi and Sith lore and history. When the Empire discovered the Jedi Temple on the planet Lothal, the minister was dispatched to oversee the excavation operations and to unlock the mysteries hidden beneath it, specifically an entrance to the World Between Worlds.\nDuring the excavation, Hydan encountered the disguised rebel infiltrators Sabine Wren and Ezra Bridger, who had disguised themselves as scout troopers. After Sabine was caught by Hydan's forces, Ezra managed to escape into the portal to the World Between Worlds. Then, Hydan attempted to use Wren to decipher the mural of the Mortis gods, the gateway to the World Between Worlds. However, Sabine rejected his offer to decipher the mural and provided very little to Hydan, even after Hydan's death troopers attacked Wren, she didn't provide anything to him.\nShortly afterwards, Hera Syndulla and Garazeb Orrelios, which were spying on the Minister and his troops, and also watching over the fellow infiltrators, invaded the excavation site and made the mobile command center in which Wren and Hydan were in shake and move until Wren could escape. Although Hydan needed more time to escape, he managed to exit the building. Shortly after they escaped, the young Bridger, exited the World Between Worlds, and the temple started to collapse. When the Rebels began their escape, Hydan admired the Mortis Gods' mural in his last moments.\nVeris Hydan was born on the planet of Ossus and at some point he became a Minister and served the Galactic Empire, he was a scholar in Jedi and Sith history and lore. He served the Empire's Emperor, Sheev Palpatine, and was given a personal guard of death troopers. Following the discovery of the Lothal Jedi Temple in 3 BBY, Hydan was dispatched to Lothal to excavate and to decipher the temple's mysteries. As the Mining Guild had already been operating on the planet, the Empire employed many of its personnel. The excavation site was heavily guarded by scout troopers, stormtroopers and death troopers. Hydan and the Emperor were very interested in the Gateway, which supposedly led to the World Between Worlds.\nTo avoid erasing any evidence to understanding the \"Gateway,\" or any information that Palpatine could use, Minister Hydan issued orders that no Imperial personnel were allowed to touch any objects excavated from the temple. In 0 BBY, the Imperial excavation project attracted the attention of the Spectres rebel cell including the Jedi Ezra Bridger, the Padawan of the late Jedi Knight Kanan Jarrus. When the rebels arrived at the temple, the Spectres divided, Syndulla and Orrelios used some binoculars to observe the excavation site while Bridger and Wren attacked a scout trooper displaying a hologram of Grand Admiral Mitth'raw'nuruodo's message to the rebels during the siege of Atollon. While the troopers were confused by the hologram, Orrelios attacked them and obtained their uniforms, which he gave to the young rebels.\nDisguised as scout troopers, Ezra and Sabine infiltrated the excavation site, when they reached the excavated artifacts, Ezra crouched and began to observe them with the mandalorian. Shortly after the rebels began examining the art and artifacts, Minister Hydan stumbled upon the two examining art and ordered them to get away from it, shortly after, escorted by his death troopers, he began to examine the artifacts and art that was touched by the rebels. He then stated that he had already stated that no personnel, other than the Mining Guild's was to touch the excavated objects. And then added that the minimal loss of evidence could lose the possiliby of understanding the gateway. Bridger then inquired the minister what was the gateway, however, he shortly interrupted himself and apologized for his behaviour. After a death trooper of his escort informed the Minister that Coruscant, specifically, the Emperor wanted to contact him, the minister then told the commanding death trooper that the conduct of the scout troopers reflected poorly on him. Then, Minister Hydan departed with the rest of the escort and left the death trooper commander to deal with the two scout troopers.\nImmediately after the incident, the commander asked the troopers their numbers and clearance numbers. However, Bridger used a force mind trick on the commander which made the commander's desire to knowing the numbers and clearance numbers of the latter non–existant.\nInside the Mobile command center, Minister Hydan informed the Emperor that the excavation had reached the roots of the temple and uncovered a painting of the Mortis gods, which was reminiscent of art and iconography found at the former Jedi Temple on Coruscant. Hydan believed that the painting was the key to unlocking the \"Gateway.\" The Emperor told Hydan that he sensed a great disturbance in the Force and opined that the death of Kanan had altered the fate of Lothal. Vowing to control the conduit between the living and the dead, the Emperor ordered Hydan to hasten his efforts.\nUnknown to Hydan, his conversation was being tapped by the Spectres, whose droid Chopper had rerouted the Imperial transmission. Acting on this information, Ezra and Sabine began to unlock the painting of the Mortis gods, which was the \"Gateway.\" Though Sabine was taken away for questioning by a group of stormtroopers, Ezra managed to unlock the \"Gateway\" by touching the Daughter's hand. Meanwhile, the stormtroopers brought Sabine into Hydan's office for questioning. After identifying Sabine as a rebel spy, Minister Hydan ordered that the camp be locked down because an intruder was on the loose. Minister Hydan, several troopers, and the captive Sabine arrived at the \"Gateway\" but were unable to stop Ezra from entering the portal. A stormtrooper tried to follow but the portal sealed and he got himself hit with a wall.\nIn response, Hydan had Sabine brought into his mobile command center for questioning. Recognizing Sabine as the talented Mandalorian rebel artist, Hydan attempted to flatter her while he drank some tea. When Hydan asked Sabine how she and Ezra had entered the portal, the Mandalorian refused to cooperate. Hydan then mocked Ezra's master Kanan, also mocking his two names, Caleb Dume and Kanan Jarrus, prompting Sabine to tell him that he was a pawn of the Emperor. Hydan countered that his power was a reflection of the Emperor's might. When Sabine mocked the Emperor for failing to unlock the \"Gateway,\" Hydan claimed that Ezra was not safe inside the World Between Worlds and that the Emperor would eventually find him. Hydan then told Sabine that the \"Gateway\" was a pathway to time and that whoever controlled it controlled the universe.\nContinuing his interrogation, Hydan told Sabine about the \"Mortis gods,\" a family of three powerful beings known as the Father, Daughter, and the Son. When Hydan asked about the differences in their depiction on the Temple and Lothal mural, Sabine feigned ignorance and unrespect towards him. Hydan then warned her not to mistake his \"pleasant demeanor\" for weakness and observed that the positions of the Loth–wolves, the Daughter's head, and the Father's hand had changed since Ezra's arrival. When Sabine defiantly taunted him, Hydan ordered one of the death troopers to strike her across the head with his rifle butt.\nAfter reasserting his authority by attacking Sabine through one of his pawns, Hydan and Sabine then discussed the painting of the Mortis gods. They concluded that the Daughter opened the portal while the Son closed it. In the meantime, Bridger had heard the voices of Obi-Wan Kenobi and Yoda, which he asked various answers to, but got no response. Shortly after, he found Ahsoka Tano and Darth Vader fighting in Malachor, when Tano was going to die at the hands of the Sith Lord, Bridger caught her shoulder and pulled back, causing her to leave the duel and survive it. After they greeted each other, and discussed the world between worlds and the possibility of saving Bridger's} master.\nShortly after their meeting, Palpatine used a sith ritual to fire a fire from a recipient, while the Emperor made the fire attack both Jedi padawans, however, they were able to stop the Emperor's attack. Tano promised Bridger that he would return with them, and Ezra departed while Tano used the Force to shield the young padawan and herself. After Bridger departed. Hera activated one of the thrusters beneath the mobile command center, causing the structure to rise and fall on its back. Sabine managed to escape with her fellow Spectres and headed towards the painting. They were joined by Ezra, who had escaped the Emperor's clutches. Ezra convinced his fellow Spectres including Sabine to help him seal the portal.\nHydan arrived with several Imperial troops but the rebels managed to escape on a Mining Guild excavation driller. The sealing of the portal caused the Lothal Jedi Temple to collapse on itself. As the temple sunk into the ground in a blinding flash, Hydan lamented through a scream that the knowledge contained in the Temple would be lost. He then fell into a chasm, which killed him.\nVeris Hydan was a human man with light skin and blue eyes. He wore a dark headgear and robes. Hydan was a scholar of Jedi and Sith history and lore. Due to his expertise in those topics, he was made in charge of the excavation of the Lothal Jedi Temple. Unlike his Sith master, he was not Force-sensitive. Hydan considered himself an art critic and used these skills to investigate the painting of the Mortis gods, which he discerned was a portal to the World Between Worlds. Hydan managed the excavation of the Lothal Jedi Temple with an iron grip and issued strict orders that no personnel were allowed to touch any of the artifacts, to avoid erasing evidence. Hydan was an astute man who quickly discerned that Sabine Wren was a rebel infiltrator. He was also a philosophical man who preferred to use words and flattery rather than force when questioning Sabine. However, Hydan was still prepared to use force against a defiant Sabine and ordered a death trooper to strike her with his rifle butt.\nHydan recognized that whoever controlled the World Between Worlds also controlled time and the fate of the universe. Hydan was a loyal servant of the Emperor and considered his own power to be a reflection of the Emperor's might. Hydan was distraught when the Spectres denied the Emperor access to the World Between Worlds and believed that the Emperor's fate was lost.\nVeris Hydan first appeared in \"Wolves and a Door\" and \"A World Between Worlds,\" back-to-back episodes in the fourth season of the canon animated television show Star Wars Rebels. The episodes aired in 2018, and Hydan was voiced by guest star Malcolm McDowell.\nAt Dragon Con 2018, Rebels showrunner Dave Filoni revealed that Hydan was actually created by Henry Gilroy for the show's third season, where he was supposed to have a bigger presence and be the mystical villain to the Jedi characters. Gilroy envisioned Hydan with an archaeological background who worked for the Emperor. His role would be that of scouring the galaxy for Jedi Temples, erasing them yet extracting secrets from them.\nIn earlier versions of the story for \"Wolves and a Door,\" Hydan was intended to be Vaneé, Darth Vader's attendant from the 2016 Star Wars Anthology film Rogue One: A Star Wars Story, but it was decided to make Hydan a new, separate character, although his design was still inspired by the one of the advisers who crowded around Vader and the Emperor. For the episodes, Hydan's character model was created by Luke Harrington.\nIn \"Wolves and a Door\" and \"A World Between Worlds,\" Hydan was only identified by his surname. The name \"Veris\" was first used in the corresponding episode guides and Databank entry posted on StarWars.com following the episodes' broadcast.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ossus",
  "/wiki/0_BBY",
  "/wiki/Lothal",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Emperor%27s_adviser",
  "/wiki/Minister",
  "/wiki/Force-sensitive",
  "/wiki/The_Force",
  "/wiki/Scholar",
  "/wiki/Jedi",
  "/wiki/Sith",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Planet",
  "/wiki/Excavation_of_the_Lothal_Jedi_Temple",
  "/wiki/World_Between_Worlds",
  "/wiki/Sabine_Wren",
  "/wiki/Ezra_Bridger",
  "/wiki/Scout_trooper",
  "/wiki/Portal",
  "/wiki/Painting_of_the_Mortis_gods",
  "/wiki/Force_wielder",
  "/wiki/Death_trooper",
  "/wiki/Hera_Syndulla",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Mobile_command_center",
  "/wiki/Galactic_Emperor",
  "/wiki/Veris_Hydan%27s_guard",
  "/wiki/3_BBY",
  "/wiki/Mining_Guild",
  "/wiki/Stormtrooper",
  "/wiki/Spectres",
  "/wiki/Padawan",
  "/wiki/Jedi_Knight",
  "/wiki/Kanan_Jarrus",
  "/wiki/Binoculars",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Battle_of_Atollon",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/C1-10P",
  "/wiki/Daughter",
  "/wiki/Mandalorian",
  "/wiki/Tea",
  "/wiki/Father_(Mortis)",
  "/wiki/Son",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Yoda",
  "/wiki/Ahsoka_Tano",
  "/wiki/Anakin_Skywalker",
  "/wiki/Malachor",
  "/wiki/Mining_Guild_excavation_driller",
  "/wiki/Wolves_and_a_Door",
  "/wiki/A_World_Between_Worlds",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/Star_Wars_Rebels",
  "/wiki/2018",
  "/wiki/Malcolm_McDowell",
  "/wiki/Dave_Filoni",
  "/wiki/Henry_Gilroy",
  "/wiki/Star_Wars_Rebels_Season_Three",
  "/wiki/Vane%C3%A9",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Luke_Harrington",
  "/wiki/Databank_(website)",
  "/wiki/StarWars.com",
  "/wiki/Category:Images_of_Veris_Hydan",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Battle_of_Jakku",
  "/wiki/Galactic_Civil_War",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/5_ABY",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/A_Princess_on_Lothal",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/The_Mystery_of_Chopper_Base",
  "/wiki/Battle_of_Yavin",
  "/wiki/Shroud_of_Darkness",
  "/wiki/Crawler_Commandeers",
  "/wiki/Twilight_of_the_Apprentice",
  "/wiki/September_8",
  "/wiki/February_14",
  "/wiki/2020"
 ]
}