{
 "name": "Verkoss",
 "display_name": "Verkoss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Verkoss was a male Trandoshan who worked as an enforcer for the Hutt Brinojja during the Galactic Civil War. In 4 ABY, Verkoss unsuccessfully attempted to capture the information merchant Rat for Brinojja on the moon Nar Shaddaa.\nVerkoss was a Trandoshan male who worked as the chief enforcer of the Hutt crime lord Brinojja during the time of the Galactic Civil War. In 4 ABY, Brinojja sent Verkoss to apprehend the information merchant Rat from a bar on the moon Nar Shaddaa. Verkoss led ten of Brinojja's thugs into the bar and confronted Rat and several Rebel Alliance agents with whom the information merchant was conducting business. An intense lightfight erupted between the two groups and Verkoss and his thugs perused Rat and the Rebels through the depths of Nar Shaddaa. Verkoss and his hoodlums eventually pinned their targets down in a dead-end alley. Determined to take the lives of Rebels, Verkoss and his forces taunted the group while laying down heavy blaster fire against them. However, Rat and the Rebels, were airlifted to safety by the YT-1300 light freighter Lazy Katarn and escaped from Verkoss.\nThough strong-willed, Verkoss was careful not to needlessly sacrifice his troops when in combat. He was multilingual and in addition to Basic was fluent in the languages Dosh and Huttese.\nDuring his attempt to apprehend Rat, Verkoss wore padded battle armor and wielded a blaster pistol, blaster carbine and a vibrodagger.\nVerkoss appeared in Soulsaber, a roleplaying adventure by written by Lee Pickler and published by RPGA in 2001. The adventure served as the second instalment of the Child of Light saga and is set within Star Wars Legends continuity. In Soulsaber the players roleplay as the Rebels that Verkoss combats on Nar Shaddaa and their fight can play out in a number of ways. If Verkoss' forces take losses against the Rebels, he urges his thugs to fall back and if events continue to turn against him, the Trandoshan orders his troops to shoot the street's glowpanels, plunging the locality into darkness. It is also possible for the battle to result in Verkoss' incapacitation and death.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Brinojja",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Rat_(Human)",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Time/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Lightfight",
  "/wiki/Death/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Lazy_Katarn",
  "/wiki/Language/Legends",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Dosh/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Padded_armor",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Vibrodagger/Legends",
  "/wiki/Soulsaber_(adventure)",
  "/wiki/Roleplaying_game",
  "/wiki/Lee_Pickler",
  "/wiki/RPGA",
  "/wiki/2001",
  "/wiki/Child_of_Light_saga",
  "/wiki/Glowpanel",
  "/wiki/Light_and_Dark_(adventure)",
  "/wiki/Child_of_Light",
  "/wiki/Standard_month/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/The_Essential_Atlas",
  "/wiki/Standard_year/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Galactic_Standard_Calendar"
 ]
}