{
 "name": "Verla",
 "display_name": "Verla",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ferren Barr's disciples"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Ferren Barr"
     ]
    }
   ]
  }
 ],
 "content": "Verla, a Force-sensitive human female, was an acolyte of the fallen Jedi Padawan Ferren Barr during the early reign of the Galactic Empire. Unlike Barr's other disciples, Verla's connection to the Force made her a candidate for Jedi training. As a result, Barr assumed the role of Jedi Master by teaching Verla to control her powers. Verla was loyal to Barr and supported his plan to sow the seeds of rebellion against the rule of Emperor Palpatine. She and the other acolytes were with their Master when he maneuvered the Mon Calamari and the Empire into a conflict that would lead to the Imperial occupation of Mon Cala.\nAs the oceanic world fell to Imperial forces, Barr and his acolytes were hunted by the Emperor's Jedi hunters, known as the Inquisitorius, led by the Sith Lord Darth Vader. Verla and her Master were confronted by the Inquisitors in Bel City, but the Jedi successfully manipulated the clone Purge Troopers to execute Order 66 against the Inquisitorius, all of whom once served the Jedi Order prior to the fall of the Galactic Republic. After escaping the Inquisitors, Barr ordered Verla to leave the planet and survive while he remained behind to personally confront Vader in single combat. It was Barr's hope that Verla would complete her training under another Great Jedi Purge survivor.\nBy the time of the Galactic Civil War, Verla adopted a calm lifestyle as a fisherwoman on Serelia. She was eventually found by Jedi trainee Luke Skywalker, who she learned, with horror, was the son of Vader.\nIn the aftermath of the Clone Wars which ended in 19 BBY, Verla encountered Jedi Padawan Ferren Barr. A survivor of the initial Great Jedi Purge, Barr sought to avenge the Jedi Order by fomenting a rebellion against the Sith-controlled Galactic Empire. To that end, he recruited several acolytes to his cause, including Verla. Unlike her fellow disciples, Verla demonstrated an ability to wield the Force. Recognizing her potential, Barr took it upon himself to train Verla in the ways of the Force as her de facto Jedi Master.\nIn 18 BBY, a year after the accession of Emperor Palpatine, Verla was hiding on the oceanic planet Mon Cala with Bar and the other acolytes. During the Battle of Dac City, Barr was informed by King Lee-Char that the Sith Lord Darth Vader and three Imperial Inquisitors had arrived to hunt the Jedi. Verla's Master revealed to his students that Vader was, in fact, Anakin Skywalker, Jedi Knight and the Chosen One destined to bring balance to the Force. Barr told the acolytes of how the Sith Lord had helped destroy the Jedi, showing holograms of it through his R1-series astromech droid Endee.\nHaving succeeded in starting a war between the Mon Calamari and the Empire, Barr and his students watched the conflict through a hologram projected by Endee. After Lee-Char informed them that Vader had discovered their location, Barr and his acolytes evacuated their refuge only to be confronted moments later by the Sith Lord and his Jedi hunters. Three acolytes were killed during the ensuing pursuit; another two elected to remain behind in order to provide Barr and Verla more time to escape the planet. However, the Padawan and his last acolyte were cornered by the Inquisitorius in Bel City. Verla watched in amazement as her Master used the Force to compel the Purge Troopers—the last batch of clones who were activated after the purge—to execute Order 66 on the Inquisitorius, all of whom were once affiliated with the Jedi Order.\nAs chaos between the Inquisitors and their troopers ensued, Verla and Barr escaped from the assassins. Shortly afterward, Verla's Master ordered her to leave Mon Cala after the fighting was over and to seek out another Jedi Master. It was Barr's hope that Verla would complete her trials under the tutelage of a fully-trained Jedi, such as Quinlan Vos, Obi-Wan Kenobi, or even Yoda. Barr confronted Vader, but was slain in a lightsaber duel against the Dark Lord of the Sith. Verla herself escaped from Bel City and later hid in a dark cave with two Quarren soldiers by the time of Mon Cala's fall to the Empire.\nOver the next twenty years, Verla attempted to do what her master had instructed her to do before his death. Verla tried to become a Jedi but had many encounters with the Inquisitorius and rare occasions a visit from Darth Vader himself. She lived a hard life, trying for years to find a teacher and lightsaber, only finding fear, pain, and death. Everyone she grew close to was killed off by agents of the dark side, or she had to leave behind when she had to run and pondered how she survived. She did seem to become familiar with certain things about the Jedi history as she was aware of the High Republic Era, and knew what holocrons were. Added with she knew the saying of \"Do or do not. There is no try.\" She eventually became aware of an ancient Jedi outpost located on Tempes. She knew what she needed was inside a Lightsaber and holorons, but never entered when she arrived feeling something dark and malevolent inside. She sometime after that eventually gave up on her Jedi path, thinking she was told to do something by a dead man.\nBy 3 ABY, Verla lived on Serelia and worked at the fishing docks on the oceanic planet. Sometime after his duel against Darth Vader on Cloud City, the Jedi trainee Luke Skywalker experienced a Force vision while training with a blaster in which a hooded Verla grabbed his falling lightsaber after losing it during the duel and asked him to follow his destiny. Upon receiving a similar vision while searching his lightsaber through the dump of Cloud City, Skywalker once again got a glimpse of a hooded Verla holding his lightsaber while standing on the waters of Serelia and asking him to follow his destiny.\nWhen Luke arrived on Serelia, Verla was discussing with the hauler droid TRK-R, who was going to collect a cargo of fish Verla had fished. Upon approaching her and asking her if she was a Jedi, Verla dropped the catch of fish on Skywalker and TRK-R before fleeing, thinking that Skywalker was another Inquisitor hunting her down. Fleeing across the water with her boat, Verla lured Skywalker onto an island and trapped him. With Skywalker at his mercy, Verla asked him what he wanted, and Skywalker told her about his vision and that he was a Jedi like her. However, Verla told him that she was no Jedi and proceeded to share her views on the Jedi to the young boy once she realized he wasn't an Inquisitor. However, as she told him about the Jedi Purge, the Inquisitorius and Darth Vader, she sensed something in him when she uttered the Sith Lord's name.\nAfter probing Skywalker's mind, Verla realized with horror that Luke was none other than Darth Vader's son. Then, Verla attempted to drown Skywalker to death. However, she was then knocked out by R2-D2, who then rescued Skywalker. Skywalker waited by Verla until she awoke, telling her of how he was not like his father and asking for more information about the Jedi. On the condition he would let her live her peaceful life once he was gone, she obliged and then told him he could find a lightsaber, which Skywalker was in need of after losing his previous blade to his father on Cloud City, in a Jedi outpost left abandoned on Tempes, although she also warned him of a dark presence stalking the grounds.\nVerla was a human female with blonde hair and light skin. Like her fellow acolytes, she was loyal to Ferren Barr and his cause to liberate the galaxy from the rule of the Galactic Empire. She was an obedient apprentice who obeyed her Master without question; when the Inquisitors threatened Barr's life, Verla was ready to die fighting alongside the Jedi. When Barr succeeded in turning clones against the Inquisitorius, Verla expressed amazement at her Master's ability to use Order 66 to their advantage.\nLater on her life, however, Verla's views on the Jedi changed considerably. When Luke Skywalker met with her on Serelia during the Galactic Civil War, Verla told him that whoever wanted to be a Jedi was a fool and that all things he had heard about them were only the positive aspects of their Order while omitting their failures. She considered Skywalker to be a poor, deluded kid and a sucker who might have thought that he had a Jedi destiny for wiggling a rock with the Force one day. By this time, Verla had also grew to be paranoid that upon first meeting Skywalker, she fled from him as she thought that the boy could be an Inquisitor.\nAs a Force-sensitive, Verla possessed the ability to wield the power of the Force. Barr, who offered to teach Verla how to control her powers, passed on his limited Jedi training as a Padawan to Verla, who became his apprentice in the ways of the Force. Even before her training began, Verla was able to levitate a small object as a demonstration of her talent. By the time she confronted the Inquisitorius, Verla had gained enough knowledge to enhance her physical abilities, allowing her to leap over the Jedi hunters with the aid of the Force and her Master. She was also skilled in her ability to \"read\" people, able to discern whether someone was attempting to lie to her or read someone's memories.\nVerla first appeared in the canon 2018 comic Darth Vader  14 written by Charles Soule and penciled by Giuseppe Camuncoli. In issue 15, Verla's hair appears darker than in the other Star Wars: Darth Vader  issues.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Planet/Legends",
  "/wiki/Verla_Klest",
  "/wiki/Star_Wars_(2020)_6",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Ferren_Barr%27s_disciples",
  "/wiki/Ferren_Barr",
  "/wiki/Jedi_Master",
  "/wiki/Force-sensitive",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/The_Force",
  "/wiki/Jedi_training",
  "/wiki/Force_power",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Mon_Calamari",
  "/wiki/Battle_of_Dac_City",
  "/wiki/Invasion_of_Mon_Cala",
  "/wiki/Mon_Cala",
  "/wiki/Ocean",
  "/wiki/Planet",
  "/wiki/Imperial_Military",
  "/wiki/Jedi_hunter",
  "/wiki/Inquisitorius",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Bel_City",
  "/wiki/Mind_trick",
  "/wiki/Cloning",
  "/wiki/Purge_Trooper",
  "/wiki/Order_66",
  "/wiki/Jedi_Order",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Republic",
  "/wiki/Lightsaber_duel",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Time",
  "/wiki/Galactic_Civil_War",
  "/wiki/Fishing",
  "/wiki/Serelia",
  "/wiki/Luke_Skywalker",
  "/wiki/Clone_Wars",
  "/wiki/19_BBY",
  "/wiki/Sith",
  "/wiki/18_BBY",
  "/wiki/Standard_year",
  "/wiki/King_of_Mon_Cala",
  "/wiki/Lee-Char",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Jedi_Knight",
  "/wiki/Chosen_One",
  "/wiki/R1-series_astromech_droid",
  "/wiki/Endee",
  "/wiki/Ferren_Barr%27s_cave_refuge",
  "/wiki/Trooper",
  "/wiki/Assassin",
  "/wiki/Quinlan_Vos",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Yoda",
  "/wiki/Duel_in_the_Royal_Command_Bunker",
  "/wiki/City",
  "/wiki/Cave",
  "/wiki/Quarren",
  "/wiki/Soldier",
  "/wiki/Tempes",
  "/wiki/3_ABY",
  "/wiki/Duel_on_Cloud_City",
  "/wiki/Cloud_City",
  "/wiki/Force_vision",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Water",
  "/wiki/Hauler_droid",
  "/wiki/TRK-R",
  "/wiki/Jedi_outpost_(Tempes)",
  "/wiki/The_Grand_Inquisitor",
  "/wiki/Hair",
  "/wiki/The_galaxy",
  "/wiki/Galaxy",
  "/wiki/Telekinesis",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_14",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Darth_Vader_(2017)_15",
  "/wiki/Star_Wars:_Darth_Vader_(2017)",
  "/wiki/Darth_Vader_(2017)_16",
  "/wiki/Darth_Vader_(2017)_17",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/Star_Wars_(2020)_3",
  "/wiki/Star_Wars_(2020)_4",
  "/wiki/Star_Wars_(2020)_5",
  "/wiki/Star_Wars_(2020)_20",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}