{
 "name": "Vermon_Skeetz",
 "display_name": "Vermon Skeetz",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  }
 ],
 "content": "Vermon Skeetz was a Human male who lived on Corellia during the time of the Galactic Civil War.\nVermon Skeetz was mentally ill but managed to be fine as long as he took his medication. By the time following the Battle of Yavin, Vermon was captured by the Corellian slavers and enslaved in the Corellian Slaver Bunker near Tyrena. During his captivity, he befriended with a man named Akers Radch. In 1 ABY, Vermon Skeetz finally managed to escape the bunker with a group of slaves led by Kyran Silene. The escaped slaves did not reach Tyrena and established a camp in the wilderness. However, Vermon lost his medicine during his escape and therefore experienced a psychotic episode. A spacer recruited by Kyran Silene's wife later arrived at the camp. The spacer planed to infiltrate the bunker to find evidence of the slaver operations for the Corellian Security Force. The spacer also met in the camp a crazy Vermon Skeetz who was ordering to assassinate Akers Radch. Once in the bunker, the spacer met Akers and the man helped to retrieve Vermon's medicine. The spacer finally broadcasted the slavers' records on the CorSec emergency request channels, leading dozens of CorSec agents to quickly move to the slaver bunker and free all the slaves. After he escapaded the bunker, Akers brought the medicine to Vermon who quickly recovered from his crisis and apologized for his aggressive behavior.\nVermon Skeetz was a non-player character in the 2003 video game Star Wars Galaxies, a massively multiplayer online roleplaying game developed by Sony Online Entertainment and published by LucasArts, prior to its closure on December 15, 2011. Vermon Skeetz was added to the game with the update named \"Chapter 1: The Corellian Captives\", published on June 8, 2006.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Blue",
  "/wiki/Akers_Radch",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Corellia/Legends",
  "/wiki/Time/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Corellian_slavers",
  "/wiki/Slavery/Legends",
  "/wiki/Corellian_Slaver_Bunker",
  "/wiki/Tyrena/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Kyran_Silene",
  "/wiki/Madison_Silene",
  "/wiki/Corellian_Security_Force",
  "/wiki/2003",
  "/wiki/Video_game",
  "/wiki/Sony",
  "/wiki/LucasArts",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/June_8",
  "/wiki/2006",
  "/wiki/Star_Wars_Galaxies:_Starter_Kit",
  "/wiki/Opening_crawl",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ruwan_Tokai",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars_Galaxies:_Rage_of_the_Wookiees",
  "/wiki/Blockade_of_Kashyyyk_(1_ABY)",
  "/wiki/The_Star_Wars_Holiday_Special",
  "/wiki/The_Nightsister%27s_Revenge",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Strongholds_of_Resistance"
 ]
}