{
 "name": "Vernestra_Rwoh",
 "display_name": "Vernestra Rwoh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 248 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mirialan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Purple-black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Stellan Gios"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Imri Cantaros"
     ]
    }
   ]
  }
 ],
 "content": "Vernestra Rwoh was a Mirialan female Jedi Knight alive during the High Republic Era. She was also occasionally nicknamed \"Vern,\" although she disliked it. The former Padawan of Jedi Master Stellan Gios, she was promoted to the rank of Knight at the age of fifteen, making her the youngest Jedi to hold that rank in a long time. Several months later, after turning sixteen, Rwoh's first proper Jedi mission was supervising Avon Starros, an aspiring inventor and the daughter of Senator Ghirra Starros, at the remote outpost Port Haileap. However, when Rwoh and Starros joined a party traveling on the starship Steady Wing to the Starlight Beacon, a new space station, the cruiser was bombed, leading the two of them, along with Padawan Imri Cantaros, Starros' protocol droid J-6, and Honesty Weft, the son of a Dalnan ambassador, stranded on the jungle moon Wevo after evacuating the stricken ship in a shuttle. Vernestra, although young for her rank, was devoted to the ideals of the Jedi Order and wished to help others as best she could.\nVernestra Rwoh, a Mirialan female, was born around the year 248 BBY. She joined the Jedi Order at a young age, with her family group celebrating the discovery of her Force-sensitivity. She eventually became the Padawan of a human male Jedi Master, Stellan Gios. Vernestra was enough of a prodigy that she eventually attained the rank of Jedi Knight at the age of only fifteen, making her the youngest Knight in a generation.\nA few months later, during which time she had turned sixteen, Rwoh, on her first proper assignment, was tasked with taking care of twelve-year-old aspiring inventor Avon Starros while she was at the outpost Port Haileap, under the supervision of the outpost's marshal, Jedi Master Douglas Sunvale. Although Avon's mother, Senator Ghirra Starros, had sent her daughter to the remote spaceport to get her out of trouble and to make her appreciate her life on Coruscant more, Rwoh believed that being at Port Haileap only gave Avon more opportunities to do whatever she wanted. Rwoh liked Avon Starros and found her inventions fascinating, but the two often butted heads because Starros disliked being told what not to do. Starros was accompanied by her protocol droid, J-6. While at Port Haileap, Rwoh had a dream about a new design for her lightsaber which would also allow it to become a lightwhip. After completing the modification that very night, Rwoh kept her weapon's new design secret, practicing with the whip in private and not telling either Master Sunvale or her former Master Gios.\nMaster Sunvale eventually requested that Starros and Rwoh join the passengers of the starship Steady Wing, which was taking a Dalnan delegation, including Ambassador Weft and his son Honesty, to the dedication ceremony of the new space station Starlight Beacon. Although Starros would not play any official role on the journey and her mother had not sent for her, Sunvale hoped that she would befriend the ambassador's son, who was the same age, and ease the Dalnans' concerns about the Galactic Republic. Rwoh also hoped that the two would become friends, as she felt that Starros needed one.\nOn a last walk around the port prior to departure, the young Jedi Knight caught Starros messing around with a homemade scoot speeder, catching her in midair with the Force and chiding her for not being on board. After the arrival of J-6, the three headed for the Steady Wing. As they were about to board, Rwoh suddenly had a foreboding feeling about an Aqualish mechanic who was one of several workers tinkering with the ship, but she tried to dismiss the feeling as it seemed to be nothing. After boarding the cruiser, Rwoh parted ways with Starros and J-6 prior to the vessel's departure from Port Haileap.\nRwoh later met Master Sunvale and his Padawan Imri Cantaros in one of the Steady Wing's dining areas, where they would be dining with the Dalnan delegation, including the Wefts, Janex, and Starstriker. Starros arrived late with J-6, stating her dress had needed refitting, and Rwoh was struck by the sharp contrast with the girl's usual appearance. The party sat down to eat, but just as they were about to begin, the Steady Wing shook. It quickly became clear the ship was in trouble. When the room was exposed to the vacuum of space, Rwoh launched herself towards the breach in order to clear debris preventing a blast door from sealing with her lightsaber. Sunvale ordered Rwoh to lead the way as the group left the room and headed for the escape pods. However, it soon became clear that the pods were gone, even though the Steady Wing was carrying far less passengers than its full possible capacity.\nRwoh, Starros, J-6, Cantaros, and Honesty Weft were separated from Sunvale and the others by a closing blast door. Searching for a way to escape, the group located a hangar containing a maintenance shuttle. With Starros quickly claiming piloting duties for herself, the group fled the doomed Steady Wing shortly before it exploded with no survivors.\nAs their ship traveled through space, Rwoh did her best to comfort Cantaros, who had lost his master, and Honesty, who had lost his family. As they ran low on supplies, Rwoh requested Cantaros help her probe for habitable planets using the Force. Together, the two Jedi sense a nearby moon, Wevo, and guide their ship to land there.\nRwoh suggested that the group hike through the jungle to reach higher ground, which would give them safety in case of a storm. During the hike, Starros revealed that she took a scout droid from the ship, much to Rwoh's agitation. While clearing the brush, Rwoh activated her lightwhip to clear the area quicker. Cantaros and Rwoh came upon a massive boulder, which Rwoh believed is blocking a cave. After some time in the cave, Cantaros and Rwoh felt a disturbance in the Force. After investigating, they stumbled upon a cargo hauler crushed by the boulder that Cantaros had moved on their first day on the moon. Upon closer inspection, they found two members of the Nihil that had pursued them there, an Aqualish male named Gwishi and a Human female named Klinith Da. Returning to the cave, Weft informed the group of the Nihil, who were more than ordinary pirates.\nThe next day, Rwoh awoke and found Cantaros and Weft missing. Believing they had gone to attack the Nihil despite her warnings, Rwoh led Starros after them. They made their way to the cargo hauler, and J-6 lured out the Nihil before pulling out her many arms, each holding a blaster. Rwoh activated her lightsaber and joined the blaster fire, first attacking the Aqualish pirate, knocking him unconscious. After being held at blasterpoint by the human woman, Rwoh realized that someone had Force choked her opponent, realizing it was Cantaros. Using the Force, she picked him up and flung him over the ship. Rwoh then confronted him and realized that Cantaros' anger was drawing him to the dark side. Cantaros decided to exact his revenge and kill the pirates, telling Rwoh that he would kill her to if she stood in his way. Rwoh flipped over Cantaros, and pulled back his arm using her lightwhip, causing him to drop his lightsaber. With another strike of her lightwhip, Rwoh destroyed his fallen lightsaber. Two days after the battle, the group was rescued by the Jedi, Master Sskeer and his Padawan, Keeve Trennis.\nAfter their battle with the Nihil, Rwoh and Cantaros traveled to Starlight Beacon for the dedication ceremony. Cantaros ashamedly approached Rwoh and apologized for his loss of composure on Wevo. However, Rwoh gently accepted his apology and then offered to take Cantaros on as her Padawan, to which Cantaros was extremely grateful. He delightfully accepted, and new master and apprentice attended the dedication ceremony together.\nRwoh joined Jedi Master Avar Kriss aboard the Ataraxia to a deserted ship in the Kazlin system that Jedi Master Sskeer and Jedi Knights Terec, Ceret, and Keeve Trennis had found. Following a lead to Sedri Minor, Sskeer and Ceret depart as Rwoh joined Kriss and Trennis assessing the damage on the Hutt ship. After transporting the Unidentified Hutt trader back to Starlight Beacon, Rwoh and Cantaros assisted Archivist OrbaLin in performing an autopsy on the dead Hutt. While performing the autopsy, Orbalin determined that the cadaver was infested, by the Drengir. It began wreaking havoc on Starlight, and Rwoh, Cantaros, and Maru began fighting the Drengir. Cantaros was hit by the Drengir, but Rwoh freed him before he could be infested. After a mind touch by Trennis on Sskeer, who had already been infested, the Drengir pulled back after Trennis convinced them the meat was spoiled.\nRwoh contacted the Star Hopper and spoke to Jedi Master Kantam Sy, Padawan Lula Talisola, and Zeen Mrala. Rwoh stated that she looked into the initial battle on Trymant IV where the Jedi had found Mrala, and noticed that the Nihil didn't follow their usual raid patterns. She suspected that those raiders might have something to do with the Nihil she had faced on Wevo. She turned to Mrala and asked if it was true that one of her closest friends, Krix Kamerat had ran off with the Nihil, and Mrala gave a small nod in confirmation. Rwoh continued that the Jedi believed Elder Tromak had some ancient information the Nihil wanted, and Master Yoda went to investigate. Talisola asked if there was any word from Master Yoda, and Rwoh replied that there was not but they would continue to investigate, revealing the purpose of her call. She asked Master Sy if they and the Padawans could investigate as well, perhaps finding some answers from the elders that were not taken from the Nihil. Sy accepted and Rwoh quickly reminded them of how dangerous the Nihil were, and ended the transmission.\nAfter consulting with Elder Barbatash, Master Sy and the Padawans headed for Stygmarn system, where Barbatash informed them the Nihil cell of Kamarat was located. Sy spoke with Rwoh again, who informed them there was a moon on the far edge, and Sy said he would meet her there. Upon meeting up, Rwoh informed the group that she and Talisola would go while Sy and Mrala would stay on the bridge of the Star Hopper, along with Rwoh's Padawan Cantaros, who she wanted to get experience in in running operations from the bridge.\nRwoh asked Talisola to pilot the Varonchagger, to which she happily agreed, eager to show off her piloting skills. Once on their way, Rwoh asked Talisola what they should do, much to Talisola's surprise. She said that Rwoh was supposed to tell her what to do, immediately regretting her words, but Rwoh laughed and said she could tell her what to do, but then she wouldn't learn. Talisola finally said they saw a signal from this area, and they would fly low with their scanners on, and once they found the Nihil base they would stay out of sight and gather information. All of a sudden, a flurry of dots erupted on the scanner, and Rwoh activated shields and cannons. The duo deduced that the dots were Nihil ships on the move, and Rwoh informed Cantaros to keep an eye out in that sector. Cantaros acknowledged and also mentioned that they had received a message from Starlight and he was forwarding it to her, because they knew she was investigating the Nihil. All the Nihil ships in front of them jumped to hyperspace, and then the message from Starlight came through. It showed a very confused Neimoidian and a young Jedi Padawan, who informed them about a possible Nihil attack at the Republic Fair on Valo, and that the comm tower had been sabotaged. Rwoh declared they would head for Valo to make sure of the threat, and they would tell Starlight what they've found.\nWhile en route to Valo, Rwoh asked Talisola what was bothering her, and Talisola simply asked how she did it. Rwoh replied that they can't go into details of their final trials, but then realized that wasn't what she was asking. Talisola finally asked that as Jedi, they're not supposed to form attachments, yet she was attached to everything around her - her friends, her master, and even her ship, finishing off by saying she was a failure. Rwoh slid a comforting hand on Talisola's shoulder and assured her that she was very strong and being a Jedi wasn't about not having feelings or caring about anything, but it was about balance. A Jedi must be able to balance the Force within themselves and the Force around them. Rwoh gave an example that she would save her master and her friends if they were in danger, but she would also save an enemy, because she cared about life. Talisola began to see the light in Rwoh's words, realizing that her actions and choices revealed the balance a Jedi required. With both of them pleased, they arrived on Valo to find an attack already underway.\nRwoh ordered Talisola to get a message to Starlight, and she replied that comms were down. Talisola began firing on the Nihil, feeling regret after killing one of them. Rwoh slid a hand over Talisola's and told her they would heal and rebuild, but now they could only make sure they got out of this alive. Talisola asked Rwoh if she was scared, and the Knight replied that she was terrified, but this is what she meant by balance. If she wasn't scared, she couldn't be courageous, but if she was overcome by terror, she would be useless. After being hit multiple times and losing shields, Rwoh crashed the ship near the bank of a lake. She activated her lightwhip to get them out of the ship, telling Talisola not to tell anyone about it. Rwoh said she would go find the elder Jedi and make sure the chancellor was safe, and ordered Talisola to find the Padawan who sent them the message and find out what he knew.\nAfter the Padawan Ram Jomaram had restored the communication on Valo, Rwoh provided some much needed assistance at the Battle of Valo. Along with the padawans of the Star Hopper, Rwoh came to the aid of her former master Stellan Gios and the countless other Jedi on the ground and in the air at Republic Fair on Valo.\nRwoh and her Padawan were present at the second battle of Cyclor, where her former master Stellan Gios prepared a trap for the Nihil of Pan Eyta's Tempest. Rwoh, along with ships belonging to the Jedi, Republic, and Togruta destroyed the entire tempest over the Cyclor Shipyards.\nAfter the victory over Cyclor, Rwoh, Gios, and the rest of the Jedi Drift traveled to Grizal, where Jedi Elzar Mann, Indeera Stokes, Padawan Bell Zettifar, and Ty Yorrick infiltrated the Nihil base. Before engaging the enemy, Gios teased his former Padawan by asking her not crash this ship, which earned him a playful nudge through the Force.\nSome time after the Attack on Valo, Rwoh and Cantaros were stationed back on Starlight Beacon, turning down an offer to return to the temple at Port Haileap. While in the meditation chamber, Cantaros informed Rwoh that a comm droid was waiting for her outside the chambers. While trying to unlock the comm droid, Rwoh encountered Padawan Reath Silas, who had just returned from the ruins on Genetia with his master, Cohmac Vitus. With the help of Silas, Rwoh unlocked the droid and learned that her former master, Stellan Gios, was calling her. Gios informed her that she and Padawan Cantaros were being recalled to the Jedi Temple on Coruscant to assist a senator, who had requested her presence by name, to handle an issue in the Berenge sector. Rwoh was displeased with the news, feeling she could do more good in taking down the Nihil.\nLater that day in the community dining area, Rwoh met up again with Silas, where she introduced him to Cantaros. Using his empathetic abilities, Cantaros soothed Silas' mild jealousy about Rwoh being a Jedi Knight whereas he was still a padawan, which displeased both Rwoh and Silas. Rwoh admonished Cantaros, saying that he must learn to control his abilities without using it to manipulate others. She suggested talking to Jedi Master Estala Maru, who may know some exercises to help Cantaros.\nRwoh and Cantaros soon made their way to the restricted section of Starlight Beacon, stopping to soak in the view from the Jedi Tower. The pair discuss Cantaros empathetic abilities, with him mentioning that something had changed after Valo. Unable to explain, Cantaros opted to show Rwoh what he meant, and she felt her worry and concern melt away. Cantaros asked if his abilities came from the dark side, which Rwoh confirmed that they did not. She told him that his abilities were not a bad thing, but that he should be mindful not to overstep boundaries. Rwoh recalled her days as a Padawan, when she had ability of losing herself in hyperspace, which had since faltered.\nCantaros and Rwoh went out looking for Jedi Master Avar Kriss, finding her in the marshal's grand office speaking with Master Gios. Kriss invited them in, and Gios reiterated that he expected his former Padawan on Coruscant as soon as possible. Rwoh asked for a moment alone with Kriss, and Cantaros exited. Rwoh told Kriss that she has not had leave to document her lightsaber modifications with the main temple, and fears that her former master may not agree with the modifications, seeing as he was a stickler for protocol. Kriss told Rwoh that she should hold off telling Gios for some more time until she was able to work out her own feelings regarding the modifications.\nLater that night, Rwoh caught Silas roaming the halls of Starlight, neither of them able to sleep. Rwoh mentioned that it always took her body some time to readjust to the gravity on Starlight. Rwoh asked Silas if he would like to duel, noting that it is something she does when she is unable to sleep, to which he agrees. Both grab their tunics and Training lightsabers. Rwoh gave tips to Silas as they duelled, telling him to breathe or else he will end up exhausted very quickly. After a long while, both Silas and Rwoh felt their attacks slowing, with Rwoh finally back flipping over Silas and pointing the saber to his back, causing him to surrender.\nRwoh applauded him on his impeccable form, to which he replied that he still lost. Rwoh told him that he had opportunities to win many times, and only lost because he focused too much on defense. She told him that she understands the Jedi Order wants them to defend life, which Silas emulated into his dueling, but she was firm in her belief that sometimes the best way to defend life is to go on the offensive. No longer on the subject of dueling, Rwoh told Silas that she thought when she became a Jedi Knight, she would have more insight into the For e and her duty as a Jedi, but she is still at the same place a year later. She worried that no one takes her seriously because of her young age, with the exception of her Padawan. Rwoh wondered if wanting to seek out the Nihil and destroy them is the right thing to do, because, while taking so much life, they would be saving much more life by destroying them.\nThe next morning, Rwoh awoke feeling better than she had in a long time, citing dueling with Reath that helped her. She found Cantaros and the pair went to the quartermasters office to locate a ship to return to the Jedi Temple on Coruscant. They headed to a desk at the end of the hall, where a young human Padawan was seated. The Padawan, Preeti, was nervous, but eased up after seeing Cantaros. Cantaros introduced Preeti to his master, who was in awe of Rwoh, and mentioned that Rwoh passed her trials at age fifteen. Rwoh asks Preeti for a ship, but she replied that she cannot issue a ship to them, under orders from Master Nubarron. Nubarron telepathically informed Rwoh that she is a terrible pilot and he will not let her destroy what is left of his fleet. Rwoh and Cantaros are saved by Master Cohmac Vitus and his Padawan Reath Silas, who offer the pair to join them on their ship, as they are also heading to Coruscant. Vitus asked Rwoh how many ships she had destroyed to upset Nubarron, to which she replied two since she had come to Starlight. After finding out that her master was Stellan Gios, Vitus remarked that he was an excellent Jedi, but not the greatest pilot. Together the group headed for their ship, the Fraunesaa.\nWhile en route to Coruscant, Vitus planned to jump to hyperspace closer to Starlight than usual, prompting a question from Cantaros. Vitus replied that the reason for it was to avoid hyperspace lanes that had been flagged by the Republic, due to reports that some ships had been pulled out of hyperspace, back into real space, and then disappearing. As soon as the Fraunesaa jumped to hyperspace, Rwoh saw herself on a desert planet she had never seen before, due to her hyperspace ability that had been dormant for many years. She walked along a ridge that led to the planet's Jedi Temple, as she saw a blue skinned Jedi exit, lightsaber in hand, ready to take on the Nihil. She headed towards a lodging house where a family of Ugnaught's was huddled, and on the table lay a small box they had stolen from the Nihil. A voice called to Rwoh, which told her to take the box and find her. As she reached for the box, Rwoh was waken by Cantaros, who was concerned about her. Vitus informed them that the Jedi Temple on Tiikae had requested for aid fighting the Nihil. Silas, Rwoh, and Cantaros left to aid them. Arriving, Rwoh recognized the town as the one she had just seen in her vision.\nThey joined forces with the Chagrian Jedi Master Oprand Qwen, the marshal on Tiikae. Qwen told them that he was the only Jedi on site, and the San Tekka clan Deputy was unavailable at the time, leaving them with no backup. Rwoh and Silas made way to the lodging house that the Nihil had taken over, fighting a barrage of blaster bolts fired that way. While searching the house, Rwoh heard the same voice from her vision again, telling her to \"find the cube.\" The Nihil re-emerged from a doorway, which Rwoh cleared and entered, and found the same family of Ugnaughts from her vision, bound and gagged. Rwoh spotted the Nihil fleeing on a speeder bike, as another speeder headed her way, with a feminine voice telling her to jump on.\nWhile pursuing the Nihil, Rwoh switched places with the driver as she jumped off their speeder onto the speeder of the fleeing Nihil. Rwoh's own speeder was engulfed in flames, causing her to jump off as well. The mystery woman had killed all but one of the Nihil, the last one becoming prey of the woman's Vollka, Remy. The woman introduced herself as Jordanna Sparkburn, the San Tekka Clan Deputy on Tiikae. Sparkburn informed Rwoh that over the last year, Tiikae had become a warzone, with trouble from the Nihil, Hutts, Zygerrians, and the Drengir. Sparkburn found a cube-shaped box on one of the bodies, with Rwoh recognizing it as the same box from her vision. Silas arrived on a speeder, and he, Rwoh, and Sparkburn headed back into town. The group decided that Sparkburn would join the Jedi heading to Coruscant, with the rest joining Master Qwen en route to Starlight Beacon. Silas returned from the lodging house, showing the Jedi a high powered comm unit, where a message from a Nihil girl played, directed at the Ugnaught family. She told the family that the Nihil know they took it, and if they continued to resist, they would be dead soon. Silas identified the girl as Nan, who he and Vitus had met a year prior on the Amaxine space station. Rwoh pulled out the box she had taken from the Nihil, suggesting it was the item the Nihil were after. The group took their leave to Coruscant, leaving Master Qwen with the residents of Tiikae to make their way to Starlight Beacon.\nUpon arriving on Coruscant, Silas and Cantaros headed to the Jedi Temple library. Meanwhile, Vitus guided Rwoh to the lift that would take her to her destination before taking his leave. Confused as to where to go, Rwoh was greeted by Master Yaddle, who instructed her to not reject her instincts. Yaddle pointed Rwoh in the direction of Gios' office, and the young Jedi Knight prepared to meet her former master.\nAs she entered his office, she was introduced to Emerick Caphtor, who had heard much about her from her former master. Gios informed her that her mission was to accompany Senator Ghirra Starros and a member of the Graf family to the Berenge sector, where the Graf family believed the Nihil had been testing experimental technology. Trying to hide her disappointment, Rwoh asked why a Jedi was needed for this mission, to which Gios answered that her affinity for hyperspace might prove useful in the situation. Trying to avoid the topic of her lightwhip and her hyperspace vision, Rwoh showed Gios the box she had found on the body of the Nihil. After a short while, Gios recognized one of the glyphs as on old Prospector symbol, and advised her to speak to Professor Thaddeus Wolk.\nLater that day, Senator Starros brought Rwoh and Cantaros into her office, where she met with Xylan Graf and Sylvestri Yarrow. Starros informed Graf that the Jedi and her Padawan would accompany he and Yarrow on their trip to the Berenge sector, providing security. Graf countered by calling Rwoh and Cantaros children multiple times, much to Rwoh's annoyance. Yarrow informed Graf that she would like to meet with Professor Wolk, and Rwoh and Cantaros joined her, mentioning they also needed to visit him. Rwoh asked Yarrow if she had done something to offend her, noticing Yarrow's clear displeasure of the Jedi. She replied that it wasn't personal, and asked if they knew Senator Starros was going to use them like that. Yarrow explained that Starros had used to Rwoh and Cantaros to get under Graf's skin, something that both Jedi has missed entirely. The group was met by a girl named Kyrie, who led them towards Wolk's office. Nearing their destination, the group ran into Sparkburn, who froze at the sight of Yarrow. Rwoh and Cantaros carried on, leaving Sparkburn and Yarrow behind. As they were trying to find Wolk's office, the hallway exploded.\nRwoh used the Force to block the debris, but she and Cantaros were still hit. A Gungan came running through the smoke, not long before a blaster bolt hit him squarely in the back. Rwoh pursued the shooter, and Republic forces met them at the other end of the hallway, firing a barrage of shots in their direction, killing the shooter. Rwoh was greeted by a Balosar woman, Ashdree Marq. Marq interrogated Rwoh about the events that had conspired on their walk back to Cantaros, coming the the conclusion that someone had tampered with their security feed before the attack. Yarrow and Sparkburn arrived on the scene, informing Rwoh that the Gungan—Professor Wolk—was already dead when they arrived.\nAfter being ushered away from the Senate building, the group made way to a nearby diner where they discussed Wolk's death and the parties responsible. The answer was given by Graf, who appeared with his Gigoran bodyguard Basha. Graf informed them that Wolk was killed to throw suspicion on Graf and his family. While discussing their trip to the Berenge sector, Graf asked Rwoh why she had to see Wolk, and she informed him about the puzzle box. Graf told Rwoh that his grandmother would be able to read it, and that their first stop would be at her compound near Neral's moon, prompting confusion from the group. Graf said he needed a craft from the compound that had experimental weapons, mentioning a regular cruiser would not suffice. He offered the group to spend the night at his tower, to which everyone reluctantly agreed.\nThe next morning in Graf's tower, Rwoh asked Yarrow why she didn't like the Jedi, to which she replied that she doesn't not like them, just that she wondered why the Jedi were never there when they were needed. Yarrow pointed out that the Nihil had been terrorizing the galaxy for years, but only after Valo did the Jedi take them seriously. Rwoh mentioned that the lift doors were locked, and that his Grand Theljian snow dog, Plinka was on the guest floor, causing suspicion among the two about Graf's intentions. Sparkburn, who was surprisingly calm about the situation, argued that there could be many reasons about the lift doors being locked and Plinka being on the guest floor. Just then, Graf entered through the lift, Vitus and Silas tailing him. Graf informed he group that there had been another attack attempt, resulting in the locked lift doors. Vitus added that he and Silas would be joining them, under request of Master Gios.\nWhile reviewing their next steps, Vitus inquired about Graf's true intentions for the sector, to which he replied that the sectors lack of planetary life made it excellent for risky experiments. Yarrow asked why it was necessary to involve Jedi into the matter, and Vitus replied he also wondered why they were called into to settle a business dispute. Rwoh wondered internally why Vitus and Silas had been assigned to accompany them, thinking the reason was Graf calling her a child a day prior. After settling the worries for a possible Nihil trap, the group headed out for Neral's moon.\nAboard Graf's pleasure yacht, the Resplendent Pearl, Master Vitus walked the younger Jedi through guided meditation to help them better work together should a battle situation arise. After sending the Padawans away, Vitus put Rwoh's mind at ease, informing her that he could tell from her face that she thought Gios had sent him to keep an eye on her, though that was not the case. Vitus mentioned that Gios felt that Senator Starros had not been completely honest in her request for Rwoh's assistance, and there was politics being played, with the Jedi unsure about both Graf's and Starros' true motivations. Vitus told Rwoh that he believed it was wrong for Gios to push Rwoh to become a Knight so early and for her to take a Padawan, not because he doubted her abilities, but because she is still young and doesn't have much experience. Vitus informed her that being a Jedi is more than having a strong connection to the Force, but also having an understanding of the galaxy. Rwoh retorted that the Jedi should be out fighting the Nihil, not settling business disputes. Vitus finally assured Rwoh that his presence had nothing to do with her abilities and everything to do with politics. After Vitus' departure from the hold, Rwoh closed her eyes to let go of the anger built up in her at Graf and Senator Starros for manipulating her, and when she opened them she found herself aboard a completely different ship.\nShe heard the same voice from earlier telling her she \"draws near\" and that \"the way is clear.\" Rwoh followed the voice down a hallway until it branched, and she took the left path. The voice called out \"so close\" and Rwoh began to run, only to realize she was not going anywhere. Nearing the voice, Rwoh was woken by Cantaros, to whom she revealed her hyperspace episodes. Yarrow stepped into the hold and informed Rwoh and Cantaros that while double checking the coordinates, she discovered that the destination Graf had plotted was actually going to the Dalnan sector, not Neral's moon. Rwoh was seated in the crew mess when Yarrow confronted Graf about the change in coordinates, to which he replied he did so to ensure they were not being followed, by the San Tekka clan nor the Nihil.\nRwoh watched in awe of the Graf family compound, called Everbloom, as the Resplendent Pearl approached Neral's moon. As they prepared to dismount the ship, Cantaros informed Rwoh that he had the feeling that someone is up to something bad, but he couldn't tell who or what. Just as the boarding ramp lowered, Basha grabbed Graf by the waist and yanked him backwards, revealing a group of people wearing masks, led by a woman who told Graf he was out of time. The Nihil deployed gas canisters and began firing, which hit Sparkburn and Silas first. Cantaros stepped back to give Vitus space, who fell immediately after activating his lightsaber. Rwoh severed the hand of a Nihil, but was hit in the face and deprived of her rebreather. Cantaros, the last Jedi standing, was ordered by his master to warn Yarrow, who was in the cockpit, but was hit by a blaster bolt and also crumpled to the ground.\nRwoh awoke in immense pain, with a Twi'lek woman in front of her telling her the pain would falter soon. The woman revealed herself as Saffa, and told Rwoh she would take her to the Matriarch when she felt up to it. Rwoh tried reaching out to the Force, only to find nothing there. Rwoh spotted Sparkburn running down the holding Beti, who informed her that they had taken Yarrow, Silas, and Cantaros. The pair spotted Vitus, all three of them being chased by their attendants. They were met by an old woman who told them it was not Xylan Graf that had set them up, just as Rwoh sensed the woman using the Force, which had come back to her. The Matriarch apologized for the attack, and returned the lightsabers to their respective owners. Catriona Graf denied having any involvement with the Nihil, which Rwoh sensed was a lie. She gave the trio her fastest ship to pursue the Nihil, though she was unsure of their whereabouts. Rwoh remembered the voice she had been hearing, and thrust the puzzle box into the Matriarch's hands, who opened it to revealed the answer is \"Always return home.\" The Matriarch gave the group Xylan Graf's prototype ship, the Vengeful Goddess, and they took their leave, all in agreement that the Matriarch was hiding something. Rwoh opened the puzzle box, revealing a projection of a little girl playing with blocks that had numbers on them. Sparkburn had an idea as to what the projection meant, and they made way to the ship.\nAboard the ship, Sparkburn entered the code on the blocks into the navicomputer, revealing a beacon in the Berenge sector. She continued that the San Tekka clan were nomads in the Berenge sector until Mari San Tekka, who was a genius that took the family from haulers to prospectors. Rwoh found an empty spot in the cargo hold and began meditating. She felt herself being drawn out into the cosmic force, and once again found herself aboard the mystery ship from her previous visions. She made way to the same hallway and entered the door, and found a medical pod with a frail old woman inside. The woman said she had a gift for Rwoh, one last path before she passed on. Rwoh was awaken by Sparkburn and Vitus, the latter of which told her to rest so she would be at one-hundred percent before arrival.\nThe ship exited hyperspace as they laid eyes on the wheel constructed of a hundred ships, spinning in the emptiness of space. Sparkburn and Rwoh entered the escape pod to enter the ship, Sparkburn opting for Rwoh to fly. A dozen Nihil ships attacked the escape pod, with the guns overheating and the shields failing. Rwoh twisted the Yoke sending the ship into a spiral, and crashed the pod into the landing deck. The Nihil began firing on Rwoh and Sparkburn, and Sparkburn told Rwoh to stay down while she handled it. She pieced together bits on her belt to create and object and threw it at the Nihil, slicing through every and any thing in its path.\nRwoh ordered Sparkburn to turn it off, saying that all the death wasn't necessary. Remy ran off and Sparkburn chased after him, Rwoh following. She entered the same hallway from her visions, and stumbled upon the room with the medical pod, along with Sparkburn, Yarrow, and the Padawans. Rwoh reached out to the old woman, seeing flashes of her life until finally she was given the Path. She felt the memory being carved into her mind, a place where no living thing should go and had not gone to for a very long time. As the old woman faded away, Rwoh understood why Master Gios had been so enamored by his padawan's hyperspace visions. She slashed the hoses connected to the pod, concealing San Tekka from view, and dashed out the room.\nThe group made their way to the hangar bay, where Rwoh informed them that Master Gios had summoned Master Elzar Mann from the Jedi Outpost on Dubrovia, and that the Jedi and Republic were making short work of the Nihil. As they were looking for a ship to escape in, blaster fire began raining down on them, and Yarrow found out it was her mother, Chancey Yarrow, who was indeed alive the one shooting. Using the Force, Rwoh snatched the blaster out of Chancey's hand, who retreated into the Yarrow's ship, the Switchback. Rwoh asked them to a ship that Remy had found, and they made their escape, leaving the Gravity's Heart in ruin.\nRwoh and Cantaros found themselves subject of a Jedi Council Meeting, with the elder Jedi interrogating her about whether she believed her young age led Graf to use and manipulate her. Courtesy of Master Gios, Rwoh and Cantaros were dismissed from the meeting and found Vitus and Silas outside. Rwoh explained her frustrations about the meeting and Vitus put her mind at ease, telling her they did the best they could. Rwoh and Cantaros took their leave, and Cantaros asked Rwoh why she didn't tell the Jedi Masters about the Path Mari San Tekka had given her. Rwoh replied that for the time being she would keep that information to herself, as well as her lightsaber modifications. The pair made their way to the Vengeful Goddess, now signed over to Yarrow, hitched a ride from her, Sparkburn and Remy.\nA few months after the destruction of the Gravity's heart, Rwoh took her Padawan to the planet Kirima to give him lessons in using the force for feats of strength. Between fighting the Drengir and the Nihil, and going to Coruscant to help Master Gios, they didn't have much time to practice. But as the Eye of the Nihil was on the run, Rwoh finally had time to actually teach Cantaros. The idea for this certain exercise was given to Rwoh by Master Sskeer, and when Rwoh asked his former Padawan Trennis about it, she laughed and said Cantaros would enjoy it. Rwoh stand on the opposite side of the canyon as the boy used the Force to push himself over it using the force. Rwoh had caught the boy at least thirty-two times before he plunged to his death. Rwoh told Cantaros that they would try it one more time before they went for lunch, to which he agreed.\nAs Cantaros jumped, Rwoh smiled as she saw the trajectory and speed of his jump, knowing he would be successful. Suddenly, the planet in front of her faded away and she saw an unidentifed human Nihil shoot at Avon Starros, and the girl fell to the floor in a laboratory Rwoh had never seen before. Coming back to reality, Cantaros crashed into his master, thrilled that he had successfully made the jump. Having abilities to read the emotions of others better than any Jedi, Cantaros sensed something was wrong and asked her what it was, and she replied that she had a vision, which was abnormal as she previously only had visions while in hyperspace. She told her Padawan of the vision she just had on Port Haileap, and they decided they would send a call to Haileap just in case.\nThey returned to their ship, the Wishful Thinking and Rwoh noticed that Cantaros' expression had gone from worried to distraught, and instructed her Padawan to accept his worry and let it wash over him instead of letting it take hold of him. She wondered if the sudden connection to Avon was a vision of the future or a call for help. As they powered up the ship, the received a transmission from Jedi Master Estala Maru from Starlight Beacon saying that they had received a report from Master Jorinda Boffrey that there was a possible Nihil attack on Port Haileap, and since they were the closest, they were being asked to go to Haileap and assess the situation. The duo powered up the ship and headed for Haileap, both hoping that Starros was okay.\nRwoh and Cantaros arrived over Port Haileap and found the forest aflame, with a long scar marred along the thickest part of the forest. That section also held what looked to be a Jedi Vector, which shocked both master and Padawan. After landing, they were greeted by the Delphidian Jedi Master Jorinda Boffrey, who informed that five or six ships entered from hyperspace and didn't seem unusual, so Jedi Knight Kohta Jarik and herself were not alarmed. She mentioned that Jarik fought valiantly, but ultimately was defeated as there were too many Nihil, and the vector in the forest was hers. Boffrey also mentioned that only a few of the ships had path engines, which she found odd, and Rwoh mentioned that without Mari San Tekka, the Nihil had no more paths and resorted to using hyperdrives once more. Rwoh went to go look for Starros while Cantaros helped with the cleanup efforts, and Rwoh began recalling her first days on Port Haileap as a newly anointed Jedi Knight. On her way to the infirmary, Rwoh was greeted by J-6, Starros' part childcare, part security droid, who informed her that the girl was not in the infirmary. Rwoh and J-6 made their way to Professor Glenna Kip's lab and J-6 reported that she did not pick up any of Starros' vitals but there was someone hiding in a cupboard. Rwoh called out to the person telling them it was okay to come out, and a young girl named Talia came out and informed Rwoh that the Nihil had taken Starros.\nRwoh and J-6 returned outside and informed Cantaros that the Nihil had taken Starros and they were going to get her back. They wondered if the Nihil knew who the girl was, being the daughter of Senator Ghira Starros, and they went to Master Boffrey to ask. Boffrey summoned Administrator Rico and asked him to continue the head count, as one person was already missing, and it would be best to see if any more were. Cantatas pointed out that the Nihil don't usually strike only one place at a time, and buy coordinating with Master Maru they might be able to locate which planets in the area the Nihil had hit recently and try to find Starros. Rwoh and Boffrey both liked the idea, and Boffrey told them she would contact Starlight to continue the cleanup and rebuild effort, the the two young Jedi should go find their friend. Along with J-6, they made way to their ship to contact Maru, who told them of five attacks in the last three hours - one on Hon-Tallos, one on Thelj, and another near Tiikae. He reported that no one went missing from those attacks, but the Jedi on Dalna had reported cases of people disappearing from the capital city of Saludad. Rwoh informed Maru of the Starros situation, and he said he would contact Senator Starros and let her know, as well as Marshal Kriss, stating that if the Nihil began kidnapping people, they need to get that information out. They signed off and prepared to head to Dalna, and Cantaros asked Rwoh if she mediated with Starros in mind, she would be able to find her, and Rwoh replied she wasn't sure but she would try.\nWhile en route to Dalna, Rwoh meditated aboard he Wishful Thinking in an effort to locate Starros. She viewed herself as a small burbling brook that flowed into a stream, then into a river, and on until she reached a wide ocean ripe with possibility. This was the way the she visualized the force, as it also flowed and twisted, and conformed to it's container. She heard the voice of Starros, saying her name was Avon Sunvale, and another name, Kara Xoo. There was a bump and she snapped out of her vision, and told Cantaros what she had heard, both wondering how long ago that exchange took place. Cantaros in turn informed his master that he had contacted the Jedi Temple on Dalna, and they were glad he reached out as they were having trouble working with the local government. They landed near the temple and were met by Jedi Master Nyla Quinn, who welcomed them to Dalna. Rwoh asked Quinn what the situation was with the missing people, and the Twi'lek Jedi replied that the matter wasn't very clear, and said it would be best if the went inside the temple.\nUpon entering the temple, Rwoh appreciated the coolness of it, and contemplated coming back to this temple after they found Starros to practice being one with the Force again. Master Quinn informed them that some families had left, and it was unclear that if that was by choice or force, and the Dalnans were hesitant to work with the Jedi. Quinn told them that some time before the Dalna temple was built, there was a tragedy and the Dalnan people blamed the Jedi, and had been standoffish since. She continued that the Dalnan Jedi keep to themselves, as that's how the Dalnans like it.\nYacek Sparkburn and Lyssa Votz, the other Jedi of the Dalna temple, returned bearing food and once again welcomed Rwoh and Cantaros, and gave them Durga berries to eat while they prepared some real food. Both Jedi departed to attend to their duties, and Rwoh asked Quinn if she didn't believe the Nihil were involved, where had the families gone missing, if they were in fact missing. She replied that she wasn't sure but she was hoping Rwoh and Cantaros would be able to help, as they had experience fighting the Nihil and the Drengir. She also brought up their travels aboard the Stead Wing where they had met with Dalnan ambassadors, and hoped that their history would be able to smooth things out with the government. Rwoh reluctantly agreed, as she did not want to stay on Dalna if it was a dead end for her search for Starros, but if something was happening on Dalna it could tie back to thr Nihil. Quinn thanked her and advices her to get some rest while Sparkburn prepared the food, and she would contact Saludad to arrange a meeting for the next day. Twig decided to join Votz in the archives to try to gather information to drive her next steps.\nThe next morning, Rwoh greeted Cantaros when he woke, and informed him that Sparkburn was giving her an overview of the people and city of Saludad. Sparkburn once again mentioned the people of Dalna's shaky relationship with the Jedi, and Rwoh asked him if soemthing had recently happened that made the people more suspicious, as they had a Dalnan friend, Honesty Weft, and he was nothing like that. Sparkburn told them that Ambassador Weft was much different than most Dalnans, and his death was the largest reason Dalna joined the Republic. He told them they were ready to take the speeder into the city, and they would be meeting with the Vice President. When they entered the city, Sparkburn and Rwoh headed inside the building while Cantaros waited outside. Cantaros was greeted by Honesty Weft, who told him he would tell the truth of the kidnappings at the temple later that night. Inside, Rwoh met with the Theelin Hackrack Bep, who denied the story about missing families, as well as telling them there were no Nihil on Dalna. They returned outside where Cantaros told them about his conversation with Weft, and Rwoh wondered why the Bep had lied to them. They made way back to the temple where they waited for Weft and his friend, who knew more about the truth then he did.\nRwoh spent the time waiting for Weft and his friend dueling with Cantaros and Sparkburn, while Quinn critiqued their skills. Both Quinn and Sparkburn applauded Rwoh's abilities, understanding why she became a Jedi Knight so young. As the sun began setting, Rwoh went to check on J-6 and the ship, where the droid told her that she had been narrowing down all the comm channels to see which one Starros would likely use to call for help. Out of two millions, J-6 had narrowed it down to a little more than three thousand, but had found nothing, in terms of Starros and the Nihil in general. Rwoh left the ship and met Cantaros outside, who both greeted Weft and his apprenticeship partner Sha'nai Plouth, a pantoran. Weft mentioned that the Dalnans still blame the Jedi for the Night of Sorrow, when the Republic and Jedi answered a call for help when Dalna was newly settled, and there was much confusion leading to many deaths. Sha'nai was reluctant to tell the Jedi what she knew, and Imri used his abilities to soothe her. She explained that there was an attack a few days prior, and she informed the security chief who then took her to the president, who told her to let the matter rest. She continued by saying she liked to ride her glider near the Maawat Mountains, and she saw the Nihil. She reported it to the security chief, but she didn't believe he did anything about it. Quinn asked if the security chief could be trusted and Weft replied that he could, although he thought the president was a bit odd. He explained that she was elected earlier this year and everyone was surprised as no one really knew her. They decided that they would visit the Maawat Mountains to see if they could find anything.\nEveryone except Master Quinn piled into the Wishful Thinking, the elder Jedi staying behind as someone should always be in the temple, and they headed off for the Maawat Mountains. Upon arrival, Weft pointed out that the area was highly sulfurous, and the area and the water weren't good for growing crops, and Votz added that the area was also the source of much of the volcanic activity on Dalna. The disembarked the ship and Sha'nai pointed out the area where she had seen the Nihil ships, and the Jedi wondered what the Nihil could possibly want on a small planet like Dalna. Rwoh asked J-6 if she had any information on the Maawat Mountains, and the droid replied that she found a geological study done by the republic about seismic events and their roles in Force confluences. Rwoh wondered why the Republic would be interested in force theory, but before she could ask J-6 to elaborate, she saw everyone else being chased by some type of animal. Sparkburn yelled for everyone to get aboard the ship, and Rwoh decided she would have to redirect the animals from the ship. She had gotten some of them to move around the ship, but realized the herd was much bigger than she had thought. Cantaros had managed to power up the ship and started to lift off, and Sparkburn called to Rwoh to board the ship. Sparkburn explained that the Boolsa were harmless, but once they were startled, there was no stopping them. Rwoh asked Cantaros to take them to the place the herd started from, and they came upon a ramshackle building not too far from where Sha'nai reported seeing the Nihil. Ice gator's were attacking the building, and they determined that someone was inside the building. Rwoh, Sparkburn, and Votz jumped from the ship to rescue whoever was inside, and Sparkburn asked them to drive away the gators instead of killing them. Rwoh used her lightwhip to strike the ground near one of the gators, which in turn scurried away.\nVotz returned to the ship and Rwoh pressed ahead with Sparkburn, and inside Rwoh noticed some flowers tied up placed inside a metal container. Sparkburn said they looked like lompop, a summer plant. They heard a noise, and Rwoh opens the hatch using the force to reveal a young boy with the same hair color as the Vice President's. They took the boy straight to the Vice President's house, and the boy, Theo, ran straight towards another Theelin man. The main introduced himself as Zian, Vice President Bep's husband. They met with Bep and he informed them that he lied, and Theo had gone missing a week ago when he was playing with some other children in the meadowlands. They received a message from the Nihil, who had taken Theo and had planted charges on the Bensha Fault, and they would detonate the charges if someone came looking for Theo. Votz explained that the Bensha Fault was the main space between tectonic plates, which used to cause frequent ground quakes. An explosion there could cause massive natural disasters, including volcanic eruptions. Sparkburn advised evacuating the planet, and Rwoh said Starlight would be happy to help as well. Bep explained that someone had taken down their relay satellite. Suddenly, J-6 entered the room and informed Rwoh that Starros had called, and had explained that the Nihil were kidnapping kids and forcing them to join the Nihil, or else be reduced to farm work. Rwoh stated that since the satellite relay was down, it would've been impossible to Starros to send a message, unless she was on Dalna the entire time.\nThe next morning, Cantaros awoke to find the Jedi along with some Dalnans, and Rwoh told him that they might have found Starros based off what Theo told them. The Dalnans had reluctantly agreed to let the Jedi search the area, but Rwoh wanted Cantaros to head back to Starlight and ask Master Maru for help with the damaged relay. Cantaros agreed, and Rwoh said that she would send Votz and Bep with him, incase Bep wanted to request Republic aid. Rwoh pulled Cantaros into a hug and assured him she was proud of the Jedi he'd become, and let him about his mission while she continued hers. Rwoh and the remaining Jedi met with the President of Dalna, and human woman named Sachary Jeffington and her aide, a Toydarian, as well as the security chief, a Vodran named Tracer Lore. Rwoh was irritated that Jeffington did not seem concerned with the Nihil, and believed that she was stalling. The Jedi asked for permission to check out the Maawat Juncture and the Bensha Fault, and Rwoh wanted to fly over the area and see if there were any Nihil. The Dalnan delegation said they didn't have any shuttles at the moment, and since Cantaros had taken the Wishful Thinking, the only option was to ride a trappu up the mountain. They decided they would leave first thing the next morning, with even Master Quinn joining them as J-6 would stay at the temple. After everyone left, Rwoh prepared herself for the upcoming potential battle.\nHalfway through their ride the next morning, the group was challenged when a ground quake struck. Lore stated that it was odd, considering it wasn't ground quake season. They continued trekking until the reached a grassy meadow where Lore called a halt, and said they'd take a break as pushing the trappus and themselves too hard was a bad idea. Rwoh dismounted her trappu and was about to reach into her pack when something in the trees caught her eye, and suddenly a dirt-covered human boy, no older than eleven, bolted out of the trees and straight at Master Quinn. Quinn used the Force to stop the boy, and determined the was just hungry and gave him the instant bun she was holding. She asked him for his name and he replied it was Liam and asked if she was a Jedi here to rescue Starros, and maybe the rest of the children as well. He said that he heard Kara Xoo let Deva Lompop eat Starros, and Rwoh asked who they were, as she had heard the name Kara Xoo in one of her visions. Liam replied that Kara Xoo was the Tempest Runner, and Deva was her friend. Quinn said to let the boy eat in peace, and they would ask him questions after he finished. They question Liam the next morning and they determined that the Nihil had been kidnapping children and bringing them to Dalna, where the officials were too afraid to disturb them. They sent Liam back to the city with Honesty and Sha'nai, so they could also contact Cantaros on Starlight. The three children departed, and Rwoh suggested it would be best to continue on foot, as the trappus could alert the Nihil about their approach. Master Quinn said the plan would be to liberate as many children as possible without fighting, and Rwoh mentioned that the Nihil plans were always evolving, and they themselves should make a plan fit for the situation they find.\nAfter the Nihil departed their Dalna base to raid Saludad, Starros and Dr. Zadina Mkampa activated Mkampa's machine that Starros had rigged with faulty Sunvale crystals. The crystals caused a few explosions, as Starros had planned and she made a run for it, trying to flee the base. During her escape attempt, she was confronted by Mkampa, who threw her against the wall. Rwoh called for Starros to stay down and launched into the area, using the force to throw the Doctor into a far-off tree line. Mkampa came back and grabbed Rwoh's tabard and threw her so she slammed into a tree. Rwoh ricocheted off the tree and slashed at Mkampa again, who began firing at her from a concealed blaster barrel. Rwoh activated her lightwhip and slashes at the barrel, sealing it shut. Mkampa retreated into the forest, and Rwoh wrapped Starros in a hug, relieved she was okay. Starros informed Rwoh that the Nihil were heading to Saludad, and they had to warn the city. Rwoh, Sparkburn, and Quinn had freed all the children they could find, and they also found the five families that were missing from Saludad. The ground quakes began again, and the Jedi rushed all the children onto the lone Nihil ship left behind. Starros informed the Jedi that the ground quakes were occurring due to a crystalline power matrix that Mkampa had tied into the planet's crust. Quinn pointed out a plume of red smoke coming from the trees, and Starros stated that Mkampa must've found a way to restart the machine. Rwoh said she and Sparkburn would take care of the doctor, but before they could go after her, the forest caught on fire and everyone boarded the Nihil ship, ready to flee. As they took off, they noticed that the forest wasn't only on fire, but there was a river of lava flowing through it.\nThe ship returned to the Jedi Temple and Rwoh began helping all the families and children, by assigning them rooms and finding pallets for them to rest on. Starros assisted Rwoh, giving a group of kids some things to do to speed up the process. Rwoh was approached by Sparkburn, who informed her of a distress call from the Dalnan council, reporting that the volcanic system had been activated, and they needed help to evacuate. Rwoh asked if it was true, and Sparkburn replied that he wasn't sure, and he reached out to Saludad but had gotten no response. Sparkburn asked Rwoh to accompany Lore back to Saludad, and he would try to contact Starlight Beacon for help. When Rwoh and Lore reached Saludad, the found the city smoldering, some houses had been set aflame and families were out and about, upset and crying.\nThey headed to the President's house and knocked, and an elderly human woman called to them and told them that the president and her aide had ran off with the Nihil. Rwoh asked about the Dalnan council, and the woman replied that they fall fled, and were probably paid off by the Nihil as well. Rwoh asked who sent the distress call, and Weft appeared and said it was him, as he came back to the city after dropping Liam off at the temple. Rwoh, Lore, Weft, and Sha'nai headed to the security office and looked at a holomap of Dalna, showing yellow and red flashing lights, for ground quakes and volcanic activity, respectively. Rwoh asked how bad the situation was, and Lore replied that in two weeks, all of Dalna would be covered in lava. Weft suggested evacuating everyone to the emergency shelter on Hanisbel Island, but Lore said the toxic gases would be more of a problem then the lava. Rwoh headed back to the temple to inform Sparkburn and Quinn of the situation, while also trying to think of a way to get everyone on Dalna to safety.\nRwoh spend the next few days assisting in trying to get everyone to Hanisbel Island, as they had to cross a body of water to get there. A day after the ground quakes began, the volcanoes in the Maawat Mountains began erupting, and every day that passed added more eruptions. Rwoh found Weft, who seemed to be extremely calm given the situation, and he explained that it hadn't really felt like his home ever since his father had died. He decided the he and Sha'nai would continue their apprenticeship somewhere else, perhaps with the San Tekkas. Weft thanked Rwoh for all her help on Dalna, and told her if she ever needed something, she should let him know. The next day Starros ran to Rwoh and informed her that Starlight Beacon had arrived to save them, a plan that Cantaros had engineered. With all the Dalnan's safely aboard Starlight, Rwoh, her fellow Jedi, and Starros were the final people to board. Rwoh comforted Starros and told her none of what happened was her fault, and Starros replied that it was, as the crystals Mkampa used for her machine were based off a kyber crystal she stole from Imri's lightsaber. Rwoh told her to hold on to it and give to Imri, and he would be excited to see her. As soon as she stepped onto Starlight, Rwoh was engulfed in a hug by Cantaros, thrilled that his master was there.\nBefore Rwoh could make it to her room, she was met by Avar Kriss, who applauded her on her effort in the Dalnan evacuation. Rwoh informed Kriss that the Tempest Runner, Kara Xoo, had escaped, and Kriss replied that Maru was looking into it. She informed Rwoh that they had some intel that the Nihil were gathering at one of their old hideouts, and she was leading a mission to root them out once and for all. She asked Rwoh if she would like to come, and Rwoh replied by asking when they would leave.\nHaving not joined Kriss on her mission to hunt Lourna Dee in No-Space, Rwoh was present on Starlight Beacon during the Nihil attack which caused it to split in two and eventually crash into Eiram. Jedi Knight Keeve Trennis sensed Rwoh's song, which assured her that Rwoh was alive.\nVernestra Rwoh was a Mirialan female with green skin, purple-black hair, and blue eyes. Rwoh bore the markings of her family, six tiny black diamonds stacked in two rows of three tattooed on the outside corner of each eye. She was compassionate and devoted to the ways of the Jedi. Although Rwoh found her charge Avon Starros exasperating at times, she enjoyed her company and wanted to get to know her better. Rwoh's prodigious talent, which vaulted her to the rank of Knight at an unusually young age, left her in an unusual position, and she was still learning to deal with her rank. This uncertainty, however, led her to occasionally dismiss genuine threats if she sensed them.\nAlthough Rwoh was aware of the attractiveness of other beings, she did not feel attraction to them. As she had never experienced any of the emotions related to falling in love, she found it difficult to have conversations about them. She also disliked holo adventures that focused on overwrought romances or being present for lovers' quarrels. Sometimes she thought it was easier not to have developed those attractions the way Padawans who came of age often did.\nRwoh could use telekinesis, using it to stop Avon Starros when the girl was running around Port Haileap on a scoot speeder when she was supposed to be boarding the Steady Wing. She was also capable of sensing threats through the Force, although she did not always realize the threat was genuine, occasionally dismissing such feelings as nothing. According to Stellan Gios, Rwoh had the ability to navigate ships using only the Force while in hyperspace. Additionally, Rwoh would often receive visions in hyperspace during her apprenticeship with Gios, an ability he urged her to exlpore, but she refused. Following her promotion to the rank of Jedi Knight, Rwoh stopped having hyperspace visions until her trip to Tiikae.\nRwoh wore brown and cream Jedi robes with short sleeves and fingerless gauntlets on her forearms. She carried a purple-bladed lightsaber, which she had modified to also serve as a lightwhip. Uncertain of the reception the modification would get, she kept it secret as long as possible.\nVernestra Rwoh was created for the 2021 novel The High Republic: A Test of Courage, written by Justina Ireland as part of the Star Wars: The High Republic multimedia project.\nConcept art of Vernestra shows her with purple hair, the same color as her lightsaber. Her hair is described as \"purple-black\" in The High Republic: Out of the Shadows.\nThough the terms were not used in the novel, Justina Ireland has confirmed that the scenes in Out of the Shadows where Rwoh reflected on her lack of experience with attraction were intended to show her as asexual and aromantic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Mirialan",
  "/wiki/Jedi_Knight",
  "/wiki/Vern",
  "/wiki/Kuari_Princess/Legends",
  "/wiki/Template:Image",
  "/wiki/Template:Update",
  "/wiki/First_Mission",
  "/wiki/The_High_Republic:_A_Test_of_Courage",
  "/wiki/The_High_Republic_(2021)_2",
  "/wiki/The_High_Republic_(2021)_3",
  "/wiki/The_High_Republic_(2021)_4",
  "/wiki/The_High_Republic_(2021)_5",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/The_High_Republic_(2021)_15",
  "/wiki/Talk:Vernestra_Rwoh",
  "/wiki/248_BBY",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Stellan_Gios",
  "/wiki/Imri_Cantaros",
  "/wiki/High_Republic_Era",
  "/wiki/Padawan",
  "/wiki/Jedi_Master",
  "/wiki/Jedi",
  "/wiki/Avon_Starros",
  "/wiki/Senator",
  "/wiki/Ghirra_Starros",
  "/wiki/Port_Haileap",
  "/wiki/Starship",
  "/wiki/Steady_Wing",
  "/wiki/Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Cruiser",
  "/wiki/Bomb",
  "/wiki/Protocol_droid",
  "/wiki/J-6",
  "/wiki/Honesty_Weft",
  "/wiki/Dalnan",
  "/wiki/Ambassador",
  "/wiki/Jungle",
  "/wiki/Moon",
  "/wiki/Wevo",
  "/wiki/Shuttle",
  "/wiki/Standard_year",
  "/wiki/Vernestra_Rwoh%27s_family_group",
  "/wiki/Force-sensitive",
  "/wiki/Human",
  "/wiki/Marshal",
  "/wiki/Douglas_Sunvale",
  "/wiki/Spaceport",
  "/wiki/Coruscant",
  "/wiki/Dream",
  "/wiki/Vernestra_Rwoh%27s_lightsaber",
  "/wiki/Lightwhip",
  "/wiki/Weft",
  "/wiki/Galactic_Republic",
  "/wiki/Scoot_speeder",
  "/wiki/The_Force",
  "/wiki/Aqualish",
  "/wiki/Gwishi",
  "/wiki/Janex",
  "/wiki/Starstriker",
  "/wiki/Attack_on_the_Steady_Wing",
  "/wiki/Realspace",
  "/wiki/Blast_door",
  "/wiki/Escape_pod",
  "/wiki/Hangar",
  "/wiki/Pilot",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/Nihil",
  "/wiki/Klinith_Da",
  "/wiki/Force_choke",
  "/wiki/Sskeer",
  "/wiki/Keeve_Trennis",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Ataraxia",
  "/wiki/Kazlin_system",
  "/wiki/Terec",
  "/wiki/Ceret",
  "/wiki/Sedri_Minor",
  "/wiki/Unidentified_Hutt_trader",
  "/wiki/Archivist",
  "/wiki/OrbaLin",
  "/wiki/Drengir",
  "/wiki/Kantam_Sy",
  "/wiki/Lula_Talisola",
  "/wiki/Zeen_Mrala",
  "/wiki/Trymant_IV",
  "/wiki/Krix_Kamerat",
  "/wiki/Tromak",
  "/wiki/Barbatash",
  "/wiki/Stygmarn_system",
  "/wiki/Varonchagger",
  "/wiki/Neimoidian",
  "/wiki/Ram_Jomaram",
  "/wiki/Cyclor",
  "/wiki/Pan_Eyta%27s_Tempest",
  "/wiki/Togruta",
  "/wiki/Cyclor_Shipyards",
  "/wiki/Drift",
  "/wiki/Grizal",
  "/wiki/Elzar_Mann",
  "/wiki/Indeera_Stokes",
  "/wiki/Bell_Zettifar",
  "/wiki/Ty_Yorrick",
  "/wiki/Attack_on_Valo",
  "/wiki/Reath_Silas",
  "/wiki/Genetia",
  "/wiki/Cohmac_Vitus",
  "/wiki/Berenge_sector",
  "/wiki/Estala_Maru",
  "/wiki/Valo",
  "/wiki/Avar_Kriss",
  "/wiki/Training_lightsaber",
  "/wiki/Preeti",
  "/wiki/Nubarron",
  "/wiki/Fraunesaa",
  "/wiki/Ugnaught",
  "/wiki/Tiikae",
  "/wiki/Chagrian",
  "/wiki/Oprand_Qwen",
  "/wiki/San_Tekka_clan",
  "/wiki/Deputy",
  "/wiki/Vollka",
  "/wiki/Remy_(vollka)",
  "/wiki/Jordanna_Sparkburn",
  "/wiki/Hutt",
  "/wiki/Zygerrian",
  "/wiki/Nan",
  "/wiki/Amaxine_space_station",
  "/wiki/Yaddle",
  "/wiki/Emerick_Caphtor",
  "/wiki/Graf",
  "/wiki/Prospector",
  "/wiki/Professor",
  "/wiki/Thaddeus_Wolk",
  "/wiki/Xylan_Graf",
  "/wiki/Sylvestri_Yarrow",
  "/wiki/Kyrie",
  "/wiki/Gungan",
  "/wiki/Balosar",
  "/wiki/Ashdree_Marq",
  "/wiki/Gigoran",
  "/wiki/Basha",
  "/wiki/Neral%27s_moon",
  "/wiki/Grand_Theljian_snow_dog",
  "/wiki/Plinka",
  "/wiki/Resplendent_Pearl",
  "/wiki/Dalnan_sector",
  "/wiki/Everbloom",
  "/wiki/Saffa",
  "/wiki/Matriarch",
  "/wiki/Beti",
  "/wiki/Catriona_Graf",
  "/wiki/Vengeful_Goddess",
  "/wiki/Mari_San_Tekka",
  "/wiki/Chancey_Yarrow",
  "/wiki/Switchback",
  "/wiki/Gravity%27s_Heart",
  "/wiki/Kirima",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Wishful_Thinking",
  "/wiki/Jorinda_Boffrey",
  "/wiki/Delphidian",
  "/wiki/Kohta_Jarik",
  "/wiki/Glenna_Kip",
  "/wiki/Talia",
  "/wiki/Hon-Tallos",
  "/wiki/Thelj",
  "/wiki/Saludad",
  "/wiki/Kara_Xoo",
  "/wiki/Nyla_Quinn",
  "/wiki/Twi%27lek",
  "/wiki/Yacek_Sparkburn",
  "/wiki/Lyssa_Votz",
  "/wiki/Vice_President",
  "/wiki/Theelin",
  "/wiki/Hackrack_Bep",
  "/wiki/Sha%27nai_Plouth",
  "/wiki/Pantoran",
  "/wiki/Night_of_Sorrow",
  "/wiki/Glider",
  "/wiki/Maawat_Mountains",
  "/wiki/Ice_gator",
  "/wiki/Lompop",
  "/wiki/Theo",
  "/wiki/Zian",
  "/wiki/Bensha_Fault",
  "/wiki/President",
  "/wiki/Sachary_Jeffington",
  "/wiki/Toydarian",
  "/wiki/Vodran",
  "/wiki/Tracer_Lore",
  "/wiki/Maawat_Juncture",
  "/wiki/Trappu",
  "/wiki/Liam_(Hetzal_Prime)",
  "/wiki/Deva_Lompop",
  "/wiki/Tempest_Runner",
  "/wiki/Zadina_Mkampa",
  "/wiki/Lourna_Dee",
  "/wiki/No-Space",
  "/wiki/Eiram",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Holodrama",
  "/wiki/Telekinesis",
  "/wiki/Speeder",
  "/wiki/Jedi_robes",
  "/wiki/Lightsaber",
  "/wiki/2021",
  "/wiki/Justina_Ireland",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic_Adventures_Annual_2021",
  "/wiki/The_High_Republic:_Into_the_Dark",
  "/wiki/The_High_Republic:_Into_the_Dark_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_A_Test_of_Courage_(audiobook)",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic:_Trail_of_Shadows_1",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Knights_at_the_Roundtable",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/StarWarsKids.com",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Vernestra_Rwoh",
  "/wiki/Standard_week",
  "/wiki/The_Star_Wars_Book",
  "/wiki/232_BBY",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/0_BBY",
  "/wiki/March_11",
  "/wiki/2020",
  "/wiki/March_30",
  "/wiki/2022"
 ]
}