{
 "name": "Ves_Volette",
 "display_name": "Ves Volette",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Caamas"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Caamasi"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Ves Volette was a male Caamasi light sculptor who lived on the galactic capital Coruscant and was the lover of Dejah Duare. He was born in the Jualya Village on Caamas. In 19 BBY, Ves was murdered by the Umber 3PO unit shortly after unveiling a new lightsaber-inspired work. Dejah went to Jax Pavan to solve the case.\nVolette's works were made of special crystals similar to those the Jedi used in their lightsabers, creating unique compositions of different colored lights. However, he also built his works so that they would not work if someone changed the crystals or energy cells. He worked for a long time with the celtronist Dejah Duare, who helped him organize exhibitions and sales pitches and became a good friend. Around 19 BBY, the artist heard rumors that his homeworld of Caamas had been destroyed by newly appointed Emperor Palpatine; in fact, that day many of the planet's population died. That same day, Ves began his next work and was finally visited by Baron Vlaçan Umber, one of Ves best customers.\nAfter having a conversation with Baron Vlaçan Umber and his wife, Kirma Umber, who arrived at the artist's residence and in a heated conversation asked him not to sell her husband any artworks, which would otherwise plunge her family into debt. However, Ves refused this, whereupon the Baroness left him angry. That was when Ves was killed the same night when he was stabbed to death by an Umber 3PO unit - acting on his own initiative. With the circumstances of his death still uncertain, his partner Duare did not rely on the official authorities, led by prefect Pol Haus, but also hired Jax Pavan, Den Dhur and the droid I-5YQ, who ultimately died revealed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Caamas/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Caamasi",
  "/wiki/Gender/Legends",
  "/wiki/Light_sculptor",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Dejah_Duare",
  "/wiki/Reproduction/Legends",
  "/wiki/Jualya_Village",
  "/wiki/Death/Legends",
  "/wiki/Umber_3PO_unit",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jax_Pavan",
  "/wiki/Jedi/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Vla%C3%A7an_Umber",
  "/wiki/Kirma_Umber",
  "/wiki/Pol_Haus",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Ves_Volette",
  "/wiki/Coruscant_Nights_II:_Street_of_Shadows",
  "/wiki/Coruscant_Nights_III:_Patterns_of_Force",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Lords_of_Nal_Hutta"
 ]
}