{
 "name": "Veshta",
 "display_name": "Veshta",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Light brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Veshta was a Human female Sith Warrior who was part of the reconstituted Sith Empire during the Cold War against the Galactic Republic. She helped guard one of the entrances to the Sith Lord Ajunta Pall's tomb on the planet Korriban around the year 3643 BBY.\nA Human female, Veshta was a Sith Warrior affiliated with the Sith Empire during the Cold War, a period of unrest between the Empire and the Galactic Republic. Around the year 3643 BBY, she was on the planet Korriban guarding one of the entrances to the tomb of the Sith Lord Ajunta Pall with a Sith Inquisitor named Gesen, an Imperial soldier sergeant named Cormun, and Cormun's troops. She also provided training to Sith Acolytes learning to be Sith Warriors at the nearby Sith Academy.\nWhile in the tomb, Veshta spoke with an acolyte, against whom she believed no Jedi would be able to stand. She encouraged the acolyte's pursuit of power and reminded the individual of a portion of the Sith Code.\nVeshta had light brown hair, brown eyes, and fair skin. She considered the pursuit of greater power a good goal and peace to be a lie—two views that were in accordance with the Sith Code.\nWhile in Ajunta Pall's tomb, Veshta wore red-and-gray armor and carried a red-bladed lightsaber.\nVeshta first appears in Star Wars: The Old Republic, a 2011 MMORPG produced by BioWare. She is a trainer for Sith Warriors on the planet Korriban, and she has the same dialogue as other Sith Warrior trainers. The player is not required to speak with her. Although her name is not mentioned, Veshta's location as a Sith Warrior trainer is identified on the maps of Korriban in the Star Wars: The Old Republic Explorer's Guide, a book released at the same time as the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Sith_Warrior",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Ajunta_Pall",
  "/wiki/Tomb_of_Ajunta_Pall",
  "/wiki/Planet/Legends",
  "/wiki/Korriban",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Sith_Inquisitor",
  "/wiki/Gesen",
  "/wiki/Imperial_soldier",
  "/wiki/Sergeant/Legends",
  "/wiki/Cormun_(Imperial_Army)",
  "/wiki/Trooper/Legends",
  "/wiki/Sith_Acolyte",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Canon",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Jedi/Legends",
  "/wiki/Code_of_the_Sith/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}