{
 "name": "Vetch",
 "display_name": "Vetch",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Urodel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray and pink"
     ]
    }
   ]
  }
 ],
 "content": "Vetch was an Urodel male who the spare parts vendor Nurchi used to try and threaten the human Cassian Andor into repaying him a deposit in 5 BBY. Nurchi confronted Andor in the streets of the planet Ferrix while Vetch loomed behind Andor; however, Andor questioned why Vetch was working for Nurchi and then left.\nVetch was an Urodel male that spent time on the planet Ferrix during reign of the Galactic Empire. He was familiar with the humans Cassian Andor and Nurchi, the latter of whom worked as a spare parts vendor. In 5 BBY, Nurchi asked Vetch to help him get back a deposit from Andor, telling the Urodel that all he need do was stand there. When Nurchi later spotted Andor rushing by his stall, the vendor confronted the debtor and prevented him from passing until Vetch moved up behind Andor and loomed over him.\nAndor was surprised to see Vetch working for Nurchi and questioned the vendor on if he was trying to threaten him. He then questioned Vetch as to why he had started taking orders from Nurchi, asking if the Urodel was desperate for work. Shifting his wide-set eyestalks, Vetch revealed that he had only been told to stand there, after which Nurchi again asserted that he wanted his money; however, Andor simply passed by him and left, stating that he would not mention the incident had taken place before saying farewell to Vetch. Nurchi then turned to stare at the Urodel, who questioned what was wrong.\nVetch was a hulking Urodel with a big mouth. He had gray and pink skin.\nVetch wore a brown jacket over a yellow shirt with a brown belt.\nVetch was portrayed by Ian Whyte in the first episode of the television series Andor, which aired on September 21, 2022. The character was revealed prior to the release of the episode in official promotional assets linked to the show released by Walt Disney Studios via Getty Images on August 19, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Urodel",
  "/wiki/Gender",
  "/wiki/Junk_dealer",
  "/wiki/Nurchi",
  "/wiki/Human",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/5_BBY",
  "/wiki/Planet",
  "/wiki/Ferrix",
  "/wiki/Time",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Eye",
  "/wiki/Mouth",
  "/wiki/Color",
  "/wiki/Clothing",
  "/wiki/Belt",
  "/wiki/Ian_Whyte",
  "/wiki/Kassa_(episode)",
  "/wiki/Andor_(television_series)",
  "/wiki/September_21",
  "/wiki/2022",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/August_19",
  "/wiki/Category:Images_of_Vetch",
  "/wiki/Star_Wars"
 ]
}