{
 "name": "Vexx",
 "display_name": "Vexx",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Nal Hutta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Apprentices",
     "values": [
      "Vexx's Crew"
     ]
    }
   ]
  }
 ],
 "content": "Vexx was a male Human criminal, smuggler, and quick-draw champion from the planet Corellia who lived during the Cold War. Brother of Vorr and Vye, he had a bounty placed on his head after he robbed fifteen Imperial Military pay stations. He owned a safehouse in the town of Jiguuna on the planet Nal Hutta, and was killed while preparing to board a shuttle offworld by a bounty hunter who sought to claim Vexx's bounty in order to cement a reputation in the area.\nVexx was a male Human born on the planet Corellia as brother to Vorr and Vye. He became a quick-draw artist and notorious smuggling captain, earning a bounty on his head after he robbed fifteen Imperial Military pay stations belonging to the Sith Empire. In 3643 BBY, during the Cold War between the Galactic Republic and the Empire, Vexx spent time on the planet Nal Hutta, where he owned a safehouse in the bad part of the town of Jiguuna. While searching for the nastiest, most brutal, untouchable scum in the area, the slicer Mako came across Vexx's bounty and brought it to the attention of the bounty hunter Braden and his protégée, who were looking for an impressive local target that could cement the protégée's reputation on Hutta.\nOn that same day, Vexx had booked a ticket for a shuttle leaving from Jiguuna Spaceport, leaving a receipt for the purchase amongst the detailed records he kept on an encrypted datapad at his safehouse. The Corellian then traveled to one of the spaceport's hangars with a bodyguard and a crew of twelve Human mercenaries and six Zabrak thugs. As he prepared to board the shuttle, Vexx was confronted by Braden's protégée, who had learned of the smuggler's location after discovering the datapad in a raid on Vexx's safehouse. Vexx was surprised to find himself cornered, but was confident that he could defeat his opponent; however, the bounty hunter killed Vexx in the ensuing fight. The hunter then took the Corellian's ID tags as proof of his death and returned to Braden, only to discover that both Braden and his associate Jory had been killed on the orders of the Mandalorian Tarro Blood. Mako then used the credits from Vexx's bounty to give Braden and Jory a decent burial.\nThe bounty hunter who had killed Vexx went on to compete against Blood in the Great Hunt competition, and during the event the Mandalorian contacted Vexx's siblings and inaccurately informed them that the hunter had killed Vexx by shooting the smuggler in the back. Vorr and Vye then confronted the hunter on the planet Balmorra in order to avenge Vexx.\nInstead of trying to convince the siblings that they had been lied to by Blood, the bounty hunter attacked and killed them both.\nVexx had a high opinion of himself and believed he was the greatest quick-draw artist in the galaxy rather than an ordinary thug, although the bounty hunter who killed him was faster on the draw. Braden considered Vexx to be a reasonable threat and assumed that he must be a madman or a glory hound to have targeted Imperial military pay stations for robbery. The Corellian sometimes spoke about himself in the third person and considered himself dashing, with brown hair, brown eyes, and dark skin.\nVexx wore a black and blue shirt under a blue jacket with black gloves, blue boots and a brown belt and pants. In combat, Vexx used a blaster pistol, an electroblade, and flash grenades.\nVexx first appeared in the video game Star Wars: The Old Republic which was published by BioWare and released in 2011. Vexx is involved in the bounty hunter class quest \"The Last Flight\" in which he is an enemy character that players must kill. Vexx will have alternate dialogue if the player character is non-Human, calling them an \"ugly alien brute\" rather than just a \"brute enforcer\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/3643_BBY",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Vexx%27s_Crew",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Smuggler/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Vorr_(Corellian)",
  "/wiki/Vye",
  "/wiki/Bounty/Legends",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Jiguuna",
  "/wiki/Death/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Hunter_(individual)",
  "/wiki/Captain/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Time/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Mako_(slicer)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Braden",
  "/wiki/Standard_day/Legends",
  "/wiki/Jiguuna_Spaceport",
  "/wiki/Datapad/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Zabrak/Legends",
  "/wiki/ID_tag",
  "/wiki/Jory",
  "/wiki/Mandalorian/Legends",
  "/wiki/Tarro_Blood",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Balmorra/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/The_galaxy/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Shirt",
  "/wiki/Jacket/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Electroblade",
  "/wiki/Flash_grenade",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}