{
 "name": "Vexx%27s_bodyguard",
 "display_name": "Vexx's bodyguard",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Vexx's Crew"
     ]
    }
   ]
  }
 ],
 "content": "The Corellian smuggler Vexx employed a Human male bodyguard as part of his crew during the Cold War between the Galactic Republic and Sith Empire. In 3643 BBY, the bodyguard and a number of Vexx's other men stood guard in a hangar of Jiguuna Spaceport on the planet Nal Hutta while Vexx waited to board a shuttle there. A bounty hunter entered the hangar and killed at least fifteen of the men guarding Vexx and then Vexx himself in order to claim a bounty on the smuggler.\nA Human male worked as the bodyguard for the Corellian smuggler and gunslinger Vexx during the Cold War between the Galactic Republic and Sith Empire. In 3643 BBY, the bodyguard and eighteen other members of Vexx's Crew stood guard in one of the hangars of the spaceport in the town of Jiguuna on the planet Nal Hutta as Vexx prepared to board a shuttle parked there. A bounty hunter aiming to claim a bounty on Vexx then entered the hangar and killed Vexx.\nThe bounty hunter also attacked the members of Vexx's Crew in the hangar and killed at least fifteen of them in order to send a message to the criminal underworld that signing on with outlaws like Vexx was a death sentence as long as the hunter was around.\nThe bodyguard had light skin and brown eyes.\nThe bodyguard wore a brown and white shirt with a brown jacket, blue and brown gloves, brown pants, and green boots. He used a vibrosword, a blaster pistol, and grenades in combat.\nVexx's bodyguard first appeared in the 2011 massively-multiplayer roleplaying game Star Wars: The Old Republic. He is one of nineteen optional enemies present during the bounty hunter class quest \"The Last Flight\", fifteen of who must be defeated for the bonus quest \"Sending a Message\". Vexx's bodyguard counts toward this number if defeated, but as not all enemies present have to be killed to complete the bonus objective this article does not assume he is amongst those killed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Vexx%27s_Crew",
  "/wiki/Corellian/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Vexx",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/3643_BBY",
  "/wiki/Bodyguard/Legends",
  "/wiki/Jiguuna_Spaceport",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Hunter_(individual)",
  "/wiki/Death/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Jiguuna",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Shirt",
  "/wiki/Jacket/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Vibrosword/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}