{
 "name": "Vi_Moradi",
 "display_name": "Vi Moradi",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chaaktil"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red",
      "yellow",
      "Black with blue tips"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Vi Moradi, also known by the codenames Starling, Amaka Kottu, Evette Harlo, Magpie, or Mother Hen was a human female spy who served the Resistance. She performed missions investigating the origins of First Order Captain Phasma and establishing a Resistance base in the Black Spire Ruins on Batuu.\nVi Moradi, was a spy from the Inner Rim planet Chaaktil who served in the Resistance during the Cold War. At some point prior to the attack on Tuanul she and her droid, U5-GG, were captured in their starhopper and taken aboard the First Order battlecruiser Absolution. Whilst aboard the ship, she was interrogated for information about the past of Captain Phasma by Cardinal, a rival of Phasma, in exchange for her release.\nMoradi relayed all of the testimony she learned from Siv, a former comrade of Phasma's from Parnassos, about his rival, while in the meantime subtly prying information from Cardinal. In the end, when Cardinal demanded proof to accuse Phasma of murdering General Brendol Hux, Moradi provided him with a Parnassos beetle, the means of which Phasma committed the deed. After Cardinal failed to bring the evidence to his superiors and later lost a duel against Phasma, Moradi rescued him and later traveled to Parnassos to rescue Siv as well as her daughter Torbi.\nMoradi later visited Black Spire Outpost on Batuu, where she would send a message to all Resistance sympathizers to join the remaining Resistance forces on Batuu to help in the war between the Resistance and the First Order.\nMoradi met up with other Resistance members on Batuu where she was tasked with infiltrating the First Order shuttle in Black Spire Outpost to steal a datacard containing First Order fleet movements. While discussing the mission, the meeting was interrupted by two stormtroopers who were quickly disarmed by Chewbacca and other Resistance operatives. Although the stormtroopers attempted to threaten that reinforcements were on the way, Moradi rightly pointed out that they hadn't been able to report in the location where they had found the Resistance operatives. While aboard the shuttle, she was forced to hide from after being warned by Resistance sympathizers who distracted the troopers. After successfully stealing the datacard, she was able to hand it over to a pilot with Blue Squadron. Before she could return to base, she was confronted by Kylo Ren who demanded the location of General Organa and the Resistance Base. When she refused, Ren used the Force against her and prepared to strike her down. Ren however was stopped by the arrival of Rey, allowing Vi to move and engage a First Order Officer in combat which led to her escape. Vi then regrouped with the Resistance operatives and she was present when Blue Leader communicated with them stating that the Datacard had been successfully retrieved and en route to General Organa. Blue Leader then directed his thanks to Vi Moradi.\nWhen Archex tried to kiss Moradi, she rebuffed his advance. She told him she would be there for him as a friend and just about every way except sexually and romantically, and she cared about him, but not like that. Afterward, she remarked to herself that she had never cared for anyone, man or woman, in a sexual way. She had a brother named Baako Moradi whom she cared about deeply.\nVi Moradi was created for Delilah S. Dawson's 2017 novel Phasma. According to Dawson, Moradi can be seen as a \"female Poe Dameron\" for her humor, ego, and talent, but with an added dash of James Bond. Moradi was originally identified as \"Amaka\" on James Zapata's blog, who designed her, Cardinal's and Keldo's appearances. Dawson was asked to change the name to Vi when it was determined that the character would appear in Star Wars: Galaxy's Edge, for which the actress and stuntwoman Alex Marshall-Brown originated the role. The character played a role in the opening ceremonies for both versions of Galaxy's Edge, and can be randomly encountered by visitors. She is portrayed by a number of different actresses at both parks.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Vi_Moradi",
  "/wiki/Phasma_(novel)",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Allegiance_1",
  "/wiki/Black_Spire:_Return_to_a_Shattered_Planet",
  "/wiki/Halcyon_Legacy_5",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Resistance_Transport_Expansion_Pack",
  "/wiki/Star_Wars:_Tales_from_the_Galaxy%27s_Edge_%E2%80%93_Last_Call",
  "/wiki/Chaaktil",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Callsign",
  "/wiki/Spy",
  "/wiki/First_Order",
  "/wiki/Phasma",
  "/wiki/Black_Spire_Ruins",
  "/wiki/Batuu",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Cold_War",
  "/wiki/Attack_on_Tuanul",
  "/wiki/U5-GG",
  "/wiki/HH-87_Starhopper",
  "/wiki/Battlecruiser",
  "/wiki/Absolution",
  "/wiki/Starship",
  "/wiki/Captain",
  "/wiki/Archex",
  "/wiki/Siv",
  "/wiki/Parnassos",
  "/wiki/Death",
  "/wiki/General",
  "/wiki/Brendol_Hux",
  "/wiki/Parnassos_beetle",
  "/wiki/Torbi",
  "/wiki/Black_Spire_Outpost",
  "/wiki/First_Order-Resistance_War",
  "/wiki/TIE/es_assault_shuttle",
  "/wiki/Datacard",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Chewbacca",
  "/wiki/Pilot",
  "/wiki/Blue_Squadron_(Resistance)",
  "/wiki/Ben_Solo",
  "/wiki/Force_choke",
  "/wiki/Rey_Skywalker",
  "/wiki/Blue_Leader",
  "/wiki/Reproduction",
  "/wiki/Baako_Moradi",
  "/wiki/Delilah_S._Dawson",
  "/wiki/2017",
  "/wiki/Poe_Dameron",
  "/wiki/Keldo",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Alex_Marshall-Brown",
  "/wiki/The_Mandalorian_1",
  "/wiki/Phasma_(audiobook)",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Black_Spire_Outpost_(Galaxy_of_Adventures)",
  "/wiki/Rise_of_the_Resistance",
  "/wiki/The_Sims_4_Star_Wars:_Journey_to_Batuu",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/LEGO",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_First_Order",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Vi_Moradi",
  "/wiki/File:DawsonTweet05302019.png",
  "/wiki/File:AlexMarshall-Brown_tweet.png",
  "/wiki/May_30",
  "/wiki/2019",
  "/wiki/June_29",
  "/wiki/August_28",
  "/wiki/December_11",
  "/wiki/August_29"
 ]
}