{
 "name": "Vici_Ramunee",
 "display_name": "Vici Ramunee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 4016 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Tannis"
     ]
    }
   ]
  }
 ],
 "content": "Vici Ramunee was a female Human Jedi Knight of the Jedi Order serving the Galactic Republic during the Great Sith War.\nA Force-sensitive Human, Vici Ramunee was the third of eight children born to an Alderaanian family on their homeworld in the decade preceding the Great Sith War. Like her younger brother Veni, her Forcefulness was detected by a Jedi Master visiting the planet in search of candidates for Jedi training. Finding them at their family's estate near Lir Lake Master Tannis selected the Forceful siblings to train with the Jedi ; though she deemed the younger Ramunee too young to begin the training and assured him that she would return in two years time to retrieve him upon his ninth birthday.\nRamunee began her training under Master Tannis at the Jedi Praxeum on Teya IV, constructing her own lightsaber and excelling in her comprehension of the Force. Her brother was brought to the praxeum upon reaching his ninth birthday and in 4000 BBY, the 16-year-old Ramunee reached the end of her training as a Padawan under Mistress Tannis. As her final test, she was tasked with traveling alone to the Cave of Truth and to face her \"greatest foe\" with only the Force as her companion. She set out, but soon sensed someone approaching; indeed her brother had attempted to follow her with her smuggled lightsaber in his robes. She refused her weapon, knowing she must follow her instructions if she was to pass her Jedi Trials and become a Jedi Knight. Ordering her younger brother back to the praxeum, he claimed he did not know the way back and would have to accompany her into the cave.\nWith no choice, the older Ramunee allowed her brother to join with her and they successfully reached the mountains hours later. There, she sensed a large creature approaching and, with no obvious place to hide or flee, activated her lightsaber to protect her and her brother. The large, monstrous creature, however, turned out to be a Duinuogwuin Jedi Master called Willm Lywin. Lywin, amused by Ramunee's attempt to \"protect\" her brother, escorted the pair the rest of the way to Cave of Truth, where Vici Ramunee entered alone and emerged successful in her trials.\nVici Ramunee, who conquered her fears, and Veni Ramunee, who came to his sister's aid, shares their first names with the contents of the latin phrase \"Veni, vidi, vici\", which is commonly attrubuted to Julius Ceasar and translates to \"I came; I saw; I conquered.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/4016_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Tannis_(Jedi)",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Alderaanian/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Veni_Ramunee",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Lir_Lake",
  "/wiki/Teyan_Praxeum",
  "/wiki/Teya_IV",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/4000_BBY/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Cave_of_Truth",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Duinuogwuin/Legends",
  "/wiki/Willm_Lywin",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Most_Dangerous_Foe",
  "/wiki/Star_Wars_Adventure_Journal_11",
  "/wiki/Slaying_Dragons",
  "/wiki/Star_Wars_Adventure_Journal_9",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}