{
 "name": "Vicrul",
 "display_name": "Vicrul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "35 ABY",
      "Exegol"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.79 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Knights of Ren",
      "Crimson Dawn",
      "First Order"
     ]
    }
   ]
  }
 ],
 "content": "Vicrul was a Force-sensitive human male who served as a member of the Knights of Ren, under the command of an individual known as Ren. Serving Ren, the Knights would pillage, destroy and kill across the galaxy, until they fell under new leadership, that of the fallen Jedi Ben Solo, who became the apprentice of Supreme Leader Snoke, Kylo Ren. This brought the Knights into working with the First Order, and following Kylo's accession to Supreme Leader after killing Snoke, he and his Knights sought to hunt down the Jedi Rey, a mission which led Vicrul and the others to Pasaana and later Kijimi. However, Vicrul, alongside all his fellow knights, would meet their end at the hands of a redeemed Ben Solo, who fought and killed them during the climactic Battle of Exegol.\nAfter hearing from their master about the Force-sensitive criminal Karrst, who, along with his brother Filin, caused over one hundred deaths, Vicrul and the other Knights of Ren sought to locate him. Eventually finding the brothers under attack from forces of Sector Security, Vicrul and the Knights of Ren dealt with the aggressors while Ren spoke to Karrst.\nAfter Karrst hesitated when Ren informed him that entry into the Knights of Ren required the death of his brother, Filin instead killed Karrst and requested to join in his place. However, as Filin was not sensitive to the Force, Ren killed him. Vicrul asked Ren what they should do next, to which the leader of the Knights replied \"find something to burn\".\nAt some point before the rise of the First Order and their war against the Resistance, Vicrul joined the Knights of Ren, an organization of Force-sensitive warriors who followed the dark side and an ideology based on the Ren, the lightsaber wielded by Ren, the leader of the Knights. Traveling throughout the galaxy, the Knights of Ren searched for other Force users to join their ranks. At some point, the Knights acquired the starship Night Buzzard.\nAt some point, Vicrul, together with his fellow knights, Ap'lek, Cardo, Kuruk, Trudgen, Ushar and Ren traveled to Elphrona to steal artifacts in the Jedi outpost there. At the same time, Luke Skywalker, a young Ben Solo and Lor San Tekka were there too. When Solo discovered a lightsaber rifle, Ren told Skywalker that everything inside the outpost belonged to him and his allies as Vicrul and the other Knights confronted the trio. Skywalker retorted that it all belonged to him, as it was a Jedi outpost and he was the last Jedi. Telling the Knights that they were going to get what they came for, Ren ignited his lightsaber. Skywalker told San Tekka to stay out of the fight and ordered Solo to look after him. San Tekka protested that Skywalker would not be able to fight the seven Knights on his own. Igniting his lightsaber, Skywalker replied that he would be just fine.\nRen ordered the Knights to attack Skywalker. Dodging their attacks, Skywalker used the Force to repel the Knights, throwing them against the walls of the outpost, including Vicrul. On the side, San Tekka marveled at Skywalker's ability. Skywalker asked the Knights if they had enough, but Ren replied that they still had numbers on their side. Skywalker lifted their weapons into the air and crushed them, leaving only Ren with a weapon. Ren flipped a switch on his lightsaber, telling Skywalker that if the weapon left his hand it would explode, killing them all. He also added that he can sense the dark side in Solo. Skywalker told Ren to leave. Ren agreed, but unmasked himself first. He asked Solo whether he is sure he wants to be a Jedi, and told him to contact the Knights if he ever wanted to explore his dark side more.\nSome time after their skirmish against Sector Security, Vicrul, Ren, and the other Knights took a break at a cantina on the planet Varnak. While resting at the bar, Vicrul approached Ren to inform him of a new arrival at the door of the cantina, telling him to check it out. To Ren's pleasant surprise, a bruised, battered but alive Ben Solo stood in the doorway. Vicrul stood by and watched as Ren and Solo spoke, Ren musing how Solo took his time in getting to them, and caught them just before they planned to leave. Solo said he was held up, and Ren told him he looked as I felt he did been chewed up, and spit out, a statement that frustrated Solo, to which Ren told him that it was just a joke. Ren removed his mask, saying that it made talking to him more intense than it ought to be, but mused that Snoke believed the Knights and Solo could be friends.\nSolo declared that he wanted to travel with the Knights, citing that he would be useful, and that he was strong in the Force. Ren then told him the price was to cause a good death. When Solo mentioned he had already taken a life, Vicrul and the Knights gathered around Ren, who said that he and the Knights would love to hear the story, and to tell them who he had killed. Solo told them of Voe, Tai and Hennix, three Jedi he trained alongside under Luke Skywalker, all three of whom survived the destruction of Luke's temple, and pursued Solo for answers. After telling the Knights the events that caused the death of Hennix, Ren asked Vicrul and the other Knights what they thought. Agreeing with them Ren told Solo that while it was indeed a death, it was not a good death, at least not good enough to appease the Knights of Ren. Solo tried to argue the point, only for Ren to point out that he didn't really want Hennix dead. Ren then stood up, Vicrul and the others moving to his side, with Ren agreeing to bring Solo with them, to see if they liked him, and he liked them, and that maybe he would find his good death.\nVicrul traveled with the Knights, Ren, and Solo, who had been equipped with a new outfit at Ren's order, to the Minemoon of Mimban in the Mid Rim, where he and the other Knights captured several miners. After Solo used the Force to look into one of the miners minds to find the location of the artifact the Knights hoped to steal, Ren ordered Vicrul and the others to kill all the captive miners, which they did without hesitation or remorse, with Vicrul brutally stabbing one with his scythe. The Knights then journeyed deeper into the underground of the moon, seeking the Mindsplinter. Ren then ordered Vicrul and the others to jump down and kill all the miners, so they could then steal the Mindsplinter without resistance. However, the seemingly easy mission was interrupted by the arrival of Voe and Tai.\nWhile Vicrul and the other Knights killed the miners, Voe attacked them. Vicrul lunged at her, swinging his scythe in an attempt to cut her down at Ren's furious command, but before he could strike, Vicrul was kicked in the face by Voe, and sent sprawling. As these events played out, Ben had started to fight Ren, who had killed Tai and was now intent on killing Solo too. However, the battle did not go in Ren's favor, as Vicrul and the other Knights watched as Solo stabbed and killed Ren, earning his good death in the process.\nWith Ren dead, and Solo having proved himself, having killed both Ren and Voe, he had earned Vicrul and the other Knights respect. Vicrul and the others kneeled before him, a silent declaration of loyalty to their new master. Vicrul, the Knights and their new master then delegated the cavern as it exploded, and left the Minemoon. Aboard the Night Buzzard, Vicrul and the other Knights watched as Solo tinkered with the multitude of lightsabers he had claimed from his victims, before eventually bleeding his once blue kyber crystal red, and forging a crossguard lightsaber. Solo earned the title of master of the Knights of Ren, and later took the name Kylo Ren, abandoning his old life entirely. He would lead the Knights on missions of pillage and destruction as their leader.\nThe Knights' service to Kylo Ren also brought them into the service of the First Order, formerly ruled by Supreme Leader Snoke, until his death at the hands of Ren, who took the title of Supreme Leader for himself. When Ren started to visit places of his past, he was accompanied by the Knights of Ren when he returned to the Jedi outpost of Elphrona, where Vicrul first met Ben Solo. Ren mentioned that they were looking for a ghost inside the outpost, to which Vicrul replied by saying that he did not sense any ghosts. This exchange led to Ren reminding Vicrul how they were defeated on Elphrona before leaving.\nSome point in 35 ABY, Vicrul and the knights surrounded Ren and Albrekh, who was fixing Ren's helmet, which he had previously crushed. After the helmet's reforging, Vicrul and the other Knights accompanied Ren to the Steadfast via their ship, the Night Buzzard. As they walked with Ren passing the hallways, they got the attention of two stormtroopers, who found their arrival to be cool. Upon arriving at the briefing, Kylo dumped the head of the Ovissian Boolio, which he and the Knights had brought back following the discovery of a spy in the First Order.\nVicrul and the Knights traveled with Ren to the desert world of Pasaana, after learning that Rey and her allies were there. As Rey went to confront Ren. Ap'lek and Kuruk stalked on Chewbacca, later capturing him and bringing him to stormtroopers, where Vicrul and the others stood by as Chewbacca was loaded aboard a transport, alongside his belongings, and the dagger he was holding. The Knights took the captive back to the Steadfast.\nWhen the Steadfast arrived at the world of Kijimi, Vicrul and the other Knights journeyed to the surface, hunting for any sign of Rey and her allies, yet were unsuccessful in their search of the city.\nA short time after the hunt for Rey, Vicrul and the other Knights of Ren were lurking in the Sith Citadel of Darth Sidious on Exegol. During the battle of Exegol, Kylo Ren, now the redeemed Ben Solo, entered the Citadel in an attempt to kill Sidious.\nBefore Solo could reach the Throne of the Sith, Vicrul and the Knights confronted their former leader; like the other Knights, Vicrul's loyalty had never been to Solo, but to Sidious. The Knights were able to swiftly overwhelm Solo in his unarmed state, forcing him to the ground and beating him. However, through the use of their Force-bond, Rey was able to give Solo his grandfather's lightsaber. With Anakin's lightsaber, Solo swiftly cut down Cardo and dueled with the remaining five Knights. His scythe restrained under the lightsaber's blade, Solo used the opening to Force push Ap'lek into a chasm before cutting Vicrul down.\nThe remaining Knights perished as well, leaving Solo and Rey to confront the Emperor. Sidious was ultimately destroyed, though it came at the cost of Solo's life, ending the Knights of Ren with his demise.\nVicrul was Force-sensitive, and an adept in the dark side of the Force. Although he was untrained in the Force, Vicrul was still capable of manifesting some Force powers, but these powers came unbidden and uncontrolled. Vicrul passively projected fear on his opponents, and possessed enhanced reflexes. Vicrul, alongside the other Knights of Ren, had fighting skills and martial prowess few could rival. Vicrul saw himself as a harvester, using his ultrasonic scythe to cut down enemies and take their souls to augment his power. Despite Vicrul's apparent skill, he was still effortlessly cut down by Ben Solo during the Battle of Exegol.\nVicrul's weapon of choice was an annealed phrik scythe. Vicrul's scythe featured an ultrasonic vibro-tech setting that allowed the blade to rend flesh with the smallest of glancing blows. Despite preferring to fight his opponents at close range, Vicrul carried a blaster pistol holstered to his hip in case of emergency.\nVicrul wore predominately black clothing like the rest of the Knights. He was mostly covered in a coat made from the skin of a monstrously large reptilian creature he had killed in the past. Vicrul's helmet was made of pastillion ore, with synth-leather ear flaps that concealed the helmet's opening seam.\nVicrul first appeared in a Force vision in the 2015 film Star Wars: Episode VII The Force Awakens, the first installment in the Star Wars sequel trilogy. In the 2019 film Star Wars: Episode IX The Rise of Skywalker, Vicrul was portrayed by martial artist Anton Simpson-Tidy, although the character was only listed as \"Knight of Ren\" in the film's credits. The character was simultaneously identified in Star Wars: The Rise of Skywalker: The Visual Dictionary, Star Wars: The Rise of Skywalker: The Galactic Guide, and his card in Star Wars: Card Trader, all of which were released in tandem with the movie.\nThe design for Vicrul was created by artist Glyn Dillon for The Force Awakens. Like the other Knights, Vicrul's design was based off of unused concept art for the \"Jedi Killer\", a character that eventually evolved into Kylo Ren. Dillon referred to Vicrul's design as \"grenade head\" in The Art of Star Wars: The Force Awakens.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Vicrul",
  "/wiki/35_ABY",
  "/wiki/Exegol",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Knights_of_Ren",
  "/wiki/Crimson_Dawn",
  "/wiki/First_Order",
  "/wiki/Force-sensitive",
  "/wiki/Ren_(human)",
  "/wiki/Jedi",
  "/wiki/Ben_Solo",
  "/wiki/Supreme_Leader",
  "/wiki/Snoke",
  "/wiki/Rey_Skywalker",
  "/wiki/Pasaana",
  "/wiki/Kijimi",
  "/wiki/Battle_of_Exegol",
  "/wiki/Karrst",
  "/wiki/Filin",
  "/wiki/Death",
  "/wiki/Sector_Security",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Resistance",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Ren_(lightsaber)",
  "/wiki/Lightsaber",
  "/wiki/The_galaxy",
  "/wiki/The_Force",
  "/wiki/Night_Buzzard",
  "/wiki/File:Vicrul_attacks_Luke.jpg",
  "/wiki/Ap%27lek",
  "/wiki/Cardo",
  "/wiki/Kuruk",
  "/wiki/Trudgen",
  "/wiki/Ushar",
  "/wiki/Elphrona",
  "/wiki/Elphrona_Outpost",
  "/wiki/Luke_Skywalker",
  "/wiki/Lor_San_Tekka",
  "/wiki/Lightsaber_rifle",
  "/wiki/Luke_Skywalker%27s_lightsaber",
  "/wiki/File:KyloRenBetaTestVersion.jpg",
  "/wiki/Cantina",
  "/wiki/Varnak",
  "/wiki/Voe",
  "/wiki/Tai",
  "/wiki/Hennix",
  "/wiki/File:KnightsOfRenAcceptANewMaster.png",
  "/wiki/Minemoon",
  "/wiki/Mimban",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Miner",
  "/wiki/Mindsplinter",
  "/wiki/Kyber_crystal",
  "/wiki/Kylo_Ren%27s_lightsaber",
  "/wiki/Master_of_the_Knights_of_Ren",
  "/wiki/File:Knights_of_Ren_return_to_Elphrona.jpg",
  "/wiki/Albrekh",
  "/wiki/Kylo_Ren%27s_helmet",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Ovissian",
  "/wiki/Boolio",
  "/wiki/Chewbacca",
  "/wiki/Ochi%27s_blade",
  "/wiki/Sith_Citadel",
  "/wiki/Darth_Sidious",
  "/wiki/File:KyloFacesTheKnightsOfRen.png",
  "/wiki/Throne_of_the_Sith",
  "/wiki/Force-bond",
  "/wiki/Skywalker_lightsaber",
  "/wiki/Anakin_Skywalker",
  "/wiki/Force_push",
  "/wiki/Dark_side_adept",
  "/wiki/Force_power",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Phrik",
  "/wiki/Vicrul%27s_scythe",
  "/wiki/Vibro_weapon",
  "/wiki/Blaster_pistol",
  "/wiki/Holster",
  "/wiki/Color",
  "/wiki/Reptile",
  "/wiki/Helmet",
  "/wiki/Pastillion_ore",
  "/wiki/File:Knights-of-Ren-concept-art.jpg",
  "/wiki/2015",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars",
  "/wiki/Sequel_trilogy",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Anton_Simpson-Tidy",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Glyn_Dillon",
  "/wiki/The_Art_of_Star_Wars:_The_Force_Awakens",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:Vicrul",
  "/wiki/War_of_the_Bounty_Hunters_5",
  "/wiki/Crimson_Reign_1",
  "/wiki/Crimson_Reign_4",
  "/wiki/Bounty_Hunters_22",
  "/wiki/Bounty_Hunters_24",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Crimson_Reign_5",
  "/wiki/The_Rise_of_Kylo_Ren_1",
  "/wiki/The_Rise_of_Kylo_Ren_2",
  "/wiki/The_Rise_of_Kylo_Ren_3",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/Star_Wars:_The_Force_Awakens_Graphic_Novel_Adaptation",
  "/wiki/The_Force_Awakens_Adaptation_4",
  "/wiki/See_You_Around,_Kid",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Kylo_Ren_vs._Resistance_Rebels",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/The_Rise_of_Skywalker_Adaptation_1",
  "/wiki/LEGO_Star_Wars_Terrifying_Tales",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_21",
  "/wiki/Helmets",
  "/wiki/Star_Wars_Helmet_Collection_51",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_IX:_The_Rise_of_Skywalker",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Star_Wars_Bust_Collection",
  "/wiki/Star_Wars_Bust_Collection_75",
  "/wiki/Star_Wars_Universe",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/December_20"
 ]
}