{
 "name": "Victor_Visalis",
 "display_name": "Victor Visalis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Bluish green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Victor Visalis was a Human male who served as the Officer of Defense for Bestine, the capital of the planet Tatooine sometime after the Battle of Yavin during the Galactic Civil War. During that time, he was involved in a political campaign against Director of Commerce Sean Trenwell for Mayor of Bestine. Victor hired a spacer to help with his campaign by obtaining evidence to further his campaign. After winning the election, Victor contracted the spacer to find and kill the Tusken Raider executioner in an effort to halt a series of Tusken raids on Bestine.\nSome time during 1 ABY, Victor Visalis set up an office in the Bestine Capitol building. From here, Victor carried out his campaign to run for mayor of Bestine, with the help of his secretary Keanna Li'kyna. Spacers who supported his campaign would gather evidence to support Victor's appointment to mayor, and submit their vote for him to Governor Tour Aryon. One piece of evidence that a spacer found was proof that Victor donated one million credits to the Lightwind Orphanage. Victor's primary campaign position was his emphasis on securing Bestine from Tusken Raider attacks. If elected, he promised to increase the number of stormtrooper patrols in Bestine, to keep its citizens safe. For this reason, he gained much support from Bestine's Imperial garrison.\nThroughout 1 ABY, Victor Visalis would periodically win mayoral elections against Sean Trenwell. However, defeats were not uncommon either. He would reward all his voters with an Imperial Banner, or Loyalist Badge when he became mayor, and Imperial stormtrooper patrols would notably increase throughout the city. After one successful election, Victor tasked a spacer with a mission to eliminate a Tusken Executioner, hidden in the caves beneath Fort Tusken. Upon returning the Tusken's head to Victor, the spacer was rewarded with a rare Lithitanium rifle.\nVictor Visalis was a Non-Player Character  in the MMORPG Star Wars Galaxies prior to the games closure on December 15, 2011. He was featured in the Bestine Political Election mini story-arc. Players had to run a short quest for him, before voting in his favor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brown",
  "/wiki/Blue",
  "/wiki/Green_(disambiguation)",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Officer_of_Defense",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Time/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Director_of_Commerce",
  "/wiki/Sean_Trenwell",
  "/wiki/Mayor/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Death/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Bestine_Capitol",
  "/wiki/Keanna_Li%27kyna",
  "/wiki/Governor/Legends",
  "/wiki/Tour_Aryon",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Lightwind_Orphanage",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Imperial_garrison_(Bestine)",
  "/wiki/Fort_Tusken/Legends",
  "/wiki/Lithitanium_rifle",
  "/wiki/December_15",
  "/wiki/2011",
  "/wiki/Sony"
 ]
}