{
 "name": "Viiveenn",
 "display_name": "Viiveenn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yarua's family"
     ]
    }
   ]
  }
 ],
 "content": "Viiveenn was a Wookiee female who was the daughter of Galactic Republic Senator Yarua. During the Clone Wars, she accompanied her father and Senator Padmé Amidala on a diplomatic mission to the Moon of Staggec. However, upon their arrival they discovered they had fallen into a Separatist trap. Yarua hid a valuable item he had been carrying in Viiveenn's toy dolly and then sent her to hide in a nearby forest.\nThe young Wookiee was later discovered in the forest by the Jedi Anakin Skywalker and Obi-Wan Kenobi, who had come to rescue the senators from captivity. Viiveenn led them to where her father was being held, but then rushed to try and reach him, resulting in her and Kenobi being captured and brought onboard a Separatist starship. Kenobi managed to escape captivity before Separatist General Grievous confronted Yarua about the valuable item.\nWhen Kenobi returned, he fought with Grievous, who threatened Viiveenn during the fight. Yarua then launched himself into Grievous to save her, causing both the senator and the general to fall through a hangar door into space. Yarua perished, and a devastated Viiveenn was comforted by Kenobi and Amidala, who arranged for her to return to the planet Kashyyyk where her family could comfort her.\nViiveenn was a Wookiee female who was daughter of Senator Yarua, who represented the planet Kashyyyk in the Galactic Senate of the Republic. During the Clone Wars between the Republic and the Confederacy of Independent Systems, Viiveenn accompanied her father and Senator Padmé Amidala on a diplomatic mission to the moon of Staggec in the Outer Rim Territories. After landing on the moon in their Consular-class cruiser, the two senators disembarked with Viiveenn and Amidala's protocol droid, C-3PO. Amidala complimented Viiveenn and asked her name, with C-3PO translating the young Wookiee's responses.\nThe delegation from Staggec had agreed to form an alliance with the Republic in exchange for a valuable item that Yarua was carrying; however, the senators found no party waiting to greet them, and quickly realized they had fallen into a trap when a trio of Separatist frigates appeared in the sky overhead. Yarua then took a doll that his daughter was carrying and hid the valuable item inside before returning the toy to Viiveenn and telling her to hide in a nearby forest.\nViiveenn did as instructed and avoided being captured by the Separatists when her father and Amidala were taken hostage. The Jedi Anakin Skywalker and Obi-Wan Kenobi, who had been sent to rescue the senators, later discovered Viiveenn in the forest after following her trail from where the cruiser had landed. She explained to them what had happened and them led them to where her father was being held. Enroute, Skywalker rushed ahead until she stopped him in order to prevent him from walking into a trap. The young Wookiee then gifted Skywalker a flower before continuing.\nThe group eventually reached the top of a cliff from where they could see B1-series battle droids leading the captive Yarua onboard a Sheathipede-class transport shuttle. Before the Jedi could form a plan, Viiveenn ran down the cliff to try and reach her father. Kenobi rushed down after her, shielding the Wookiee when the battle droids opened fire. The landing incapacitated Kenobi and he and Viiveenn were loaded onto the departing shuttle before Skywalker could reach them.\nThe trio of prisoners were delivered onto a larger Separatist vessel, where the droids guarding them left the prisoners unattended while searching for restraints for Kenobi, who they believed to be unconscious. Viiveenn realized that the Jedi had in fact woken, but he signalled for her to remain quiet and then escaped to search for Amidala. While Kenobi was gone, Separatist General Grievous confronted Yarua and demanded the valuable item, but Kenobi soon interrupted him upon his return. The Jedi and the general fought, but after Kenobi gained the upper hand, Grievous grabbed Viiveenn and held his lightsaber to her throat. Kenobi demanded he release her, but before either could act, the still bound Yarua launched himself at the general.\nThe Separatist released Viiveenn as he and Yarua fell back through a shielded hangar door into space, killing Yarua and defeating Grievous. As she wailed at her the loss of her father, Kenobi hugged Viiveenn close. Viiveenn and the Jedi later departed the moon of Staggec in the Jedi's Eta-class shuttle alongside Amidala and the delegation from Staggec, who Skywalker had rescued. The weeping Viiveenn wascomforted by Amidala, before falling asleep in her arms during the journey. A shuttle was arranged to take her back to Kashyyyk, where it was hoped her family would help comfort her. The Jedi reported being unable to locate the valuable item that Yarua had carried, unaware that it was still hidden within Viiveen's doll.\nViiveenn was scared when her father sent her to hide in the forest and hugged him before obeying. When she later saw him again she rushed into danger to try and reach him, but was worried for Kenobi after he was incapacitated trying to defend her. During the confrontation with Grievous, she clutched at Yarua's leg until she was grabbed by the general, and upon her fathers death she whimpered quietly, devastated at his loss. Viiveenn had brown hair and brown eyes. She spoke one of the Wookiee languages and did not understand Galactic Basic Standard.\nViiveenn wore ties in her hair to either side of her face and carried a small Wookiee-like doll with her.\nViiveenn was created for Hyperspace Stories 1, which was written by Amanda Deibert and illustrated by Lucas Marangon. Prior to the comic's release on August 24, 2022, Viiveenn was first mentioned on July 22 of that year in a blog post on StarWars.com covering a panel at Star Wars Celebration Anaheim where the comic had been first revealed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookiee",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Yarua%27s_family",
  "/wiki/Galactic_Republic",
  "/wiki/Senator",
  "/wiki/Yarua",
  "/wiki/Clone_Wars",
  "/wiki/Parent",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Mission_to_the_moon_of_Staggec",
  "/wiki/Moon_of_Staggec",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Unidentified_valuable_item",
  "/wiki/Forest",
  "/wiki/Youngling",
  "/wiki/Jedi",
  "/wiki/Anakin_Skywalker",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Starship",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Lightsaber_combat",
  "/wiki/Hangar",
  "/wiki/Realspace",
  "/wiki/Planet",
  "/wiki/Kashyyyk",
  "/wiki/Galactic_Senate",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Moon",
  "/wiki/Consular-class_cruiser",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Moon_of_Staggec_delegation",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Cruiser",
  "/wiki/Plant",
  "/wiki/B1-series_battle_droid",
  "/wiki/Sheathipede-class_transport_shuttle",
  "/wiki/Battle_droid",
  "/wiki/Shuttle",
  "/wiki/Droid",
  "/wiki/Lightsaber",
  "/wiki/Deflector_shield",
  "/wiki/Death",
  "/wiki/Eta-class_shuttle",
  "/wiki/Sleep",
  "/wiki/Limb",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Language",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Hyperspace_Stories_1",
  "/wiki/Amanda_Deibert",
  "/wiki/Lucas_Marangon",
  "/wiki/August_24",
  "/wiki/2022",
  "/wiki/July_22",
  "/wiki/StarWars.com",
  "/wiki/Celebration_Anaheim_(2022)",
  "/wiki/Category:Images_of_Viiveenn",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Chancellors,_Senators_and_Other_Statesmen_of_the_Republic",
  "/wiki/Dark_Horse_Comics"
 ]
}