{
 "name": "Vika_Surn",
 "display_name": "Vika Surn",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Neuvalis"
     ]
    }
   ]
  }
 ],
 "content": "Vika Surn was one half of one of the most famous brother and sister bounty hunter teams. The other half was her younger brother, Alic Surn. They operated through House Neuvalis, hunting in the Inner Rim.\nAlic and Vika complemented each other well. Vika was a steadying influence on her brother, while Alic helped his sister deal with the emotional disorders that led to her frequent outbursts of anger against friend or foe. Vika's emotional orders likely stemmed from a very early age. While it could not be proven she was responsible for her parents' death, she was hospitalized several times for observation for mental anguish following the deaths of her parents in a speeder accident.\nWhen working with her brother, Vika was responsible for any necessary kills. She constantly trained, trying to reach the peak of physical perfection. Her tall, muscular frame and vibroblade scar down her right cheek was evidence of her hard conditioning. Vika possessed super-Human stamina.\nThe Surns paid the Neuvalis syndicate a five percent gap in exchange for the use of their transport ship, a modified Incom scout ship named Widow Maker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/House_Neuvalis",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Alic_Surn",
  "/wiki/Inner_Rim",
  "/wiki/Speeder/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Incom_Corporation/Legends",
  "/wiki/Widow_Maker",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Playing_A_Major_Role",
  "/wiki/Star_Wars_Galaxy_Collector_1"
 ]
}