{
 "name": "Vildar_Blin",
 "display_name": "Vildar Blin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Vildar Blin was a Human male corporal and scout of the Alliance Special Forces during the Galactic Civil War. After his brother betrayed their family by joining the Galactic Empire's Commission for the Preservation of the New Order, Blin joined the Bormea sector's Rebel underground, and he later served with Alliance High Command at its Echo Base headquarters on the ice planet Hoth. Blin was killed during the Battle of Hoth in 3 ABY while storming a downed All Terrain Armored Transport that exploded as a result of friendly Rebel snowspeeder fire.\nVildar Blin was once a member of the local security force on the planet Corulag, in the Bormea sector of the Core Worlds. However, Blin joined the sector's Rebel underground after his brother betrayed their family by joining the Imperial Commission for the Preservation of the New Order. Eventually, Blin was assigned to the Alliance High Command headquarters of Echo Base on the Outer Rim Territories ice planet Hoth, where he served with Alliance Special Forces as a corporal.\nDuring the Battle of Hoth in 3 ABY, the Rebel Alliance's worst battlefield defeat of the Galactic Civil War, Blin fought in the defensive trenches surrounding Echo Base, under the command of Colonel Ledick Firest. Trained in reconnaissance, Blin helped spot for the Rebels' artillery and marked for capture any salvageable Imperial equipment from fallen All Terrain Armored Transports.\nIn the skies above the trenches, Rogue Group pilot Wedge Antilles downed one of the AT-ATs by ensnaring its legs with high-tension cable from his T-47 airspeeder, or \"snowspeeder,\" tripping it to the ground, the first Imperial walker neutralized during the battle. Blin and an assistant boisterously stormed out of the trenches at Firest's behest for the grounded AT-AT. They reached the walker before any Imperials could emerge and were about to enter the AT-AT when a snowspeeder pilot fired upon the vulnerable walker, destroying it. Large chunks of shrapnel flung the Rebel soldiers backward, and Blin and his assistant were killed in the explosion.\nVildar Blin served the Rebel Alliance Special Forces as a scout. Even before joining the Alliance, he had prior training in first-response tactics and already boasted special forces experience. As such, Blin was regularly assigned to reconnaissance missions, which encompassed his artillery observation and salvage duties at the Battle of Hoth. Blin, a Human, sported a beard of brown hair by the time of the Hoth battle and had light skin.\nDuring the Battle of Hoth, Blin wore the standard cold-weather armor of the Echo Base field troops, including headgear, anti-glare goggles, padded vest]], thermal flak jacket, gloves, belt, leggings, boots, and backpack. His equipment also included binoculars, and he carried a sizable piece of equipment during his ill-fated charge of the downed AT-AT during the battle.\nVildar Blin appears briefly in the 1980 film Star Wars: Episode V The Empire Strikes Back, running across the Hoth plains for the first downed AT-AT walker at the Battle of Hoth, before the shot cuts to an explosion of the walker. The character's identity and role as a first-response scout were created for the \"Rebel Scout\" card as part of the November 1996 Hoth Limited expansion set of the Star Wars Customizable Card Game.\nBlin's backstory was later expounded upon in the 2004 article Who's Who in Echo Base in Star Wars Insider 74, the first source to confirm his death in the walker explosion. Blin's death in the Who's Who article draws upon a scene that appears in The Empire Strikes Back novelization, in which a group of Rebels charge the downed AT-AT and are subsequently caught in its explosion. However, in the novelization, the AT-AT explodes from within rather than from Rebel snowspeeder fire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3_ABY/Legends",
  "/wiki/Hoth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Corporal/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Alliance_Special_Forces/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Vildar_Blin%27s_brother",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order/Legends",
  "/wiki/Bormea_sector/Legends",
  "/wiki/Bormea_sector_Rebel_underground",
  "/wiki/Alliance_High_Command/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Water/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Death/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/T-47_airspeeder/Legends",
  "/wiki/Corulag_security_force",
  "/wiki/Corulag/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Ledick_Firest/Legends",
  "/wiki/Artillery/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Rebel_pilot/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Blizzard_2/Legends",
  "/wiki/Power_harpoon",
  "/wiki/Walker/Legends",
  "/wiki/Vildar_Blin%27s_assistant",
  "/wiki/Pilot/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Special_forces/Legends",
  "/wiki/Time/Legends",
  "/wiki/Alliance_Cold_Weather_armor",
  "/wiki/Troop/Legends",
  "/wiki/Alliance_Cold_Weather_Headgear",
  "/wiki/Anti-glare_goggles/Legends",
  "/wiki/Thermal_flak_jacket",
  "/wiki/Alliance_Cold_Weather_Backpack/Legends",
  "/wiki/Binoculars/Legends",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/November",
  "/wiki/1996",
  "/wiki/Hoth_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/2004",
  "/wiki/Who%27s_Who_in_Echo_Base",
  "/wiki/Star_Wars_Insider_74",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(junior_novelization)",
  "/wiki/The_Empire_Strikes_Back_Notebook",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back:_The_Illustrated_Screenplay",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back_(Second_Edition)"
 ]
}