{
 "name": "Vilim_Disra",
 "display_name": "Vilim Disra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Central Committee of Grand Moffs",
      "Imperial RemnantCouncil of Moffs",
      "Council of Moffs",
      "Sinister Triumvirate"
     ]
    }
   ]
  }
 ],
 "content": "Vilim Disra was the human male politician who was the Grand Moff of the Imperial Remnant by 19 ABY. Disra was also in charge of the Braxant sector and a member of the Council of Moffs, who used his powers to be the lead man of a secret triumvirate comprised of himself, former Emperor's Royal Guard Major Grodin Tierce and a con-artist named Flim. His faction was assembled in order to bring the New Republic into an internal civil war over the Bothan's involvement concerning the Caamas Document in order to keep the Supreme Commander, then-Fleet Admiral Gilad Pellaeon, from successfully making peace with the New Republic. Previously, Disra had been a member of the Central Committee of Grand Moffs that supported Trioculus's claim to the Imperial throne.\nIn 3 BBY, Disra became chief administrator of Shelsha sector, under Governor Barshnis Choard. In 0.5 ABY he double-crossed Choard, who wanted to orchestrate a secession of Shelsa from the Galactic Empire. For roughly two years, Disra worked with Choard and a mercenary named Caaldra to put together an allegiance of pirate gangs under the BloodScars and place them with the resources they would need to take over specific Imperial targets when the time came. Disra also managed to make contacts within the Rebel Alliance, pretending that Shelsha would ally with the Rebellion in exchange for the Alliance's help in defending Shelsha from the expected Imperial reprisal.\nHowever, Disra was planning to betray Choard, Caaldra, and the Rebel Alliance all along. He kept detailed records of everything, so that when the time came he could turn over Choard to Lord Vader and present himself as a hero to the Empire. He succeeded in his plan, made easier because Lord Vader and his 501st Legion were already on Shelsha's capital of Shelkonwa due to a tip Disra had called in to Imperial Center informing Vader that Princess Leia Organa was in the city. Though Disra had the city under lockdown to prevent her escape, she managed to do so with the help of Luke Skywalker, Han Solo, the Hand of Judgment, and—unwittingly—Mara Jade. Disra made it clear to Vader that he wished to be named Governor of Shelsha after Choard's removal, but Palpatine refused to do so.\nAt some point Disra sat on the Central Committee of Grand Moffs approximately a year after the Battle of Endor. Afterward, he was demoted . He engaged in the maneuvering that resulted in the assassination of Grand Admiral Rufaan Tigellinus, allowing Disra to take his place at the Committee. In 11 ABY, he began searching for someone to impersonate Thrawn successfully, to use in a plan to overthrow the New Republic. By 19 ABY he was one of the eight members of the Council of Moffs.\nDisra later hired the con artist Flim to portray Grand Admiral Thrawn in order to consolidate Imperial military power under the command of a triumvirate consisting of Disra, Flim, and Major Grodin Tierce. Under the nominal leadership of Disra, the triumvirate laid out a plan to sabotage part of the planetary shield of Bothawui. Meanwhile, they manipulated hostilities arising from the discovery of a datacard implicating the Bothans in the post-Clone Wars bombardment of Caamas.\nDisra also employed the services of pirate gangs, most notably the Cavrilhu gang under Captain Zothip. The Remnant loaned Zothip's gang leftover clones from Thrawn's campaign against the New Republic 10 years earlier, and in return was supplied with Preybird-class starfighters. The Preybirds were badly needed to augment the dwindling supply of TIE fighters in the Imperial Navy, and though far less intimidating, the Preybirds proved to be capable replacements. Disra hired the pirates to attack New Republic shipping convoys, letting Zothip's gang keep anything of value while forcing the New Republic to use valuable resources trying to stop the attacks. Disra used Zothip as a pawn until Zothip arrived at Disra's private office on Bastion with murderous intent. Fortunately for Disra, Zothip was killed by an assassin, a Mistryl Shadow Guard who had also sneaked into his estate.\nThough Disra was the creator of the secret triumvirate, he never really controlled it. Major Tierce manipulated the group from the beginning. Disra planned betrayal, plotting to kill Tierce and Flim when it came time to do so. He was unaware that Tierce knew of this, but he was in constant disagreement with the soldier, whom he suspected of planning to usurp his leadership. Disra continually attempted to gain the upper hand over him, but never really succeeded. As the first shots over Bothawui were fired, it was revealed that Tierce was, in fact, an unstable clone from a failed project. Disra's triumvirate was laid bare by information procured by smuggler/information broker Talon Karrde and Disra was arrested on grounds of treason.\nThe Council of Moffs replaced him with Ephin Sarreti.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Central_Committee_of_Grand_Moffs",
  "/wiki/Imperial_Remnant",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Sinister_Triumvirate",
  "/wiki/Politics/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Braxant_sector",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Major/Legends",
  "/wiki/Grodin_Tierce",
  "/wiki/Flim",
  "/wiki/New_Republic/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Caamas_Document",
  "/wiki/Supreme_Commander_(Empire)/Legends",
  "/wiki/Fleet_Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Trioculus",
  "/wiki/3_BBY/Legends",
  "/wiki/Shelsha_sector",
  "/wiki/Governor/Legends",
  "/wiki/Barshnis_Choard",
  "/wiki/0_ABY/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Caaldra",
  "/wiki/Pirate/Legends",
  "/wiki/BloodScar",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/501st_Legion/Legends",
  "/wiki/Shelkonwa",
  "/wiki/Coruscant/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Skirmish_on_Shelkonwa",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Hand_of_Judgment",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Bertroff_Hissa",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Rufaan_Tigellinus",
  "/wiki/11_ABY/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Caamas_Document_Crisis",
  "/wiki/Con_artist/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Datacard/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Caamas/Legends",
  "/wiki/Zothip",
  "/wiki/Preybird-class_starfighter",
  "/wiki/TIE/LN_starfighter",
  "/wiki/Talon_Karrde",
  "/wiki/Treason/Legends",
  "/wiki/Ephin_Sarreti",
  "/wiki/Allegiance_(novel)",
  "/wiki/Allegiance_(audiobook)",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Star_Wars_Adventure_Journal_8",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_102",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Star_Wars_Insider_66",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Andray",
  "/wiki/Bemos",
  "/wiki/Edan",
  "/wiki/Hort",
  "/wiki/Quillan_(Moff)",
  "/wiki/Sander",
  "/wiki/Vered",
  "/wiki/Star_Wars:_The_Hand_of_Thrawn_Duology"
 ]
}