{
 "name": "Villar",
 "display_name": "Villar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Villar was a male Devaronian information broker who often aided the Galactic Empire. A skilled fighter who excelled at espionage, Villar was a typical member of his species. He longed to see the galaxy, but such travels required money. Villar turned to the intelligence business, gathering information on his journeys and selling it to highest bidder. Usually, the Devaronian sold whatever knowledge he had acquired to the Empire.\nA male Devaronian, Villar held a desire to travel throughout the galaxy. As exploration was a costly venture, he needed access to credits. Forced to find an occupation to finance his hobby, Villar became an information broker and collected intelligence during his journeys to offer to the highest bidder—a practice that usually put him in the services of the Galactic Empire. The Empire's patronage allowed Villar to continue to explore the galaxy.\nA typical Devaronian and a skilled warrior, Villar yearned to see the galaxy like most male members of his species, but his wanderlust required him to take on a profession capable of financing his journeys. To that end, Villar put his espionage talents to use as an information broker, obtaining information on his endeavors and selling it to whomever was willing to pay the highest price.\nVillar first appeared in the 1998 PC game Star Wars: Rebellion as one of several Imperial-aligned characters available to the player. In the game, Villar boasts a high success rate for missions to Rebel-held star systems. The Devaronian also possesses an ability to design facilities, which makes him one of the Empire's most valuable non-officer characters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Gray",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Species/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/1998",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Rebellion_(video_game)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Star_Wars:_Rebellion:_Prima%27s_Official_Strategy_Guide",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}