{
 "name": "Villpu_Nagg",
 "display_name": "Villpu Nagg",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 22 BBY",
      "Khorm"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Aqualish"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Villpu Nagg was a male Aqualish technician who served the Confederacy of Independent Systems during the Clone Wars. Around 22 BBY, the Confederacy took control of the planet Khorm and built a weather-control station on the Kafiri Mountain to defend the planet from Republic forces. Nagg was placed in charge of the station, which created storms in order to prevent Republic troops from landing. The Republic, however, managed to land several units on Khorm, and Nagg was contacted by Warlord Unger Gout. The warlord informed him that two Jedi were on the way to destroy the station and ordered Nagg to create a storm strong enough to kill the Jedi. The Aqualish obeyed and created the storm; however, the Jedi were able to redirect it on the station itself. The storm destroyed the station and killed Nagg.\nVillpu Nagg was a male Aqualish technician who lived during the waning years of the Galactic Republic. Nagg joined the Confederacy of Independent Systems and served during the Clone Wars. Around 22 BBY, Nagg was placed in command of a weather-control station on the planet Khorm, a world where the costly agrocite mineral, which increased the power of starfighters, was found. The station was built on the Kafiri Mountain and was able to to create storms capable of preventing Republic forces from landing and capturing the agrocite mines. A Republic task force under the command of Jedi Generals Kit Fisto and Plo Koon, however, managed to land several troops on Khorm and capture a Confederate agrocite processing facility. The Jedi then decided to destroy the weather-control station in order to allow more reinforcements to land.\nThe Confederate commander, Warlord Unger Gout, then contacted Nagg and informed him of the Jedi threat. He also told him that the Dark Jedi Asajj Ventress was on her way to kill the Jedi, but nevertheless ordered Nagg to create a storm large enough to destroy the Jedi, as well as placing Ventress in danger. While Nagg was hesitant about the possibility of slaying Ventress, Gout insisted that Nagg carry out his orders. The Jedi survived, however, and managed to reach one of the station's junction boxes. With the help of the clone trooper Fixer, they sliced the box and changed the coordinates of the storm to target the weather-control station itself. The storm destroyed the station and killed Nagg and his staff.\nNagg was trusted enough to control Khorm's best defensive structure. Although Nagg was at first hesitant to kill Ventress along with the Jedi, Gout soon persuaded him that it was better than facing two Jedi Masters alone. The Aqualish had black eyes and brown skin.\nVillpu Nagg's first and only appearance to date was in the 2009 second installment of the In Service of the Republic story arc of the Star Wars: The Clone Wars comic series, written by Henry Gilroy and Steven Melching, and illustrated by Scott Hepburn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/22_BBY/Legends",
  "/wiki/Khorm/Legends",
  "/wiki/Aqualish/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Weather-control_station",
  "/wiki/Kafiri_Mountain_Range",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Battle_of_Khorm/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Unger_Gout",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Agrocite/Legends",
  "/wiki/Mineral/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Kit_Fisto/Legends",
  "/wiki/Plo_Koon/Legends",
  "/wiki/Agrocite_processing_facility",
  "/wiki/Commander/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Asajj_Ventress/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Fixer_(clone_trooper)",
  "/wiki/Slicer/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Eye/Legends",
  "/wiki/2009",
  "/wiki/The_Clone_Wars_8",
  "/wiki/Star_Wars:_The_Clone_Wars:_In_Service_of_the_Republic",
  "/wiki/Star_Wars:_The_Clone_Wars_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Henry_Gilroy",
  "/wiki/Steven_Melching",
  "/wiki/Scott_Hepburn",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}