{
 "name": "Vilmarh_Grahrk",
 "display_name": "Vilmarh Grahrk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Devaron"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Devaronian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  }
 ],
 "content": "Vilmarh Grahrk, or Villie as he was often known, was a male Devaronian smuggler during the waning years of the Galactic Republic and the early days of the Galactic Empire. A notorious gambler, grifter and scoundrel, Villie took part in a number of underhanded schemes in his quest for money and women.\nOne of Grahrk's first schemes involved working for no less than Darth Sidious himself. During his recruitment, he insulted Darth Maul, earning a brief Force choke from the Sith apprentice. Together with his cousin Holmar, Villie was tasked with inciting the Yinchorri into battle with the Jedi. The resulting conflict left a number of Jedi—including Council member Micah Giiett—dead, and Holmar captured. Grahrk was later questioned by the Jedi, but was deemed to know nothing of value.\nGrahrk next came to the Jedi's attention when he encountered the amnesiac Quinlan Vos on Nar Shaddaa. At this time Grahrk had once again gambled away his money, which he made from transporting the glitteryll that had wiped the minds of Vos and his Padawan Aayla Secura. Grahrk saw Vos as an opportunity to break even, and placed the bet with the longest odds of all—that Vos would survive long enough to get away from the Smugglers' Moon. Then, in a series of double and triple-crosses, Grahrk escaped with Vos on his ship, the Inferno.\nFrom Nar Shaddaa, Grahrk took Vos to Kiffu, Ryloth and Coruscant. During this time, Grahrk killed Holmar and double-crossed the corrupt politician Chom Frey Kaa who had begun the glitteryll scandal.\nGrahrk was next hired to smuggle weapons to the convicts on Kiffex, but was shot down by the Kiffu Guardians and imprisoned himself. He was found by no less than Quinlan Vos and his Master Tholme in their hunt for the rogue Aayla Secura. Grahrk was uncomfortable being in the presence of two Jedi, and this discomfort only grew with the addition of Masters Zao and T'ra Saa.\nAlthough the Jedi would not allow Grahrk to leave the planet before the defeat of Volfe Karkko, Quinlan Vos did agree to travel with him as he followed the will of the Force.\nGrahrk's also had a part in Kh'aris Fenn's plot to take control of Ryloth. Grahrk was hired as a pilot for the Morgukai Tsyr and Bok when they kidnapped Nat Secura and Tholme. Vos and Secura tracked Villie to Ord Mantell, hoping that he would reveal where he had taken the prisoners. With typical faithfulness to his employers, Grahrk told the Jedi everything he knew—though not before they had used the Force to help him win some dice rolls. Of course, providing aid to the Jedi didn't stop him for also working for his original employers. Grahrk spirited Fenn away from Ryloth before he was made to walk in the Bright Lands, saving both of them from serious trouble.\nSometime during the Clone Wars, Grahrk angered Durge. Perhaps due to this, in 20 BBY, Grahrk came to the Kashyyyk village of Palsaang, and was allowed to stay as he smuggled goods onto the world. During this time he befriended Chak, who began calling him \"Uncle Villie\". When the Battle of Kashyyyk came, Grahrk saw Quinlan Vos and others fighting for their lives against LM-432 crab droids and Trandoshans. Grahrk and his Wookiee friend Chak swooped down in the Inferno and saved Jedi Vos, Luminara Unduli, and other clone troopers and Wookiees.\nAfter that, Vos attempted to contact Khaleen Hentz but the tall trees caused interference with the holocomm. Grahrk let Vos use his on the Inferno. But Vos discovered Grahrk had been smuggling Wookiee hidden hyperspace routes. He was about to take Grahrk in when it turned out Chak showed him the routes so Grahrk didn't steal them. When the actual battle of Kashyyyk came, Grahrk decided to fight for the Wookiees but was shot down by a Heavy Missile Platform.\nGrahrk and Chak were right in the path of a Corporate Alliance Tank Droid, but were saved by Vos' Juggernaut. Grahrk would soon set out to return the favor, as Order 66 set Quinlan against Commander Faie and Kashyyyk's entire contingent of clones. Grahrk found Vos broken and beaten along side the corpse of Commander Faie. Grahrk then burned the trooper's body, and when questioned by a Clone Patrol, said he killed and burned the Jedi, out of respect. He then proceeded to smuggle Vos off planet and aided the Jedi in his recovery.\nGrahrk was present at the reunion of Quinlan Vos and Khaleen.\nVilmarh Grahrk was voiced by Tom Kane in the game Star Wars: Galactic Battlegrounds and appears in the game as a Gungan hero. His species functions as the Gungans' bounty hunter unit.\nAt around 3 ABY, Han Solo and Chewbacca arrived in Mos Eisley to meet Grahrk so that he could deliver their debt to Jabba. Unfortunately for them, Grahrk had other plans and captured Solo and the Wookiee and handed them over to Jabba before stealing the Millennium Falcon. However, Solo and Chewbacca would escape and recapture the Falcon from Grahrk.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Grahrk",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Vilmarh_Grahrk",
  "/wiki/Devaron/Legends",
  "/wiki/Devaronian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Con_artist/Legends",
  "/wiki/Scoundrel",
  "/wiki/Palpatine/Legends",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Force_power/Legends#Choking_powers",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Holmar_Grahrk",
  "/wiki/Yinchorri",
  "/wiki/Jedi/Legends",
  "/wiki/Yinchorri_Uprising",
  "/wiki/Jedi_Council/Legends",
  "/wiki/Micah_Giiett",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Glitteryll",
  "/wiki/Padawan/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Inferno_(Vilmarh_Grahrk)",
  "/wiki/Kiffu/Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Chom_Frey_Kaa",
  "/wiki/Kiffex/Legends",
  "/wiki/Kiffu_Guardians",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Tholme/Legends",
  "/wiki/Zao",
  "/wiki/T%27ra_Saa",
  "/wiki/Volfe_Karkko",
  "/wiki/The_Force/Legends",
  "/wiki/Kh%27aris_Fenn",
  "/wiki/Morgukai",
  "/wiki/Tsyr",
  "/wiki/Bok_(Nikto)",
  "/wiki/Nat_Secura",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Durge/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Palsaang",
  "/wiki/Chak_(Wookiee)",
  "/wiki/Battle_of_Kashyyyk/Legends",
  "/wiki/LM-432_crab_droid/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Luminara_Unduli/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Khaleen_Hentz/Legends",
  "/wiki/Holocomm/Legends",
  "/wiki/HMP_droid_gunship/Legends",
  "/wiki/NR-N99_Persuader-class_droid_enforcer/Legends",
  "/wiki/HAVw_A6_Juggernaut/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Faie/Legends",
  "/wiki/Star_Wars_Infinities:_The_Empire_Strikes_Back",
  "/wiki/Tom_Kane",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Gungan/Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/3_ABY/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Category:Images_of_Vilmarh_Grahrk",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)",
  "/wiki/Deal_with_a_Demon",
  "/wiki/Star_Wars_Tales_3",
  "/wiki/Jedi_Council:_Acts_of_War_1",
  "/wiki/Jedi_Council:_Acts_of_War_3",
  "/wiki/Jedi_Council:_Acts_of_War_4",
  "/wiki/Bad_Business",
  "/wiki/Star_Wars_Tales_8",
  "/wiki/Star_Wars_(1998)_18",
  "/wiki/Star_Wars:_Republic:_Twilight",
  "/wiki/Star_Wars:_Republic:_Darkness",
  "/wiki/Star_Wars:_Republic:_The_Devaronian_Version",
  "/wiki/Star_Wars:_Republic:_Rite_of_Passage",
  "/wiki/Star_Wars:_Episode_II_%E2%80%94_Attack_of_the_Clones",
  "/wiki/Star_Wars:_Republic:_Hidden_Enemy",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Wizards.com",
  "/wiki/Vilmarh_Grahrk:_A_Devil_of_a_Smuggler",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/The_New_Essential_Guide_to_Vehicles_and_Vessels",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Saga_Edition_Web_Enhancement:_Devaronians",
  "/wiki/Star_Wars:_Panel_to_Panel_Volume_2:_Expanding_the_Universe",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Red_Five_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_137",
  "/wiki/Republic_82"
 ]
}