{
 "name": "Vinn_Atrius",
 "display_name": "Vinn Atrius",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zakuul"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Facial cybernetics"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eternal Empire",
      "Knights of Zakuul",
      "Horizon Guard",
      "Knights of Zakuul",
      "Horizon Guard",
      "Order of Zildrog"
     ]
    }
   ]
  }
 ],
 "content": "Vinn Atrius was a male Human citizen of the Eternal Empire of Zakuul living during the Galactic War.\nA member of the Knights of Zakuul at the time of the war against Zakuul, Atrius was hand-picked by Empress Vaylin to join the new Horizon Guard following her Coronation. After Vaylin was killed and Zakuulan Empire toppled by the Eternal Alliance, he witnessed the plight of his people and the heavy toll of war, beginning to resent the Alliance and its Commander, who brought an end to Zakuul's centuries of prosperity. Determined to destroy the Alliance by using Zildrog, an ancient superweapon from Iokath, Atrius set up base of operations on an Abandoned Listening Post and began seeking allies to join his secret Order of Zildrog. Not knowing how to activate Zildrog or how to control it, he searched the GEMINI network and eventually was approached by GEMINI 16, a rogue unit who sought the total destruction of the Eternal Fleet. GEMINI 16 acquired access to the security of Alliance base on Odessen, allowing the Order to observe the Alliance's every step for months.\nAtrius was also approached by one of the Alliance's original founders Theron Shan, who now wanted to join the Order and bring the Alliance down. Atrius initially refused to listen to him, which led Theron to arrange a trap for the Alliance Commander on Iokath and later steal a shipment of adegan crystals on Umbara to win Atrius' trust and be allowed to join the Order. GEMINI 16 warned Atrius that Shan should not be trusted, but Theron proved himself extremely useful, infiltrating the Chiss House Inrokini on Copero to obtain the Sith Emperor's holomap to Zildrog's location. The coordinates pointed to Nathema and the Order moved its base of operations there, taking everything they could from the listening post with them and tasking Shan with wiping all data and destroying the rest.\nArriving on Nathema, Atrius, Shan and GEMINI 16 located Zildrog in the ruins of an ancient Sith temple and began the ritual meant to awaken it, assisted by their allies who had personal vendettas against the Alliance Commander. However, Theron Shan was acting as a double-agent for the Alliance the whole time, and managed to warn them of the Order's intentions, leading Lana Beniko the Alliance Commander straight to Nathema, where he joined them. After GEMINI 16 informed him about Theron's true allegiance, Vinn Atrius ordered to begin awakening Zildrog ahead of schedule, and the GEMINI deceived and betrayed many of their allies, locking them inside energy transfer chambers to be used as fuel for Zildrog's awakening. Shan, Beniko and the Commander interrupted the ritual and Shan shot Atrius, but GEMINI 16 had already awakened Zildrog and ordered it to use the Gravestone to attack the Eternal Fleet in orbit of Odessen. The trio engaged and destroyed the GEMINI, but by that time the Eternal Fleet was completely destroyed and Zildrog was already targeting Odessen itself. Shan attempted to disable Zildrog, but Atrius stabbed him in the back with his lightsaber pike and ordered Zildrog to augment him with his power. Zildrog increased his strength and Atrius engaged the Commander and Beniko, who defeated him and destroyed Zildrog. Laying at the mercy of the one he worked so hard to destroy, Atrius then tried to taunt the Commander into ending his life.\nThe player has the options to either imprison Atrius or send him back to Zakuul to be dealt with by his own people for Light Side points, or kill him on the spot for Dark Side points.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Zakuul",
  "/wiki/Human/Legends",
  "/wiki/Zakuulan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/Eternal_Empire",
  "/wiki/Knights_of_Zakuul",
  "/wiki/Horizon_Guard",
  "/wiki/Order_of_Zildrog",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Galactic_War",
  "/wiki/War_against_Zakuul",
  "/wiki/Vaylin",
  "/wiki/Assault_on_Odessen",
  "/wiki/Battle_of_Zakuul",
  "/wiki/Eternal_Alliance",
  "/wiki/Alliance_Commander",
  "/wiki/Zildrog",
  "/wiki/Superweapon/Legends",
  "/wiki/Iokath",
  "/wiki/Abandoned_Listening_Post",
  "/wiki/GEMINI",
  "/wiki/GEMINI_16",
  "/wiki/Eternal_Fleet",
  "/wiki/Alliance_base",
  "/wiki/Odessen",
  "/wiki/Theron_Shan",
  "/wiki/War_on_Iokath",
  "/wiki/Crisis_on_Umbara",
  "/wiki/Adegan_crystal/Legends",
  "/wiki/Umbara",
  "/wiki/Chiss/Legends",
  "/wiki/Inrokini_family",
  "/wiki/Copero/Legends",
  "/wiki/Tenebrae",
  "/wiki/Holomap",
  "/wiki/Nathema",
  "/wiki/Listening_post/Legends",
  "/wiki/File:Vinn_Atrius_armor_closeup.jpg",
  "/wiki/Sith/Legends",
  "/wiki/Lana_Beniko",
  "/wiki/Mission_to_Nathema_(Zildrog)",
  "/wiki/Gravestone",
  "/wiki/Lightsaber_pike/Legends"
 ]
}