{
 "name": "Vinto_Hreeda",
 "display_name": "Vinto Hreeda",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Vinto Hreeda was a male Rodian mercenary, smuggler and boltslinger during the reign of the Galactic Empire. Hreeda was exceptionally skilled with a blaster and few beings would stand a chance against him in a lightfight. During his career, Hreeda obtained several scars that marked his face, but his most distinctive injury lost him his left antennae, leaving a large scar running the length of his face from his missing antennae, between the eyes, to his right cheek.\nAfter the Empire destroyed everything that Hreeda held dear, he honed his skills with a blaster until he was more than a match for all but a select few in the galaxy. He hired his services out as a mercenary, and relished any opportunity to strike back at the Empire he hated. His primary focus was to tear down the empire one stormtrooper at a time. He was seen as a protecting hero and vigilante to his home clan, and came to exact vengeance when a rival clan hired pirates to raid medical supplies from his people.\nHreeda made use of dual blaster pistols carried in dual holsters at his waist. He wore a brown, three-quarter-length coat with reinforced shoulders.\nThe character of Vinto Hreeda was first introduced to the Star Wars universe in the \"Jabba's Realm\" expansion pack for the Star Wars: Imperial Assault strategy board game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Gunslinger",
  "/wiki/Imperial_Period",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Lightfight",
  "/wiki/Blaster/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Holster/Legends",
  "/wiki/Star_Wars",
  "/wiki/Jabba%27s_Realm",
  "/wiki/Star_Wars:_Imperial_Assault_(Fantasy_Flight_Games)",
  "/wiki/Board_game/Legends",
  "/wiki/Fantasy_Flight_Games"
 ]
}