{
 "name": "Vinya_Maysor",
 "display_name": "Vinya Maysor",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Corporate Sector Authority"
     ]
    }
   ]
  }
 ],
 "content": "Vinya Maysor was a Human female who worked for Viceprex Karrek Flim during the Galactic Civil War.\nMaysor worked for Corporate Sector Authority Viceprex Karrek Flim on Vreni Island on Corellia during the time of the Galactic Civil War. Her office was in the back of a local cantina.\nIn 1 ABY, one of the Viceprex's underlings paid data slicers to alter shipping documents to make the Viceprex seem incompetent and corrupt. To prevent damage to the Viceprex's reputation, she decided to employ a data slicer herself to alter records that would make the underling look like a fool instead. For this, she hired a spacer to deliver the datadisc to the slicer.\nVinya Maysor is a Non-Player Character  in the MMORPG Star Wars Galaxies. In the game, Maysor can be found in the cantina of the Vreni Island settlement where she offers a quest to players. This quest asks the player to deliver a datadisc to a slicer. However, players are unable to actually start the quest, because it was never fully implemented by the developers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Corporate_Sector_Authority/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Viceprex/Legends",
  "/wiki/Karrek_Flim",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Vreni_Island",
  "/wiki/Corellia/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Datacard/Legends"
 ]
}