{
 "name": "Vinyor_Tesh",
 "display_name": "Vinyor Tesh",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Manaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Task Force Nova",
      "Task Force Nova"
     ]
    }
   ]
  }
 ],
 "content": "Vinyor Tesh was a Nautolan male Jedi Master during the third Galactic War between Galactic Republic and Sith Empire. Tesh was trained in and specialized in maintaining the Jedi Archives.\nVinyor Tesh was born to a mother and father who were both researchers based on Manaan. At a young age, Tesh's parents were killed when the Sith Empire attacked the planet. During the attack, he was noticed by the Jedi Laotah, who took him to Coruscant to be trained as a Jedi at the Jedi Temple.\nDuring Tesh's training, he specialized in cataloging records and research at the Jedi Archives. Tesh enjoyed this line of work because it helped him feel closer to his parents. Tesh was affected by the attack on the Jedi Temple when the Imperials invaded Coruscant, being assigned to recover records damaged during the attack.\nTesh went on to become a Jedi Knight and then a Jedi Master, eventually joining Task Force Nova by 3626 BBY. When the Commander, Arn Peralun, and Aryn Leneer returned from their mission to the old Dantooine Jedi Enclave, where they investigated the whereabouts of Darth Malgus, Tesh was one of the Jedi chosen by Master Gnost-Dural to discuss the next moves in rebuilding the Jedi after the war against Zakuul. Gnost-Dural chose to invite him, along with Tau Idair and Sal-Deron to the gathering because Gnost-Dural believed them to be the Order's most important representatives. Tesh protested Leneer's appearance at the meeting, believing that she no longer had the right to participate in the affairs of the Jedi as a former member, but was rebuffed by Peralun and Gnost-Dural. Gnost-Dural assigned Tesh to comb records of the Jedi Enclave to identify what Malgus took from the ruins.\nAfter the meeting, Tesh apologized to the Commander for coming off as cold and leaving a bad first impression. He hoped to develop a working relationship with the Commander.\nTesh worked with Peralun to discover that the relic stolen by Darth Malgus from Dantooine was once owned by a certain Darth Nul, but what Malgus intended to do with it and the nature of the relic itself was still unclear to the pair.\nTesh was an individual of strong convictions, believing in maintaining the old traditions and protocols of the Jedi Order. He considered himself slow to trust those he was not already familiar with. Tesh valued the security of the Jedi Order and was paranoid of being betrayed from within, believing it necessary to look out for potential spies within Task Force Nova. He believed this because he blamed the decline of the Jedi Order when the Eternal Empire attacked on help they received from within the Order, and did not want a repeat of this event. Tesh did not get along with those he considered interested in changing the Jedi to something new and those who challenged Tesh's convictions.\nVinyor Tesh appeared in the 2019 expansion Onslaught to the 2011 massively multiplayer online role-playing game Star Wars: The Old Republic by the company BioWare. He was added in the \"Secrets of the Enclave\" flashpoint. Tesh only appears in the Republic version of the story.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Manaan/Legends",
  "/wiki/Nautolan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Task_Force_Nova",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Third_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Jedi_Archives/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Vinyor_Tesh%27s_mother",
  "/wiki/Vinyor_Tesh%27s_father",
  "/wiki/Parent/Legends",
  "/wiki/Death/Legends",
  "/wiki/Devastation_of_Manaan",
  "/wiki/Planet/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Laotah",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_training/Legends",
  "/wiki/Sacking_of_Coruscant#Assault_on_the_Jedi_Temple",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/3626_BBY",
  "/wiki/Alliance_Commander",
  "/wiki/Arn_Peralun",
  "/wiki/Aryn_Leneer",
  "/wiki/Dantooine/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Darth_Malgus",
  "/wiki/Gnost-Dural",
  "/wiki/War_against_Zakuul",
  "/wiki/Tau_Idair",
  "/wiki/Sal-Deron",
  "/wiki/Darth_Nul",
  "/wiki/Eternal_Empire",
  "/wiki/2019",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith",
  "/wiki/Mission_Abstract:_Investigate_link_between_Darth_Malgus_and_the_planet_Elom",
  "/wiki/Standard_week/Legends",
  "/wiki/Galactic_Standard_Calendar"
 ]
}