{
 "name": "Virar_Needa",
 "display_name": "Virar Needa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Virar Needa was an Imperial lieutenant, and cousin of Captain Lorth Needa of the Imperial II-class Star Destroyer Avenger. Virar joined the Imperial Military at a young age, enrolling in the Imperial Academy. However, Virar's career went steadily downhill after his cousin's failure during the Battle of Hoth, though Needa knew it could have been worse; he was one of few members of the family whose life was spared. However, he was assigned to maintain the orbital mirrors in space above Coruscant, a position many saw as extremely demeaning, and which was generally saved for those who had failed or embarrassed the Empire in battle. Needa, however, saw it as an honorable cause, and performed it to his utmost ability.\nThose operating the mirrors were so distrusted by their superiors that they had no control over where the satellite traveled; this fact was taken advantage of when the New Republic used Needa's mirror in 7 ABY in their efforts to liberate Coruscant from Imperial control. Needa and his men did not initially realize what was happening when their mirror was used to boil a reservoir on the surface of Coruscant, intended to cause a storm which would bring down the planet's shields and leave it exposed to an attack. After realizing what was happening, Needa ordered his men to take up arms, but after seeking counsel with another member of the crew, they decided to serve the New Republic, who were now the legitimate rulers of Coruscant.\nVirar was a member of the Needa family, and, like his cousin Lorth Needa, entered Imperial service. Around 2 ABY, he was attending the Imperial Academy. In his youth, Virar was not particularly ambitious, and no one thought that he was headed in the direction of greatness. When his cousin—the captain of the Imperial II-class Star Destroyer Avenger—failed to capture the Millennium Falcon during the Battle of Hoth, almost the entire Needa family was executed on the vengeful orders of Darth Vader.\nThough Virar's life was spared, his career was destroyed. He was placed in charge of OSETS 2711, an Orbital Solar Energy Transfer Satellite above Imperial Center. Some people considered this the worst possible job in the Imperial Navy; Lieutenant Needa had to share a single sleeping quarters with five other men. Needa, however, considered it a noble duty, spinning a cocoon of self-delusion that allowed him to perform his menial assignment with the utmost efficiency and enthusiasm. For example, while most OSETS officers would shirk the task of maintaining traffic observation logs, Needa made it his hobby, cataloging every single starship that he saw exiting hyperspace. He hoped to be able to provide Imperial Center with information that could be used against the New Republic, which he, like many Imperials, still derisively thought of as \"Rebels.\" Ironically, these meticulous logs later proved valuable to the New Republic in the search for Lai Nootka.\nAfter having spent four years \"riding the mirror,\" Needa was on duty when Rogue Squadron took control of his station from the computer center on the ground. They realigned the satellite to heat up a large water reservoir, creating a terrible thunderstorm that brought down the planet's shields, in anticipation of an invasion attempt by Admiral Ackbar and the New Republic Defense Fleet. While the others on the satellite displayed immediate alarm, Needa assumed that nothing was amiss, and managed to persuade the others that the unusual commands being sent to the station were merely part of some secret Imperial project. He felt honored that his satellite had been selected for such an important task—this was the higher-ranking Imperials' way of repaying him for his unswerving loyalty to the Imperial cause. He told his fellow crew members they would be rewarded beyond their wildest dreams for the part they played in the top-secret operation. When the lights went out on the planet below him, he convinced himself that there was still nothing wrong. Those officers on the ground responsible for the power failure would be punished, and he would be the Empire's obvious choice to replace them.\nThis carefully constructed house of sabacc cards would soon come crashing down, as the New Republic fleet jumped into the Coruscant system and commenced their liberation of the throne world. The Rebels were commanding two Imperial Star Destroyers captured at the Battle of Endor, which Needa recognized as the Imperial II-class Accuser and the Imperial I-class Star Destroyer Adjudicator. Although he was happy at having been able to identify the two vessels, Needa still had a feeling of unease. It took a moment to dawn on him that the ships he had identified no longer belonged to the Empire, and in fact their presence meant the Rebels were attacking. Needa abruptly ordered the satellite's personnel to battle stations, before being reminded that OSETS 2711 had no battle stations. All he could do was sit in terror and wait for the Rebels to destroy him, while his fellow crewmen, completely non-fazed, casually played cards. One of Needa's crewmen, Cadet Pedetsen, suggested that Needa could spin a story about his cousin's supposed Rebel sympathies, which he had naturally confided only to Virar, to ingratiate himself to Coruscant's new rulers.\nNeeda and the OSETS crew did nothing as the station was used to burn a hole into one of the Imperial Golan III platforms, an event which helped reduce casualties on both sides. OSETS 2711 survived the battle, and the crew continued their roles upon the mirror after the Rebels took control.\nVirar Needa was not overly ambitious in a practical sense, but he held a lofty view of his menial duties in orbit around Imperial center. Where most would have dreaded \"riding the mirror\" for several years, Needa thought of it as an honor, and did the very best he could. He thought he was extremely loyal to the Empire, and that his efforts were being closely monitored and had been coveted by Imperials in ranks superior to his own. Needa held the deluded opinion that he and what he did was of utmost importance, but in truth the Empire didn't trust him enough to actually allow him to make use of the mirror, leaving that to others on the planet's surface.\nDespite the fact it was considered an equal fate to death by many, Needa quite enjoyed serving on the station, and preferred to look at Coruscant from above than to be down on the surface. His crewmates interacted with him with a sort of bemusement, and never took his various eccentricities seriously. Needa was also somewhat socially awkward, and often mistook his crewmates' jokes as serious comments. Virar was very decisive, making decisions of great import without delay, though he was always open to suggestion, and had no qualms about accepting the ideas of one of his subordinates, as demonstrated during the New Republic's taking of Coruscant, where he was persuaded against attacking the New Republic's fleet.\nVirar Needa was created by Star Wars author Michael A. Stackpole for X-Wing: Wedge's Gamble, where he served as a form of comic relief.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Cadet/Legends",
  "/wiki/Pedetsen",
  "/wiki/Lieutenant/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Lorth_Needa/Legends",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Avenger/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Orbital_Solar_Energy_Transfer_Satellite",
  "/wiki/Realspace/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Satellite/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Liberation_of_Coruscant_(Galactic_Civil_War)",
  "/wiki/Planet/Legends",
  "/wiki/Planetary_shield/Legends",
  "/wiki/2_ABY/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/OSETS_2711",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Lai_Nootka",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Water/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Coruscant_system/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Emancipator",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Liberator_(Imperial_I-class)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Golan_III_Space_Defense_NovaGun",
  "/wiki/Star_Wars",
  "/wiki/Michael_A._Stackpole",
  "/wiki/X-Wing:_Wedge%27s_Gamble",
  "/wiki/X-Wing:_The_Krytos_Trap",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Empire%27s_Finest:_Who%27s_Who_in_the_Imperial_Military",
  "/wiki/Star_Wars_Insider_96",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Coruscant_and_the_Core_Worlds"
 ]
}