{
 "name": "Virec_Xan",
 "display_name": "Virec Xan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "pale"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sable Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Virec Xan was the Sable Dawn's administrator in Point Nadir.\nXan was responsible for establishing the organization's presence within the shadowport by assassinating the former head of the Anjiliac Kajidic, maintaining good relations with the Hutt clan and rival criminal group Epsis. Xan has spent much of his life working for the Sable Dawn, and his loyalty to the shadowy members of its inner circle was without question. He had always been a specialist in the acquisition of information, rather than his organization's usual cold-blooded killing. His ability to take lives was never in question, though, having personally ended the careers of several failed agents with little more than a wave of his hand.\nIn Point Nadir, Xan maintained a discreet profile, always attending on the rare occasions that the comet's ruling council actually convened. Despite his attempts at stealth, however, he was known by all in the shadowport, recognizable even though rarely going about without a disguise. At Xan's urging, the Sable Dawn performed charity work within the slums and ghettos of the shadowport's Fissure District, which improved the public opinion of their organization and allowed the cartel to keep an eye out for potential talent.\nDespite his age, Virec Xan was a powerful and deadly Force Adept, being notably skilled in the area of telekinesis; in addition, he possessed a charismatic personality, which he could use to inspire fear in friend and foe alike, or weaken an enemy's resolve. In combat, he fought with a sporting blaster pistol, but placed greater emphasis on his Force powers.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sable_Dawn",
  "/wiki/Point_Nadir",
  "/wiki/Shadowport/Legends",
  "/wiki/Tirello_Anjiliac",
  "/wiki/Anjiliac",
  "/wiki/Kajidic/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Epsis_(organization)",
  "/wiki/Comet/Legends",
  "/wiki/Force_Adept",
  "/wiki/Telekinesis/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Scum_and_Villainy_(sourcebook)"
 ]
}