{
 "name": "Viscus",
 "display_name": "Viscus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dathomir"
     ]
    },
    {
     "name": "Died",
     "values": [
      "By 14 BBY",
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.88 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grayish-green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Clan(s)",
     "values": [
      "Viscus' clan"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Nightbrothers",
      "Shadow Collective"
     ]
    }
   ]
  }
 ],
 "content": "Viscus was a male Dathomirian Zabrak who led a Nightbrother clan on Dathomir during the Clone Wars and the early reign of the Galactic Empire. Though he was the leader of a Nightbrother clan, Viscus, like all the Nightbrothers, was subservient to the Nightsisters and their leader, Mother Talzin. During the Clone Wars, Brother Viscus aided Talzin in her fight against the Sith, first by supplying the Nightsisters with a warrior from his village to use in their plot to kill the Sith Lord Dooku. Dooku retaliated by having the Sith-led Confederacy of Independent Systems massacre the Nightsisters, after which Viscus allied with Talzin and her son Maul in their bid to exact revenge.\nThough the Dathomirians nearly succeeded in their goal, Talzin was killed as Confederate forces decimated Viscus' village. Having survived the destruction of his home, Viscus and the Nightbrothers established a new village and came to serve the last Nightsister on Dathomir, Merrin. Viscus' time would end, however, when his tribe discovered the stranded Jedi Master Taron Malicos. Impatient with waiting for Merrin's orders and worried about Malicos' growing influence among his clan, Viscus decided to have the fallen Jedi killed. Malicos was brought before Viscus in the ruins near the village, but the interloper fought back and killed him, after which he took control of the Nightbrothers.\nBrother Viscus was born a Nightbrother on the planet Dathomir and eventually became the leader of his clan of Nightbrothers in a village on the far side of the planet, with the title of \"Brother.\" Several members of his tribe were the children of Mother Talzin, the clan mother of the Nightsisters, a group to whom the Nightbrothers were subservient. Talzin's children were Maul, Savage Opress, and Feral, and they were each a member of Viscus' village. Maul, however, was taken away at a young age by the Sith Lord Darth Sidious and was trained as his apprentice until his presumed death and replacement by Count Dooku of Serenno.\nIn 20 BBY, amidst the Clone Wars between the Confederacy of Independent Systems and the Galactic Republic, Mother Talzin sent her Nightsister Asajj Ventress to meet with Viscus and select a male from his village, ostensibly as a mate. In reality, Talzin and Ventress were plotting to take revenge on Count Dooku, the leader of the Confederacy, who had taught Ventress as her master until he betrayed her and left her for dead. When Ventress arrived at the mountain village, Brother Viscus welcomed her. She told him that she had come for the Selection, and he ordered the heads of each tribe, which included Savage and Feral, to line up for the Nightsister. Viscus watched as she inspected the group and removed candidates that weren't to her liking. Ventress told the remaining Nightbrothers that they would face three tests, and whoever survived would be her champion.\nViscus joined Ventress and her candidates in the Nightbrother arena, where he stood atop a rock spire to oversee the games. With a clap of his hands, Viscus began the Test of Fury, where the Nightsister was to face off against the tribal leaders she had chosen. Ventress easily beat the Nightbrothers, killing two. When Savage went to help Feral, Ventress remarked that they were pathetic and asked Viscus where the warriors she came for were. The next test started shortly after, the challenge of blindness, where the Nightbrothers had to face Ventress in the dark. After Viscus began the test, the lights around the arena turned off, leaving the warriors in the darkness of the night. Ventress slipped into the shadows and ran up against the four remaining Nightbrothers, slaughtering all but Feral and Savage, who managed to catch her.\nNow with only two candidates left, Viscus and Ventress prepared for the third and final challenge, where Savage and Feral were to fight Ventress on a series of shifting elevated pillars. Though they managed to evade her initially, Savage and Feral were split apart. Ventress nearly killed the Feral before Savage intervened, and in the ensuing fistfight, Savage proved to Ventress that he was the winner of the challenge. On the next morning, Brother Viscus watched as Ventress departed for the Nightsister fortress with Savage and silently bade him goodbye. At their lair, Mother Talzin and her witches imbued Savage with their magick, turning the once-caring Nightbrother into a hulking monster subservient to their will. They made him prove his loyalty by having him kill Feral, then sent him to be Count Dooku's new apprentice.\nAs Dooku's apprentice, Savage was sent across the galaxy on missions for the Confederacy of Independent Systems. He killed two Jedi during a massacre on Devaron, bringing attention to the Jedi Order and Galactic Republic of his existence. Hoping to learn more in hopes of stopping him, Jedi Master Obi-Wan Kenobi and Jedi Knight Anakin Skywalker traveled to Dathomir to meet with Viscus. As the Jedi entered the Nightbrother village, Viscus and his warriors watched from the rooftops and prepared to fight. Viscus gave the order for the Nightbrothers to attack, but Skywalker jumped onto the roof he was standing on to confront him directly. The two engaged in a brief fight, but Skywalker took Viscus hostage and told the Nightbrothers to back off.\nKenobi asked Viscus if he knew where Savage was, but the leader asked what made them think he was part of his village. Kenobi informed him that the Jedi High Council had already discovered he came from their clan, and Viscus directed them to Mother Talzin for answers. The Nightbrothers prepared to attack the Jedi again as they left, but Viscus stopped them from doing so and let the visitors go. Ventress and Talzin's plan for revenge ultimately failed, with Savage breaking free from their control and Dooku surviving their attempts to assassinate him.\nCount Dooku ordered Confederate General Grievous to lead an army to Dathomir and wipe out the Nightsisters in retaliation for their attempts to kill him. Grievous and his forces massacred the Nightsisters and destroyed their fortress. Mother Talzin escaped the onslaught by vanishing into the spirit world, while others, such as Ventress or the young Merrin survived on their own. Talzin employed Savage Opress to locate her long-lost son, Maul, and return him to her. Talzin healed Maul's wounds, and he took Savage as his apprentice and began a scheme to take revenge on their enemies by founding a criminal empire, the Shadow Collective, in 19 BBY. Their ploy caught the attention of Darth Sidious, who killed Opress and took Maul hostage. After being freed by his Shadow Collective, Maul joined Talzin in a bid to destroy the Sith.\nTalzin sent Maul and the Shadow Collective to Ord Mantell, where the Shadow Collective's Black Sun crime syndicate had a base, to lay a trap to capture Dooku and Grievous. Because she could not go herself, Mother Talzin contacted Brother Viscus and sent him and a team of Nightbrother warriors to aid Maul. Viscus and his warriors arrived at the Black Sun stronghold, where Viscus greeted Maul and informed him that Talzin had sent them there. Shortly after Viscus and his men landed, Maul sensed that the Confederate droid armies had arrived, and an orbital barrage from Grievous's ships came down upon the stronghold. Maul yelled at his forces to take their positions, then told Viscus there was no time for a formal briefing and ordered him to take the Nightbrothers to the command center and wait for his word. While Maul led the Shadow Collective into battle against Grievous and his army, Viscus and the Nightbrothers hid in the command center. Count Dooku and a duo of MagnaGuards traveled to the stronghold to capture Talzin and Maul, unaware that the witch was not there.\nAs Dooku inspected the area, Viscus and his warriors revealed themselves and destroyed the MagnaGuards. Viscus told Dooku that Mother Talzin sent him her regards and that he was there to deal with him in her place. The Nightbrothers surrounded Dooku, who threatened that Talzin's task was beyond their abilities to accomplish. Viscus and his men began fighting the Sith Lord, who easily slaughtered them, leaving Viscus as the only survivor. Brother Viscus leaped into the air to duel Dooku and told the count that he was a formidable opponent, which would only make the Nightbrother's victory well earned. Dooku used the Force to grab him mid-air, telling him that he would kill the Nightbrother leader, then Maul, and finally Talzin. Dooku slammed the injured Viscus into the ground and prepared to kill him, but was stopped by the arrival of Maul's forces, who had captured Grievous and took Dooku captive as well.\nAfter the battle, Viscus and his warriors returned to Dathomir to begin the next stage of Talzin's plan. In his village, Viscus prepared a sanctum to help bring Talzin back out of the spirit realm. In the meantime, Maul had lost Grievous but managed to keep Dooku hostage. Maul traveled to Dathomir to continue with his plan and met with Viscus once he landed. Maul asked Viscus if he had made the preparations, and Viscus replied that they were ready to proceed. as Dooku was hauled off Maul's ship, Viscus confronted him and warned him that this experience would be different from Ord Mantell. Maul, Viscus, and a pair of Nightbrothers brought Dooku to a series of caves, where a stone sculpture stood in the center. Viscus informed Dooku that they were at the heart of Talzin's power and told him that he and Sidious were going to pay for his crimes against the Nightsisters.\nMaul touched the stone, and Talzin appeared in a burst of magick. As Viscus and Maul watched, Talzin possessed Dooku and began draining his life force from him, which would give her all she needed to take her full form once again. Viscus noted that it wouldn't be long until Dooku was dead, then left with his Nightbrothers to prepare Talzin's chambers so she would be able to rest after the weakening process of draining Dooku's life. After Viscus left, however, Grievous and Sidious himself arrived and did battle with the possessed Dooku and Maul. Although Talzin was able to recover her mortal form mid-battle, the process failed to kill Dooku, and she sacrificed her life to give Maul a chance to escape Sidious' wrath. Sidious had Grievous's army decimate the Nightbrother village, but Viscus too survived.\nAfter the destruction of their village, Brother Viscus and his clan relocated to a new village in the caverns underneath the Strangled Cliffs. They also came to serve Merrin, who they believed was the last Nightsister. The Clone Wars ended in 19 BBY, and the Galactic Empire took over the galaxy, with Sidious as its Emperor. Sidious enacted the Great Jedi Purge, and the Jedi were nearly wiped out. That same year, Viscus and his people completed their new village. At one point, Viscus and his warriors witnessed a ship crash into the Swamp of Sacrifice. Viscus informed Merrin of the incident, and she advised him to be cautious and that she sensed great danger. The Nightbrothers captured the stranded pilot, the Jedi Master Taron Malicos, who had crashed on Dathomir while fleeing the Empire. Malicos was brought to the village, but Viscus and the Nightbrothers did not know what to do with him while they waited for Merrin to give them instructions.\nViscus grew tired of waiting for Merrin to tell the Nightbrothers what to do with Malicos, who succumbed to Dathomir's dark energies and turned to the dark side of the Force. Brother Viscus was aware that Malicos was manipulating his captors in a bid to divide them and confided in a fellow Nightbrother that it was time to deal with the interloper. When Malicos escaped imprisonment, Viscus sent the Nightbrother warriors to hunt the fallen Jedi through the Collapsed Settlement nearby the village. Malicos was recaptured and brought back to the dungeons, but he killed one of the Nightbrothers, leading several others to decide that action needed to be taken, and they brought him before Viscus in the settlement ruins. The two became engaged in a struggle, however, and Malicos managed to get the upper hand and kill Viscus, who, with his dying words, told the former Jedi that the Nightbrothers would never kneel before him.\nAfter killing Viscus, Malicos was able to usurp control over the Nightbrothers through his strength alone. The Nightbrothers laid down their weapons and submit to him, and he became the new leader of the tribe. Malicos also came into contact with Merrin, and, seeking to become even more powerful, manipulated the young Nightsister into allying with him. Malicos told Merrin that the Jedi had been the ones who massacred the Nightsisters during the Clone Wars, and in return for teaching him her magicks, he would help her get revenge. Because of her misplaced loyalty to the increasingly mad Malicos, Merrin allowed him to lead the Nightbrothers astray without Viscus' leadership.\nIn 14 BBY, another former Jedi, Padawan Cal Kestis, traveled to Dathomir on his journey to rebuild the Jedi Order. Over the course of his time on Dathomir, he fought against the Nightbrothers and learned of Malicos's rise to power through psychometry. At one point, Kestis discovered Brother Viscus' corpse and learned that he had been the leader of the Nightbrothers and was killed by the off-worlder. While on Dathomir, Kestis convinced Merrin to turn on Malicos, who they defeated, and leave the planet to join him on his journey.\nBrother Viscus was a male Dathomirian, a subspecies of the Zabrak that was native to Dathomir. Viscus stood 1.88 meters, or 6 feet and 2 inches, tall. His skin was orange in color, and like his fellow Nightbrothers, Viscus covered his face and body in thin, dark tattoos as a right of passage. As a Nightbrother, he lived a primitive life but was well-respected as a leader. Brother Viscus was subservient to Mother Talzin and was recognized by Count Dooku as the third most important leader on Dathomir, following Talzin and her son Maul. He shared Talzin's animosity for the Sith and their transgressions against the Nightsisters and Nightbrothers and proudly stood with her and Maul to destroy them.\nWith the death of Mother Talzin during the Clone Wars, Viscus and his clan began serving the Nightsister Merrin. Viscus dutifully worked with Merrin following the Clone Wars, but his village became embroiled in turmoil with the discovery of Taron Malicos. He immediately distrusted the outsider but found himself in a difficult situation as Merrin failed to give the Nightbrothers guidance on what to do with him. Viscus recognized that Malicos was intent on manipulating his village into following him, and his impatience with Merrin led him to decide to take charge to take care of the urgent situation.\nViscus was a powerful Nightbrother warrior and combatant. A practitioner of various martial arts, Viscus was skilled in hand-to-hand combat and was extremely agile, able to effortlessly leap over Count Dooku during the Battle of Ord Mantell. He was also trained in armed combat and could hold his own against Dooku for a time but could not match the Sith Lord's prowess with the Force. In addition, Viscus was an adept military tactician and effective leader of the Nightbrothers.\nBrother Viscus wore a orange and black padded suit, as well as a gray robe. By the time of his death, he wore only a tattered belt and wrap around his waist, with a loincloth that reached past his knees. He also briefly used a spear during the Battle of Ord Mantell.\nViscus was created for \"Monster\", the thirteenth episode of the third season of Star Wars: The Clone Wars. He was voiced by Stephen Stanton. Stanton didn't audition for the role of Brother Viscus and had to work out what voice to use for the character on set. Because he wasn't sure what was wanted for the role, Stanton used the gladiator arena scenes as inspiration and based Viscus' voice off of Peter Ustinov's character in Spartacus, Lentulus Batiatus. With supervising director Dave Filoni, who thought the Spartacus inspiration was \"too broad,\" Stanton fine-tuned the performance into a \"reedy\" and \"higher-pitched\" voice for the character. Despite the minor role Viscus played in the story arc, Stanton enjoyed the ability to work alongside Savage Opress actor Clancy Brown.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Viscus",
  "/wiki/Viscus/Legends",
  "/wiki/Dathomir",
  "/wiki/14_BBY",
  "/wiki/Zabrak",
  "/wiki/Dathomirian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Viscus%27_clan",
  "/wiki/Nightbrothers",
  "/wiki/Shadow_Collective",
  "/wiki/Clone_Wars",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Nightsisters",
  "/wiki/Mother_(title)",
  "/wiki/Talzin",
  "/wiki/Brother",
  "/wiki/Sith",
  "/wiki/Savage_Opress",
  "/wiki/Nightbrother_village",
  "/wiki/Death",
  "/wiki/Sith_Lord",
  "/wiki/Dooku",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Dathomir",
  "/wiki/Maul",
  "/wiki/Campaign_against_the_Shadow_Collective",
  "/wiki/Second_Battle_of_Dathomir",
  "/wiki/Unidentified_Nightbrother_village",
  "/wiki/Merrin",
  "/wiki/Jedi_Master",
  "/wiki/Taron_Malicos",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Collapsed_Settlement",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Feral",
  "/wiki/Darth_Sidious",
  "/wiki/Sith_apprentice",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Count",
  "/wiki/Serenno",
  "/wiki/20_BBY",
  "/wiki/Galactic_Republic",
  "/wiki/Asajj_Ventress",
  "/wiki/Test_of_Fury",
  "/wiki/Challenge_of_blindness",
  "/wiki/Nightsister_lair",
  "/wiki/Magick",
  "/wiki/Devaron_massacre",
  "/wiki/Devaron",
  "/wiki/Jedi_Order",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Grievous",
  "/wiki/Spirit_world",
  "/wiki/19_BBY",
  "/wiki/Battle_of_Sundari",
  "/wiki/Ord_Mantell",
  "/wiki/Black_Sun",
  "/wiki/Black_Sun_stronghold",
  "/wiki/Battle_of_Ord_Mantell",
  "/wiki/IG-100_MagnaGuard",
  "/wiki/Force_power",
  "/wiki/The_Force",
  "/wiki/Strangled_Cliffs",
  "/wiki/Galactic_Emperor",
  "/wiki/Great_Jedi_Purge",
  "/wiki/Swamp_of_Sacrifice",
  "/wiki/Padawan",
  "/wiki/Cal_Kestis",
  "/wiki/Mission_to_Dathomir_(Cal_Kestis)",
  "/wiki/Psychometry",
  "/wiki/Subspecies",
  "/wiki/Tattoo",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Belt",
  "/wiki/Spear",
  "/wiki/Monster",
  "/wiki/The_Clone_Wars:_Season_Three",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Stephen_Stanton",
  "/wiki/Dave_Filoni",
  "/wiki/Clancy_Brown",
  "/wiki/Witches_of_the_Mist",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_2",
  "/wiki/Darth_Maul%E2%80%94Son_of_Dathomir_4",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_149",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Databank_(website)",
  "/wiki/Template:JFODate",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Massacre",
  "/wiki/Revenge",
  "/wiki/Eminence",
  "/wiki/The_Lawless",
  "/wiki/Time",
  "/wiki/Order_66",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Battlefront_II"
 ]
}