{
 "name": "Visquis",
 "display_name": "Visquis",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Exchange"
     ]
    }
   ]
  }
 ],
 "content": "Visquis was a Quarren crime lord of the Exchange responsible for its business on Nar Shaddaa until 3951 BBY.\nLike Loppak Slusk on Telos IV, Visquis worked for G0-T0, one of the most powerful leaders of the Exchange. On Nar Shaddaa, he could usually be found in his private lounge in the Jekk'Jekk Tarr.\nOver time, however, Visquis grew weary with his boss. Goto did not seem to care much for the Exchange; he was only interested in numbers, progress reports, and stability. Eventually, Visquis entered a deal with Vogga the Hutt, who was annoyed by Goto stealing his freighters and disrupting his business on Nar Shaddaa, and received Vogga's best bounty hunter, Hanharr, at his disposal.\nVisquis decided to use the bounty G0-T0 had placed on Jedi against him—he planned to capture a living Jedi and bring him before Goto; so far, the mysterious authority had only presented himself as a hologram, but for a Jedi, as Visquis hoped, he would make an exception, giving bounty hunters an opportunity to assassinate him.\nKnowing that the Jedi appeared whenever there were oppressors and oppressed people, he ordered Saquesh—his representative in the Refugee Sector of Nar Shaddaa, also a Quarren—to start driving the refugees away. However, even though there were rumors of a Jedi present on Nar Shaddaa—true rumors, speaking about Master Zez-Kai Ell—that Jedi seemed not to be endangering himself by intervening into the conflict between the Exchange and the refugees. Some time had passed before another Jedi, Meetra Surik, appeared on the Smugglers' Moon and drove Saquesh and the Exchange out of the Refugee Sector.\nSurik then received a message from Visquis, who said he had arranged an audience in his personal lounge. Even though Surik was aware that it was a trap, she decided to walk into it, as she and Kreia knew that sometimes traps worked both ways. However, on her way to the Jekk'Jekk Tarr, she was intercepted by Mira, who had been employed by Zez-Kai Ell to watch over Surik. She stole her enviro-suit and entered the bar herself, hoping to reach a peaceful agreement—but her efforts proved to be for nothing.\nAfter that, Surik entered the Jekk'Jekk Tarr herself, using the breath control Force power to survive in its toxic atmosphere, and single-handedly laid down Visquis's thugs who tried to stop her. This caused Visquis to rethink his chances and run away to his secret underground citadel, well-hidden behind a maze of ventilation tunnels and guarded by his personal Ubese bounty hunters.\nHowever, there was something Visquis did not take into account: Mira. He brought her to an arena in his hideout and suspected her to become easy prey for Hanharr, but she proved to be tough to kill. She defeated Hanharr and escaped the arena, evaded the Ubese bounty hunters, and let Surik in.\nDesperate, Visquis ordered all the Ubese to attack the Jedi at once, but suddenly he realized that they had never truly served him—G0-T0 was their true master, and when G0-T0 finally learned that Visquis had betrayed him, they turned against the Quarren, no longer responding to his orders. One of the bounty hunters then impaled Visquis with a vibro double-blade, killing him instantly, despite Surik's protest. After his death, they incapacitated Surik, and delivered her to G0-T0's yacht.\nThe underground citadel in the Jekk'Jekk Tarr was planned to belong to the GenoHaradan, but, when they were cut from the game, was reassigned to Visquis—similar to how Lonna Vash and one of the protocol droids in Vogga's warehouse were reassigned from the planet M4-78.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/3951_BBY",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Exchange",
  "/wiki/Mira",
  "/wiki/Crime_lord/Legends",
  "/wiki/Loppak_Slusk",
  "/wiki/Telos_IV",
  "/wiki/G0-T0",
  "/wiki/Jekk%27Jekk_Tarr",
  "/wiki/Vogga",
  "/wiki/Hutt/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Hanharr",
  "/wiki/Bounty/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Saquesh",
  "/wiki/Refugee_Sector",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Meetra_Surik",
  "/wiki/Kreia",
  "/wiki/Enviro-suit",
  "/wiki/Breath_control",
  "/wiki/Force_power/Legends",
  "/wiki/Ubese/Legends",
  "/wiki/Vibro_double-blade",
  "/wiki/Visionary",
  "/wiki/GenoHaradan",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Lonna_Vash",
  "/wiki/Protocol_droid/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide"
 ]
}