{
 "name": "Vitor_Reige",
 "display_name": "Vitor Reige",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial Remnant",
      "Alliance-in-exile",
      "Jedi Coalition"
     ]
    }
   ]
  }
 ],
 "content": "Vitor Reige was a male Human who served as a shuttle pilot for the Imperial Remnant during the Yuuzhan Vong War, an admiral under Jagged Fel, and later became the first democratically-elected Head of State of the Imperial Remnant after Fel dropped out of a three-way contest with Natasi Daala.\nDuring the Battle of Bastion, which occurred during the latter half of the Yuuzhan Vong War, it was Vitor who flew the shuttle that bore the grievously injured Grand Admiral Gilad Pellaeon from Bastion to Yaga Minor. He accompanied the Grand Admiral aboard the Widowmaker, and refused to have his own wounds tended to until the Grand Admiral was stabilized by the Jedi healer, Tekli.\nReige was Pellaeon's top aide at the Second Battle of Fondor in 41 ABY and had been serving him faithfully for years. When Pellaeon was murdered by Tahiri Veila, Reige led a mutiny against the Moffs who had taken over Pellaeon's flagship, the Bloodfin, holding out long enough to be rescued by Mandalorian forces.\nIn 44 ABY Reige, now an Admiral, commanded the Bloodfin against Natasi Daala during the Battle over Exodo II.\nWhen Daala, with the help of Abeloth posing as Lydea Pagorski, shortly later managed to make Fel agree to a democratic election for the post of Imperial Head of State, Fel convinced Reige to enter the contest as a spoiler candidate to split the military vote. After Fel ordered a strike on Daala's campaign headquarter - the same laboratory in which Tol Getelles developed his youth serum from drochs and the scientists who developed the nanovirus that prevented Boba Fett from returning to Mandalore - public opinion rose against Fel but he anticipated Daala's attempt to discredit him for his actions and instead chose to drop out of the race and endorsed Reige, who beat Daala easily. Reige then gave the former Head of State the yacht Parting Gift as a farewell present.\nIn the Star Wars: Legacy of the Force novel, Legacy of the Force: Revelation, it's implied that Pellaeon may have fathered Vitor Reige with an unidentified woman, though Pellaeon never confirmed Reige's ancestry. This would be supported in the Fate of the Jedi novel Fate of the Jedi: Ascension, when Admiral Daala believes that Reige sounds like a younger Pellaeon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Alliance-in-exile",
  "/wiki/Jedi_Coalition",
  "/wiki/Shuttle/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Admiral/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/Imperial_Election_of_44_ABY",
  "/wiki/Head_of_State_(Imperial_Remnant)",
  "/wiki/Natasi_Daala",
  "/wiki/Battle_of_Bastion",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Bastion/Legends",
  "/wiki/Yaga_Minor/Legends",
  "/wiki/Widowmaker_(frigate)",
  "/wiki/Jedi_healer/Legends",
  "/wiki/Tekli",
  "/wiki/Second_Battle_of_Fondor",
  "/wiki/41_ABY",
  "/wiki/Tahiri_Veila",
  "/wiki/Moff/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Bloodfin_(Star_Destroyer)",
  "/wiki/Mandalorian/Legends",
  "/wiki/44_ABY",
  "/wiki/Battle_over_Exodo_II",
  "/wiki/Abeloth",
  "/wiki/Lydea_Pagorski",
  "/wiki/Tol_Getelles",
  "/wiki/Droch",
  "/wiki/Nanovirus",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Mandalore/Legends",
  "/wiki/Parting_Gift",
  "/wiki/Star_Wars:_Legacy_of_the_Force",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Ascension",
  "/wiki/The_New_Jedi_Order:_Force_Heretic_I:_Remnant",
  "/wiki/Legacy_of_the_Force:_Invincible",
  "/wiki/Fate_of_the_Jedi:_Ascension_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Head_of_State/Legends",
  "/wiki/Emperor/Legends"
 ]
}