{
 "name": "Viun_Gaalan",
 "display_name": "Viun Gaalan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Tall"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Lavender"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Lost Tribe of Sith"
     ]
    }
   ]
  }
 ],
 "content": "Viun Gaalan was a male Keshiri Lord of the Lost Tribe of Sith who was admired by others for his physical beauty. In 43 ABY, Lord Gaalan led a convoy of shuttles dispatched from the Tribe's armada to the surface of the planet Dathomir to parley with the Nightsisters clan of witches. Expecting all of the Sith to be female, the leader of the Nightsisters, Dresdema, ordered her witches to attack Gaalan's forces once she realized that they were being led by a man. While the Nightsisters were quickly defeated, captured, and taken off-world by the Sith, Gaalan's own departure was delayed by the arrival of Jedi Grand Master Luke Skywalker and two others. Gaalan and Skywalker dueled intensely while several of the Sith Lord's remaining companions were cut down by Skywalker's associates, forcing him to retreat to the safety of his shuttle and flee the battlefield.\nViun Gaalan was a male Keshiri from the planet Kesh. Gaalan was also Force-sensitive, and his ability to manipulate its dark side, combined with his unblemished physical appearance, eventually earned him the rank of Sith Lord within Kesh's Lost Tribe of Sith.\nIn 43 ABY, Lord Gaalan was a member of a team that was sent by the Lost Tribe to the Dathomir system to retrieve the stranded Sith apprentice Vestara Khai. Khai was the sole survivor of a strike force that had been recently dispatched to the Maw black hole cluster on a mission to kill Luke Skywalker, the Grand Master of the Jedi Order. She fled to the planet Dathomir, made contact with the Tribe, and made plans for them to rescue her. Khai had also arranged for a group of Nightsister witches to be collected by Gaalan's team for transport back to Kesh.\nAt the appointed time, Gaalan led a vanguard of shuttles to Dathomir's surface, where he was introduced by his aide to Dresdema, leader of twenty-two Nightsisters and eighteen of their pet rancors. The witches were expecting all of the Sith to be female and perceived Gaalan's obviously male identity as an act of treachery. Dresdema gave an order for her sisters to attack, forcing Gaalan and the Sith into battle. He immediately set upon the nearest rancor, using the Force to propel himself onto the beast's shoulder. He then decapitated the rancor with his lightsaber, while his companions killed the remaining rancors and incapacitated all of the Nightsisters.\nAs the witches were being bound and taken to the shuttles, Gaalan was approached by Vestara Khai, who advised the Sith Lord of an additional Nightsister whom she had captured. Gaalan praised her and took from her a datapad that held the coordinates to the Maw Cluster, the home of a mysterious dark side being whom Khai had encountered while in pursuit of the Jedi. He then allowed the apprentice to recover her captive but was confronted shortly thereafter by Luke Skywalker and his son, Ben—who had followed Khai to Dathomir—and their Force-sensitive comrade Dyon Stadd.\nAfter he introduced himself to the elder Skywalker, Gaalan declared that he would be the agent of the Jedi Grand Master's death, and would also exact revenge on behalf of Lady Olaris Rhea, whom Skywalker had killed at Sinkhole Station. When the Jedi dismissed Gaalan's proclamation, the Sith Lord ignited his red-bladed lightsaber and lunged at his opponent. His aide joined him in the assault against Skywalker, but Gaalan soon found himself alone against the Jedi Master, as his aide was knocked aside. His aide and the two other Sith, a male and a female Saber, then engaged Stadd and Ben Skywalker during the fight. Gaalan matched Skywalker blow-for-blow, but the other Sith quickly fell to Ben Skywalker and Stadd. As Khai returned to the scene to aid the Sith, Gaalan capitalized on a moment of Skywalker's distraction to retreat to the safety of his shuttle. He immediately closed the hatch and sped away while using the Force to telekinetically counter and nullify Skywalker's Force grip on the shuttle.\nViun Gaalan was a tall, lean, broad-shouldered, lavender-skinned Keshiri male who possessed a physical beauty that was highly respected by the members of the Lost Tribe. Indeed, his flawless features contributed to his ascension to the rank of Sith Lord, which was a common occurrence among the upper echelons of the Sith. Women such as Vestara Khai and the Nightsister Dresdema considered him exceedingly attractive, although the latter was not so moved by his appearance that she felt obliged to abandon the Dathomiri belief in feminine superiority.\nGaalan spoke with a cultured, rich, and melodious voice that was unnervingly pleasant, and conveyed an air of preeminence. He regarded the Nightsisters as savages and was disappointed with being assigned to escort them back to Kesh. He did little to acknowledge the presence of Sith apprentices such as Vestara Khai, and like other Sith Lords, his face remained expressionless during casual conversation, even in the midst of joking. Gaalan did, however, voice his approval of Khai's actions and openly commended her success upon their meeting in the Dathomir landing meadow. He nevertheless considered Khai expendable and chose to ensure only his own survival when he escaped to his shuttle and left Khai to the mercy of the Jedi.\nGaalan was interested in achieving greater status within the Lost Tribe and believed such honor would be bestowed upon him were he able to kill Luke Skywalker. He also actively sought to avenge the death of Lady Rhea by ending Skywalker's life, but he was unsuccessful in completing that goal.\nViun Gaalan displayed notable ability with his red-bladed lightsaber, using it to behead a rancor in one fell swoop. His dueling prowess was slightly inferior to Grand Master Skywalker's, whose blade came increasingly close to striking the Sith Lord, before Gaalan was forced to flee. Skywalker believed that while Gaalan's combat skills were probably enough to contend with Jedi swordmasters such as Kyp Durron or Kyle Katarn, he would have been more than a match for the reserved dueling style of the Mon Calamari Master Cilghal, or even Skywalker himself, had the Grand Master had to face Gaalan immediately after his time beyond shadows in the Maw.\nGaalan also demonstrated considerable strength in the Force and used it to perform feats of great acrobatic skill. He was able to leap to great heights when fighting a rancor before alighting with flawless balance. He was also able to telekinetically resist and counter the Force grip of Luke Skywalker while escaping in his shuttle.\nViun Gaalan first appeared in Aaron Allston's 2010 novel Fate of the Jedi: Backlash, the fourth installment in the Star Wars: Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Kesh",
  "/wiki/Keshiri",
  "/wiki/Gender/Legends",
  "/wiki/Purple",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Sith_Lord/Legends",
  "/wiki/43_ABY",
  "/wiki/Lord/Legends",
  "/wiki/Convoy/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Sith_armada_(Lost_Tribe_of_the_Sith)",
  "/wiki/Planet/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Nightsisters/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Sith/Legends",
  "/wiki/Dresdema",
  "/wiki/Skirmish_in_the_Dathomir_landing_meadow",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Duel_in_the_Dathomir_landing_meadow",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dathomir_system/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Vestara_Khai",
  "/wiki/Lost_Tribe_of_Sith_strike_team",
  "/wiki/The_Maw/Legends",
  "/wiki/Black_hole/Legends",
  "/wiki/Skirmish_at_Sinkhole_Station",
  "/wiki/New_Jedi_Order",
  "/wiki/Viun_Gaalan%27s_aide",
  "/wiki/Rancor/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_Jump",
  "/wiki/Sai_cha/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Death/Legends",
  "/wiki/Halliava_Vurse",
  "/wiki/Datapad/Legends",
  "/wiki/Abeloth",
  "/wiki/Ben_Skywalker",
  "/wiki/Dyon_Stadd",
  "/wiki/Olaris_Rhea",
  "/wiki/Sinkhole_Station",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Unidentified_male_Sith_Saber_(Viun_Gaalan)",
  "/wiki/Unidentified_female_Sith_Saber",
  "/wiki/Sith_Saber",
  "/wiki/Telekinesis/Legends",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Swordmaster",
  "/wiki/Kyp_Durron",
  "/wiki/Kyle_Katarn",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Cilghal",
  "/wiki/Beyond_shadows",
  "/wiki/Aaron_Allston",
  "/wiki/2010",
  "/wiki/Fate_of_the_Jedi:_Backlash",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Backlash_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Omen",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Fate_of_the_Jedi:_Allies"
 ]
}