{
 "name": "Vizam",
 "display_name": "Vizam",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kintan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Vizam was a Kajain'sa'Nikto male who served as weapons master for the crime lord Jabba the Hutt. Between 8 BBY and 2 BBY, Vizam contacted the criminal Corbus Tyra to let him know that Jabba was offering a million credits for someone to steal an urn containing the ashes of the Hutt's rival Krestrel D'Naran. In 4 ABY, he was present in the throne room of Jabba's Palace on the planet Tatooine when the droids R2-D2 and C-3PO arrived to deliver a message from Jedi Knight Luke Skywalker, a member of the Rebel Alliance. Skywalker stated his desire to see the smuggler Han Solo freed from imprisonment in the palace and then gifted the droids to Jabba.\nVizam later watched a performance by the Max Rebo Band in the throne room, which ended with the dancer Oola being dropped through a trap door into a pit containing the rancor Pateesa. The Nikto excitedly watched as the dancer was killed by Pateesa, after which Skywalker's ally Princess Leia Organa arrived disguised as a bounty hunter with the Solo's ally Chewbacca as a prisoner. Vizam and the rest of Jabba's court later hid within the throne room in order to catch Organa attempting to free Solo. Once the smuggler was free, Jabba revealed himself along with Vizam and the others and had Organa and Solo captured.\nVizam was again present in the throne room when Skywalker himself arrived, witnessing Jabba drop the Jedi into the rancor pit only for Skywalker to slay Pateesa. Jabba then demanded that the prisoners be fed to the sarlacc living in the Great Pit of Carkoon. Vizam traveled to the pit onboard Jabba's sail barge, the Khetanna, but the prisoners fought back against Jabba's henchmen once brought to their destination. While Vizam mounted a laser cannon on the barge's top deck and opened fire on the skiff carrying the prisoners, Skywalker boarded the barge and slew the Nikto with his lightsaber.\nOriginally from the planet Kintan, the Nikto Vizam served as weapons master for the criminal empire of the Hutt crime lord Jabba Desilijic Tiure. At some point between 8 BBY and 2 BBY, Vizam learned that Jabba had offered the criminals Han Solo, Chewbacca, and Greedo one million credits to go to the planet Corellia and steal an urn containing the ashes of Krestrel D'Naran, one of the Hutt's rivals.\nKnowing that he was looking for an easy way to make money, Vizam then contacted the criminal known as Corbus Tyra via hologram from a cantina in Mos Eisley spaceport on the planet Tatooine. After Vizam detailed the job and its reward, Tyra correctly guessed that for that much money there must be other parties also trying to steal the urn, prompting Vizam to ask if Tyra was familiar with Solo. Jabba's majordomo, Bib Fortuna, was aware that Vizam had told Tyra about the job and provided this information to Buck Vancto, a marshal of the Benelex Marshal Service who was searching for Solo. Following this lead, Vancto crossed paths with Tyra and arrested him, revealing that he had learned about Vizam's tip off.\nIn 4 ABY, during the Galactic Civil War between the Galactic Empire and the Alliance to Restore the Republic, Vizam was present in the throne room of Jabba's Palace on the Tatooine when the droids R2-D2 and C-3PO delivered a message to the Hutt from Jedi Knight Luke Skywalker of the Rebel Alliance. As Vizam stood next to a Jawa beside Jabba's dais, a hologram of Skywalker stated his intention to see Solo, who was imprisoned in the palace within a block of carbonite, set free. Skywalker then gifted the two droids to Jabba, and they were escorted by several of the Hutt's henchmen from the room.\nVizam later viewed a musical performance by the Max Rebo Band in the throne room, which ended when the Twi'lek dancer Oola refused Jabba's advances. The Hutt dropped the dancer through a trap door into a pit containing his pet rancor, Pateesa. Vizam was among the members of the court who rushed forward to the grate above the pit to witness Oola's demise. Leia Organa, an ally of Skywalker, then arrived in the throne room disguised as the bounty hunter Boushh and was accepted into the court after delivering Chewbacca as a prisoner to the Hutt.\nHaving been tipped off by the bounty hunter Boba Fett, Jabba knew Boushh was not who they seemed and later that night, Vizam and the rest of the court hid themselves behind a curtain in the throne room in order to set a trap for her. After they had waited for an hour, Organa crept into the room and freed Solo from the carbonite, Jabba revealed himself along with Vizam and his other allies, who were stood between the pair and the exit, blocking their escape. The Hutt then had Organa and Solo taken captive.\nWith Organa having failed her mission, Skywalker himself arrived at the palace to confront the Hutt. Vizam was seated on the floor of one of the throne room's alcoves among various other resting court members when Skywalker entered the throne room and demanded that Jabba free his friends. Vizam stood to witness the confrontation, which resulted in Skywalker being dropped into the rancor pit after threatening Jabba's life. However, Skywalker managed to slay Pateesa, causing an enraged Jabba to demand that Skywalker, Solo, and Chewbacca be fed to the sarlacc that dwelled within the Great Pit of Carkoon on Tatooine.\nTo view his prisoners' execution, Jabba traveled to the sarlacc pit on his sail barge, the Khetanna. Vizam was also on the barge while Jabba's prisoners were transported on a Bantha-II cargo skiff escort. Once the skiff stopped above the pit, R2-D2 launched Skywalker's lightsaber from the barge to the Jedi, who took the blade to defeat Jabba's henchmen and free his friends aboard the skiff. Vizam witnessed the attack and quickly mounted a Gi/9 antipersonnel laser cannon on the sail barge's railing.\nThe Nikto then opened fire on the skiff, which knocked Lando Calrissian—an ally of Skywalker's who had been disguised as one of Jabba's men—and the skiff's helmsman, Vedain, overboard. Calrissian took hold of the skiff and survived, but the helmsman tumbled into the maw of the sarlacc. Vizam continued firing on the skiff, allowing Skywalker to deflect one of the bolts from the Nikto's turret into the jetpack of Fett, incapacitating Fett and contributing in no small part to the hunter's fall into the sarlacc below. Vizam's assault eventually caused the vehicle to drop on one side, after which Skywalker climbed aboard the sail barge and slashed Vizam with his lightsaber, killing him. The Jedi and his allies went on to kill Jabba and destroy the entire sail barge before escaping Tatooine.\nVizam was an orange-skinned Kajain'sa'Nikto, a subspecies of the Nikto species, with a flat face. After learning that Jabba had offered a job to Solo and his crew, Vizam contacted Corbus as a potential rival for Jabba's chosen employees. When Corbus expressed surprise at the amount that the Hutt was offering for the urn, Vizam stated that it was not that surprising if you knew Jabba.\nVizam enjoyed grisly executions more than most. When the enslaved girl Oola was being eaten by the rancor, the Nikto chose to move closer to the rancor's pit and watch while bobbing up and down. The disruption of the execution at the Pit of Carkoon spoiled Vizam's day and he began firing from the deck enthusiastically in order try and bring things back under control and earn Jabba's respect. The Nikto was so intent on firing at the skiff that he did not notice Skywalker boarding the sail barge until it was too late.\nVizam manned a laser cannon while aboard Jabba's sail barge. He wore brown-and-gray headgear; several layers of clothing that included a yellow padded vest, navy sleeves, and gray shoulder pads; chrome gauntlets; a utility belt; white pants; and black boots. On at least one occasion, Vizam also carried a DL-18 blaster pistol, which he kept in a holster on his belt.\nVizam first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The character was created for the film through the combined efforts of Phil Tippett's creature design team and Nilo Rodis-Jamero's costume design team. During production of the film, Vizam was known as \"Nikto #4\" and dressed in a costume designed to be similar to some of the other skiff guards. A sketch of Vizam's costume was drawn by Tippett.\nThe Vizam costume consisted of a navy undergarment covered by a brown kimono and then a quilted yellow tabard, as well as white pants, gray vambraces, and a soft hat made of brown-and-gray fabric. The costume's wrist guards were made of plastic, and the cotton jersey that served as the undergarment was dyed navy and smocked to give the clothing a loose, bunched appearance on the arms.\nIn the new Star Wars canon, the character was first identified by name in 2016 in the nineteenth issue of the Star Wars Helmet Collection magazine produced by De Agostini. That name originated in Star Wars Legends through Decipher, Inc.'s Star Wars Customizable Card Game, where it appeared on the \"Vizam\" card in the 1998 Jabba's Palace Limited set. The 2018 reference book Star Wars: Complete Vehicles uses Vizam's character design for the majority of guards on board the Khetanna.\nVizam appears in \"Tatooine Rhapsody,\" an ambiguously canon short film in the Star Wars: Visions series released on September 22, 2021. In the short, the band Star Waver make a deal to perform for Jabba in the Mos Espa Grand Arena before he executes one of their members, Geezer Odajion. Vizam pilots a Bantha-II cargo skiff to the arena's stage carrying two Gamorreans and three members of the band; Odajion, K-344, and V-5.\nHe then moves the vehicle away from the stage while the song \"Galactic Dreamer\" is performed, but returns at the end of song transporting the armed guards Vedain, Kithaba, and Rintel Aren. Star Waver's lead singer, Jay, then asks Jabba to spare Odajion and instead become the band's first sponsor. After the crowd demand an encore, the guards on Vizam's skiff aim their blasters at the band, but then shoulder them on Jabba's signal to spare Odajion. Vizam then pilots the skiff away, allowing the band to perform again.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Vizam",
  "/wiki/Vizam/Legends",
  "/wiki/Kintan",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Nikto",
  "/wiki/Kajain%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Weapons_master",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/2_BBY",
  "/wiki/Corbus_Tyra",
  "/wiki/Credit",
  "/wiki/Krestrel_D%27Naran",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Planet",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Jedi_Knight",
  "/wiki/Luke_Skywalker",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Prison",
  "/wiki/Max_Rebo_Band",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Pateesa",
  "/wiki/Death",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Boushh",
  "/wiki/Chewbacca",
  "/wiki/Prisoner",
  "/wiki/Jedi",
  "/wiki/Sarlacc",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/LO-KD57",
  "/wiki/Khetanna",
  "/wiki/Gi/9_antipersonnel_laser_cannon",
  "/wiki/Sail_barge",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Homeworld",
  "/wiki/Hutt",
  "/wiki/Greedo",
  "/wiki/Corellia",
  "/wiki/Currency",
  "/wiki/Hologram",
  "/wiki/Cantina",
  "/wiki/Mos_Eisley",
  "/wiki/Spaceport",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Buck_Vancto",
  "/wiki/Marshal",
  "/wiki/Benelex_Marshal_Service",
  "/wiki/Galactic_Civil_War",
  "/wiki/Galactic_Empire",
  "/wiki/Throne",
  "/wiki/Jawa",
  "/wiki/Carbonite",
  "/wiki/Music",
  "/wiki/Twi%27lek",
  "/wiki/Bounty_hunter",
  "/wiki/Boba_Fett",
  "/wiki/Standard_day",
  "/wiki/Standard_hour",
  "/wiki/Skiff",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Helm_officer",
  "/wiki/Vedain",
  "/wiki/Turret",
  "/wiki/Jetpack",
  "/wiki/Lightsaber",
  "/wiki/Species",
  "/wiki/Slavery",
  "/wiki/Laser_cannon",
  "/wiki/Hat",
  "/wiki/Clothing",
  "/wiki/Armor",
  "/wiki/Gauntlet",
  "/wiki/Utility_belt",
  "/wiki/Boot",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/Holster",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Phil_Tippett",
  "/wiki/Nilo_Rodis-Jamero",
  "/wiki/Star_Wars",
  "/wiki/2016",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/De_Agostini",
  "/wiki/Star_Wars_Legends",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/1998",
  "/wiki/Jabba%27s_Palace_Limited",
  "/wiki/2018",
  "/wiki/Star_Wars:_Complete_Vehicles_(2018)",
  "/wiki/Tatooine_Rhapsody",
  "/wiki/Star_Wars:_Visions",
  "/wiki/September_22",
  "/wiki/2021",
  "/wiki/Star_Waver",
  "/wiki/Mos_Espa_Grand_Arena",
  "/wiki/Geezer_Odajion",
  "/wiki/Gamorrean",
  "/wiki/K-344",
  "/wiki/V-5",
  "/wiki/Galactic_Dreamer",
  "/wiki/Kithaba",
  "/wiki/Rintel_Aren",
  "/wiki/Jay",
  "/wiki/The_Skywalker_Saga",
  "/wiki/Han_Solo_%26_Chewbacca_1",
  "/wiki/Han_Solo_%26_Chewbacca_5",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(Disney_Die-Cut_Classics)",
  "/wiki/Episode_VI:_Return_of_the_Jedi_Read-Along_Storybook_and_CD",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Category:Images_of_Vizam",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Han_Solo_%26_Chewbacca",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/19_BBY",
  "/wiki/10_BBY",
  "/wiki/0_BBY",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/The_Art_of_Star_Wars_Episode_VI:_Return_of_the_Jedi",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star"
 ]
}