{
 "name": "Vodo-Siosk_Baas",
 "display_name": "Vodo-Siosk Baas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Krevas"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3996 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Krevaaki"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red chitinous carapace"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Jedi Order",
      "New Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Crado",
      "Shoaneb Culu",
      "Dace Diath",
      "Krynda Draay",
      "Exar Kun",
      "Nomi Sunrider",
      "Sylvar",
      "Qrrrl Toq"
     ]
    }
   ]
  }
 ],
 "content": "Jedi Master Vodo-Siosk Baas was a venerable Krevaaki male who served the Jedi Order with distinction into the onset of the Old Sith Wars. A warrior, historian, and expert lightsaber crafts being, Baas's was a life devoted to the training of Jedi Knights to combat agents of the dark side of the Force. A respected member of the Assembly of great Masters, Baas's time was divided between the Jedi epicenter on the world of Ossus and his academy for exceptional apprentices on the planet Dantooine. Although several of his students achieved fame for their efforts against the Sith, it was while under Baas's tutelage that a young Human named Exar Kun developed a fanatical desire for knowledge forbidden by the Jedi, and abandoned his Master's wisdom in search thereof.\nBy 3997 BBY, the influence of Sith magic had resurfaced and rapidly spread across the galaxy, headquartered in the Empress Teta system and propagated by the Krath cult. Vodo-Siosk Baas answered the summons of all Jedi to convene on the planet Deneba and discuss strategy against the new Sith, but while en route he experienced the despair of his errant apprentice's fall to the dark side and became even more concerned with the future safety of the galaxy. The Jedi Convocation was assailed by the Krath, an attack that spurred Jedi Knight Ulic Qel-Droma into an infiltration mission of their ranks. Baas was among several Masters in meditation on Ossus who foresaw Qel-Droma's inevitable fall to the dark side, which culminated in his apprenticeship to the Dark Jedi Exar Kun, who had since become the Dark Lord of the Sith and had begun preparations for the restoration of a Sith Golden Age to the galaxy.\nWith the Lords of the Sith Brotherhood firmly enmeshed in total war against the Galactic Republic, Vodo-Siosk Baas represented the Masters of the Order on a diplomatic venture to the Galactic Senate on Coruscant with a request for permission to handle what they considered to be an internal affair. He and his retinue of Jedi Knights subsequently participated in the successful defense of the galactic capital from the invading Krath and Mandalorian armies, which were led by Ulic Qel-Droma. With the defeated warlord in custody and his forces repelled, Baas returned to Dantooine for a time, in contemplation of his hand in the return of the Sith. Although devastated, he became ever more determined to prevent the realization of Kun's campaign of galactic tyranny. Baas returned to Coruscant and met his former apprentice in the fully audienced Grand Convocation Chamber of the Senate Hall, with a final demand for Kun's renunciation of his chosen Sith path. Baas was forced into a duel with him, and was over-matched when the Dark Lord activated his lightsaber's unexpected second blade. With his own demise at hand, Baas promised to one day return and vanquish Kun, whose killing blow then committed the Krevaaki to the Force. In fulfillment of his dying prophecy, the ghost of Baas returned more than four thousand years later to assist the inaugural class of Master Luke Skywalker's Jedi Praxeum in the final defeat of Kun's own disembodied spirit.\nA native of his species' homeworld of Krevas, Vodo-Siosk Baas was a Krevaaki male Jedi Master with centuries of service to both the Jedi Order and the Galactic Republic into the onset of the Old Sith Wars. A respected teacher and formidable warrior, Baas dedicated himself to the preparation of future generations of Jedi Knights for battle against the inevitable return of threats armed with the power of the dark side. A historian extensively acquainted with the history of the ancient Sith, much of Baas's knowledge was recorded in the Tedryn Holocron, a Jedi heirloom created by the ancient Jedi Master Tedryn. By 4000 BBY, the Krevaaki Master had taken up instruction of apprentices at the Jedi training center on the world of Ossus. Study under Baas consisted of exploration of the Force and its application, as well as the creation of and honed proficiency with the Jedi lightsaber. He became the Master of several promising young apprentices, among them Dace Diath, a Human male adolescent from Tatooine; the Nazzar Crown Prince Qrrrl Toq; and a timid, Force-sighted Miraluka girl named Shoaneb Culu. While Diath had received previous training from his father, a renowned Jedi Master named Sidrona Diath, and Toq had been a disciplined philosopher among his people, Baas sensed misgivings in Culu, whose limited facility with the Force had somewhat dashed her dream of taking the Jedi arts back to her homeworld of Alpheridies. At first disturbed by the young girl's passion for knowledge, Baas soon realized that hers was a genuine desire for enlightenment, so he spent many hours a day in private instruction with her. Although her ability to command the Force was less than that of her peers, Culu achieved a matchless understanding of its nature, and became more learned in the lore of ancient Jedi, all by way of Vodo-Siosk Baas' instruction.\nThat same year, centuries of civil war on Onderon, an Inner Rim world that had been under the thrall of the dark side since its subjugation by a Dark Lord of the Sith called Freedon Nadd, was brought to an end via the intervention of Jedi Knights under the guidance of the Arkanian Master Arca Jeth. The planet remained plagued by terrorism in the two years of relative peace that followed, as remnants of the defeated regime perpetuated interference with efforts to restore planetary civilization and stability. By 3998 BBY, worshipers of the dark side had again risen to prominence on Onderon, and many Jedi came to Ossus as the Order sought to marshal their forces against the new Sith threat. Baas met with a Tchuukthai Master called Thon and assumed tutelage of his apprentice, Nomi Sunrider, whom Baas was to guide in the creation of her own lightsaber. Upon their first meeting, Baas discerned that the Force was strong with the young woman, whose late husband he had known, and in whose infant daughter he also sensed great potential. He introduced Sunrider to Shoaneb Culu, who had also reached the next level in her training, but had further ruined the already flawed lightsaber crystal with which, moments before, she had intended to focus her weapon. Sunrider offered one of her many pontites, crystals that Baas recognized as the rarest of specimens. Over the course of a week, Baas watched as Dace Diath, Culu, Sunrider, and others fine-tuned their individual designs, until each had fashioned a fully functional lightsaber with which to do battle.\nTensions on Onderon blossomed into open warfare when Jeth was captured by the planet's sorcerer-king, Ommin, and the revealed Sith spirit of Freedon Nadd himself. In response, a convocation of Jedi was called on Ossus to develop a rescue mission for their beleaguered comrades on the other side of the galaxy. Of all who volunteered, five were chosen: the Gotal Kith Kark, Dace Diath, Shoaneb Culu, Nomi Sunrider, and Qrrrl Toq. Prior to their departure, Baas took Culu aside and expressed doubts that she was confident enough in her abilities to serve effectively on Onderon. When she calmly replied that she believed the Force was pulling her toward something important, Baas gave her his blessing. Baas's Onderon-bound students were successful in their mission and permanently drove the influence of the dark side from the planet. Around the same time, Baas interviewed a young woman named Krynda Hulis, whom he later accepted for apprenticeship. With both Human and Miraluka lineage, Hulis demonstrated exceptional powers of prognostication, and the Krevaaki Master was often inclined to refer to her as the \"eyes of the Jedi.\"\nIn the wake of the events on Onderon, Baas became more vigilant in his quest to prevent the resurgence of the Sith, and he recorded the history of the fallen Jedi–turned–Dark Lord Nadd in his holocron, records only intended for access by fellow Jedi Masters. He had since relocated to the barren world of Dantooine, where he agreed to serve as the system's Jedi Watchman, although he ventured back to Ossus from time to time. In a dilapidated training compound long forsaken prior to Baas's arrival, he established a new environment for students to learn from him the ways of the Jedi. Only those destined for Knighthood were trained at the Dantooine academy, and among Baas's new pupils were the Cathar mates Crado and Sylvar, and Exar Kun, a prodigious young Human of exceptional talent in both the Force and with the lightsaber. Relentlessly, Baas drilled them, and Kun, whom Baas quickly recognized as the greatest student he had ever had, regularly bested his classmates in practice combat. Baas noticed that an arrogance had grown in the young Human, as well as a thirst for forbidden knowledge; on one occasion, Kun took the Tedryn Holocron and immersed himself in stories of Freedon Nadd and his fall to the dark side. Baas confiscated the device and admonished his curious student, who was of the opinion that his superior skill in all areas made him eligible for such closely guarded knowledge. The Krevaaki Master rebuked Kun's haughtiness and bade him prove such claims in another lightsaber combat practice session against Crado and Sylvar.\nKun dominated his Cathar opponents from the onset of their bout, Crado especially. He next faced Sylvar, with whom he appeared to be evenly matched, until she slashed his face in a fit of rage. Kun retaliated, but Baas intervened and challenged his apprentice, one who thought so highly of himself, to prove his skill against a Master. Armed with a utilitarian quarterstaff that belied its Force-augmented strength, the Krevaaki Jedi humiliated his overconfident student with relative ease. Kun then retrieved the defeated Crado's lightsaber with which to reengage the Jedi Master; overwhelmed by the sudden onslaught of blades wielded in tandem, Baas was swiftly defeated by Kun, his staff cleaved in two. It was then that he sensed a subtle darkness inside of Kun, of which he believed even the young man to be unaware.\nWhile the dark side had been defeated on Onderon, many Sith artifacts escaped the Inner Rim, taken by individuals eager to continue the practice of Sith magic elsewhere. By 3997 BBY, the Empress Teta star system had fallen under the tyranny of the conquest-driven Krath, a cult of Sith sorcerers taught by the ghost of Freedon Nadd. Two Jedi who had served on Onderon, Ulic Qel-Droma and Nomi Sunrider, participated in the Republic's offensive against the Krath, but the Republic forces were defeated by the Krath's Force illusions and forced to retreat. A conference of all members of the Jedi Order was organized on the planet Deneba in recognition of the threat posed by the new Sith, during which was to be discussed an age-old prophecy that spoke of the return of the Dark Lords of the Sith. Baas answered the summons, accompanied by Crado and Sylvar, but not Exar Kun, who had abandoned his apprenticeship in pursuit of long-forgotten Sith lore.\nAs Baas's courier vessel approached Deneba, an intense wave of agony passed through the Force, one that the aged Master recognized as indicative of Kun's fall to the dark side. He relinquished control of the vessel to Crado and Sylvar as he attempted to draw protective light side energy around his wayward pupil, only to be attacked by the malicious presence of Freedon Nadd, whose spirit had seduced Kun and lashed out at Baas with a potent blast of hatred. Powerless against the Sith spirit's influence over his student, Baas refrained from further attempts to assist Kun as he and the two Cathar made their way planetside. They arrived shortly after a recess had been called, and Baas approached Knights Ulic and Cay Qel-Droma with inquiries as to the whereabouts of their own Master, Arca Jeth. However, the assembly was ambushed shortly thereafter by an army of Krath war droids accompanied by planetside servant droids that had been secretly reprogrammed by the subterfuge of Krath warlord and Tetan Emperor, Satal Keto. The automatons were ultimately decimated, but not before casualties were suffered among the Jedi ranks, Jeth among the most grievous of them. In the battle's aftermath, Baas recorded the day's events in his holocron, as well as details provided by Cay Qel-Droma about the origins of the Krath's war droids.\nGrief-stricken by the loss of his former Master, Ulic Qel-Droma was determined to infiltrate the Krath in the hopes of orchestrating their destruction from within, despite the admonitions of Baas and the conference of Jedi Masters that gathered in the wake of the massacre on Deneba. The Krevaaki Jedi was among those worried about the smoldering anger within Qel-Droma, emotions that Baas had once identified in his own former student–turned–Dark Jedi Exar Kun, and emotions he knew led dangerously close to the embrace of the dark side. It was because of the perceived folly in Qel-Droma's plan that Baas, on behalf of the Jedi Assembly, denied the young Human permission to undertake such a dangerous mission. The insubordinate Qel-Droma declared his intention to carry out his plan, irrespective of the orders of the Jedi leadership. Unable to sway the determined Knight from his idea, Baas offered his blessing before he and the Masters departed for Ossus to develop strategy against the Sith threat.\nQel-Droma carried out his mission, and over the next several months, Baas and the other Masters of the Jedi Assembly gathered each day in communal meditation on the Force. The months passed without any report of Qel-Droma's progress before a team of Knights ventured to the Tetan capital world to extract him. Their mission was unsuccessful, as Qel-Droma had been seduced by the very dark side he had desired to conquer, exactly as predicted by Baas. The repelled Knights returned to Ossus in search of guidance from the Jedi Assembly. While many of them felt that Qel-Droma had been beguiled by the powers of the Sith, Baas was among those who cautioned the Knights against attempts to force the Human back toward the light. They approved of another rescue attempt but gave strict instructions not to extract Qel-Droma with force if he refused to leave of his own accord. All felt the despair of Qel-Droma and the sinister triumph of Exar Kun through the Force at that moment, and Baas immediately inferred that both men had been inextricably taken by the power of the dark side. The subsequent rescue attempt was indeed refused by Qel-Droma, who drove his comrades from Empress Teta before he joined forces with Kun—as the apprentice to the new Dark Lord of the Sith, with whom he conspired to take over the galaxy.\nIn the months that followed, the new Sith Brotherhood began to consolidate their resources in preparation for war with the Jedi and the Republic. Kun traveled to Ossus in search of recruits for his fledgling Sith Empire, while Qel-Droma supplemented his already formidable Krath armies with the warrior clans of Mandalore the Indomitable. As raids against Republic shipyards and military installations were reported throughout the galaxy, rumors abounded of a renegade Jedi perpetrator, and the Republic's Ministry of Defense made plans to deal with what they considered to merely be a new terrorist threat. The Masters of the Jedi Order on Ossus, however, were convinced of a certain fallen Jedi's involvement. Accompanied by Knights Shoaneb Culu, Dace Diath, Tott Doneeta, Cay Qel-Droma, Nomi Sunrider, Sylvar, and Qrrrl Toq, Baas went to Coruscant, determined to convince the Galactic Senate to allow the Jedi to personally handle what they considered to be an internal affair. Baas met with both Supreme Chancellor Sidrona and Minister of Defense Netus, the latter of whom had just received a report from Naval Fleet Captain Orley Vanicus that confirmed Ulic Qel-Droma's complicity, much to the dismay of the Jedi present.\nReports suggested that the Sith's next strike would be against the shipyards at the Kemplex IX space station in the Cron system, and the Republic Navy planned to intercept Qel-Droma's forces there. It dawned on Baas that the actions of Kun and Qel-Droma were indicative of ancient prophecy that foretold the return of the Sith made manifest, and he prepared to confront them both. His departure was halted by the sudden emergence of a battle fleet from hyperspace into the Coruscant atmosphere: the suspected attack on Kemplex IX had been a ruse, and the forces of the Sith had instead attacked the galactic capital. Priority was placed on Baas's safety as both the Jedi Knights and the Republic forces mounted a hurried defense against the Mandalorian-bolstered Krath invaders. However, the Krevaaki Master had foreseen that the outcome of the battle would be decided in the war room, and he made haste for the planetary Command Center. The Jedi fought their way into the war room and found Qel-Droma inside, using the Force to compel reluctant Republic soldiers into his service. With Baas and Nomi Sunrider at the forefront, the Jedi imprisoned the Sith Lord within a temporary wall of light, a technique that effectively blocked a dark-side Force-user from his or her power. Qel-Droma was then placed into the custody of the Republic so that he might stand trial for his crimes against sapient species. His arrest prompted the remaining forces of the Krath, under the leadership of the Sith sorceress Aleema Keto, to retreat from Coruscant while their warlord was left to the mercy of his captors.\nWhile several of the Jedi remained on Coruscant to support Ulic Qel-Droma and participate in his upcoming trial, Baas returned to Dantooine, where he reflected on the events that had resulted in the galaxy's current state of war. Even though Qel-Droma's machinations had appeared to be the most destructive, Baas knew that Exar Kun was the true mastermind behind the galactic turmoil, a result of Baas's own failure to recognize the dark ambitions of his former apprentice. The Krevaaki Master reinforced his feeble quarterstaff before he left Dantooine for Coruscant, resigned to the notion of a final confrontation with Kun, which he was certain would occur during Qel-Droma's trial.\nOn Coruscant, the unrepentant Qel-Droma responded to Senate accusations against him with pro-Sith rhetoric, and a refusal to acknowledge the lawlessness of his actions as so defined, much to the bewilderment of his present Jedi supporters. Accompanied by Mandalore the Indomitable and an entourage of Massassi warriors, Kun then burst into the Senate Hall and paralyzed the gathered senators with a Sith spell as he assumed control of the proceeding. He killed Sidrona moments before Baas arrived, interrupting the outline of Kun's plan to restore a Golden Age of Sith splendor to the galaxy. Baas gave no heed to the Jedi who rose in his defense as he barred the Sith's exit, much to the delight of Kun, who had foreseen the confrontation's necessity in accordance with his planned elimination of the Jedi leadership. Armed with only his quarterstaff, Baas pleaded with Kun to renounce his dark side practices, but to no avail; the Dark Lord activated his lightsaber, and a furious duel ensued. When he realized that he was outmatched, Kun disengaged Baas to reveal a modification made to his weapon that produced a blue blade from each end. The Krevaaki Jedi was immediately over-matched by the double-bladed lightsaber, and he knew that his demise was imminent. He vowed to one day return and defeat Kun, and became one with the Force upon the Dark Lord's killing stroke. The Jedi were left to mourn his passing on the floor of the Senate Hall before the impotent masses, as the Sith departed to resume their campaign of galactic domination.\nThe power of the dark side fueled Kun's war machine as he sought to destroy the Republic in favor of his despotic Sith Empire. He was ultimately betrayed by Qel-Droma, who led the combined forces of the Jedi Order and Republic Navy against Kun's Yavin 4 stronghold, where the Dark Lord bound his spirit to the walls of his temple in defeat. Of Baas's apprentices who survived the Great Sith War, Sylvar achieved celebrity status on her homeworld, while Nomi Sunrider's was a name of legend in the galaxy at large. The atrocities committed by the Sith were largely attributed to Baas's failure to prevent Kun's fall to the dark side. One of his pupils, the seer Krynda Draay, who lost much in the war, dedicated herself to the same vigilance of her Master against the resurgence of the dark side. A statue of Baas was erected in his honor on the grounds of her estate, wherein a secret covenant of Jedi, organized by Draay and tasked to watch for any sign of the return of the Sith, was headquartered. One of the Covenant's many collectives of diviners, \"WatchCircle Vodo,\" was so named after the late Krevaaki Jedi Master. The Covenant's mission was inherently flawed, however, as one of its founders had been Sith in disguise, a man whose clandestine machinations nearly brought about the annihilation of the Jedi Order from within.\nBaas's Dantooine academy was reinstated as a preeminent center of Jedi learning in the years before, during, and after both the Mandalorian and Jedi Civil Wars, and his philosophies survived the millennia through recordings made in the Tedryn Holocron, of which he was one of many interactive gatekeepers. A descendant of his, Bodo Baas, also practiced and mastered the Jedi arts, and stored much of his knowledge and gatekeeper simulacrum in the Tedryn Holocron like his ancestor before him. By 11 ABY, Baas's teachings were an instrumental component in the curriculum of Master Luke Skywalker's newly established Jedi Praxeum on Yavin 4. Interaction with his gatekeeper likeness was short-lived, however, as the Sith spirit of Exar Kun destroyed the holocron and corrupted several of Skywalker's apprentices, before he attacked the Jedi Master himself. Skywalker's students ultimately succeeded against Kun with assistance from Baas, whose spirit joined them in the creation of a wall of light that shattered the Dark Lord's ghost and forever banished him from Yavin 4. A ballad that detailed the struggles and exploits of the Krevaaki Master was later written by Jedi historian Tionne Solusar, who incorporated the piece into a training lesson for the next generation of Skywalker's Jedi Initiates.\nVodo-Siosk Baas was a flatfooted elderly Krevaaki male with a deep-red, slightly mottled exoskeleton. Once he had wispy dark gray hair, all of which was gone by the time Dantooine became his primary residence. His bulbous black eyes were especially expressive in moments of sorrowful reflection. At times, Baas wrapped his hands in bandages, but not always. Although he went without clothing on occasion, Baas was often clad in garments reminiscent of traditional Jedi attire: a dark brown robe, embroidered around the shoulders and adorned with loose-hanging straps fixed to metal rings and buckles, worn over a full-length, long-sleeved, sand-colored tunic, all designed to accommodate the unique physiology of his species. In his later years, he relied on a wooden quarterstaff to support his gnarled frame, but he was yet spry for a being of such advanced age. While Baas dismissed such concerns, his seniority was often ample reason for younger Jedi Knights to defend him in times of imminent danger.\nVodo-Siosk Baas was a pious warrior in his quest against the forces of the dark side, regardless of their form. His devotion to the Jedi way extended beyond direct confrontation with the enemy to preparation of future Knights for the dark times that he felt were sure to come. The urgency with which the Krath wrought galactic havoc dismayed him immensely, but he immediately realized the lesser influence of Ulic Qel-Droma's vengeful ambition in the face of Exar Kun's insatiable desire for chaos. Kun's willful defection to the Sith deeply troubled Baas even more, and he harbored considerable guilt for the fall into darkness of what he considered an inadequately trained apprentice on his behalf, blame for which was also laid at his feet by others. Still, he felt compelled to help Kun, a sign of foolish naiveté according to Freedon Nadd. Baas assumed full responsibility for ending the threat posed by his fallen apprentice and resigned himself to whatever outcome resulted from their confrontation. He gained a deeper understanding into the seductive nature of the dark side through his experience with Kun and recorded his findings into the Tedryn Holocron, so that generations to come could benefit from his findings.\nBaas was a firm believer in the virtues of the lifelong, never-ending training of a Jedi Knight, and readily imparted measures of wisdom to both the curious and uninterested, indiscriminately. Such was the deference conveyed upon him that other Masters often sent their own apprentices to him for further instruction, and Baas could often be seen in the midst of his actively engaged students. He was deeply attuned to the emotions of others: dejection and misgiving were met with comfort and reassurance; overconfidence in those with great promise was swiftly admonished; darkness and emptiness were misunderstood—and pitied. Wisdom born of such an illustrious, centuries-long career earned him the respect of Jedi young and old. By the time of the Great Sith War, he was a vocal and influential member of the loosely collected Jedi Assembly of great Masters, and his counsel was often sought on matters of import.\nVodo-Siosk Baas was a skilled Jedi Master with a broad Force sense, a talent with which he displayed a wide variety of uses, from trivial character assessments to perceived impressions of despair in faraway places. From disarming telekinetic maneuvers to walls of light side energy that severed another being's connection to the Force, Baas often preferred non-aggressive Force techniques in combat. Baas was gifted with farsight, focused resolve augmentation, bursts of incredible speed, and Force-empowered battle meditation. He achieved the ability to appear in spirit form after his death. A bona fide scholar, Baas was intimately familiar with the lore and histories of the Galactic Republic, the Jedi Order, and the Sith, much of which he recorded into several holocrons. In addition to his myriad Force talents, the Krevaaki Master was fluent in Galactic Basic Standard, the Vultan native tongue, Tchuukthese, and Kreva, the language of his own species, which he could also write.\nAs a Jedi Guardian, Baas's primary talents lay in the field of battle. His combat reflexes were second to none; six tentacles designated for locomotion allowed him to effect highly acrobatic maneuvers and recoveries, while the two appendages that served as arms struck at targets with blindingly rapid efficiency. His unparalleled knowledge of armed combat saw him recognized as a consummate weapon handler and expert lightsaber craftsman, one who often indulged aspiring Jedi with instruction in both the weapon's construction and use. Despite his renown as the greatest of a species of formidable fighters and legendary status as a duelist, Baas was one of few known Jedi who preferred not to carry or wield a lightsaber. Instead, he utilized a long wooden quarterstaff ambidextrously, one that he imbued with the Force when the need for combat arose. Able to shatter stones and even withstand repeated strikes from an opposing lightsaber blade, Baas's quarterstaff served him well in combat, and allowed him to disarm underestimating opponents such as the inexperienced Exar Kun, in whom Baas was also able to induce unsure footing and clumsiness through superior speed and skill. However, his staff caved under the pressure of Kun's relentless Jar'Kai onslaught, and Baas's unfamiliarity with the Dark Lord's double-bladed lightsaber was reflected by his ineffective usage of his own weapon, an error that resulted in the Jedi Master's death.\nVodo-Siosk Baas first appeared as a holocron gatekeeper in Dark Apprentice, the second novel of author Kevin J. Anderson's Jedi Academy Trilogy, which was released in July 1994. A month later, Baas appeared as a supporting character in the first of two issues that comprised the entirety of the Freedon Nadd Uprising comic book story arc. Written by Tom Veitch and penciled by Tony Akins, the comic was the character's first and only appearance with hair. Champions of the Force, the third novel in Anderson's Jedi Academy Trilogy, was released in September of that year and featured the spirit of Baas in a minor protagonist role. Baas retained his role as a primary character throughout the Star Wars: Tales of the Jedi comic series. The Dark Lords of the Sith story arc, a collaboration between Veitch and Anderson, portrayed Baas as a significant component in the backstory of Exar Kun, a character who debuted in Anderson's Jedi Search novel. For 1995's release of Jedi Assault, the final issue of Dark Lords of the Sith, Baas was drawn by Art Wetherell, a deviation from the illustrations of Chris Gossett that made up the previous five issues. That same year, Baas was featured in Straight from the Horse's Mouth: A Guide to the Tales of the Jedi Universe, Part 1, an article for the twenty-sixth issue of Star Wars Insider. The second and third issues of Anderson's subsequent Star Wars: Tales of the Jedi — The Sith War story arc were Vodo-Siosk Baas's final appearances as a living character, wherein his likeness was rendered by veteran Star Wars artist Dario Carrasco, Jr.\nTen years after the initial comic release, Baas was included in the John Whitman's audio adaptation of Dark Lords of the Sith, although the actor who supplied his voice was not credited. Minor changes were made between versions, including Baas already being present on Deneba when he attempted to assist Exar Kun, in contradiction with Tales of the Jedi – Dark Lords of the Sith 3, which depicted the occurrence of the confrontation while he is still onboard his courier ship. Also different in the audio rendition is Baas's assumption of the entirety of the dialogue of the character Thon, who is not featured at all. Aside from the works in which he actually appeared, Baas was mentioned throughout the remainder of The Sith War comic series. He was referred to in issues six, nine, eighteen, and thirty-three of the Knights of the Old Republic comic series, and appeared via other means, though still not alive, in the thirty-second and forty-seventh issues. He also received minor mentions in the stories Knight Errant, The Ruins of Dantooine, Firestorm, I, Jedi, and Young Jedi Knights: Heirs of the Force, in which a song of him is sung.\nBaas's relationships with several other characters from his initial Freedon Nadd Uprising appearance were expanded upon in the Tales of the Jedi Companion Star Wars Roleplaying Game sourcebook by West End Games. Both the Power of the Jedi Sourcebook and the Ultimate Alien Anthology provided significant additions regarding the physical composition of Baas and members of his species, information that was later expanded upon by the Jedi Academy Training Manual. In addition to inclusions in an array of source and reference book material, Baas received fleeting acknowledgements in several issues of The Official Star Wars Fact File, as well as mentions in the StarWars.com Databank entries for both Dantooine and Exar Kun. He was given entries within the Star Wars Encyclopedia and its updated version, the latter of which erroneously claimed that he created the Tedryn Holocron. A mini-statue of Baas was also included in the Jedi Academy set of Star Wars Miniatures.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Krevas",
  "/wiki/3996_BBY",
  "/wiki/Coruscant/Legends",
  "/wiki/Krevaaki",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Chitin/Legends",
  "/wiki/Exoskeleton",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Crado",
  "/wiki/Shoaneb_Culu",
  "/wiki/Dace_Diath",
  "/wiki/Krynda_Draay",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Nomi_Sunrider",
  "/wiki/Sylvar",
  "/wiki/Qrrrl_Toq",
  "/wiki/Tedryn_Holocron",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Old_Sith_Wars",
  "/wiki/Jedi_historian",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_artisan/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Darksider",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi_Assembly",
  "/wiki/Time/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/Padawan/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Human/Legends",
  "/wiki/3997_BBY",
  "/wiki/Sith_magic",
  "/wiki/The_galaxy/Legends",
  "/wiki/Empress_Teta_system/Legends",
  "/wiki/Krath/Legends",
  "/wiki/Sith_cult/Legends",
  "/wiki/Conclave_at_Deneba",
  "/wiki/Deneba/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Jedi_Convocation",
  "/wiki/Battle_of_Deneba",
  "/wiki/Krath_war_droid/Legends",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Mission_to_Empress_Teta",
  "/wiki/Meditation/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Golden_Age_of_the_Sith",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Brotherhood_of_the_Sith",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Battle_of_Coruscant_(Great_Sith_War)",
  "/wiki/Capital/Legends",
  "/wiki/Mandalorian_Crusaders",
  "/wiki/Army/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Grand_Convocation_Chamber",
  "/wiki/Senate_Hall",
  "/wiki/Duel_in_the_Senate",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Exar_Kun%27s_lightsaber/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Death/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_ghost",
  "/wiki/11_ABY/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Wall_of_light",
  "/wiki/Transfer_essence",
  "/wiki/Species/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Jedi_artifact/Legends",
  "/wiki/Tedryn",
  "/wiki/4000_BBY/Legends",
  "/wiki/Knossa/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Nazzar",
  "/wiki/Prince/Legends",
  "/wiki/Force_sight",
  "/wiki/Miraluka/Legends",
  "/wiki/Sidrona_Diath",
  "/wiki/Alpheridies/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/Beast_Wars",
  "/wiki/Onderon/Legends",
  "/wiki/Inner_Rim",
  "/wiki/Freedon_Nadd",
  "/wiki/Arkanian/Legends",
  "/wiki/Arca_Jeth",
  "/wiki/Terrorist/Legends",
  "/wiki/Naddist",
  "/wiki/3998_BBY",
  "/wiki/Tchuukthai",
  "/wiki/Thon",
  "/wiki/Force_sense/Legends",
  "/wiki/Andur_Sunrider",
  "/wiki/Youngling/Legends",
  "/wiki/Vima_Sunrider",
  "/wiki/Lightsaber_crystal",
  "/wiki/Adegan_crystal/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Freedon_Nadd_Uprising",
  "/wiki/First_Battle_of_Onderon_(Naddist_Uprising)",
  "/wiki/Sith_sorcerer",
  "/wiki/King/Legends",
  "/wiki/Ommin/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Kith_Kark",
  "/wiki/Second_Battle_of_Onderon",
  "/wiki/Eye/Legends",
  "/wiki/File:ExarKunEmptyPlace-DLOTS.ogg",
  "/wiki/Holocron/Legends",
  "/wiki/Dantooine_system/Legends",
  "/wiki/Jedi_Watchman/Legends",
  "/wiki/Cathar/Legends",
  "/wiki/Master_Vodo%27s_quarterstaff",
  "/wiki/Force_weapon",
  "/wiki/Jar%27Kai/Legends",
  "/wiki/Staff/Legends",
  "/wiki/Sun_djem/Legends",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Political_uprising_of_the_Empress_Teta_system",
  "/wiki/Battle_of_Koros_Major",
  "/wiki/Mind_trick/Legends#Force_illusion",
  "/wiki/Dark_Lord_prophecy",
  "/wiki/Vodo-Siosk_Baas%27s_courier",
  "/wiki/Disturbance_in_the_Force/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Hatred",
  "/wiki/Cay_Qel-Droma",
  "/wiki/Service_droid/Legends",
  "/wiki/Program_trap",
  "/wiki/Emperor/Legends",
  "/wiki/Satal_Keto/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/Empress_Teta/Legends",
  "/wiki/Second_Battle_of_Empress_Teta",
  "/wiki/Sith_Empire_(Great_Sith_War)",
  "/wiki/Mandalore_the_Indomitable",
  "/wiki/Shipyard/Legends",
  "/wiki/Ministry_of_Defense",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Minister_of_Defense_(Republic)",
  "/wiki/Netus",
  "/wiki/Republic_Navy",
  "/wiki/Fleet/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Orley_Vanicus",
  "/wiki/Kemplex_IX",
  "/wiki/Space_station/Legends",
  "/wiki/Cron_system",
  "/wiki/Navy/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Atmosphere/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Command_center",
  "/wiki/Soldier/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Trial_of_Ulic_Qel-Droma",
  "/wiki/Aleema_Keto",
  "/wiki/Mandalore_(title)",
  "/wiki/Massassi/Legends",
  "/wiki/Q%C3%A2zoi_Kyantuska",
  "/wiki/Jedi_pogrom",
  "/wiki/Oneness",
  "/wiki/Battle_of_Yavin_4_(Great_Sith_War)",
  "/wiki/Yavin_4/Legends",
  "/wiki/Temple_of_Exar_Kun",
  "/wiki/Draay_Estate",
  "/wiki/Jedi_Covenant",
  "/wiki/WatchCircle_Vodo",
  "/wiki/Haazen",
  "/wiki/Mandalorian_Wars",
  "/wiki/Jedi_Civil_War",
  "/wiki/Gatekeeper",
  "/wiki/Bodo_Baas",
  "/wiki/The_Ballad_of_Master_Vodo-Siosk_Baas",
  "/wiki/Historian/Legends",
  "/wiki/Tionne_Solusar",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Force_empathy/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Sever_Force/Legends",
  "/wiki/Farsight/Legends",
  "/wiki/Battlemind",
  "/wiki/Force_speed",
  "/wiki/Battle_meditation",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Vultan",
  "/wiki/Dromnyr",
  "/wiki/Tchuukthese",
  "/wiki/Kreva",
  "/wiki/Language/Legends",
  "/wiki/Jedi_Guardian/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Jedi_Weapon_Master",
  "/wiki/Ambidexterity",
  "/wiki/Dark_Apprentice_(novel)",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Star_Wars:_The_Jedi_Academy_Trilogy",
  "/wiki/July",
  "/wiki/1994",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Freedon_Nadd_Uprising_1",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Freedon_Nadd_Uprising",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Tom_Veitch",
  "/wiki/Tony_Akins",
  "/wiki/Champions_of_the_Force",
  "/wiki/September",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(comic_series)",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_-_Dark_Lords_of_the_Sith",
  "/wiki/Jedi_Search",
  "/wiki/1995",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_6",
  "/wiki/Art_Wetherell",
  "/wiki/Chris_Gossett",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_26",
  "/wiki/Star_Wars_Insider",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_2",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_3",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Sith_War",
  "/wiki/Star_Wars",
  "/wiki/Dario_Carrasco,_Jr.",
  "/wiki/2005",
  "/wiki/John_Whitman",
  "/wiki/Tales_of_the_Jedi:_Dark_Lords_of_the_Sith_(audio)",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_3",
  "/wiki/Courier/Legends",
  "/wiki/Knights_of_the_Old_Republic_6",
  "/wiki/Knights_of_the_Old_Republic_9",
  "/wiki/Knights_of_the_Old_Republic_18",
  "/wiki/Knights_of_the_Old_Republic_33",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_(comic_series)",
  "/wiki/Knights_of_the_Old_Republic_32",
  "/wiki/Knights_of_the_Old_Republic_47",
  "/wiki/Knight_Errant_(novel)",
  "/wiki/Star_Wars_Galaxies:_The_Ruins_of_Dantooine",
  "/wiki/Firestorm_(short_story)",
  "/wiki/I,_Jedi",
  "/wiki/Young_Jedi_Knights:_Heirs_of_the_Force",
  "/wiki/Tales_of_the_Jedi_Companion",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/Ultimate_Alien_Anthology",
  "/wiki/Jedi_Academy_Training_Manual",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/StarWars.com",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Miniatures:_Jedi_Academy",
  "/wiki/Star_Wars_Miniatures",
  "/wiki/Category:Audio_files_of_Vodo-Siosk_Baas",
  "/wiki/Category:Images_of_Vodo-Siosk_Baas",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_1",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_2",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Dark_Lords_of_the_Sith_5",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_1",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_4",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_5",
  "/wiki/Timeline_10:_The_Exar_Kun_War",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars:_Rebellion_(video_game)",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars_Insider_28",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Secrets_of_Star_Wars:_Shadows_of_the_Empire",
  "/wiki/Star_Wars_Galaxy_Magazine",
  "/wiki/The_Dark_Side",
  "/wiki/Star_Wars_Galaxy_Magazine_8",
  "/wiki/The_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/The_Unseen_Planets_of_Star_Wars",
  "/wiki/Star_Wars_Insider_36",
  "/wiki/The_Essential_Guide_to_Planets_and_Moons",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/The_Essential_Chronology_(real-world_book)",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/Star_Wars_Roleplaying_Game_Core_Rulebook",
  "/wiki/The_Dark_Side_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File_1",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/The_Official_Star_Wars_Fact_File_14",
  "/wiki/The_Official_Star_Wars_Fact_File_20",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/Sony",
  "/wiki/The_New_Essential_Guide_to_Weapons_and_Technology",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars_Galaxies:_The_Complete_Guide:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Special_Edition",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_Handbook",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Jedi_Academy_(Star_Wars_Miniatures)",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_Unknown_Regions",
  "/wiki/Star_Wars:_The_Ultimate_Visual_Guide:_Updated_and_Expanded",
  "/wiki/Tales_of_the_Jedi_(audio)",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Freedon_Nadd_Uprising_2",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_6",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Redemption_3",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_Redemption_1",
  "/wiki/Wookieepedia:Interview/Kevin_J._Anderson"
 ]
}