{
 "name": "Voe",
 "display_name": "Voe",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "28 ABY",
      "Minemoon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Luke Skywalker"
     ]
    }
   ]
  }
 ],
 "content": "Voe was a Force-sensitive human female Jedi Padawan who was part of the Jedi Order under Jedi Master Luke Skywalker. While under the tutelage of Luke Skywalker, Voe trained hard, but felt her abilities were inferior to those of the more naturally gifted Ben Solo.\nVoe was away on a mission with fellow students Hennix and Tai during the destruction of the Jedi Temple. When they returned to find the temple destroyed by Ben Solo, they confronted the perpetrator and began a pursuit. Voe was impatient to bring Solo to justice and led a confrontation against him on the planet Elphrona. Solo nearly killed her when she called him a murderer, and in the confusion, Solo inadvertently killed Hennix.\nTracking down Solo to the moon of Minemoon, Voe and Tai faced Solo and the Knights of Ren. While Voe managed to hold back the Knights for a while, their leader called Ren killed Tai, and Solo turned to the dark side as he killed Ren. He then disarmed Voe and used Ren's lightsaber to kill her.\nAround 16 ABY, the Force-sensitive Voe began training as a student at Jedi Master Luke Skywalker's Jedi temple alongside Ben Solo, Tai, and the Quarren Hennix. She learned several Jedi techniques including telekinesis, lightsaber dueling, and meditation. Despite Master Skywalker's assurances that everybody had varying levels of connection to the Force, Voe was jealous of Solo's mastery of the Force and sought to best him. After Master Skywalker went on a mission to the planet Elphrona with Ben Solo, Voe learned about her master's encounter with the Knights of Ren.\nIn 28 ABY, while Voe was returning from a mission with her fellow Jedi Tai and Hennix, the three discovered that Skywalker's Jedi Temple was burning. After landing their starship Verity, Voe found that she was unable to sense anyone on the ground. However, Tai was able to sense the presence of Ben Solo.\nBen told them that Master Skywalker had tried to kill him in his sleep and believed that the Jedi was now dead. Due to the animosity between the two, Voe did not believe Solo, who responded that he was stronger than all the three Jedi combined. Despite Tai's attempts at diplomacy, Voe and Hennix drew their lightsabers. Voe charged at Solo but he froze her in mid-air and hurled her into Hennix.\nThe three Jedi drew their blades but Solo used the Force to hurl debris at them. Hennix was stabbed in the chest with a piece of wood. While Voe and Tai attended to him, Solo escaped on his starship Grimtaash. Voe attempted to remove the debris but Tai advised that it would be better to do it aboard their ship. The three Jedi returned to their ship.\nWhile Tai attended to the wounded Hennix, Voe piloted the Verity and pursued the Grimtaash. However, Solo was able to escape by damaging one of the Verity's engines before fleeing into hyperspace. Later, the three Jedi debated their next move. Hennix proposed tracking Ben using a transponder inside his droid Geegee. Tai suggested alerting Solo's mother, Senator Leia Organa, but Voe convinced them to investigate the truth behind Solo's apparent betrayal and the destruction of the Jedi temple before involving a third party.\nVoe, Tai, and Hennix managed to track Ben Solo down to the Jedi outpost on Elphrona. Solo was about to set out to meet with the Knights of Ren, a shadowy dark side cult, on the planet Varnak. Unwilling to let anyone get in his way, Solo engaged Voe, Tai and Hennix in a lightsaber duel within the outpost. Tai attempted to penetrate his mind but Solo cast him aside and fled outside the outpost.\nSolo fled on top of a high rock. Giving chase, Voe used her Force powers to Force jump after Solo. Unable to keep up with Voe, Hennix urged her to stop and think but she was determined to pursue Solo. When Voe denounced Solo as a murderer, an enraged Solo Force pushed her, causing her to lose her lightsaber. However, he was soon overwhelmed with guilt and tried to levitate her to safety, only to lose his grip.\nBelieving that Solo had sent Voe to her death, Hennix attacked Solo but was accidentally killed by the fallen Jedi. Meanwhile, Tai managed to catch Voe's fall using the Force. Before they could go and help Hennix, Solo caught up with them and hurled them into the Jedi outpost. To prevent them from following him, Solo collapsed two statues on top of them before leaving for Varnak.\nUsing their Force powers, Voe and Tai managed to dig themselves out of the rubble. Tai disclosed that he had learned that Solo was seeking a cult known as the Knights of Ren. Voe, not interested, picked up Hennix's lightsaber and only sought to avenge his death. Tai, who had tried to help Solo, came to the conclusion that Solo was lost and needed to be stopped.\nSolo later recounted his encounter with Voe to the dark sider Ren and the other Knights of Ren. Ren regarded Voe as brawn. While he accepted that Solo had killed Hennix, he regarded it as not a \"good death\" since Solo had not intended to kill the Jedi. Nevertheless, he invited Solo to join their group, hoping that Solo could prove himself.\nUsing Tai's Force connection to Solo, the two Jedi managed to tracked their former comrade down to Minemoon, where the Knights of Ren were attempting to seize a Force relic known as the Mindsplinter from the local Mimbanese. While Tai attempted to reason with Solo, he dispatched Voe to aid the Mimbanese.\nVoe fought with the Knights' leader Ren, stopping him from killing a second Mimbanese with his red lightsaber. When Ren boasted that he had fought Master Skywalker, Voe countered that she was familiar with that story and that Skywalker had defeated the Knights of Ren. She kicked Ren in the head.\nRen used the Force to shove Voe, who ordered one of his fellow acolytes Kuruk to shoot her with his blaster. However, Voe managed to dodge his blaster bolts. She then led the Mimbanese against the Knights of Ren, denouncing them as destroyers and killers. Voe then knocked Kuruk to the ground during the ensuing charge, stating that she had been trained by Luke Skywalker. The skirmish entered a new level after Ren murdered Tai. Overcome by rage and grief, Solo killed Ren in combat, completing his fall to the dark side.\nDuring his fall to the dark side, Ben also unleashed Force lightning which scattered the combatants. After using the Force to retrieve Voe's lightsaber, Solo faced his former comrade. A fearful and awed Voe remarked that Solo had killed Ren. Solo responded that he was a murderer and that told Voe that she would never be a Jedi because there was no one left to train her. As the mine began to flood, Solo killed Voe by impaling her with Ren's lightsaber, questioning why she would even want to stay alive.\nFollowing the deaths of Voe, Tai and Ren, Solo embraced the dark side and claimed the mantle of Master of the Knights of Rens. As a symbolic commitment to the dark side, he also bled his kyber crystal.\nVoe was a female human with dark skin and white hair. She was an ambitious and aggressive Jedi who was jealous of Ben Solo's ease with mastering the Force. Voe became angry and ashamed about her inability to best Solo, things that Jedi were not meant to get angry about. Voe was a fiery and impulsive Jedi who tended to instigate fights.\nVoe's tense relationship with Solo led her to assume that he had a role in the destruction of the Jedi Temple. Her aggressive approach sparked a confrontation with Solo, causing him to flee to Snoke. Voe also convinced Tai and Hennix that the trio should not involve other parties in their investigation into Solo's purported role in the destruction of the Jedi Temple and Master Luke Skywalker's presumed death.\nVoe's hostility towards Solo aggravated tensions between Solo and his former Jedi comrades during a confrontation on Elphrona. Despite Hennix's warnings, Voe attempted to pursue Solo by Force jumping. She was also ready to believe that he had destroyed the Jedi Temple and killing Skywalker and the other Jedi despite the lack of clear evidence. Though Solo Force pushed her in a fit of rage, his subsequent regret led him to try to pull her to safety. Though Voe was ultimately saved by Tai, Hennix was killed during an attempt to avenge the harm done to Voe. Hennix's death at the hands of Solo only hardened her feelings against Solo.\nVoe was shaken and awed by Solo's mastery of Force lightning during his fall to the dark side. Solo ultimately reciprocated their mutual animosity by killing her following the deaths of Tai and Ren, which cemented his fall into the dark side.\nVoe was Force-sensitive and wielded a green lightsaber. She was also able to levitate objects, duel with lightsabers, meditate, and could also Force jump to great heights. Voe lacked Solo's mastery of the Force and felt jealous and insecure, attempting to best him in the various Jedi powers and skills While she never reached the same level as Ben, Voe's hard work made her a combatant capable of facing Ren on the Minemoon.\nVoe also knew how to fly the starship Verity. Besides her lightsaber skills, Voe was also able to dodge Kuruk's blaster bolts with the help of the Force. She also showed leadership when she led the Mimbanese in combat against the Knights of Ren.\nVoe wore tan Jedi robes. She possessed a green-bladed lightsaber. After Hennix death at the hands of Solo, Voe took his blue-bladed saber.\nVoe first appeared in the Marvel Comics comic mini-series Star Wars: The Rise of Kylo Ren, which premiered with the release of The Rise of Kylo Ren 1 on December 18, 2019. She was created by comic writer Charles Soule and illustrated by Will Sliney.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Jedi",
  "/wiki/Senator",
  "/wiki/Voe_Atell",
  "/wiki/28_ABY",
  "/wiki/Minemoon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Luke_Skywalker",
  "/wiki/Force-sensitive",
  "/wiki/Padawan",
  "/wiki/Jedi_Master",
  "/wiki/Ben_Solo",
  "/wiki/Hennix",
  "/wiki/Tai",
  "/wiki/Destruction_of_the_Jedi_Temple",
  "/wiki/Duel_on_Elphrona",
  "/wiki/Elphrona",
  "/wiki/Moon",
  "/wiki/Knights_of_Ren",
  "/wiki/Ren_(human)",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Ren_(lightsaber)",
  "/wiki/16_ABY",
  "/wiki/Jedi_Temple_of_Luke_Skywalker",
  "/wiki/Quarren",
  "/wiki/Telekinesis",
  "/wiki/Lightsaber_duel",
  "/wiki/Mission_to_Elphrona",
  "/wiki/Planet",
  "/wiki/Starship",
  "/wiki/Verity",
  "/wiki/Lightsaber",
  "/wiki/Grimtaash_(starship)",
  "/wiki/Hyperspace",
  "/wiki/Transponder",
  "/wiki/Geegee",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Elphrona_Outpost",
  "/wiki/Varnak",
  "/wiki/Force_jump",
  "/wiki/Force_push",
  "/wiki/Voe%27s_lightsaber",
  "/wiki/Hennix%27s_lightsaber",
  "/wiki/Skirmish_on_the_Minemoon",
  "/wiki/Mindsplinter",
  "/wiki/Mimbanese",
  "/wiki/Kuruk",
  "/wiki/Blaster",
  "/wiki/Force_lightning",
  "/wiki/Master_of_the_Knights_of_Ren",
  "/wiki/Bleeding",
  "/wiki/Kyber_crystal",
  "/wiki/Jedi_robes",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars:_The_Rise_of_Kylo_Ren",
  "/wiki/The_Rise_of_Kylo_Ren_1",
  "/wiki/December_18",
  "/wiki/2019",
  "/wiki/Charles_Soule",
  "/wiki/Will_Sliney",
  "/wiki/The_Rise_of_Kylo_Ren_2",
  "/wiki/The_Rise_of_Kylo_Ren_3",
  "/wiki/The_Rise_of_Kylo_Ren_4",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Luke_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Star_Wars_comic_books"
 ]
}