{
 "name": "Voegliss",
 "display_name": "Voegliss",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Voegliss's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Voegliss, a member of an unknown species of predatory sentients, was an Imperial assassin and commando. His mouth was filled with sharp teeth, which he used in combat, along with his clawed hands. His skin formed a hard, red carapace, and his eyes were hooded.\nVoegliss's species was first encountered by an expedition led by Doctor Devlor Samt, an Imperial scientist. When the expedition fought and killed two members of his species, presumably Voegliss's parents, the infant Voegliss was found nearby. Though Voegliss and his family were found on this unnamed world, they were not native to that world, and were not traced to any other world on record. Samt raised the young alien as his son.\nAt the age of 15, the Imperial Army took Voegliss into custody on orders from the sector Moff. Though Voegliss killed fourteen troopers in the process of his \"induction\", he soon became a willing Imperial operative. As part of an Imperial commando team, he became a dedicated and skilled warrior. His two main ambitions were to be accepted as an independent assassin directly serving the Empire, and to be reunited with his adopted father. Though he was an intelligent and proficient operative, he continued in many ways to be emotionally immature.\nDuring missions, Voegliss was typically outfitted with a knife, a blaster pistol, and a dark cloak. In addition to hand-to-hand combat, weapons, and assassination skills, he was a trained interrogator and starship gunner.\nWhile Voegliss himself is not pictured in Heroes \u0026 Rogues, the alien pictured in the illustration for the \"Imperial Assassin-In-Training\" template may match Voegliss. The background, equipment, and special abilities of that character template are very similar to those of Voegliss.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Voegliss%27s_species",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Species/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Mouth/Legends",
  "/wiki/Tooth/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Doctor/Legends",
  "/wiki/Devlor_Samt",
  "/wiki/Scientist/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Dark_cloak",
  "/wiki/Starship/Legends",
  "/wiki/Heroes_%26_Rogues"
 ]
}