{
 "name": "Vollot",
 "display_name": "Vollot",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Cloud City"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Stormtrooper Corps",
      "Stormtrooper Corps"
     ]
    }
   ]
  }
 ],
 "content": "Sergeant Vollot was a Human stormtrooper of the Galactic Empire, where he served as a bomb squad stormtrooper. In 3 ABY, Vollot's squad was responsible for disarming bombs that had been allegedly set up by the Ugnaughts of Cloud City on the planet Bespin. However, the squad was blown up in the process.\nVollot was a Human stormtrooper of the Galactic Empire, serving as a sergeant. In 3 ABY, Vollot's squad of bomb squad stormtroopers were dispatched to Cloud City on the planet Bespin, where they were greeted by Captain Hugo Treece, who asked if the squad was ready. Vollot affirmed that they were, explaining that they would immediately begin energy scans and would easily disarm the explosives once they were found. Treece was pleased to hear this, and he was eager to be able to focus their attention to the Ugnaughts that he claimed had planted the bombs. Vollot expressed confusion, as the Ugnaughts had been nothing but law-abiding workers, but Treece brushed off the soldier's concern, noting that it did not involve Vollot.\nWith the help of the sergeant, the squad found its first bomb, much to Treece's approval. As the captain was about to give the order to disarm it, the bomb began speaking, giving instructions on how to disarm it. Although Treece and the troopers were taken aback by the talking bomb, they proceeded with the disarming, taking the bomb's word. In reality, however, the speaker was Cloud City administrator Lando Calrissian, who was trying to eliminate the Imperial presence in the city. Once the squad was almost done, one of the stormtroopers pointed out that it sounded more like the bomb had been activated than deactivated. Indeed, the bomb exploded, killing the squad, with Calrissian jeering at them through the speaker.\nWhen Treece implicated the Ugnaughts for having planted bombs, Vollot was curious to know their reasoning behind such a crime.\nVollot's good work was praised by Captain Treece.\nThe sergeant was well-armed and wore white stormtrooper armor.\nVollot appeared in the fifty-sixth issue of Marvel Comics' Star Wars comic series, which was writen by David Michelinie, illustrated by Walter Simonson and Tom Palmer and published by Marvel Comics on October 20, 1981.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Cloud_City/Legends",
  "/wiki/Human/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Stormtrooper_Corps/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Bomb_squad_stormtrooper",
  "/wiki/Squad/Legends",
  "/wiki/Bomb/Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Death/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Hugo_Treece",
  "/wiki/Gender/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Administrator/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/City/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Color/Legends",
  "/wiki/Stormtrooper_armor/Legends",
  "/wiki/Star_Wars_(1977)_56",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Wars_(Marvel_Comics_1977)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/David_Michelinie",
  "/wiki/Walter_Simonson",
  "/wiki/Tom_Palmer",
  "/wiki/October_20",
  "/wiki/1981",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_Updated_and_Expanded_Edition"
 ]
}