{
 "name": "Volpau",
 "display_name": "Volpau",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 1 ABY",
      "Ubuuga"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Imperial family"
     ]
    }
   ]
  }
 ],
 "content": "Volpau was a Human male about whom little is known other than that he apparently was Emperor Palpatine's third cousin.\nVolpau, who was apparently a very wealthy individual, died on the planet Ubuuga of unknown causes, or so it was assumed. In reality, he became a victim of the Ubuugan fleshborers, parasitic worms that used the bodies of their victims as hosts.\nVolpau's mummified corpse was put into a Rodomium death casket together with a valuable amulet which had his ancestry engraved on it. The ZZ-class freighter Mingula was to deliver Volpau's remains to Coruscant for ritual incineration; however, the fleshborers, still inside of Volpau's body, burst out of the casket and attacked the Zylurian crew, killing all four members; the Mingula was immobilized in outer space, its journey cut short.\nSometime later, the infamous bounty hunter Boba Fett discovered the lost ship and, looking for precious cargo to salvage, boarded it. He and his prisoner Tsumo found Volpau's casket in the cargo hold and noticed the drill holes of the fleshborers on its surface. It didn't take long until the two were attacked by the parasites, which killed Tsumo on the ship's bridge and attacked Fett.\nEscaping the ship hiding in a garbage container which was ejected into space, Fett caused an explosive chain reaction which destroyed the Mingula. Volpau's valuable amulet was the only object Fett was able to take with him before he had to flee from the fleshborers, leaving behind the casket, which survived the explosion.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Ubuuga",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_family",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Ubuugan_fleshborer",
  "/wiki/Rodomium",
  "/wiki/ZZ-class_freighter",
  "/wiki/Freighter/Legends",
  "/wiki/Mingula",
  "/wiki/Coruscant/Legends",
  "/wiki/Zylurian",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Tsumo",
  "/wiki/Boba_Fett_%C2%BD",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_27",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}