{
 "name": "Von_Longo",
 "display_name": "Von Longo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cimarosa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "1 BBY aboard Purge"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue-gold"
     ]
    }
   ]
  }
 ],
 "content": "Von Longo was known in the Imperial criminal system as Inmate ICN 28740, was the father of Kale and Trig Longo, prisoners being transported to a detention moon by the Imperial prison barge Purge. He died in a medbay after being tortured by Captain Jareth Sartoris, in 1 BBY and Kale wasn't there, the only thing Kale regretted about his life. The barge broke down during the trip and the brothers were told by a guard named Wembly that Purge had discovered a derelict Star Destroyer and a crew was sent to scavenge parts.\nWhen some form of virus the crew brought back spread through the Purge, it killed all but six people. The brothers were unaffected, hearing screams and smelling the dead bodies in the cells around them. No guards were left either and the brothers were not receiving food. During this time, Kale wrote an unfinished and unsigned letter to Von and hid it under his mattress, though Trig found it without his brother's knowledge and added to it. Trig talked about their current position and, due to the limited space below Kale's message, left off at the sound of footsteps approaching the cell. The letter was recovered aboard Purge after its occupants were decimated by the plague and it was released to the public for academic purposes in relation to the history of Purge.\nWhile five out of six surviving members of the Purge were attempting to find some sort of control for the Vector aboard the main bridge, Trig stumbled across what he thought was his dead father, but as he reached to turn it over to check, it lifted its head, and would have bitten Trig if his brother Kale hadn't pushed his brother out of the way. However, Kale was bitten instead, resulting in his death. Trig felt it was his fault his brother died, and that he should have been the one to have been bitten instead.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Cimarosa",
  "/wiki/1_BBY/Legends",
  "/wiki/Purge_(prison_barge)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Kale_Longo",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Trig_Longo",
  "/wiki/Detention_area",
  "/wiki/Moon/Legends",
  "/wiki/Imperial_prison_barge",
  "/wiki/Wembly",
  "/wiki/Vector_(Star_Destroyer)",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Von_Longo",
  "/wiki/Death_Troopers:_Recovered_Messages_from_Purge",
  "/wiki/Death_Troopers",
  "/wiki/Death_Troopers_(audiobook)"
 ]
}