{
 "name": "Voontara_Fa%27athra",
 "display_name": "Voontara Fa'athra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3640 BBY",
      "Voss"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange-Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown-Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Kajidic",
     "values": [
      "Fa'athra"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt CartelFa'athra gang",
      "Fa'athra gang"
     ]
    }
   ]
  }
 ],
 "content": "Voontara Fa'athra was a powerful Hutt who lived during the Galactic War era between the Galactic Republic and the resurgent Sith Empire. He was an opponent of Suudaa Nem'ro, a member of the rival Nem'ro clan, seeking to take over Nem'ro's turf. Eventually, Fa'athra encountered the Imperial Agent Cipher Nine on Voss. Infuriated with the agent for driving him off Nal Hutta, he ordered his troops to attack Nine, but was killed instead. He was most often known simply by his cuirvas, Fa'athra.\nBorn sometime after 3843 BBY, Fa'athra became an upstart member of the Hutt clans, specifically clan Fa'athra. Instead of focusing on the slow accumulation of wealth and power, Fa'athra became a nimble strategist who enjoyed crushing his enemies with unstoppable force. Following the Treaty of Coruscant and the start of the Cold War, Fa'athra assassinated several Hutts in disfavor with the Cartel. Eventually, he became an opponent to Suudaa Nem'ro, hoping to take over his seat on Nal Hutta from his base of operations in a palace in the Eastern Grime. Since Fa'athra was less devoted to Hutt Cartel law, he considered himself a disciple of ancient Hutt traditions.\nDuring the Cold War, Fa'athra was engaged in a gang war with Nem'ro. However, he unknowingly was caught up in subterfuge committed by the Sith Empire, looking to acquire Nem'ro's allegiance. An Imperial agent, later known as Cipher Nine, aided Nem'ro's cause by slaying Karrels Javis, Nem'ro's lieutenant, and pinning the murder on Fa'athra, making it seem like he was aiding the Republic. The ruse worked, and Fa'athra was later forced off Hutta.\nAround 3640 BBY, Fa'athra was alerted by Hunter of Nine's identity. Hiring a few mercenaries, Fa'athra journeyed to Voss to revenge himself upon the agent. His men kidnapped Bas-Ton, Nine's contact and an undercover Imperial agent. When the Cipher Agent came to him, Fa'athra and his troops engaged the Cipher Nine and were all defeated.\nVoontara Fa'athra is a character in the 2011 game Star Wars: The Old Republic. The Hutt makes a personal appearance in the Imperial Agent's Chapter 3 story on Voss.\nDepending on the player's choices, Fa'athra's fate may be decided three ways:",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3640_BBY",
  "/wiki/Voss",
  "/wiki/Hutt/Legends",
  "/wiki/Color/Legends",
  "/wiki/Fa%27athra_clan",
  "/wiki/Hutt_Cartel",
  "/wiki/Fa%27athra_gang",
  "/wiki/Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Nem%27ro_clan",
  "/wiki/Kajidic/Legends",
  "/wiki/Imperial_Agent",
  "/wiki/Cipher_Nine",
  "/wiki/Cuirvas",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Fa%27athra%27s_Palace",
  "/wiki/Eastern_Grime",
  "/wiki/Karrels_Javis",
  "/wiki/Hunter_(Star_Cabal)",
  "/wiki/Bas-Ton_(imposter)",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/The_Old_Republic:_Fatal_Alliance",
  "/wiki/The_Old_Republic:_Fatal_Alliance_(audiobook)",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}