{
 "name": "Voort_saBinring",
 "display_name": "Voort saBinring",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gamorr/Saffalore"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gamorrean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "Under 150 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "New RepublicWraith SquadronTwin Suns Squadron",
      "Wraith Squadron",
      "Twin Suns Squadron",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Voort saBinring, or \"Piggy\", was a Gamorrean male and member of Wraith Squadron from its inception in 7 ABY through most of the Yuuzhan Vong War. saBinring had been genetically-modified by Tuzin Gast, a scientist working for Warlord Zsinj to have much higher mathematical analysis; he later translated this into tactical acumen in New Republic military service. saBinring left the Wraiths after the death of his close friend Hohass Ekwesh during the Yuuzhan Vong War, but was re-recruited into an unofficial Wraith Squadron after the Second Galactic Civil War. Following the unit's official reinstatement in 44 ABY, saBinring became the leader of the Wraiths.\nPrior to joining the New Republic Navy, saBinring was biogenetically altered by Binring Biomedical Product, given a genius mathematical acumen and the ability to speak Basic via a throat-mounted translator. His prowess with mathematics was so great that during his first days as a Wraith, he demonstrated an ability as a sort of tactical computer, his mathematical abilities and pattern recognition allowing him to guide other pilots to heighten their efficiency, even as he flew well himself.\nEventually escaping the facility with help from his creator, Tuzin Gast, saBinring made his way to Obroa-skai. It was here that he researched the war and chose to join the Rebellion, it was also where he chose his name. His creator later committed suicide. His starfighter career was abruptly cut short by a xenophobic superior officer who framed him for assault and insubordination. The officer threw a punch at him, which Piggy blocked, but the officer reported that saBinring attacked him. Undeterred, saBinring applied for transfer to Wraith Squadron and immediately impressed squadron leaders Wedge Antilles and Wes Janson with his genius for astronavigation and intelligence analysis. He also had a simple explanation for why he could not have attacked the officer: if Piggy had punched him, the officer would not have been able to speak coherently at the time he reported the \"assault\". saBinring was accepted into Gray Squadron after an extensive training regimen, earning a reputation as a navigational expert in the process. Piggy was given the callsign Wraith Twelve, with Lieutenant Janson operating as his wingman.\nWhen the squadron's training ground was discovered by enemy forces, Piggy fought in the resulting Battle of Folor, using his keen analytic skills to view the opposing starfighters' movements and provide critical combat advice to his squadron- and also managed to shoot down at least one TIE Interceptor in the process.\nThe evacuation of Folor base following the attack by Admiral Apwar Trigit and the Implacable saw Wraith Squadron fall foul of Zsinj's latest toy, the Empion mine. While the squadron drifted helplessly in space, Piggy suffered the indignity of having his vocal implant disabled and he was only able to communicate through a series of grunts. Fortunately Grinder was able to effect repairs and Piggy volunteered for a crazy scheme to turn the tables on their ambushers.\nBy jury-rigging a vehicle made of X-wing parts and spare pieces of equipment aboard the Narra, they created a small transport called the Lunatic. Piggy volunteered to pilot this unusual craft due to his unique physiology . saBinring was able to maneuver the Lunatic into the hold of the Night Caller and used his makeshift laser cannon taken off an X-wing to kill Captain Zurel Darillian and capture the ship. Piggy sarcastically asked if he could keep the newly-captured ship, and was mildly shocked when Commander Antillies outlined a potential career path in New Republic Defense Force Fleet Command that would allow him to remain in charge of the Night Caller. Ultimately, Piggy declined- believing he would enjoy serving in an X-Wing more than on a ships' bridge.\nAfter the Battle of Ession Piggy returned to Coruscant with the squadron, using his analytical skills once again in an attempt to predict Warlord Zsinj's next move. He suggested that Zsinj was attempting to build a secondary army of pirates to increase his military prowess. This theory led to the creation of the Hawk-bat Independent Space Force, a top-secret Wraith Squadron mission where the squadron would act as pirates in an attempt to get closer to Zsinj's operations. Their efforts were ultimately successful; Zsinj recruited the Hawk-bats to assist in the capture of Razor's Kiss- a newly completed Super Star Destroyer.\nDuring the pirate raid, saBinring was able to simulate a fighter crash- he had actually made a rough landing atop the Warlord's flagship, Iron Fist . Piggy was able to inflict severe damage on the Destroyers' shields, forcing them to retreat while the Razor's Kiss was destroyed. Piggy barely escaped in his badly damaged starfighter; fellow Wraith Shalla Nelprin was able to track his erratic flight pattern and the Gammorean returned to his squadron.\nOnce again on Coruscant, Piggy found himself at the center of Warlord Zsinj's latest scheme—the warlord had brainwashed certain members of nonhumanoid species to wreak havoc in the New Republic and assassinate important leaders, thus stirring up distrust. In one such incident saBinring helped save Admiral Gial Ackbar's life. The attack came in the form of Lieutenant Jart Eyan, a Twi'lek, who was brainwashed while on leave. Upon receiving his code phrase trigger the lieutenant headed towards the admiral's office, and killed the admiral's secretary before entering. Admiral Ackbar and saBinring were inside the admiral's office discussing the odd behavioral patterns of the 181st Imperial Fighter Wing during their last battle. The unsuspecting admiral introduced the lieutenant who saluted Piggy and then shot him in the gut. Although severely injured, saBinring was overcome with base Gamorrean instincts, and rose to fight Eyan. He broke the blaster with a vibroblade and used a desk to smash the Twi'lek into the wall, smashing his head flat and leaving a large dent in the wall. The force of the blow was so strong that it knocked an ensign leaning against the wall unconscious. The Wraith had just enough strength left to avoid dropping the desk on Admiral Ackbar before passing out. saBinring had to be submerged in bacta for an extended period of time, but survived and was placed in the medical facilities aboard the Mon Calamari Star Cruiser Mon Remonda to stay with his squadron, which had been assigned to the ship as part of an anti-Zsinj task force under General Han Solo.\nPiggy recovered from his injuries in time to participate in the raid on Binring Biomedial Products; his \"birthplace.\" Despite a complicated trap meant to kill the Wraiths, Piggy escaped serious injury and aided in the capture of Doctor Edda Gast, who would provide vital information about the warlord's brainwashing schemes.\nDuring the Battle of Selaggis, Piggy recognized that several members of the ersatz 181st Imperial Fighter Wing were in fact droid ships armed with heavy explosives. Thanks to coordinating with members of Rogue Squadron, saBinring was able to shut down the droids before they could cause any serious damage to the New Republic starfighters. saBinring continued service with the squadron when it was transferred to New Republic Intelligence.\nIn 13 ABY in a mission involving Imperial Admiral Kosh Teradoc, in a bar on the world of Ryvester Piggy acted as a dancer. After receiving the signal from Face, who was disguised as a pirate, Captain Hachat, looking for a partner to retrieve priceless work of art, Piggy shouted in Gamorrean that a raid was happening. This, coupled with audio recordings of other shouts of a raid, caused the patrons in the bar to panic. A fire fight ensued. Piggy relayed info of enemy positions from his throat implant to other Wraith members. When one of Teradoc's bodyguards aimed a blaster at the fleeing Loran and Dr. Mulus Cheems, he jumped off the stage and tackled him, breaking the guards bones and knocking him unconscious. Piggy then made his way out the door. When he made it outside, Runt played a trick on him making him think that he was caught. He got into a nearby airspeeder where he was expecting a change of clothes. But due to another one of Runts jokes he was forced to ride to the evac point practically naked. The Wraiths made it to the docks and boarded a luxurious yacht, belonging to Admiral Kosh Teradoc, where he found a robe and began to mix drinks. A short time later the fake statue Teradoc took back to his base exploded, killing Teradoc.\nsaBinring was still a member of the Wraiths during the Yuuzhan Vong War. After the Fall of Coruscant in 27 ABY, saBinring and several other surviving Wraiths made their way to Borleias to join their old leader, Wedge Antilles, who was serving as a general in charge of a fleet group. Antilles had seized Borleias back from the Yuuzhan Vong after the invaders had used it as a staging point for their assault on Coruscant, and had determined to fight a holding action while the New Republic regrouped.\nsaBinring, along with Sharr Latt, an expert in psychological warfare, was assigned to work with Jaina Solo, a Jedi starfighter pilot in command of Twin Suns Squadron. Due to a Yuuzhan Vong religious obsession with twins, Solo—a twin herself—had begun a campaign of psychological warfare that promoted her as an avatar of the Yuuzhan Vong goddess Yun-Harla. saBinring and Latt helped further her deception, and saBinring himself joined Twin Suns Squadron, serving as an advisor and mentor in starfighter tactics.\nsaBinring would also help plan Luke Skywalker's mission to Coruscant to hunt down the deranged Dark Jedi Lord Nyax. However, he and Latt remained on Borleias to assist Solo.\nIn 29 ABY, near the end of the Yuuzhan Vong War, he was part of the mission to the Vong controlled world of Chashima, acting as the sniper for Runt and Estoric Sandskimmer. Just as the latter two were getting away from a shaper damutek with a new secret weapon that the Vong had developed, they were attacked. In spite of Piggy's help, both Wraith members were killed. Piggy was forced to perform a mercy killing on his friend Runt by shooting him through the chin so he wouldn't have to suffer the effects of the amphistaff venom that poisoned him. This incident caused Piggy to resign from the Wraith and renounce his nickname because of Runt's death and because the weapon that the Vong had developed at that point wouldn't be able to help them against the Galactic Federation of Free Alliances given that the GA had them on the ropes, making Runt's death pointless.\nIn 44 ABY Voort was a mathematics professor on the world of Ayceezee, no longer using the nickname \"Piggy\" because of the events of the Yuuzhan Vong war 15 years before. He was recruited by Face Loran to join a new team of Wraiths he set up at the behest of Head of Galactic Alliance Security, Borath Maddeus, to investigate whether then-head of Galactic Alliance Army, General Stavin Thaal, was part of the Lecersen Conspiracy. Voort was joined by Bhindi Drayson as Wraith Leader, Jesmin Tainer, Myri Antilles, Trey Courser, Turman Durra and Viull \"Scut\" Gorsat. The team followed Thaal to the Vandor-3, where they ran a variant of the \"king of the droids\" ploy to find a secret installation of Thaal's Pop-Dogs in a supposed petting zoo for children.\nWhile gathering evidence of Thaal's actions, they ran into another group of Wraiths, led by Sharr Latt, which Loran had set up to investigate separate leads. Together they escaped the Pop-Dogs to a nearby installation, while Bhindi sacrificed herself to distract their pursuers. Forced to await rescue by Wedge Antilles who Myri had called, Voort declared himself leader of the new combined Wraith Squadron. This move was criticized by Scut - a Yuuzhan Vong member of the team Voort distrusted. He believed Voort unfit to lead because of his unresolved issues with what happened in the Yuuzhan Vong war and all the other times he lost a team mate. Voort was initially angry but admitted that Scut had a point and later managed to convince Scut and at the same time managed to accept Scut as a team member. Voort then traveled with his team to Kuratooine where they were able to capture Thaal. While on the mission, Voort had to dance to attract witnesses to the scene and managed to resolve his issues, calling himself \"Piggy\" again.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jek_Tono_Porkins/Legends",
  "/wiki/Gamorr/Legends",
  "/wiki/Saffalore",
  "/wiki/Gamorrean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Kilogram/Legends",
  "/wiki/13_ABY/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Wraith_Squadron",
  "/wiki/Twin_Suns_Squadron",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/7_ABY/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Tuzin_Gast",
  "/wiki/Warlord/Legends",
  "/wiki/Zsinj",
  "/wiki/New_Republic",
  "/wiki/Hohass_Ekwesh",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/44_ABY",
  "/wiki/New_Republic_Defense_Fleet/Legends",
  "/wiki/Binring_Biomedical_Product",
  "/wiki/Obroa-skai/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/Wes_Janson/Legends",
  "/wiki/Wraith_Twelve_(callsign)",
  "/wiki/Battle_of_Folor",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Folor",
  "/wiki/Admiral/Legends",
  "/wiki/Apwar_Trigit",
  "/wiki/Implacable_(Imperial-class)",
  "/wiki/Empion_mine",
  "/wiki/Eurrsk_Thri%27ag",
  "/wiki/Narra_(shuttle)",
  "/wiki/Lunatic",
  "/wiki/Ession_Strike",
  "/wiki/Captain/Legends",
  "/wiki/Zurel_Darillian",
  "/wiki/New_Republic_Defense_Force_Fleet_Command",
  "/wiki/Battle_of_Ession",
  "/wiki/Coruscant/Legends",
  "/wiki/Hawk-bat_Independent_Space_Force",
  "/wiki/Razor%27s_Kiss",
  "/wiki/Super_Star_Destroyer/Legends",
  "/wiki/Iron_Fist_(Executor-class)",
  "/wiki/Shalla_Nelprin",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Jart_Eyan",
  "/wiki/Twi%27lek/Legends",
  "/wiki/181st_Imperial_Fighter_Wing/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Mon_Remonda",
  "/wiki/Han_Solo/Legends",
  "/wiki/Battle_of_Selaggis",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Kosh_Teradoc",
  "/wiki/Ryvester",
  "/wiki/Mulus_Cheems",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/27_ABY/Legends",
  "/wiki/Sharr_Latt",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Jedi",
  "/wiki/Yun-Harla",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Irek_Ismaren",
  "/wiki/Chashima",
  "/wiki/Estoric_Sandskimmer",
  "/wiki/Shaper_caste",
  "/wiki/Damutek",
  "/wiki/Amphistaff",
  "/wiki/Ayceezee",
  "/wiki/Head_of_Galactic_Alliance_Security",
  "/wiki/Borath_Maddeus",
  "/wiki/Galactic_Alliance_Army",
  "/wiki/General/Legends",
  "/wiki/Stavin_Thaal",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/Bhindi_Drayson",
  "/wiki/Jesmin_Tainer",
  "/wiki/Myri_Antilles",
  "/wiki/Trey_Courser",
  "/wiki/Turman_Durra",
  "/wiki/Viull_Gorsat",
  "/wiki/Vandor-3",
  "/wiki/King_of_the_droids",
  "/wiki/Pop-Dogs",
  "/wiki/Kuratooine",
  "/wiki/X-Wing:_Wraith_Squadron",
  "/wiki/X-Wing:_Iron_Fist",
  "/wiki/X-Wing:_Solo_Command",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_II:_Rebel_Stand",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Rogue_Leaders",
  "/wiki/Star_Wars_Galaxy_Collector_4",
  "/wiki/Star_Wars_Insider",
  "/wiki/Who%27s_Who_in_Rogue_Squadron",
  "/wiki/Star_Wars_Insider_59",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Wraith_Squadron_(article)",
  "/wiki/Star_Wars_Gamer_9",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_2",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Galaxy_at_War",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_134",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/From_Page_to_Screen_and_Back_Again...",
  "/wiki/Star_Wars_Insider_145",
  "/wiki/Wraith_Eight_(callsign)",
  "/wiki/Garik_Loran",
  "/wiki/Wraith_Seven_(callsign)",
  "/wiki/Dia_Passik",
  "/wiki/Wraith_Leader_(callsign)"
 ]
}