{
 "name": "Vooz_Nooxoo_Una",
 "display_name": "Vooz Nooxoo Una",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Vooz Nooxoo Una, Bocce for \"The Patriot,\" was an alias used by a Human male biogeneticist–turned–vigilante crime fighter in the lower levels of Coruscant. Una was able to develop a suit of armor made out of engineered plant fibers, which he tested on himself. The armor began affecting Una's mind, causing him to view himself as a hero destined to vanquish evil. During his adventures, he caught the attention of the Empire after an incident resulting in the deaths of three Imperial officers. A bounty was placed on Una and the posting was later archived in the Imperial Enforcement DataCore.\nThe individual who would take on the name \"Vooz Nooxoo Una\" was originally a Human male biogeneticist who lived during the reign of the Galactic Empire. He developed a suit of armor created from genetically engineered plant matter and used himself as a test subject for it. The armor began influencing his mind, and he eventually became a vigilante in the Coruscant underworld, believing that the Empire was not doing its job to combat crime. He then took on the name \"Vooz Nooxoo Una,\" which translated from Bocce to Basic as \"The Patriot.\"\nInitially, Una only attacked criminals in the lower levels of Coruscant, allowing the Empire to turn a blind eye to his activities. However, at some point Una attacked and killed three Imperial officers, prompting the Empire to send a squad of stormtroopers into Coruscant's lower levels after him. Only two of them returned from the hunt alive, having failed to capture Una. The Empire proceeded to post a bounty of 7,500 on the vigilante, wanted dead by disintegration. This bounty posting was later archived in the Imperial Enforcement DataCore.\nVooz Nooxoo Una was an intelligent biogeneticist whose thought process was altered by the unique armor he wore. As a vigilante, he was very dedicated to his cause and thought of himself as a hero fighting evil. The Empire believed him to be a very sick individual with a warped view of the galaxy who was quickly spiraling out of their control. The Empire also considered him armed and dangerous, and advised caution when approaching him. Una had in-depth knowledge of Coruscant's lower levels, having been able to survive living there for a long period of time. He had basic medical training and could speak several different languages, including Huttese, Rodese, and Quarren.\nUna crafted his unique armor from biochemically and genetically engineered plant fibers. This organic armor had a green-yellow, wooden appearance and a thorny surface designed to fend off physical attacks. It covered Una's entire body and had roots growing out from points along his legs, though the armor still retained a relatively anthropomorphic shape. The armor was asymmetric and had round, shell-like shoulder pads and a trapezoidal helmet. The suit had retractable claws and bladed gauntlets, which complemented the vibroblade Una carried with him. Although the armor was not sentient, long-term exposure to residual plant spores was thought to have affected Una's state of mind.\nVooz Nooxoo Una was first referenced in the 2001 Star Wars Gamer 6 article Bounties to Die For, written by S. Mitch Ritchie and illustrated by Ramón Pérez. The article was presented as an in-universe database of bounties posted throughout the Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounties_to_Die_For",
  "/wiki/Bocce/Legends",
  "/wiki/Geneticist/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Coruscant/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Plant/Legends",
  "/wiki/Brain/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Death/Legends",
  "/wiki/Imperial_officer/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Imperial_Enforcement_DataCore/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Squad/Legends",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Credit",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Disruptor/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Huttese/Legends",
  "/wiki/Rodese",
  "/wiki/Quarrenese/Legends",
  "/wiki/Color/Legends",
  "/wiki/Wood/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Claw/Legends",
  "/wiki/Gauntlet/Legends",
  "/wiki/Vibroblade/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/2001",
  "/wiki/Star_Wars_Gamer_6",
  "/wiki/S._Mitch_Ritchie",
  "/wiki/Ram%C3%B3n_P%C3%A9rez",
  "/wiki/In-universe",
  "/wiki/Star_Wars_Gamer"
 ]
}