{
 "name": "Vor_Harkass",
 "display_name": "Vor Harkass",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Vor Harkass was a Force-sensitive Human who served as an Imperial scout during the Galactic Civil War.\nHarkass was born on Nar Shaddaa to a slave dancer, who was owned by a Hutt. After being hiding Harkass away for a few years, the dancer sent her child to live with relatives on Alderaan when Harkass was eight years old. Harkass was enrolled in the Aldera University and decided to become a scout and explore the galaxy. Harkass's relatives were dismayed by Harkass's decision to join the scout corps of the Imperial Army and tried to persuade Harkass that the Empire and Palpatine were evil, but Harkass ignored this\nHarkass served aboard the YT-2400 light freighter Predator's Beak. However, it crash-landed on the planet Yorgraxx and was left with no functioning engines of communication systems, while Harkass and Arran Flekk were the only survivors. After they had been there over a month, they encountered the surviving crew of a crashed Rebel Alliance ship and they joined forces. They soon after entered the fortress of the Sith Lord Quorlac Fornayh, where they confronted his reawakened spirit.\nHarkass featured in the Star Wars Roleplaying Game scenario Shadows in the Force and has no canonical gender, as that is established by the player.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Human/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Aldera_University",
  "/wiki/The_galaxy/Legends",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/YT-2400_light_freighter/Legends",
  "/wiki/Predator%27s_Beak",
  "/wiki/Yorgraxx",
  "/wiki/Arran_Flekk",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Fornayh%27s_fortress",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Quorlac_Fornayh",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Shadows_in_the_Force"
 ]
}