{
 "name": "Voren_Na%27al",
 "display_name": "Voren Na'al",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Massassi Group",
      "Massassi Group",
      "New Republic",
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Voren Na'al was a human male historian who served in the Alliance to Restore the Republic and the New Republic. Na'al served as a lieutenant in the military of the Alliance around the time of the Battle of Scarif. At the time, he was working on a project titled \"Official History of the Rebel Movements, Volume One\" with Major Arhul Hextrophon. He served as an Alliance archivist by the time of the Battle of Hoth.\nVoren Na'al was a human male who served as a lieutenant and historian in the military of the Alliance to Restore the Republic around the time of the Battle of Scarif. At the time, he was working on a project titled \"Official History of the Rebel Movements, Volume One\" with Major Arhul Hextrophon. Na'al was in the briefing room at Base One when Jyn Erso was brought before Chancellor Mon Mothma and the rest of the Alliance High Command, and he summarized the proceedings of this meeting in a report to Hextrophon. He also intended to interview Mon Mothma after the battle was over. This report was later included in a compilation of documents prepared by General Airen Cracken, Chief of Rebel Intelligence, for Mothma. In a correspondence with Mothma titled \"DOC #0320194-ALL\" that was included in the collection of documents that became known as The Rebel Files, Arhul Hextrophon mentioned Na'al's intention to interview her, and suspected he began writing his own book.\nLater, Na'al was also at the ceremony held in honor of Luke Skywalker and other heroes of the Battle of Yavin. He bore one of the Medals of Bravery, which General Jan Dodonna handed to Princess Leia Organa of Alderaan, who awarded it to Skywalker. By the time of the Battle of Hoth, Na'al served as an an archivist in the Alliance. Following the battle, lieutenant Wedge Antilles summarized the battle in a classified correspondence titled \"RI 087-R2 Action on Hoth\" to Na'al that was included in The Rebel Files.\nBy the time of the New Republic, Na'al had become a bona fide historian. At some point, he attended the Arhul Hextrophon School of Embedded Journalism on Lerct, where he met fellow historian Beaumont Kin. After The Rebel Files were rediscovered on Durkteel in 34 ABY and handed to the Resistance, \"DOC #0320194-ALL\" was annotated by Amilyn Holdo and Ushos O. Statura. Holdo mentioned that Na'al intended to have a two-hour lunch with her the next time he's on D'Qar, and Statura noted his humble beginnings. By 35 ABY, Na'al and Kin maintained a correspondence.\nVoren Na'al had light skin and blond hair.\nVoren Na'al originated as the in-universe \"author\" of several Star Wars Legends roleplaying sourcebooks published by West End Games, beginning with Galaxy Guide 1: A New Hope in 1989. The character went on to appear in several other reference books. In 2012, the \"Rogues Gallery\" feature in Star Wars Insider 133 identified one of the extras who hand the medals to General Dodonna as Na'al, retroactively establishing that film as his first appearance. The extra in question was Derek Lyons, who also portrayed a member of the Rebel Honor Guard earlier in the same scene.\nThe character became canon when he was mentioned in the 2016 reference book Star Wars: Rogue One: Rebel Dossier.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Voren_Na%27al",
  "/wiki/Voren_Na%27al/Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Massassi_Group",
  "/wiki/New_Republic",
  "/wiki/Resistance",
  "/wiki/Official_History_of_the_Rebel_Movements,_Volume_One",
  "/wiki/Historian",
  "/wiki/Lieutenant",
  "/wiki/Alliance_Military",
  "/wiki/Battle_of_Scarif",
  "/wiki/Major",
  "/wiki/Arhul_Hextrophon",
  "/wiki/Archivist",
  "/wiki/Battle_of_Hoth",
  "/wiki/Great_Temple",
  "/wiki/Jyn_Erso",
  "/wiki/Chancellor_(Rebel_Alliance)",
  "/wiki/Mon_Mothma",
  "/wiki/Alliance_High_Command",
  "/wiki/Operation_Fracture_dossier",
  "/wiki/General",
  "/wiki/Airen_Cracken",
  "/wiki/Chief",
  "/wiki/Rebel_Alliance_Intelligence_Service",
  "/wiki/The_Rebel_Files",
  "/wiki/Royal_Award_Ceremony",
  "/wiki/Luke_Skywalker",
  "/wiki/Battle_of_Yavin",
  "/wiki/Medal_of_Bravery",
  "/wiki/Jan_Dodonna",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alderaan",
  "/wiki/Wedge_Antilles",
  "/wiki/Arhul_Hextrophon_School_of_Embedded_Journalism",
  "/wiki/Lerct",
  "/wiki/Beaumont_Kin",
  "/wiki/Excavation_on_Durkteel",
  "/wiki/Durkteel",
  "/wiki/34_ABY",
  "/wiki/Amilyn_Holdo",
  "/wiki/Ushos_O._Statura",
  "/wiki/D%27Qar",
  "/wiki/35_ABY",
  "/wiki/Color",
  "/wiki/Hair",
  "/wiki/In-universe",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/Galaxy_Guide_1:_A_New_Hope",
  "/wiki/1989",
  "/wiki/2012",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_133",
  "/wiki/Retcon",
  "/wiki/Derek_Lyons",
  "/wiki/Rebel_Honor_Guard",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_26",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Standard_day",
  "/wiki/Battle_of_Endor",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Blogs",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars_Insider",
  "/wiki/March_17",
  "/wiki/2019"
 ]
}