{
 "name": "Vorlocca",
 "display_name": "Vorlocca",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 20 BBY",
      "Almas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Vorlocca was a male Wookiee Jedi Knight who was, during the time of the Clone Wars, based on the planet Almas, where he helped to guard the Almas Sith fortress. Circa 20 BBY, Vorlocca and five other Jedi were attacked by the slaver Phylus Mon, the Dark Jedi Karae Nalvas, and a number of Mon's minions, who planned to enter the fortress to search for the secrets of the creation of Sith battlelords. Vorlocca was killed during the fight, and the attackers subsequently dragged the Wookiee's corpse inside the fortress, where they fed it to three gundarks. His body was later discovered by a search team that had traveled to the fortress to look for any Jedi who had survived the attack.\nVorlocca was a male Wookiee who served as a member of the Jedi Order during the time of the Clone Wars, attaining the rank of Jedi Knight. At some point, he became a member of a Jedi force that was garrisoned on the planet Almas outside the Almas Sith fortress to keep the Believers, a Sith cult that operated in the Cularin system, from entering the fortress, which had previously served as a Believer base. While the majority of the fortress's Jedi guards were stationed to the north of the building, Vorlocca was one of six Jedi who were assigned to protect the facility's south entrance.\nDuring a sandstorm circa 20 BBY, the Chevin slaver Phylus Mon, the Dark Jedi Karae Nalvas, and a number of Mon's minions traveled to the south entrance to access the fortress, where they planned to search for the secrets of the creation of ancient Sith warriors known as Sith battlelords. Mon's forces attacked Vorlocca and the other five Jedi guards; during the ensuing fight, Vorlocca and the Jedi Tresten Agai'i, K'kur, and Milak Sonloam were killed, while the other two Jedi defenders were captured, allowing Mon and Nalvas to enter the fortress. The attackers dragged Vorlocca's body inside the building and abandoned it in a slave pen in the lower levels of the fortress to be eaten by three gundarks that Mon had brought with him into the facility.\nIn the aftermath of the attack, the Jedi discovered the bodies of Agaai'i, K'kur, and Sonloam, and they dispatched a number of search parties into the fortress to try and find Vorlocca and the two captured Jedi. Two hours after Vorlocca's death, one search team made its way to the lower levels of the fortress, where it located his corpse and observed as one of the gundarks shredded the Wookiee's body and fed from it.\nVorlocca was a very skilled Jedi Knight who could have qualified as a Jedi Master if he had desired to do so. He was chosen to guard the south entrance of the Sith fortress because of his exceptional abilities, as the Jedi knew less about the south entrance than they did about the building's other entrances. Vorlocca was more physically powerful than his fellow guards Tresten Agai'i, K'kur, and Milak Sonloam.\nVorlocca was created by Morrie Mullins and was featured in the 2004 roleplaying adventure A Mon Alone, a supplement that formed part of the Living Force campaign. In the adventure, the player-characters, who roleplay as the search party that discovers Vorlocca's corpse, find a number of individuals inside the Sith fortress who have had their Force essences separated from their bodies as a result of Phylus Mon's attempts to carry out a ritual relating to the creation of Sith battlelords. It is then possible for the players to ask the Force ghost Darsin if Vorlocca's body had also been separated from its Force essence, to which the spirit replies is unlikely. It is also possible for the player-characters to take Vorlocca's body with them when they leave the fortress. If they choose to do so, the cadaver is then loaded onto a shuttle with the player-characters and is taken to the Almas Academy, a Jedi academy that was located on Almas.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/20_BBY/Legends",
  "/wiki/Almas",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Lanius_Qel-Bertuk",
  "/wiki/A_Mon_Alone",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Almas_Sith_fortress",
  "/wiki/Jedi/Legends",
  "/wiki/Raid_on_the_Almas_Sith_fortress",
  "/wiki/Slavery/Legends",
  "/wiki/Phylus_Mon",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Karae_Nalvas",
  "/wiki/Fortress/Legends",
  "/wiki/Sith_battlelord",
  "/wiki/Death/Legends",
  "/wiki/Gundark/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Garrison/Legends",
  "/wiki/Believers",
  "/wiki/Sith_cult/Legends",
  "/wiki/Cularin_system",
  "/wiki/Sandstorm/Legends",
  "/wiki/Chevin/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Tresten_Agai%27i",
  "/wiki/K%27kur",
  "/wiki/Milak_Sonloam",
  "/wiki/Standard_hour/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Morrie_Mullins_(person)",
  "/wiki/2004",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Roleplaying_game",
  "/wiki/The_Force/Legends",
  "/wiki/Force_ghost",
  "/wiki/Darsin",
  "/wiki/Shuttle/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Jedi_academy",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Night%27s_Homecoming",
  "/wiki/Caaried_Away",
  "/wiki/A_Dark_Fortress"
 ]
}