{
 "name": "Vossk",
 "display_name": "Vossk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Trandosha"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Trandoshan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "Vossk was a male Trandoshan bounty hunter living on Nal Hutta's moon Nar Shaddaa during the years after the Jedi Civil War. He eventually left the Bounty Hunters' Guild and gave up his position as leader of the organization. In 3951 BBY, Vossk met Meetra Surik on Nar Shaddaa and warned her about the other bounty hunters who were after her bounty on the surface of the moon.\nVossk was a male Trandoshan who lived during the years after the Jedi Civil War. Operating as a bounty hunter on Nar Shaddaa, commonly known as the \"Smuggler's Moon,\" Vossk was the leader of an ancient regulative institution, the Bounty Hunters' Guild. However, he later gave up his career and the leadership due to his contempt for many of the new mercenaries who did not adhere to the Bounty Hunters' Creed.\nIn 3951 BBY, Meetra Surik, known as the Jedi Exile, and her companions landed on Nar Shaddaa in order to find the lost Jedi Master Zez-Kai Ell. When the Jedi approached Vossk, the Trandoshan warned her about dangers she would encounter on the Smuggler's Moon. He told her about the bounty that had been placed on her head by the Exchange crime syndicate, and suggested getting rid of the bounty by trying to make members of the Exchange collect it and thus revealing themselves.\nHe also gave her information on notable bounty hunters operating on Nar Shaddaa, such as the nest of insective Gands, the Duros bounty hunter group called the Zhug brothers, two Twi'lek female assassins known as the Twin Suns, and a group of HK-50 series assassin droids. In addition, he informed Surik of two bounty hunters who were rivals, the Wookiee Hanharr and Human Mira.\nVossk gave a great value to the rules and honor between the bounty hunters, namely the Bounty Hunters' Creed, and his disgust at others ignoring the creed compelled him to leave the Bounty Hunters' Guild. He was especially respectful toward the bounty hunter Mira, whom he regarded as the best bounty hunter on Nar Shaddaa due to her dedication to the hunt, rather than the slaughter that many other bounty hunters had taken up.\nVossk was first introduced in Star Wars: Knights of the Old Republic II: The Sith Lords, a video game developed by Obsidian Entertainment that was first released on the Xbox platform in December 2004 and for PC two months later. His status as the former Bounty Hunters' Guild leader was initially stated in game dialogue as a background whisper when he introduces himself to the Exile, and was further confirmed in the Star Wars Insider 99 article Bounty Hunters' Guild Handbook, released in January 2008. In cut content of the game, Vossk would have been the source of information about the GenoHaradan assassin guild, a group that was introduced in BioWare's 2003 video game Star Wars: Knights of the Old Republic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Trandosha/Legends",
  "/wiki/Trandoshan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Red",
  "/wiki/Bounty_Hunters%27_Guild/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Dark_Wars",
  "/wiki/Jedi_Civil_War",
  "/wiki/3951_BBY",
  "/wiki/Meetra_Surik",
  "/wiki/Bounty/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Bounty_Hunters%27_Creed",
  "/wiki/Jedi/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Lost_Jedi",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Exchange",
  "/wiki/Insect/Legends",
  "/wiki/Gand/Legends",
  "/wiki/Duros/Legends",
  "/wiki/Zhug_brothers",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Twin_Suns_(assassins)",
  "/wiki/HK-50_series_assassin_droid",
  "/wiki/Wookiee/Legends",
  "/wiki/Hanharr",
  "/wiki/Human/Legends",
  "/wiki/Mira",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Video_game",
  "/wiki/Obsidian_Entertainment",
  "/wiki/Xbox",
  "/wiki/December",
  "/wiki/2004",
  "/wiki/Personal_computer",
  "/wiki/February",
  "/wiki/2005",
  "/wiki/Star_Wars_Insider_99",
  "/wiki/Bounty_Hunters%27_Guild_Handbook_(article)",
  "/wiki/January",
  "/wiki/2008",
  "/wiki/Cut_content_from_Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/GenoHaradan",
  "/wiki/BioWare",
  "/wiki/2003",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Knights_of_the_Old_Republic_II:_The_Sith_Lords:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Bounty_Hunter_Code:_From_the_Files_of_Boba_Fett",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/The_Old_Republic:_Revan"
 ]
}