{
 "name": "Voth_Vassakka",
 "display_name": "Voth Vassakka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3640 BBY",
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Special Forces Division",
      "Republic Special Forces Division"
     ]
    }
   ]
  }
 ],
 "content": "Voth Vassakka was a Human soldier of the Galactic Republic's Special Forces Division who fought against the reconstituted Sith Empire at the Battle of Corellia, where he held the Republic's supply schedule for Corellia in the planet's capital, Coronet City. Given the schedule's critical value as military intelligence, Vassakka was lured out and killed by Imperial forces.\nA Human male soldier of the Galactic Republic, Voth Vassakka underwent training at the Republic Army Special Forces Academy to become a member of the elite Special Forces Division. He held the Republic's supply schedule for the contested planet Corellia in 3640 BBY during the Galactic War against the reconstituted Sith Empire. As part of the Battle of Corellia, the Empire deemed the schedule to be a crucial piece of intelligence for their ongoing assault on the Republic-held government district in the Corellian capital of Coronet City.\nOperating under the command of Admiral Hestun, an individual affiliated with the Imperial forces sought to claim the schedule, battling through anti-aircraft emplacements in the district before proceeding to slice into a ground-level Republic console near Vassakka's position. The soldier then descended to the ground using his jetpack to confront the intruder alone. Vassakka was killed by the assailant in the ensuing brawl, and the Republic supply schedule that he possessed was taken by the victor and subsequently handed over to the nearby Imperial Central Command.\nVoth Vassakka wore a set of white Republic Special Forces trooper armor that sported blue markings with brown accents and a pauldron piece affixed to his left shoulder, while the right shoulder pad was adorned with the emblem of the Republic. Donning a bandolier and a jetpack, the soldier fought with an assault cannon, a rail gun, and cryo grenades.\nVoth Vassakka appeared in BioWare's 2011 massively multiplayer online role-playing game, Star Wars: The Old Republic. He spawns as an enemy boss character in the final stage of \"Break the Lines,\" an optional bonus mission of the Imperial quest \"Precision Strikes.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3640_BBY",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Special_Forces_Division",
  "/wiki/Republic_soldier",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Battle_of_Corellia",
  "/wiki/Planet/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coronet_City/Legends",
  "/wiki/Death/Legends",
  "/wiki/Imperial_Military_(Sith_Empire)",
  "/wiki/Republic_Army_Special_Forces_Academy",
  "/wiki/Galactic_War",
  "/wiki/Governmental_Sector",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Canon",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Admiral/Legends",
  "/wiki/Hestun",
  "/wiki/Anti-aircraft_gun",
  "/wiki/Slicer/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Imperial_Central_Command_(Corellia)",
  "/wiki/Grenade/Legends",
  "/wiki/Color/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Pauldron/Legends",
  "/wiki/Republic_crest",
  "/wiki/Bandolier/Legends",
  "/wiki/Assault_cannon/Legends",
  "/wiki/Rail_gun",
  "/wiki/CryoBan_grenade",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Template:TOR_dates/3",
  "/wiki/Standard_year/Legends",
  "/wiki/Jedipedia",
  "/wiki/May_2",
  "/wiki/2022",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}