{
 "name": "Vram",
 "display_name": "Vram",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hethrir's Worldcraft"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Empire Reborn"
     ]
    }
   ]
  }
 ],
 "content": "Vram was a young Human boy associated with the Empire Reborn in 14 ABY.\nAs with most of the other children kept on Hethrir's Worldcraft, Vram may have been from one of the sleeper-ships that contained people from planets that had been condemned and punished by Hethrir during his days as the Imperial Procurator of Justice.\nLike most of the children under Hethrir, he was indoctrinated into believing that Emperor Palpatine had brought security and prosperity into the galaxy through his Galactic Empire and that the Rebel Alliance was a threat to that galactic security. Vram was a hardened bully and was also Humanocentric with this being evident by him harassing the Chironian Lusa.\nBefore the death of Lord Hethrir he achieved the rank of Helper, allowing him to don the rust-red tunic worn as a uniform. Despite this, Hethrir still did not trust him and kept him locked up at night in a cell.\nOn one occasion, he mistreated a then-five year old Jaina Solo during her incarceration at Hethrir's Worldcraft. While Jaina insisted that her mother Leia Organa Solo was the greatest leader in galactic history, Vram angrily told her that Palpatine was the greatest.\nWhen the children that Hethrir captured escaped, Jaina and her brother Jacen offered to let Vram out of his cell, having escaped and immobilized the Head Proctor. Vram angrily rejected the offer, believing that Jaina would hit him. The twins then slammed the door of his cell, shutting him in. His fate after that is unknown though he may have been captured by the New Republic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Vram_(Pyke)",
  "/wiki/Hethrir",
  "/wiki/Worldcraft",
  "/wiki/Gender/Legends",
  "/wiki/Empire_Reborn",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/14_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Procurator_of_Justice",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Humanocentrism",
  "/wiki/Chironian",
  "/wiki/Lusa",
  "/wiki/Helpers",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Darth_Caedus",
  "/wiki/Head_Proctor",
  "/wiki/New_Republic/Legends",
  "/wiki/The_Crystal_Star",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}