{
 "name": "Vrannin_Vaxx",
 "display_name": "Vrannin Vaxx",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dorvalla"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Two-thirds of body replaced with a YVH 1 droid"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Security",
      "Daala's special-missions force",
      "Galactic Alliance Security",
      "Daala's special-missions force"
     ]
    }
   ]
  }
 ],
 "content": "Vrannin Vaxx was a male Human mercenary from the planet of Dorvalla. He won fame during the Yuuzhan Vong War, but was nearly killed in a personnel shuttle crash near the end of the war. His family obtained a black market YVH 1 droid and made it into a cybernetic body for Vaxx.\nIn 43.5 ABY, Vaxx, along with a female Human bounty hunter and the Quarren inventor Dhidal Nyz, was hired by Chief of State Natasi Daala to capture the fugitive Jedi Knight Valin Horn. During the hunt, Vaxx was shot, and the hunters' vehicle was disabled by ex-smuggler Han Solo and his wife, Leia Organa Solo, in the Millennium Falcon, forcing the hunters to give up the bounty. Horn was captured by the Jedi and eventually returned to the Jedi Temple. Vaxx was later hired alongside bounty hunter Zilaash Kuh by the Galactic Alliance to assist in the arrest of Valin Horn from the Temple.\nVrannin Vaxx was a male Human born on the Outer Rim Territories planet of Dorvalla, in the Videnda sector. He became a mercenary and distinguished himself during the Yuuzhan Vong War, but suffered grievous injuries when his personnel shuttle crashed late in the war. Two-thirds of his body was destroyed beyond repair, but instead of replacing it with simple prostheses, Vaxx's wealthy family—a mining clan—acquired a black market YVH 1 droid and reassembled it into a cybernetic body for Vaxx.\nIn 43.5 ABY, Vaxx and two other bounty hunters—a blond female Human and the Quarren inventor Dhidal Nyz—in a cargo hauler piloted by another being, were hired by Chief of State Natasi Daala as a part of her special-missions force. They were ordered to capture the fugitive Jedi Knight Valin Horn, who was suffering from a psychological breakdown. During the chase through the galactic capital of Coruscant, Horn ejected from the antique T-65 X-wing starfighter he had been flying and landed his ejector seat on the cargo hauler's bed. Before the bounty hunters could attack him, however, they were distracted by Jedi Knight Jaina Solo as she jumped down from her airspeeder onto the bed in hopes of catching Horn. Horn quickly escaped on his ejector seat, and Solo landed where Horn had been standing a moment before. Vaxx reassured Solo that they weren't there to hurt her, but Nyz fired his electric net gun at the Jedi. The net caught Solo and knocked her over the edge of the cargo bed. The female bounty hunter began to criticize Nyz for his rash action, but a racing speeder shot by the hauler, causing the vehicle to tip over sideways. Nyz was thrown off the hauler and their female colleague lost her balance, but Vaxx held his footing.\nAs they began to accelerate back up to speed, Vaxx opened fire on Solo and her companion, Jedi Master Kyle Katarn, in their speeder. However, the hunters were quickly fired upon by former smuggler Han Solo and his wife, Leia Organa Solo, in their starship, the Millennium Falcon. Vaxx was hit, and the cyborg was launched into the control cab of the cargo hauler. Smoke began pouring from the cab and the hauler slowed down. The bounty hunters were forced to give up the chase, but Vaxx survived the accident and was quickly repaired. Soon after, Horn was captured by Jedi Grand Master Luke Skywalker and eventually placed in the Jedi Temple. Before long, Vaxx was hired by the Galactic Federation of Free Alliances, alongside fellow bounty hunter Zilaash Kuh, to accompany Galactic Alliance Security forces led by Captain Oric Harfard to the Jedi Temple to arrest Valin Horn. Horn was then put on trial, convicted, encased in carbonite, and placed in the Armand Isard Correctional Facility, a prison on Coruscant.\nVrannin Vaxx was terribly injured in a shuttle crash near the end of the Yuuzhan Vong War and had his irreparably damaged body replaced with that of a YVH 1 droid. While he wasn't able to carry as much weaponry as a normal YVH droid due to his smaller carapace, he made up for it with his cunning and experience. He often worked with other bounty hunters and was also employed by the Galactic Alliance.\nVrannin Vaxx was created by the established Star Wars author Aaron Allston for the first novel in the nine-part Fate of the Jedi series, Fate of the Jedi: Outcast. This novel, released on March 24, 2009, is Vaxx's only appearance to date.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Dorvalla/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/YVH_1",
  "/wiki/Droid/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Daala%27s_special-missions_force",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/Mercenary/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Death/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Black_market/Legends",
  "/wiki/Cybernetics/Legends",
  "/wiki/43_ABY",
  "/wiki/Unidentified_Human_bounty_hunter_(Valin_Horn)",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Quarren/Legends",
  "/wiki/Dhidal_Nyz",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/Laser/Legends",
  "/wiki/Cargo_hauler/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/New_Jedi_Temple",
  "/wiki/Jesmin_Tainer",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Videnda_sector",
  "/wiki/Mining/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Unidentified_pilot_(Valin_Horn)",
  "/wiki/Force_psychosis",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Ejector_seat/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Airspeeder/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Kyle_Katarn",
  "/wiki/Starship/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Temple_of_the_Sith",
  "/wiki/Captain/Legends",
  "/wiki/Oric_Harfard",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Valin_Horn",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Armand_Isard_Correctional_Facility",
  "/wiki/Prison/Legends",
  "/wiki/Star_Wars",
  "/wiki/Aaron_Allston",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/March",
  "/wiki/March_24",
  "/wiki/2009",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion"
 ]
}