{
 "name": "Vroma",
 "display_name": "Vroma",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nautolan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "Vorma was a Nautolan girl who resided on the astronomical object Hon-Tallos. During the High Republic Era, Vroma took a durga berry from one of the groves, prompting the bully Ghenli to track her down and shove her away. The Nihil marauder, Deva Lompop came to Vroma's aid and the two devised a plan to get back at Ghenli. They met Ghenli in the grove, but Vroma had taken another berry. Ghenli and his friends chased Vroma, but Lompop was picking off Ghenli's friends. Lompop scared Ghenli and her admitted to stealing the fruit. Vroma and Lompop returned to the city and Vroma thanked Lompop for helping her. She wished to become a Nihil but Lompop told her of the actions the Nihil commit, changing her mind.\nVroma was a young Nautolan girl who resided with her mothers at a city on Hon-Tallos. During the High Republic Era, Vroma took a durga berry from one of the groves that a human boy named Ghenli claimed ownership over. Ghenli chased Vroma throughout the city until she tripped and fell. With the berry destroyed, Vroma proclaimed the durga berry groves were for everyone and not just Ghenli, but Ghenli did not care and did not believe people like Vroma should be allowed into the groves. He then shoved Vroma back, and threatened her to not return to \" grove.\"\nNearby was Deva Lompop, who asked what was wrong. Vroma told her that the durga berry was a favorite of her mothers and she just wanted to do something nice for them. But Ghenli was a bully to Vroma and would take anything of Vroma's he wanted. Lompop told her to take it back but Vroma believed stealing was wrong, but Lompop countered and told her it was not stealing to take back something that was already stolen. Vroma then became worried of Lompop and told her she could not talk to strangers. Lompop introduced herself as a member of the Nihil, who Vroma confused for the Jedi, and promised to teach her a lesson.\nAt the grove, Vroma explained that she would pick her berry and attempt to leave but Ghenli and his friends would already be waiting for her. Lompop recommended they exit from the back of the grove, but Vroma said it would take longer for her to escape and it was dark. Lompop then developed her plan and assured Vroma she would never have to worry about the bullies again.\nVroma thought it was terrible idea as she traveled through the groves but Lompop reassured her it was not. She was then confronted by Ghenli and his friends who told her she should have stayed away. Vroma replied that they are making a mistake and the Grove Guardians would not like it. Ghenli didn't believe that was a thing and the chase began. One of Ghenli's friends shouted to Vroma she would regret this but Vroma kept running. Then, each of Ghenli's friends were picked off until just he remained. Vroma stopped and told Ghenli that she tried to warn him about the Grove Guardians but he made them angry. Ghenli brushed them off as stories but then a loud voiced echoed throughout the grove. It introduced itself as the \"Guardian of the Grove\" and promised to punish Ghenli. The figured revealed itself to be Lompop who opened her mouth to reveal her rows of sharp teeth, scaring Ghenli into admitting to stealing the durga berries. Ghenli ran away and Lompop and Vroma returned to town.\nVroma was surprised the plan worked out and thanked Lompop for her help. She then asked Lompop if she could join the Nihil to stop bullies all over the galaxy. Lompop told her she could, but the Nihil were pirates who do not stop bullies. Vroma didn't think her mothers would allow that. Lompop told her to head home as the Nihil began the attack on Hon-Tallos. Vroma thanked Lompop again and walked away, believing Lompop was a nice lady as the Nihil opened fire on the city.\nVroma had blue skin with black eyes. She also had green spots on her tentacles. Vroma was worried at first to accept the help of Lompop but grew more confident to stop the bullies.\nVroma wore a light brown tunic with white boots and a brown belt.\nVroma appeared in \"Tales of Villainy: A Very Nihil Interlude\" the backstory of the fourteenth and final issue of the 2020 Star Wars Adventures anthology Star Wars comic book series. The comic story was written by Justina Ireland, illustrated by Nick Brokenshire and published by IDW Publishing on February 9, 2022.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Nautolan",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Hon-Tallos",
  "/wiki/High_Republic_Era",
  "/wiki/Durga_berry",
  "/wiki/Hon-Tallos_groves",
  "/wiki/Ghenli",
  "/wiki/Nihil",
  "/wiki/Marauder",
  "/wiki/Deva_Lompop",
  "/wiki/Berry",
  "/wiki/Fruit",
  "/wiki/City",
  "/wiki/Youngling",
  "/wiki/Human",
  "/wiki/Parent",
  "/wiki/Jedi",
  "/wiki/Grove_Guardians",
  "/wiki/Tooth",
  "/wiki/The_galaxy",
  "/wiki/Pirate",
  "/wiki/Attack_on_Hon-Tallos",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Belt",
  "/wiki/Tales_of_Villainy:_A_Very_Nihil_Interlude",
  "/wiki/Star_Wars_Adventures_(2020)_14",
  "/wiki/2020",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Justina_Ireland",
  "/wiki/Nick_Brokenshire",
  "/wiki/IDW_Publishing",
  "/wiki/February_9",
  "/wiki/2022"
 ]
}