{
 "name": "Vrook_Lamar",
 "display_name": "Vrook Lamar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray",
      "originally brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Dantooine Jedi Enclave Council",
      "Jedi High Council",
      "Dantooine Jedi Enclave Council",
      "Jedi High Council",
      "Galactic Republic",
      "Khoonda Militia",
      "Lost Jedi"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Unidentified Padawan"
     ]
    }
   ]
  }
 ],
 "content": "Vrook Lamar was a Human male who served as a Jedi Master as early as the time of the Great Hunt, holding a seat on the Dantooine Jedi Enclave Council. He was also a member of the Jedi High Council throughout the Mandalorian Wars, the Jedi Civil War, and the Dark Wars. He was friends with fellow Council member Vandar Tokare, despite rarely concurring with him on anything, most notably the decision of accepting Revan back into the Jedi Order after his fall to the dark side of the Force. He retreated to Dantooine after the Conclave at Katarr as what remained of the Jedi waited for the Sith to reveal themselves, but he was killed by Kreia in the ruins of the Jedi Enclave when Meetra Surik had a council assembled to take action against the Sith Triumvirate.\nIn the years following the Great Sith War, Lamar was stationed at the Jedi Enclave on Dantooine, though he occasionally attended Council meetings at the Jedi Temple on Coruscant. Exar Kun had dealt the Jedi a great blow to their numbers, so when the terentatek were discovered to be behind the deaths of more Jedi throughout the galaxy, the High Council started a Great Hunt to wipe them out. The hunt officially ended in 3993 BBY, when the last of the species were driven deep under Korriban, and it was deemed too dangerous to seek them out due to the planet's strong ties to the Sith. Three Jedi Knights, Shaela Nuur, Duron Qel-Droma, and Guun Han Saresh were chosen to continue the hunt, and reported to the Council on Dantooine. Lamar, as well as other members of the Council, had strong reservations about sending such a meager party of Jedi, as well as sending a Qel-Droma to Korriban, given what Duron's cousin, Ulic, had done in the recent war. The other Masters, though they agreed on the first point, argued that it was unfair to judge a Jedi by their blood.\nSometime before the Mandalorian Wars, when Meetra Surik was still a student at the Jedi academy on Dantooine, Lamar caught her in a heated argument with his Padawan and asked Master Vandar for proper disciplinary action, since her master would take no steps against her. Lamar called her a \"mediocre Jedi\" with a lust for power that would lead her to the dark side, and also voiced his concern on her strong influence on the other Padawans, as whatever they saw her do some were quick to do the same while others intensely opposed her. Vandar, however, believed Surik's was a unique strength and that she was just a natural leader, so he told Lamar that her discipline was none of his concern.\nSomething else on which Lamar and Tokare had the chance to disagree on, was the choice of apprentice five Padawan learners to Jedi Masters Feln, Q'Anilia, Raana Tey, Xamar, and Lucien Draay, a cloistered group that was secretly part of the Jedi Covenant, a cabal which Sage Master Krynda Draay had founded years before with the purpose of guarding against a new Sith outbreak. The students were trained at the Jedi academy on Taris, a rimworld with little law and order whence the Jedi were making an effort to conjure up new Jedi Knights to help maintain peace and justice.\nHowever, just before the Mandalorians would invade the Galactic Republic, the students were killed by their own teachers. Framed for the murders, Zayne Carrick, the only Padawan to escape the massacre, turned himself in after learning that a prophecy was catalyst for his Masters' actions that could mean he was going to collapse the Republic and the Jedi Order. As he was brought in chains to the Jedi Tower, Lamar saw him on the holonews in the council chamber of the Enclave, before Carrick resolved to escape once more to protect people who helped him that his Master would not spare.\nWith ever more Jedi following Revan to war, Lamar was frustrated with the diminished authority of the Council, and would chide further defiance. Although the five Masters of Taris had not actually confessed to the murders, they were all reassigned to different postings per Lamar's demand, as he felt that they had failed in the most basic mission a Master can have, which was protecting their student. As they stood judgment before the High Council on Coruscant, Tokare regretted he did not listen to Lamar when he showed reluctance in assigning learners to uneager teachers.\nRaana Tey's outburst at Lamar's decision of dividing her group was met with equal passion by Lamar. When the Jedi withdrew from Taris, the planet had only recently joined the Republic; its citizens were left by both of them to fend for themselves against the impending Mandalorian invasion. After the Battle of Jebble, the High Council offered Lucien Draay to join them, but Lamar didn't like the way he had fed off opposition to Revanchism and how the Draay Trust had gained him consensus among the councilors, not to mention the fact that little before they were reprimanding his group for failing to protect their students. Draay accepted the seat, and while Lamar and Tokare agreed to this, it was but a means of keeping a closer look on him and learning more about the Padawan Massacre and the one Tokare sensed behind his rise to power. This person was Haazen, Krynda Draay's aide, and his reason was for the Covenant Shadows to be employed with more freedom.\nAs soon as Zayne Carrick got a hold of evidence to clear his name, he had two of his acquaintances deliver a message to Master Vandar and set out for Coruscant. The Master received a holographic transmission from Shel Jelavan and Jedi Knight Alek Squinquargesimus informing him of the events on Jebble, where Covenant Shadow Celeste Morne turned the power of the Muur Talisman against the Mandalorians, and he agreed to meet them at a cantina in the underlevels of Coruscant. Due to the arrest warrant put out for the Revanchists, Alek went by the name of Captain Malak.\nThough at first he was very skeptical, Master Lamar went with Tokare and met the two, and they were told about Raana Tey and her duel on Taris with Carrick, in which she revealed Krynda Draay as the head of the Covenant, shortly before dying. Alek also told them that Carrick was on his way to Coruscant with Sith artifacts from the Sanctum of the Exalted, a containment facility on Odryn where the Covenant had been conducting experiments. Lamar, however, knowing the importance of Krynda Draay, realized that even that was not enough to bring the matter before the Council, and told Alek that if they were to accuse her, the Order would be torn apart. Krynda Draay was one of the few remaining Sith War heroes, and she had been training Jedi for thirty years without the supervision of the Council, thus retaining their allegiance. Just as Master Vandar concluded that one of the Masters involved in the Padawan Massacre needed to speak up, Xamar stepped forward with Zayne in his grasp. The Khil resolved to confess and accept punishment in exchange for full immunity for Krynda, and a role in her rescue from the Rogue Moon Prophecy, which half the First WatchCircle had already been unable to escape.\nLamar led a contingent of Jedi on the Draay Estate but had to fall back when Haazen, a failed Padawan who secretly joined Exar Kun, hacked the system's of Admiral Saul Karath's fleet and fired on them. Taken by surprise, Lamar ordered the Jedi to fall back. The battle soon ended when Draay turned against Haazen and redirected orbital fire towards the Draay Estate, killing Haazen.\nLamar led a contingent of Jedi to Cathar knowing that the Revanchist and his followers would be there. Lamar confronted the Revanchist and Malak saying that there was nothing special about the Mandalorians and there was no need for the Jedi to be in the war. The Revanchist soon found a Mandalorian mask and after its discovery all the Jedi present received a vision of the Battle of Cathar.\nIn the vision the Mandalorians slaughtered the Cathar people without mercy. Cassus Fett ordered the survivors to be herded into the ocean and executed. One Mandalorian, the one who wore the recently discovered mask, was appalled with Fett's decision and protested it. Fett didn't listen and had that Mandalorian killed along with the rest of the Cathar. After the vision ended the Revanchist flew into a rage. Taking the name Revan he declared that he would take up the fallen Mandalorian's task and not stop until justice had been served. He kept the mask and swore not to take it off until the Mandalorians were defeated once and for all.\nMeanwhile, the revelation of what had occurred on Cathar convinced the Council to sanction the Revanchists' actions in the war as well as persuade a great number of Jedi to join them. But despite that Revan now had the Council's sanction, Lamar developed a very low view of everyone who joined him.\nLamar remained on Dantooine during the turbulent years of the Jedi Civil War. He thought Revan and Malak to be paragons of the ideals the Order sought to uphold, but after the Battle of Malachor V and the end of the war, they returned as Sith Lords, and Lamar blamed the Jedi Masters for their fall, most notably Kreia, for her unorthodox teachings. He was present at the trial of Meetra Surik, when the former Jedi General who had served under Revan in the war was banished from the Order. He believed that her isolation would give her time to think on what she had done, but when she returned in 3951 BBY, she still stood by her choice of going to war. After Revan's fall, Lamar grew more cynical and demanding toward Jedi apprentices; believing the Order could not afford any more failures, he accepted nothing but perfection from them. He learned that Revan and Malak had discovered on Dantooine some ancient ruins strong with the dark side, but he argued they had to be already corrupted to seek them out in the first place. After the capture of Darth Revan, he was the sole member of the Enclave Council who was against the notion of retraining him in the ways of the Jedi. He worried that his former self might return and reclaim the title of Dark Lord of the Sith, but his fears would not come to pass. As Revan grew once again strong in the Force, he remained true to the light side and brought an end to his own Sith Empire.\nAs of 3956 BBY, the Jedi at the Enclave helped in local security and talked through much of the family bickering inside the community. Lamar was actually in charge of their relations with the settlers, but he found it frustrating having to deal with sentients such as Ahlan Matale, rash and stupid enough to start a war over any imagined slight. As Revan was earning back his place in the Order, he was handed over the matter of resolving the feud between rich land-owners Ahlan Matale and Nurik Sandral, which degenerated with the disappearances of their sons Casus Sandral and Shen Matale.\nRevan and the crew of the Ebon Hawk were almost through searching for the Star Forge, when Darth Malak, who before being ruler of the Sith had been his Sith apprentice, attacked the Jedi Enclave on Dantooine via orbital bombardment. While many Jedi fell in the attack, Lamar and his fellow Council members survived the assault.\nAfter the Jedi Civil War, Lamar was the only member of the Dantooine Council not to participate in the ill-fated Conclave at Katarr. After that shocking event, Lamar and the remaining Jedi decided to go into exile. They hoped that by doing so this new Sith threat—which was hunting the remaining Jedi to extinction—would be lulled into a false victory and reveal itself. During the dark years of the First Jedi Purge, Lamar hid in the ruins of the Dantooine Enclave.\nMeetra Surik would later track down the surviving members of the Council. At that time, Lamar was participating in the restoration of the destroyed Dantooine Enclave. During his time in the ruins of the Enclave, he allowed himself to be captured by the mercenaries on Dantooine to deter them from attacking Khoonda. When Surik heard of his capture, she went to the mercenary base in the near by crystal cave, not knowing of Lamar's plan. After she slew his captors and released him, he bitterly criticized her and explained the situation. Both of them rushed back to Khoonda to help defend it. Lamar left to attack the mercenary camp, and returned in time to help Surik finish Azkul and his remaining mercenaries.\nAlthough Lamar's attitude towards Surik had grown more benevolent following her heroism in the Battle of Khoonda, he did not allow his feelings to alter his judgment when the newly established Council convened to pass judgment on her once more. Lamar and his fellow Masters, Kavar and Zez-Kai Ell, decided that Surik was too grave of a threat to the galaxy and, therefore, decided to permanently strip her of her connection to the Force. While attempting to carry out their sentence, Lamar and the other two council members were attacked by Kreia, who having had her own connection to the Force restored through Surik, had grown tired of both the Jedi and the Sith's ignorance and decided to end them as they posed a threat to her plans to silence the echoes of the Force's will. Kreia thus drained the Jedi Masters of their Life Force, killing them in their inability to let go of the Force as she herself and the Exile did.\nDuring his tenure as a Jedi Master, he was generally characterized by his brusque manner, stern demeanor, cautious disposition, and suspicious nature.\nLamar wished for all his students to be strong, capable Jedi. He also thought very low of those who went against the Council's will, as Kavar said Lamar was in low opinion of everyone who followed Revan to war.\nThough he was pessimistic and cynical, Lamar was one of the more active members of the Dantooine Council, often personally mediating disputes. Despite his harsh demeanor, he occasionally showed great concern for the safety of Padawans, as when he rebuked Revan for endangering his pupils in the Mandalorian Wars.\nMaster Lamar was a practitioner of the advanced Force forms and of many styles of lightsaber combat. By 3951 BBY he had mastered Ataru, Shien, Niman, and Juyo, which he also supplemented with aggressive Force powers, such as the dreaded Force lightning. He wielded a green lightsaber.\nThough he thought of it as a punishment reserved for only a few, he could use the Sever Force ability, which he attempted to use on Meetra Surik. His knowledge of the Force also included techniques able to stun or paralyze opponents, and advanced healing powers.\nVrook Lamar was voiced by Ed Asner in the video games Knights of the Old Republic and Knights of the Old Republic II: The Sith Lords.\nAs Lamar wielded a green lightsaber, he is identified as a possible Jedi Consular before he became a Master, if the lightsaber color-to-specialization mapping from the first KotOR game is to be considered canonical.\nIn Knights of the Old Republic II: The Sith Lords, Lamar can teach the player one of the Force or lightsaber forms he knows, depending on what order the Jedi Masters are found.\nWith the Force Power Force sight it is shown that Lamar only has a relatively weak light side alignment.\nIf you take the dark side path and duel Lamar he is considered one of the most difficult bosses in the game.\nDuring the attack on Khoonda, after choosing to help Azkul and his mercenaries against Khoonda, the Jedi Exile fights and kills Lamar.\nIf the Jedi Exile openly states that they wish to kill Lamar while he is still captive, Lamar escapes his holding cell after the mercenaries have been killed and states that he was never unarmed as he takes out his lightsaber. The Exile and their companions are forced to battle Lamar. When you come close to beating him, he notes that the Exile has regained their abilities and flees.\nAnother possibility is that the Exile pretends to aid the Khoonda militia before betraying them in battle, allowing Azkul to assassinate Administrator Terena Adare. Lamar, who is occupied in battle elsewhere, does not witness the betrayal, and assumes the Exile did her best in preventing the death of the Administrator. The two do not duel despite the mercenary control over Khoonda.\nShould the Exile save Khoonda, they later have an option to kill Lamar in the rebuilt Enclave. If the Exile has killed either Zez-Kai Ell or Kavar, they will be forced to fight the remaining Jedi Masters.\nInstead of fighting Lamar when taking the darker path, the Exile has the option of letting the mercenaries holding him captive take him to Nar Shaddaa, which will be admired by Kreia, Visas, and Hanharr.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3951_BBY",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dantooine_Jedi_Enclave_Council",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Khoonda_Militia",
  "/wiki/Lost_Jedi",
  "/wiki/Vrook_Lamar%27s_Padawan",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Great_Hunt_(Jedi)",
  "/wiki/Mandalorian_Wars",
  "/wiki/Jedi_Civil_War",
  "/wiki/Dark_Wars",
  "/wiki/Vandar_Tokare",
  "/wiki/Revan/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Conclave_at_Katarr",
  "/wiki/Jedi/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Kreia",
  "/wiki/Jedi_Enclave",
  "/wiki/Meetra_Surik",
  "/wiki/Sith_Triumvirate",
  "/wiki/Bala_Nisi",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Terentatek/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/3993_BBY",
  "/wiki/Korriban",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Shaela_Nuur",
  "/wiki/Duron_Qel-Droma",
  "/wiki/Guun_Han_Saresh",
  "/wiki/Qel-Droma_family",
  "/wiki/Ulic_Qel-Droma/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Kavar",
  "/wiki/Feln",
  "/wiki/Q%27Anilia",
  "/wiki/Raana_Tey",
  "/wiki/Xamar",
  "/wiki/Lucien_Draay",
  "/wiki/Jedi_Covenant",
  "/wiki/Jedi_Consular",
  "/wiki/Krynda_Draay",
  "/wiki/Taris/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Zayne_Carrick",
  "/wiki/Padawan/Legends",
  "/wiki/Padawan_Massacre",
  "/wiki/Rogue_Moon_Prophecy",
  "/wiki/Jedi_Tower",
  "/wiki/Hologram/Legends",
  "/wiki/First_WatchCircle",
  "/wiki/Planet/Legends",
  "/wiki/Battle_of_Jebble",
  "/wiki/Revanchist",
  "/wiki/Draay_Trust",
  "/wiki/Haazen",
  "/wiki/Covenant_Shadow",
  "/wiki/Shel_Jelavan",
  "/wiki/Darth_Malak",
  "/wiki/Jebble",
  "/wiki/Celeste_Morne",
  "/wiki/Muur_Talisman",
  "/wiki/Cantina/Legends",
  "/wiki/Jedi_strike_team",
  "/wiki/Mission_to_the_Jedi_Temple",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Sanctum_of_the_Exalted",
  "/wiki/Odryn",
  "/wiki/Khil",
  "/wiki/Draay_Estate",
  "/wiki/Saul_Karath",
  "/wiki/Cathar_(planet)",
  "/wiki/Battle_of_Cathar",
  "/wiki/Cathar/Legends",
  "/wiki/Cassus_Fett",
  "/wiki/Battle_of_Malachor_V",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Trial_of_Meetra_Surik",
  "/wiki/Jedi_General/Legends",
  "/wiki/Rakatan_ruins_(Dantooine)",
  "/wiki/Capture_of_Darth_Revan",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/3956_BBY",
  "/wiki/Sentience/Legends",
  "/wiki/Ahlan_Matale",
  "/wiki/Nurik_Sandral",
  "/wiki/Casus_Sandral",
  "/wiki/Shen_Matale",
  "/wiki/Ebon_Hawk",
  "/wiki/Star_Forge",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Attack_on_Dantooine_(Jedi_Civil_War)",
  "/wiki/First_Jedi_Purge",
  "/wiki/Zez-Kai_Ell",
  "/wiki/Khoonda",
  "/wiki/Azkul",
  "/wiki/Battle_of_Khoonda",
  "/wiki/File:CrystalCaveVrook.ogg",
  "/wiki/Force_form",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Form_IV/Legends",
  "/wiki/Form_V/Legends",
  "/wiki/Form_VI/Legends",
  "/wiki/Form_VII/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Sever_Force/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Force_Stun",
  "/wiki/Force_healing/Legends",
  "/wiki/Ed_Asner",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Force_sight",
  "/wiki/Terena_Adare",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Category:Audio_files_of_Vrook_Lamar",
  "/wiki/Shadows_and_Light",
  "/wiki/Star_Wars_Tales_23",
  "/wiki/Knights_of_the_Old_Republic_4",
  "/wiki/Knights_of_the_Old_Republic_6",
  "/wiki/Knights_of_the_Old_Republic_9",
  "/wiki/Galactic_Republic_Defense_Ministry_Daily_Brief_KD0092",
  "/wiki/Knights_of_the_Old_Republic_29",
  "/wiki/Knights_of_the_Old_Republic_31",
  "/wiki/Knights_of_the_Old_Republic_32",
  "/wiki/Knights_of_the_Old_Republic_33",
  "/wiki/Knights_of_the_Old_Republic_42",
  "/wiki/Timeline_8:_The_Jedi_Civil_War",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cartel_Market",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Knights_of_the_Old_Republic_30",
  "/wiki/3963_BBY",
  "/wiki/Atris",
  "/wiki/Lonna_Vash",
  "/wiki/Dorjander_Kace",
  "/wiki/3959_BBY"
 ]
}