{
 "name": "Vukorah",
 "display_name": "Vukorah",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Unbroken Clan",
      "Crimson Dawn"
     ]
    }
   ]
  }
 ],
 "content": "Vukorah was a human female who held the rank of general in the Unbroken Clan criminal syndicate. After the rival Mourner's Wail Syndicate bombed and killed Unbroken Clan soldiers on Chorgad, Vukorah attacked Mourner's Wail forces. Seeing the Unbroken Clan's leader to be ineffective, Vukorah eventually eliminated those with loyalties to the old line, becoming the leader of the syndicate.\nVukorah was part of the Corellia criminal syndicate Unboken Clan during the Imperial Era. She rose to the rank of General within the Syndicate.\nBetween 10 BBY and 3 BBY Vukorah personally interrogated and tortured bounty hunter Beilert Valance after he was caught in the Unbroken Clan sanctuary in Coronet City during the attempted murder of Krynthia prepared by Khamus, heirs, respectively, of the Unbroken Clan and the Mourner's Wail Syndacate, in which Valance took part along with the Nautolan Nakano Lash, the Trandoshan Bossk, Boba Fett and T'ongor. Valance didn't know the answers to the questions Vukorah kept asking him, which led the general to activate her Interrogator Droid to torture him. Valance evtnually was released or escaped from his imprisonment.\nBetween 3 ABY and 4 ABY Vukorah attacked, without her boss knowing, a group of smugglers of the Mourner's Wail Syndicate at the Smugglers' Refueling Station, in the Kessel sector with her henchmen and killed the Iktotchi criminal who was leading said operation. In that moment she received a call from Nakano Lash, who inteded to come in terms with her surrender; Vukorah decides to stall the call, trace the signal and order her henchman to ask Lash about Cadeliah, Khamus and Krynthia's daughter, in that moment under the Nautolan's protection.\nLash's transmission's trace came from the planet Ruusan so she went there searching for Lash, Cadeliah and Beilert Valance, planning to kill them all. Then, after she had found Nakano Lash's freighter, one of her henchmen fired a hit on the ship's reactors, causing Lash's death and Boba Fett, who also was inside the freighter, Valance and Cadeliah to leave the exploding ship. When, despite the explosions, Broken Wing and Slave I's energy signatures appeared on the sensors proving the survival of some of the people involved in the disaster, Vukorah promised herself to hunt down the little girl wherever she would go.\nVukorah decided then to hire the Gand findsman Zuckuss and his droid partner 4-LOM to find Valance and Cadeliah, dead or alive, for her and promised to pay them enough to repay the loss of money caused by failing to capture the Rebel leader Han Solo.\nAfter that she was seen on Corellia interrogating a Sullustan smuggler named Remy who aquired a specialized hyperdrive manufactured by the Nihil marauder during the High Republic Era. After Remy told the General to pursue Sana Starros instead, whom he made contact with the day before, and to ask the other smuggler the questions she needed, Vukorah killed the Sullustan with her knife. She then took Remy's datapad, which contained information about the Path Engine, and went out in search for Starros. At the door of the hideout, Chelli Lona Aphra detonated a Detonite Ring, which hurt Vukorah and sent her unconscious. After that Aphra proceeded to take the Datapad from Vukorah, who revealed to actually be awake and pointed her blaster at Aphra, only to be disarmed by Starros, who was with Aphra at the moment; the pair got away while the Unbroken Clan's guards were overthrowed by other Detonite Rings.\nVukorah the followed the two on the planet Dol'har Hyde, where Remy first found the Path Engine, and started blasting on the tree where they were exploring the wreckage of a Nihil ship. She then threatened Aphra and Starros to kill them if they don't surrender and Aphra responded faking a surrender and then escaped right before Vukorah could kill her with her ship's blasters. Vukorah, who thought no one could have survived the explosion that followed the shot, headed towards the planet Midarr, where an Ortolan bartender from Dol'har Hyde told her the hyperdrive engine had been sent.\nOn Midarr, Vukorah broke in the De'Rruyet Center with a squad of Unboken Clan's henchmen to retrieve the Path Engine. She then killed a technician called Cadil, who tried to inform her that the engine wasn't operational, threatened to kill a person every five minutes until the ship wasn't fully-functional and pointed her blaster at Beol De'Rruyet, leader of the project.Chelli Aphra then entered the room, revealing to be still alive, and proposed to fix the engine herself, because, being an expert in ancient technology, she was the only one capable of fixing the ship before the Empire could arrive to arrest the Unbroken Clan members. Vukorah accepted the deal, and promised Aphra that she would have been the last person to be killed in the room. Meanwhile Sana Starros was allerting Imperial Stormtroopers and making hostages escape from the building. In the moment when Vukorah decided to stop waiting for Aphra to fix the ship and kill her, the Stormtroopers entered in the building started firing on the Unbroken Clan. Aphra managed to escape with the crystal core of the Path Engine with Sana Starros and, when Vukorah tried to follow them, the smuggler shot her in the eye, leaving Vukorah scarred and wounded.\nVukorah returned to Corellia to recover from her wounds when, entering her house, on of her guards is killed by the Zabrak assassin Deathstick, who was already in the house. Vukorah then killed her other guard, because he suggested to go into an unsafe location. Deathstick the officially invited Vukorah to represent her syndicate at the auction for the carbonite-encased Han Solo, hosted by the criminal syndicate Crimson Dawn on the planet Jekara, because the actual leader of the Unbroken clan locked himself away mourning. Vukorah, reluctant, accepted the invite.\nShe then participated at the event, staying even after Darth Vader's attacked Crimson Dawn's leader Qi'ra to retrieve Solo. Margo, Qi'ra's assistant, noticed that and Vukorah, while drinking spice wine, affirmed that's \"her kind of party\" and was looking forward to more mayhem.\nAfter that Qi'ra invited Vukorah into a private meeting, proposing her to ally herself and the Unbroken Clan to unite all the criminal underworld: to do this, Vukorah needs to take the leadership of her syndicate, which she can't take because is not related to the Unbroken Clan's dynasty's bloodline. Qi'ra replied showing Vukorah a mysterious object in a box, making Vukorah accept her request.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Template:Expand",
  "/wiki/Template:Cleanup",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Unbroken_Clan",
  "/wiki/Crimson_Dawn",
  "/wiki/General",
  "/wiki/Mourner%27s_Wail_Syndicate",
  "/wiki/Bombing_on_Chorgad",
  "/wiki/Death",
  "/wiki/Soldier",
  "/wiki/Chorgad",
  "/wiki/Attack_on_a_spice_run",
  "/wiki/Unidentified_Unbroken_Clan_Grand_Leader",
  "/wiki/Corellia",
  "/wiki/Imperial_Era",
  "/wiki/10_BBY",
  "/wiki/3_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Bounty_hunter",
  "/wiki/Beilert_Valance",
  "/wiki/Unbroken_Clan_sanctuary",
  "/wiki/Coronet_City",
  "/wiki/Krynthia",
  "/wiki/Khamus",
  "/wiki/Nautolan",
  "/wiki/Nakano_Lash",
  "/wiki/Trandoshan",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/Boba_Fett",
  "/wiki/T%27ongor",
  "/wiki/Interrogator_droid",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Smugglers%27_Refueling_Station",
  "/wiki/Kessel_sector",
  "/wiki/Iktotchi",
  "/wiki/Cadeliah",
  "/wiki/Ruusan",
  "/wiki/Nakano_Lash%27s_720_light_freighter",
  "/wiki/Reactor",
  "/wiki/Broken_Wing",
  "/wiki/Slave_I",
  "/wiki/Gand",
  "/wiki/Findsman",
  "/wiki/Zuckuss",
  "/wiki/Droid",
  "/wiki/4-LOM",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Han_Solo",
  "/wiki/Unbroken_Dagger",
  "/wiki/Sullustan",
  "/wiki/Smuggler",
  "/wiki/Remy_(smuggler)",
  "/wiki/Path_engine",
  "/wiki/Nihil",
  "/wiki/High_Republic_Era",
  "/wiki/Sana_Starros",
  "/wiki/Datapad",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Detonite_ring",
  "/wiki/Blaster",
  "/wiki/Dol%27har_Hyde",
  "/wiki/Midarr",
  "/wiki/Ortolan",
  "/wiki/Hyperdrive",
  "/wiki/De%27Rruyet_Center",
  "/wiki/Cadil",
  "/wiki/Beol_De%27Rruyet",
  "/wiki/Archaeologist",
  "/wiki/Galactic_Empire",
  "/wiki/Stormtrooper",
  "/wiki/Crystal_core",
  "/wiki/Zabrak",
  "/wiki/Assassin",
  "/wiki/Deathstick",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Jekara",
  "/wiki/Anakin_Skywalker",
  "/wiki/Qi%27ra",
  "/wiki/Margo",
  "/wiki/Spice_wine",
  "/wiki/Category:Images_of_Vukorah",
  "/wiki/Bounty_Hunters_3",
  "/wiki/Bounty_Hunters_5",
  "/wiki/Bounty_Hunters_6",
  "/wiki/Bounty_Hunters_7",
  "/wiki/Bounty_Hunters_8",
  "/wiki/Doctor_Aphra_(2020)_7",
  "/wiki/Doctor_Aphra_(2020)_8",
  "/wiki/Doctor_Aphra_(2020)_9",
  "/wiki/Doctor_Aphra_(2020)_10",
  "/wiki/Doctor_Aphra_(2020)_11",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Doctor_Aphra_(2020)_12",
  "/wiki/Bounty_Hunters_16",
  "/wiki/Bounty_Hunters_17",
  "/wiki/Bounty_Hunters_20",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Bounty_Hunters_22",
  "/wiki/Bounty_Hunters_23",
  "/wiki/Bounty_Hunters_24",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Bounty_Hunters_27",
  "/wiki/Bounty_Hunters_28",
  "/wiki/Bounty_Hunters_31",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/StarWars.com"
 ]
}