{
 "name": "Vult",
 "display_name": "Vult",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Dorin government"
     ]
    }
   ]
  }
 ],
 "content": "Vult was a male Kel Dor customs officer stationed in 43 ABY at the spaceport in the city of Dor'shan on the planet Dorin, where he served as a sergeant. The Kel Dor officer inspected the Jade Shadow, the ship of the recently exiled Jedi Grand Master Luke Skywalker and his son, Jedi Knight Ben Skywalker, when they landed on Dorin to find out more about Jacen Solo's fall to the dark side of the Force. Sergeant Vult found that all items on board the vessel were permissible, which allowed the Skywalkers to visit Dorin.\nVult was a male Kel Dor who lived on the Expansion Region planet Dorin in 43 ABY. Vult served as a customs officer for the government of Dorin and held the rank of sergeant during that time. In 43 ABY, the exiled Jedi Grand Master Luke Skywalker and his son, Jedi Knight Ben Skywalker, visited Dorin and landed in the capital city, Dor'shan, in their ship, the Jade Shadow. While Vult inspected the ship, Lieutenant Dorss asked the Skywalkers for the purpose of their visit. Luke Skywalker told the Lieutenant that he intended to speak with the Baran Do, in hopes of finding out more about Jacen Solo's fall to the dark side of the Force and transformation into Darth Caedus. After Vult had completed the inspection of the Shadow, he reported to Dorss that all items on the ship corresponded with the categorical limits. The Lieutenant then allowed the Skywalkers to visit the Baran Do.\nVult served as a customs officer with Lieutenant Dorss; he inspected vessels that landed at the spaceport in Dor'shan. To do so, he used a baton-like instrument, connected via cable to a backpack that he wore, that possessed several sensor intakes along its length. The Kel Dor was rather thin, had no hair, and had eyes that were intelligent and Human-like in appearance. He wore a black robe with sky-blue and black patterns on it as well as a breath mask to protect him from carbon dioxide, nitrogen, and oxygen, which were fatal to a Kel Dor. Vult was able to speak his native Kel Dor.\nVult made his only appearance briefly as a minor character in the 2009 novel Fate of the Jedi: Outcast, written by Aaron Allston. Outcast is the first book of the Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Customs_official/Legends",
  "/wiki/Vult_Skerris",
  "/wiki/Galactic_Empire",
  "/wiki/Pilot",
  "/wiki/Gender/Legends",
  "/wiki/Dorin/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Fate_of_the_Jedi:_Outcast",
  "/wiki/43_ABY",
  "/wiki/Spaceport/Legends",
  "/wiki/City/Legends",
  "/wiki/Dor%27shan",
  "/wiki/Planet/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Jade_Shadow",
  "/wiki/Starship/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Ben_Skywalker",
  "/wiki/Darth_Caedus",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Skywalker_family/Legends",
  "/wiki/Expansion_Region/Legends",
  "/wiki/Time/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Dorss",
  "/wiki/Baran_Do/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Sensor/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Human/Legends",
  "/wiki/Color/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Antiox_breath_mask",
  "/wiki/Carbon_dioxide/Legends",
  "/wiki/Nitrogen/Legends",
  "/wiki/Oxygen/Legends",
  "/wiki/Language/Legends",
  "/wiki/Kel_Dor_(language)/Legends",
  "/wiki/2009",
  "/wiki/Aaron_Allston",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Outcast_(audiobook)",
  "/wiki/The_New_Essential_Guide_to_Alien_Species",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}