{
 "name": "Vurrulf",
 "display_name": "Vurrulf",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Republic",
      "Combined Defense Forces of the New Republic",
      "New Republic Starfighter Command",
      "Rogue Squadron",
      "Combined Defense Forces of the New Republic",
      "New Republic Starfighter Command",
      "Rogue Squadron",
      "New Republic Starfighter Command",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Vurrulf was a Klatooinian starfighter pilot in the New Republic's elite Rogue Squadron. While the Rogues were hunting the Invid pirates in 11 ABY, Vurrulf served as a member of the squadron's Three Flight. New Republic Intelligence learned that the Invids would be attacking a luxury liner near the moon Alakatha, and Rogue Squadron laid in wait in-system before springing their trap on a group of Invid ugly starfighters. Vurrulf came out of the battle unscathed, and the victorious Rogues returned to the New Republic's capital world of Coruscant.\nVurrulf, a Klatooinian, was a starfighter pilot in the New Republic's Rogue Squadron in 11 ABY. The Rogues were a twelve-person squadron of X-wing fighter pilots who served New Republic Starfighter Command. Vurrulf flew in the squadron's Three Flight along with wingmate Ghufran, as well as Rogue Ten, Ooryl Qrygg; and Rogue Nine, Captain Corran Horn—the flight group's leader. The Rogues were commanded overall by Rogue Leader, Colonel Tycho Celchu. 11 ABY saw Rogue Squadron assigned to hunt for the elusive pirate group known as the Invids, who managed to elude every New Republic attempt to capture them, leaving the Rogues with about a week of down time in between raids.\nWhen New Republic Intelligence received a tip that the Invids would be attacking the luxury liner Glitterstar near the moon Alakatha, the Rogues were ferried almost all of the way to Alakatha's star system aboard the MC80 Star Cruiser Home One. They finally entered the system using micro-jumps, and their X-wings went to ground on several large asteroids near the moon. When the modified bulk cruiser Booty Full arrived in-system and dispatched numerous ugly starfighters to attack the Glitterstar, Rogue Squadron intercepted and engaged them. Horn told Three Flight to pick their targets carefully, and after their enemies' ranks had been thinned considerably, Vurrulf covered Horn as the captain pursued and destroyed an ugly tri-fighter.\nThe Booty Full quickly surrendered, and with all of the uglies defeated, Home One and two New Republic Victory-class Star Destroyers entered the system to collect both the Rogues and the defeated bulk cruiser. Vurrulf and the Rogues underwent a debriefing aboard Home One while en route to the New Republic's capital planet, Coruscant, and upon arrival, they all landed their X-wings in a hangar. Not long afterward, Vurrulf's flight leader, Corran Horn, left the squadron to train as a Jedi in Master Luke Skywalker's New Jedi Order.\nVurrulf served in Rogue Squadron, an elite team of pilots that included the best in the entire New Republic Defense Force. The Klatooinian survived at least one encounter with the Invid pirates, coming out of the engagement unscathed.\nVurrulf appears briefly in the first chapter of Michael A. Stackpole's 1998 novel I, Jedi. Although Rogue Squadron reappears later in the book, it is not stated whether or not Vurrulf is flying with them. I, Jedi is Vurrulf's only appearance or mention in Star Wars canon, and the book does not identify the character's sex.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Klatooinian/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/New_Republic_Starfighter_Command/Legends",
  "/wiki/Rogue_Squadron/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Hunting/Legends",
  "/wiki/Invids",
  "/wiki/Pirate/Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Three_Flight",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Glitterstar",
  "/wiki/Moon/Legends",
  "/wiki/Alakatha/Legends",
  "/wiki/K%27vath_system",
  "/wiki/Battle_of_Alakatha",
  "/wiki/Ugly/Legends",
  "/wiki/Starfighter_combat/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/X-wing_starfighter/Legends",
  "/wiki/Wingmate/Legends",
  "/wiki/Ghufran",
  "/wiki/Rogue_Ten/Legends",
  "/wiki/Ooryl_Qrygg",
  "/wiki/Rogue_Nine",
  "/wiki/Captain/Legends",
  "/wiki/Corran_Horn",
  "/wiki/Flight_group/Legends",
  "/wiki/Flight_leader",
  "/wiki/Rogue_Leader/Legends",
  "/wiki/Colonel/Legends",
  "/wiki/Tycho_Celchu/Legends",
  "/wiki/Standard_week/Legends",
  "/wiki/Time/Legends",
  "/wiki/Luxury_liner/Legends",
  "/wiki/MC80_Home_One_type_Star_Cruiser",
  "/wiki/Home_One/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Precision_hyperspace_jump",
  "/wiki/Asteroid/Legends",
  "/wiki/Bulk_cruiser/Legends",
  "/wiki/Booty_Full",
  "/wiki/Clutch_(fighter)",
  "/wiki/Victory-class_Star_Destroyer/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Michael_A._Stackpole",
  "/wiki/1998",
  "/wiki/I,_Jedi",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/Gender/Legends",
  "/wiki/The_New_Jedi_Order_Sourcebook",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream"
 ]
}