{
 "name": "Vydel_Dir%27Nul",
 "display_name": "Vydel Dir'Nul",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Dark Jedi"
     ]
    }
   ]
  }
 ],
 "content": "Vydel Dir'Nul was a Human female Jedi Knight who lived during the Clone Wars. One month before the initiation of the Clone Wars, the Jedi Council assigned Dir'Nul to serve as a bodyguard for an individual. During her mission, Dir'Nul fell in love with the freighter pilot Ash B'risko and entered into a romantic relationship with him. However, she later caught B'risko in the arms of a Twi'lek female. As she slew B'risko and the woman, Dir'Nul created the personality of the male Dark Jedi Kardem, whom she believed was a different individual. After the murders, Dir'Nul was unaware of her split personality or that she was responsible for the murder of B'risko.\nWhen the Clone Wars began, Dir'Nul refused to become a general in the Grand Army of the Republic, instead devoting her resources to tracking Kardem. After traveling to the planet Perilious, she killed three more Twi'leks, acting as Kardem. Six months later, as Dir'Nul investigated their murders, she was confronted by a male Jedi, whom she assumed was Kardem. After the Jedi defeated her in a lightsaber duel, Dir'Nul changed to the Kardem personality and attacked him with Force lightning. The Jedi explained that the Council had sent him after Dir'Nul, and then attempted to kill her. However, she intercepted the attack and killed the Jedi. After his death, Dir'Nul reverted to her original personality and vowed to stop Kardem. Eventually, a bounty was placed on her alter ego of Kardem, and she was captured by the Mandalorian bounty hunter Feskitt Bobb.\nVydel Dir'Nul, a Human female, was a Jedi Knight who served during the final years of the Galactic Republic. In 22 BBY, Dir'Nul was assigned by the Jedi Council to serve as a bodyguard for an individual. During the mission, she fell in love with a freighter pilot named Ash B'risko. She entered a romantic relationship with the pilot, going against the Jedi Code. However, she eventually discovered B'risko in the arms of a female Twi'lek dancer. Dir'Nul murdered both B'risko and the Twi'lek, and in doing so, created the personality of a male Dark Jedi named Kardem, whom she believed was a different individual. After the Clone Wars—the Republic's conflict with the Confederacy of Independent Systems—began at the First Battle of Geonosis, Dir'Nul refused to return to the Jedi and become a general in the Republic Army. Dir'Nul buried B'risko and began tracking Kardem in the Outer Rim, killing two more Twi'lek females while acting as the Dark Jedi. By the time she arrived on the planet Perilious—which was known for its Twi'lek slave tradings—Dir'Nul had slain three more Twi'lek females as Kardem.\nSix months later, while Dir'Nul was investigating the murders of the three Twi'leks, a robed man with a lightsaber revealed himself to her, and she attacked him, assuming he was Kardem. After a brief lightsaber duel, the man gained the upper hand and defeated Dir'Nul. As he informed her that he was going to bring her back to the Jedi Council, Dir'Nul reverted to the Kardem personality—who was unaware that he was Dir'Nul—and unleashed bolts of Force lightning against her attacker. After the Jedi used Dir'Nul's name while pleading with her to stop attacking him, Kardem told the man he was going to kill him. The man revealed that he was a Jedi and that he had been tracking Dir'Nul for six months. The Jedi ignited his lightsaber and used the Force to throw it at Dir'Nul, determined to bring her to the Council dead or alive. However, Dir'Nul, who was still mentally Kardem, used the Force to stop the lightsaber midflight and attacked the Jedi with more lightning. As Kardem was torturing the Jedi, he claimed that he did not know Dir'Nul and threw the lightsaber back at the Jedi, cutting him in half.\nDir'Nul reverted to her original personality following her attacker's death and was shocked to learn that Kardem had killed a Jedi. She vowed to stop Kardem no matter what it took, unaware that she was the one who had actually committed the crime. A bounty was eventually placed on Dir'Nul's split personality of Kardem. The serial killer was captured by the Mandalorian bounty hunter Feskitt Bobb.\nThe Human female Vydel Dir'Nul served the Jedi Order as a Jedi Knight. During her mission to protect an individual, she fell in love with the pilot Ash B'risko, willingly going against the Jedi Code. When she discovered B'risko in a Twi'lek dancer's arms, Dir'Nul was overcome with anger, and she killed both of them immediately. During the act of murdering B'risko and the Twi'lek, Dir'Nul unknowingly created an alter ego of a male Dark Jedi named Kardem. After burying B'risko, she desired answers and vengeance, and dedicated herself to capturing Kardem.\nFollowing the initiation of the Clone Wars, Dir'Nul was not interested in fighting for the Republic's politicians, whom she viewed as greedy and self-serving, and so refused to serve as a Jedi General. Neither Dir'Nul nor Kardem was aware of the other's existence. During her search for Kardem, she continued her vendetta against Twi'lek females, violently murdering them as Kardem. After she reverted to her normal personality, Dir'Nul would hear Kardem's voice, which would degrade Twi'leks and taunt her. After she was defeated in lightsaber combat by the male Jedi, she adopted the Kardem personality and began torturing him. When Kardem killed the Jedi, Dir'Nul reverted to her original personality and vowed to stop Kardem, regardless of how long it took and no matter what she had to sacrifice.\nDir'Nul possessed the ability to move objects with the Force; she used this ability against the male Jedi sent by the Council to apprehend her. When Dir'Nul switched her personality to that of the serial killer Kardem, she possessed dark-side Force powers, including Force lightning. She used this power against numerous Twi'leks and against the male Jedi. However, when Dir'Nul dueled the Jedi sent to apprehend her, he was able to best her, and he noted that she had let her skills at lightsaber combat deteriorate. After the Jedi threw his lightsaber at her, she was able to stop it midflight. Dir'Nul herself wielded a lightsaber containing an orange crystal.\nVydel Dir'Nul and her split personality of Kardem first appeared in the short comic \"Dark Journey,\" which was featured in Star Wars Tales 17 and written by Jason Hall. In the comic, she was drawn by Ben Templesmith. The story was later compiled into a trade paperback version and republished in Star Wars Tales Volume 5. Plausible stories in Star Wars Tales 1–20 were deemed S-canon until referenced in a non-Tales source, at which point the subject matter was elevated to C-canon status. Dir'Nul was first referenced outside Tales in the article The History of the Mandalorians, written by Abel G. Peña and published in Star Wars Insider 80. Her split personality of Kardem was used as part of the background for the Mandalorian Feskitt Bobb. Her appearance in The History of the Mandalorians elevated Dark Journey to C-canon. Dir'Nul later received an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Black",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Standard_month/Legends",
  "/wiki/First_Battle_of_Geonosis/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Bodyguard/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Ash_B%27risko",
  "/wiki/Unidentified_Twi%27lek_female_(Kardem%27s_first_Twi%27lek_victim)",
  "/wiki/Death/Legends",
  "/wiki/Multiple_personality_disorder",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Perilious",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Unidentified_Jedi_(Kardem%27s_victim)",
  "/wiki/Jedi/Legends",
  "/wiki/Duel_on_Perilious",
  "/wiki/Force_lightning/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Feskitt_Bobb",
  "/wiki/Time/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Torture/Legends",
  "/wiki/Sai_tok/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Orange",
  "/wiki/Lightsaber_crystal",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Dark_Journey_(comic)",
  "/wiki/Star_Wars_Tales_17",
  "/wiki/Jason_Hall",
  "/wiki/Ben_Templesmith",
  "/wiki/Star_Wars_Tales_Volume_5",
  "/wiki/Star_Wars_Tales_1",
  "/wiki/Star_Wars_Tales_20",
  "/wiki/Canon",
  "/wiki/The_History_of_the_Mandalorians",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Star_Wars_Insider_80",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Category:Images_of_Vydel_Dir%27Nul",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee"
 ]
}