{
 "name": "Walif_Merv",
 "display_name": "Walif Merv",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Dac"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quarren"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Walif Merv was a male Quarren who lived on the planet Mon Calamari during the Galactic Civil War. After the Galactic Empire enacted a project to prevent Mon Calamari from supplying starships to the Alliance to Restore the Republic, a team of Imperial saboteurs disrupted mining operations in the city Morjanssik and the Alliance dispatched a group of agents to the city, investigate the sabotage. Planning to ambush the Rebels, the Imperial infiltrators—who were disguised as Mon Calamari—bribed Merv to lure the Rebels out of Morjanssik's heavily-defended administrative sector. Merv asked the agents if they would like him to show them around the Long Drink, a local bar, and the agents accepted his offer. The Rebels were subsequently attacked in the bar, but were able to escape.\nThe Imperials later murdered Moren Chonk, the Chief Manager of Morjanssik, and the Rebels were blamed for the crime and imprisoned. Due to the fact that he believed that a Mon Calamari had hired him to lure the Rebels to the bar, Merv began to suspect that some Mon Calamari elements were setting the agents up so that the Mon Calamari Council would renege on its deal to provide support to the Rebel Alliance. Merv therefore broke the agents out of jail and escorted the Rebels to the Morjanssik docks, to confront the Imperials.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Dac",
  "/wiki/Quarren/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Calamari_Project",
  "/wiki/Starship/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Mining/Legends",
  "/wiki/City/Legends",
  "/wiki/Morjanssik",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Long_Drink",
  "/wiki/Death/Legends",
  "/wiki/Moren_Chonk",
  "/wiki/Chief_Manager",
  "/wiki/Mon_Calamari_Council",
  "/wiki/Death_in_the_Undercity",
  "/wiki/West_End_Games",
  "/wiki/Classic_Adventures:_Volume_Three"
 ]
}