{
 "name": "Wam_Lufba",
 "display_name": "Wam Lufba",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuzzum"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "The Yuzzum male Wam Lufba, nicknamed \"Bam,\" was born on the moon of Endor, but left on a visiting starship. He ended up being shanghaied into working as a pest exterminator at the palace of the Hutt crime lord Jabba Desilijic Tiure on the planet Tatooine. Lufba was present in Jabba's throne room in 4 ABY during a performance by the Max Rebo Band and witnessed the enslaved dancer Oola being dropped into Jabba's rancor pit. The Yuzzum then witnessed Princess Leia Organa, disguised as the bounty hunter Boushh, negotiate with the Hutt over the bounty on the Wookiee Chewbacca.\nWam Lufba, who also went by the nicknamed \"Bam,\" was a Yuzzum male from the Forest Moon of Endor. Lufba left the moon on a visiting starship and ended up on the desert planet Tatooine where the Yuzzum was shanghaied into working as a pest exterminator at the palace of the Hutt crime lord Jabba Desilijic Tiure. The pests that Lufba had to deal with could be quite dangerous, but the perceived innocuousness of the Yuzzum allowed him to overhear the various machinations of the lowlifes that made up Jabba's court without arousing suspicion.\nIn 3 ABY, the bounty hunter Boba Fett received custody of the smuggler Han Solo after Solo was frozen in carbonite. As Jabba had placed an outstanding bounty on the smuggler head, Fett promised to deliver him to the Hutt, but before he could fulfill this agreement, the Crimson Dawn crime syndicate stole Solo. After learning of this, Jabba put a bounty on Fett's head, so the bounty hunter traveled to Jabba's Palace to confront the Hutt. Fett was greeted at the entrance to the palace by the Hutt's majordomo, Bib Fortuna.\nAfter Fortuna informed Fett that Jabba was not available as he was attending the Crimson Dawn's auction for Solo, Wam Lufba and a crowd made up of other members of the Hutt's court emerged behind the majordomo. The group aimed their weapons at Solo as Fortuna suggested that Fett leave, but the bounty hunter instead reminded Lufba and the others of his deadly reputation. When faced with the reality of potentially dying only for the sake of Fortuna, Lufa and the others silently lowered their weapons. Fett then moved through the crowd with Fortuna in order to see the invitation.\nIn 4 ABY, Lufba was stood beside Jabba's throne in the palace during a performance of the song \"Jedi Rocks\" by the Max Rebo Band. When the Hutt demanded that they repeat the song, the Yuzzum danced along to the second performance until it was interrupted by Jabba, who dropped the enslaved dancer Oola into a pit below the throne room after she refused his advances. The court then crowded round to watch as Oola was eaten by Jabba's pet rancor, Pateesa.\nOnce the spectacle was over, the court's attention was drawn to the room's entry way by the sound of blaster fire. The source was revealed to be Princess Leia Organa, disguised as the bounty hunter Boushh, who entered with the Wookiee Chewbacca as her prisoner. While the exterminator watched from beside the throne, Organa demanded double what Jabba was offering as the bounty for the Wookiee, and then threatened the Hutt and his court with a thermal detonator to get her way. While most of the court cowered, the Hutt merely laughed and counter offered with an increased, but not doubled amount. This satisfied Organa, who deactivated the detonator and let Chewbacca be led away. The next day, Jabba and much of his court were killed by Organa and her allies above the Great Pit of Carkoon.\nWam Lufba had brown hair, yellow eyes, and fair skin. He was perceived as innocuous by the rest of Jabba's court.\nLufba used a blaster rifle and wore brown shoes. He also sometimes wore a pair of black shoes.\nThe character of Wam Lufba was created for the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. A prototype model of the character, who was known during production as just \"Yuzzum,\" was built for the film, with Lufba's design being inspired by early concept art of the Ewok species which depicted them with much longer legs. The Yuzzum was given a Star Wars Legends name and a backstory by Tim Veekhoven, writing as \"Sompeetalay,\" in the StarWars.com Hyperspace feature What's The Story?. The name, which was inspired by the British pop band Wham!, and parts of the backstory were then confirmed to be canon in the reference book Ultimate Star Wars released in 2015.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wam_Lufba",
  "/wiki/Wam_Lufba/Legends",
  "/wiki/Endor",
  "/wiki/Yuzzum",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Moon",
  "/wiki/Starship",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Throne",
  "/wiki/4_ABY",
  "/wiki/Max_Rebo_Band",
  "/wiki/Slavery",
  "/wiki/Oola",
  "/wiki/Rancor",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Bounty_hunter",
  "/wiki/Boushh",
  "/wiki/Bounty",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Endor_(planet)",
  "/wiki/Desert",
  "/wiki/3_ABY",
  "/wiki/Boba_Fett",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Carbonite",
  "/wiki/Crimson_Dawn",
  "/wiki/Majordomo",
  "/wiki/Bib_Fortuna",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Music",
  "/wiki/Jedi_Rocks",
  "/wiki/Pateesa",
  "/wiki/Blaster",
  "/wiki/Thermal_detonator",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Blaster_rifle",
  "/wiki/Clothing",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Ewok",
  "/wiki/Species",
  "/wiki/Limb",
  "/wiki/Star_Wars_Legends",
  "/wiki/Tim_Veekhoven",
  "/wiki/StarWars.com",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/What%27s_The_Story%3F",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/2015",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Databank_A-Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Star_Wars:_Chronicles",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Blogs"
 ]
}