{
 "name": "Wamtra",
 "display_name": "Wamtra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Nemen Ull"
     ]
    }
   ]
  }
 ],
 "content": "Wamtra was a male Rodian Jedi who served the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars.\nSent to the Jedi Temple on Coruscant following the discovery of his Force-sensitivity, Wamtra began the several year process of training in the classrooms of the Temple. When the Jedi Master Nemen Ull discovered his talents, Ull quickly decided to take the Rodian on as a Padawan.\nAt the outbreak of the Clone Wars, Wamtra was made a Jedi Commander within the Grand Army of the Republic and accompanied his master on many fronts. Several months into the war they were sent to the planet Argul, where they participated in the Battle of Argul. Leading the defense of the docking towers at the capitol's spaceport, Wamtra and his master vigorously held off the Separatist Droid Army. During the fighting, Master Ull went on the search for a missing child as he evacuated an apartment complex. While inside the complex, Armored Assault Tanks unleashed their payloads on the building, killing Ull. Sensing his master's death through the Force, Wamtra lost concentration and was forced to fall back within the ranks of clone troopers. After the Republic secured a victory, Wamtra considered leaving the Order as he was still haunted by his master's demise.\nWamtra made his only appearance in Only the Force, a scenario for the Star Wars Roleplaying Game. In that, the player playing as Wamtra can choose Wamtra's sex. However, he is described as male in the biographies of the other playable characters, so that can be assumed to be his canonical sex.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Nemen_Ull",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Argul",
  "/wiki/Battle_of_Argul",
  "/wiki/Spaceport/Legends",
  "/wiki/Separatist_Droid_Army/Legends",
  "/wiki/Armored_Assault_Tank",
  "/wiki/The_Force/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Only_the_Force",
  "/wiki/Star_Wars_Roleplaying_Game"
 ]
}