{
 "name": "Wandau",
 "display_name": "Wandau",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Klatooine"
     ]
    },
    {
     "name": "Died",
     "values": [
      "67 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Klatooinian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.9 meters"
     ]
    }
   ]
  }
 ],
 "content": "Wandau was a male Klatooinian who worked for Captain Ellin Lah onboard the Woebegone and was one a group of traders who traveled through the Auril sector, where it supplied several worlds with seafood.\nWandau once served as a a bodyguard for the Hutts on Nal Hutta until he decided to quit and join Ellin Lah's crew. He had once encountered a Jedi, who used a mind trick on the Klatooinian for honorable purposes.\nAs Wandau and his comrades set out on a journey to Ithor, they realized that a Muun was hiding in the stowaway onboard the Woebegone. The Muun was revealed to be Darth Plagueis and he asked the entire crew to take him back to his homeworld. After Wandau and the others came to the consensus and rejected his offer, the Sith Lord attacked. Wandau tried to take advantage of taking a seemingly defenseless Plagueis after the Muun threw his lightsaber at Semasalli and Blir', but Plagueis caught him with Force lightning. The impact hurled Wandau against the ceiling, paralyzing him from the waist down. He was still able to speak to Plagueis, mistaking him for a Jedi. To him, the Muun was a disgrace to the Order which he served; he could've just used the Force in a more peaceful manner. Plagueis, uncaring, replied in Wandau's native language that he was weak-willed and useless before putting him out of his misery.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Klatooine/Legends",
  "/wiki/67_BBY",
  "/wiki/Klatooinian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Captain/Legends",
  "/wiki/Ellin_Lah",
  "/wiki/Woebegone",
  "/wiki/Auril_sector/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Ithor/Legends",
  "/wiki/Muun/Legends",
  "/wiki/Darth_Plagueis/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Telekinesis/Legends#Saber_Throw",
  "/wiki/Lightsaber/Legends",
  "/wiki/Semasalli",
  "/wiki/Blir%27",
  "/wiki/Force_lightning/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Klatooinian_(language)",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Wandau",
  "/wiki/Darth_Plagueis_(novel)",
  "/wiki/Darth_Plagueis_(audiobook)"
 ]
}