{
 "name": "Waran",
 "display_name": "Waran",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Matukai",
      "Convocation of the Force"
     ]
    }
   ]
  }
 ],
 "content": "Waran was a Kel Dor individual who served as the Matukai's representative on the Convocation of the Force on the moon Jedha during the High Republic Era. At a meeting of the Convocation around 382 BBY, Waran attempted to attack a Yacombe envoy who had traveled to Jedha to apply for membership onto the Convocation. After the allegiance of the Yacombe was discussed by Sirené, the Fallanassi representative, and the representative for the Lonto, Waran questioned why the Yacombe did not speak for themselves to confirm. The Disciples of the Whills representative, Elris, then reminded Waran of why, because they did not speak but through their proxies, and added that the Matukai already knew this fact. The Kel Dor then admitted their surprise to Elris that a Disciple of the Whills would vouch for a dark sider, adding they should know better, and launched forward with their ax to attack the envoy in an attempt to defend the light. As Waran moved to attack, they attacked the Lonto in the process, but was ultimately stopped from reaching the Yacombe by the interference of Jedi Oliviah Zeveron. Waran told Zeveron to stand aside, though they refused, and pointed out that whilst the Matukai claimed to protect the light, the envoy was the only one not fighting, whichs stopped Waran and the other representatives. The incident, however, had persuaded the envoy that Jedha was not suitable for the Yacombe, and left.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Peace_and_Unity",
  "/wiki/Kel_Dor",
  "/wiki/Matukai/Canon",
  "/wiki/Convocation_of_the_Force",
  "/wiki/Representative",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/High_Republic_Era",
  "/wiki/382_BBY",
  "/wiki/Yacombe",
  "/wiki/Unidentified_Yacombe_envoy",
  "/wiki/Siren%C3%A9",
  "/wiki/Fallanassi",
  "/wiki/Unidentified_Lonto_representative",
  "/wiki/Lonto",
  "/wiki/Disciples_of_the_Whills",
  "/wiki/Elris",
  "/wiki/Ax",
  "/wiki/Light_side_of_the_Force",
  "/wiki/Jedi",
  "/wiki/Oliviah_Zeveron",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Waran",
  "/wiki/The_High_Republic_(2022)_1",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/232_BBY",
  "/wiki/Template:LightOfTheJediDate",
  "/wiki/StarWars.com",
  "/wiki/Standard_year"
 ]
}