{
 "name": "Warburton",
 "display_name": "Warburton",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Warburton was the Wookiee commander of the rebel group that lived in the sub-facility on the planet Tol Ado.\nIn 0 ABY, Warburton was working alongside several escapees from the Deathblock, the Imperial prison on Tol Ado. His rebel group harassed Imperial patrols that swept through the sub-facility to attempt to recapture escaped prisoners. During one of their planned raids, Warburton was encountered by Luke Skywalker and his allies, Sidney Shortfang and Erling Tredway who had been discovered wandering through the sub-facility by Warburton's scout, Tormey. When Imperials began to attack the sub-facility, Warburton ordered Skywalker and his friends to defend the facility to prove they were not Imperial spies.\nThe attack was successful, but due to the incompetence of Erling Tredway during the attack, Warburton's men wanted to execute him. However, Skywalker gave Warburton evidence on a spy within their ranks. Warburton's lieutenant, Santo was revealed as a traitor, as Skywalker had seen him conspiring with Imperials. Warburton quickly had the Twi'lek executed for treason.\nWarburton was created by Troy Denning and appeared in one of the role-playing strands of the 1990 West End Games role-playing supplement Jedi's Honor. During the scenario, the outcome of the attack against the Imperials is dependent on the reader's choices. If Skywalker allows Tredway to botch the ambush, the attack does not fully defeat the Imperials, and Warburton's men are left to create a last-ditch defense plan against an better equipped Imperial force. If Skywalker stops Tredway from botching the ambush, the Imperials are soundly defeated by Tormey and his Gorums, leaving the sub-facility forces in a position of strength for the future.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Tormey",
  "/wiki/Planet/Legends",
  "/wiki/Tol_Ado",
  "/wiki/Canon",
  "/wiki/0_ABY/Legends",
  "/wiki/Deathblock",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Sidney_Shortfang",
  "/wiki/Erling_Tredway",
  "/wiki/Spy/Legends",
  "/wiki/Santo_(Twi%27lek)",
  "/wiki/Treason/Legends",
  "/wiki/Troy_Denning",
  "/wiki/Roleplaying_game",
  "/wiki/1990",
  "/wiki/West_End_Games",
  "/wiki/Jedi%27s_Honor"
 ]
}