{
 "name": "Warda_Gojun",
 "display_name": "Warda Gojun",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Saleucami"
     ]
    },
    {
     "name": "Born",
     "values": [
      "22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.81 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "71st GAV Battalion",
      "71st GAV Battalion"
     ]
    }
   ]
  }
 ],
 "content": "Warda Gojun, designated \"HH-4413,\" was a human native of the planet Saleucami. By 0 BBY, he held the rank of sergeant in the Galactic Empire's Imperial Army and was stationed in Jedha City, where he served as a member of a tank crew commanded by First Sergeant Jimmon Arbmab. Before the Empire evacuated from Jedha, Gojun and his crew were involved in a deadly ambush by local partisans which left Arbmab and many other Imperial personnel dead.\nWarda Gojun was a human male individual who was born on the Outer Rim planet Saleucami in 22 BBY, and joined the Galactic Empire before or during 0 BBY and subsequently given the designation \"HH-4413\". Gojun was eventually promoted to the rank of sergeant and assigned to the Imperial Army's 71st GAV Battalion under the command of First Sergeant Jimmon Arbmab.\nThe 22 year old trooper and his tank crew were deployed to the desert moon of Jedha, and shortly before the Empire's evacuation were assigned to a transport detail for kyber crystals being exported off of the moon from Jedha City. The tank was escorted by a squad of heavily armed stormtroopers, and proceeded carefully along their route through the cities narrow, enclosed streets—streets that were strategically ideal for ambushes. Nonetheless, the transport detail moved through the city, wary of hostile forces.\nDespite their concern, the escort was swiftly ambushed by local partisans affiliated with Saw Gerrera while they proceeded along their route. The escort responded in turn and inflicted heavy casualties on the insurgents, and Gojun, along with his crew, delivered several deadly shots into the insurgents' ambush positions. Despite the efforts of the escort team, the stormtrooper escort was eliminated after the brutal firefight. In the chaos, Arbmab, Gojun's commanding officer, was killed by a point-blank shot from Rebel Alliance spy Cassian Andor.\nGojun was a human male native to Saleucami, and stood 1.81 meters  tall.\nGojun wore the white plastoid armor of an Imperial tank trooper, and was equipped with compact repair and diagnostic kits affixed to his belt. Additionally, his helmet was furnished with a wireless telemetry receiver, which connected to the tank system interfaces.\nWarda Gojun first appeared in the 2016 Star Wars Anthology film Rogue One: A Star Wars Story, and Gojun's name was established simultaneously in the reference book Star Wars: Rogue One: The Ultimate Visual Guide.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Saleucami",
  "/wiki/22_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Galactic_Empire",
  "/wiki/71st_GAV_Battalion",
  "/wiki/Planet",
  "/wiki/0_BBY",
  "/wiki/Military_rank",
  "/wiki/Sergeant",
  "/wiki/Imperial_Army",
  "/wiki/Jedha_City",
  "/wiki/TX-225_GAVw_%22Occupier%22_combat_assault_tank",
  "/wiki/First_Sergeant",
  "/wiki/Jimmon_Arbmab",
  "/wiki/Partisans",
  "/wiki/Soldier",
  "/wiki/Death",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Standard_year",
  "/wiki/Desert",
  "/wiki/Moon",
  "/wiki/Jedha",
  "/wiki/Kyber_crystal",
  "/wiki/Hovertank",
  "/wiki/Squad",
  "/wiki/Stormtrooper",
  "/wiki/Saw_Gerrera",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Spy",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Color",
  "/wiki/Plastoid",
  "/wiki/Armor",
  "/wiki/Belt",
  "/wiki/Helmet",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Rebellion_(board_game)",
  "/wiki/Rise_of_the_Empire",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_40",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Databank_A-Z",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Across_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Helmets",
  "/wiki/Allies_and_Adversaries",
  "/wiki/Star_Wars:_Legion",
  "/wiki/TX-225_GAVw_Occupier_Combat_Assault_Tank_Unit_Expansion",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}