{
 "name": "Waroon_Dak",
 "display_name": "Waroon Dak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corellia"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Waroon Dak was a rotund male Human from the planet Corellia who worked skilfully as an infochant during the Galactic Civil War. Dak worked from a cantina in the Blasted Asteroid commercial chain which was located on the Wheel space station. There he occupied a table near to the bar where he would meet clients to exchange information. The cantina's bartender and bouncer, Ceoloe, would purposefully say revealing comments he learned concerning customers loudly, as to draw Dak's attention to the potential sources of information. Dak paid the barkeeper a small finder's fee for this information as well as for the table, and Ceoloe also made sure the infochant was safe if any fights broke out. When interacting with clients Dak charged a flat fee per question, which he would negotiate before any information was revealed and ranged from around 10 to 15. Dak was aware of the lost Confederacy of Independent Systems ship named the Sa Nalaor and was willing to pay between 50 and 300 for information concerning its whereabouts.\nWaroon Dak first appeared in 2013 in Beyond the Rim an adventure module written by Sterling Hershey for the Fantasy Flight Games roleplaying game, Star Wars: Edge of the Empire. He was included as someone that players could potentially interact with whilst searching for information on the Wheel. If players do sell him information concerning the Sa Naloar then that information will later fall into the hands of their rivals through Dak. If players sell him false information and Dak realizes it then he demands all payments he has made back and Ceoloe will throw the players out of the cantina.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Information_broker/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Blasted_Asteroid_(the_Wheel)",
  "/wiki/Blasted_Asteroid",
  "/wiki/The_Wheel/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Bartender/Legends",
  "/wiki/Bouncer_(occupation)/Legends",
  "/wiki/Ceoloe",
  "/wiki/Credit",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Sa_Nalaor/Legends",
  "/wiki/2013",
  "/wiki/Beyond_the_Rim",
  "/wiki/Sterling_Hershey",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_Edge_of_the_Empire"
 ]
}