{
 "name": "Wat_Tambor",
 "display_name": "Wat Tambor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Skako",
      "Skako Minor"
     ]
    },
    {
     "name": "Born",
     "values": [
      "By 97 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "Mustafar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Skakoan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Techno Union",
      "Baktoid Armor Workshop",
      "Baktoid Armor Workshop",
      "Confederacy of Independent Systems",
      "Executive Separatist Council",
      "Executive Separatist Council"
     ]
    }
   ]
  }
 ],
 "content": "Wat Tambor was a male Skakoan who was the foreman of the Techno Union and an executive of Baktoid Armor Workshop. During the Separatist Crisis, he pledged the Techno Union's resources to the Confederacy of Independent Systems, earning himself a seat on the Separatist Council during the Clone Wars. In the conflict's early stages, Tambor was appointed Emir of Ryloth and supervised its occupation by the Separatists, which was fiercely resisted by local Twi'lek freedom fighters led by Cham Syndulla. After defying orders to abandon Ryloth when the tide of battle turned against the Separatists, Tambor was left behind and captured by the Galactic Republic. He was briefly imprisoned on Coruscant before being liberated later in the conflict.\nAs the Clone Wars escalated, Wat Tambor took an interest in the captive ARC trooper CT-1409, who had been captured during a battle in the Citadel but was presumed dead by the Republic. Tambor kept an unconscious Echo in a stasis chamber and managed to extract information from Echo's mind to use as an algorithm consisting of strategies devised by Echo and the Clone Captain CT-7567. While officially professing the Techno Union's neutrality, Tambor had sold the algorithm to the Separatist Admiral Trench, who used it to great effect during the Battle of Anaxes to invade the Republic world of Anaxes. Tambor's dealings with the Separatists were exposed by a Republic infiltration team consisting of Rex, Clone Force 99, and the Jedi Knight Anakin Skywalker.\nDuring the final days of the Clone Wars, Wat Tambor and the rest of the Separatist Council relocated from the planet Utapau to Mustafar, where they were slaughtered by Darth Vader. Following his demise, the newly-formed Galactic Empire assumed control of the Techno Union's assets.\nA male Skakoan from the planet Skako, Wat Tambor left his homeworld at an early age and began a career in technology on the harsh industrial world of Metalorn. He eventually became foreman of the Techno Union, a powerful commercial body that made massive profits from developing new technologies, and an executive of Baktoid Armor Workshop, an arms manufacturer.\nNearly a century before the Galactic Civil War, Tambor acquired the Triple-Zero protocol personality matrix with the intent of studying it.\nDuring the last years of the Galactic Republic, Tambor supported the Secessionist Movement, which eventually developed into the Confederacy of Independent Systems. During the Separatist Crisis, Wat Tambor and several other pro-Separatist corporate leaders, including the Trade Federation Viceroy Nute Gunray, the InterGalactic Banking Clan Chairman San Hill, and the Commerce Guild president Shu Mai attended a secret conference on the planet Geonosis that was hosted by the Separatist leader Count Dooku and the Geonosian Archduke Poggle the Lesser, who oversaw the production of battle droids for the Techno Union. At the meeting, Tambor pledged the Techno Union's resources to the Separatist cause.\nDuring the ensuing First Battle of Geonosis, the first battle of the Clone Wars, Wat Tambor and other Separatist delegates watched the fighting unfold through a holotable in the Geonosian Command Center before fleeing Geonosis to escape the advancing Grand Army of the Republic. Despite the Techno Union's support for the Separatist cause, the company still declared neutrality and was even represented in the Galactic Senate by Senator Gume Saam. At some point after he joined the CIS, Tambor flew his Belbullab-22 heavy starfighter near an orange astronomical object.\nEarly in the war, Tambor led Separatist forces to capture the planet Quarmendy and its important trading post the Nexus. A Republic counterattack to retake the Nexus was led by Plo Koon and Clone Commander Wolffe, with the Jedi Master leading a starfighter assault in order to distract Tambor from a smaller attack mounted by Wolffe, who planned to lead a squad of clones with jet packs onto the station's surface. Due to the impregnable nature of the Nexus, Tambor was surprised that the Republic would dare to launch such an operation but he nonetheless ordered his vulture droids to be scrambled in order to fend off Plo's starfighters. He then confronted the former custodian of the Nexus, Orkle, accusing her of trying to undermine his control of the station. He warned her that her life meant very little to him, but stated that she would make a good hostage to use against the Republic.\nAs the battle for the skies intensified, Wolffe and his clones began their attack on the station's surface but came under heavy fire from gun turrets. Informed of this maneuver, Tambor took the news in his stride and ordered a unit of D1-series aerial battle droids out to engage the clones in the air before they could land. Unfortunately for Tambor, however, Wolffe was able to attach a thermal detonator to one of the droids before sending it spiralling towards the Skakoan's command centre. Tambor was able to escape the resulting explosion, holding onto Orkle as his hostage, but was immediately confronted by Wolffe and the clones who demanded his surrender and her release. Tambor declared that he would rather blow the Nexus apart than surrender it, pressing a detonator he had kept on his person before grabbing onto two D1 battle droids and making his escape. Wolffe was left to rescue Orkle, but neither he nor Plo were able to save the station from Tambor's detonation and it was blown apart.\nAfter his escape from Quarmendy, Tambor spearheaded the Separatist invasion of Ryloth, the homeworld of the Twi'lek species, and supervised its subsequent occupation after being installed as the Emir of Ryloth by Count Dooku. Setting up headquarters in the capital city of Lessu, the Skakoan and his tactical droid TA-175 ruled the planet with an iron fist and many Twi'leks starved as a result of the Separatist occupation. Ryloth was also blockaded by a large Separatist war fleet to deter any Republic attempts to retake Ryloth. When the Senate dispatched reinforcements to retake Ryloth, Tambor ordered the Neimoidian Captain Mar Tuuk to prevent a Republic invasion of the planet.\nShortly later, three Republic Navy Venator-class Star Destroyers under the command of Jedi General and Knight Anakin Skywalker and Admiral Wullf Yularen emerged from hyperspace. However, Tuuk trapped the Star Destroyers by sending four Munificent-class star frigates to interdict them. As a result of this counter-attack, the Venator Star Destroyer Redeemer was crippled while another ship, the Defender, was badly damaged. Via hologram, Tambor congratulated Tuuk on his success but warned him not to under-estimate General Skywalker since the Techno Union foreman knew how he caused nothing but trouble for Count Dooku and the Separatist Alliance. Despite the initial setback, General Skywalker used the crippled Defender to ram into Tuuk's flagship, a Droid Control Ship.\nRepublic reinforcements under Jedi Masters Obi-Wan Kenobi and Mace Windu then exited hyperspace with three Acclamator-class transgalactic military assault ships carrying substantial ground forces to liberate Ryloth. In response to the planned Republic landings at the Ryloth city of Nabat, Tambor ordered the tactical droid TX-20 to use captive Twi'leks as 'living shields' to deter the Republic's clone troopers and their Jedi commanders from launching a heavy attack. As the Republic's Ghost Company advanced into Nabat, TX-20 unleashed several starved gutkurrs but the Jedi and clones managed to foil this attack. The capture of Nabat enabled the clone army to march on Lessu.\nIn response to Master Windu's advance on Lessu, Emir Tambor conferred with TA-175. Despite the odds stacked against him, he refused to order a retreat and claimed that Windu did not have sufficient troops to retake the city. Tambor also ordered that all droids be brought into Lessu in order to secure his stronghold and the strategically important plasma bridge. By this stage, Republic starfighters under General Skywalker had secured the space around Ryloth and General Kenobi had taken the Jixuan desert, allowing the planet's southern hemisphere to fall under Republic control. In response to Tambor's military presence in Lessu, Mace Windu decided to enlist the help of the Twi'lek Resistance under Cham Syndulla.\nLater, Wat Tambor and TA-175 conferred with Count Dooku, who ordered the Techno Union foreman to retreat with whatever valuables he could and destroy everything else. While Tambor was alarmed by Dooku's order, the Count explained that he wanted to use Ryloth to demonstrate the cost of a \"Republic victory\" to the galaxy. As Republic forces closed in on Lessu, Tambor ordered TA-175 to prepare his shuttle for departure. Tambor refused to leave until the last of Ryloth's treasures had been loaded onto his shuttle. This infuriated Count Dooku who wanted him out of the city before Republic reinforcements arrived. The Separatist leader intended to use several Hyena-class Droid Bombers to bomb Lessu as part of a \"scorched earth\" tactic and did not want the Republic to gain a valuable prisoner.\nIn a desperate attempt to slow down Windu and Cham's advance, Tambor attempted to use Twi'lek civilians as living shields. Despite his best efforts, the Republic and their Twi'lek allies managed to secure control of the plasma bridge and liberate the city. Before Tambor could reach his shuttle, TA-175 departed on the ship with his looted treasures; leaving Tambor to be captured by Master Windu and Cham's forces. Despite Tambor's capture, Count Dooku gave the order for the Hyena bombers to raze Lessu to the ground. When confronted by Windu, the captive Tambor told him that they would perish for the glory of the Separatist cause. However, Dooku's Hyena bombers were knocked out of the sky by Anakin and his Padawan Ahsoka Tano's starfighters. Defeated, Tambor surrendered unconditionally to the clone troopers and Cham's Twi'lek Resistance forces.\nFollowing his capture on Ryloth, Wat Tambor was incarcerated in the Republic Center for Military Operations on Coruscant. Poggle the Lesser was also imprisoned in the center, with Lieutenant Commander Orson Callan Krennic mentioning him to Poggle by asking if the foreman had been the one to create the plans for a mobile battle station. Tambor was later freed from Republic custody and rejoined the Separatist war effort, retreating to the Techno Union's headquarters in Purkoll, a city on the planet Skako Minor. At some point, Tambor obtained a captured ARC trooper CT-1409 \"Echo,\" who had been presumed killed during a mission to the Citadel. Tambor used Echo's mind to gain a strategy algorithm. Holding Echo within a stasis chamber, Tambor used the unconscious clone trooper to feed the Separatist Admiral Trench with information on the Republic's tactics during the Battle of Anaxes. Using the algorithm, the Separatist tactics matched plans created by Clone Captain CT-7567 \"Rex\" and Echo.\nUsing the strategy algorithm mined from Echo's mind, Admiral Trench won several victories on Anaxes and seemed poised to conquer the planet. In response, Rex and a group of clone troopers known as the \"Bad Batch\" infiltrated a Separatist Cyber Center. During the mission, they discovered a signal originating from Skako Minor, a world that had declared itself neutral during the Clone Wars. They also recognized Echo's voice and deduced he was still alive.\nFollowing the clone trooper's attack on the Cyber Center, Admiral Trench contacted Tambor to warn him that the Republic had traced the algorithm's signal to Skako Minor, cautioning the Techno Union foreman to be ready. The Skakoan resolved to stop the clone rescuers.\nAs expected, Rex, the Bad Batch, and Master Skywalker infiltrated Skako Minor. After landing on the planet and making contact with the native Poletec, the Republic infiltrators managed to trace Echo's signal to Purkoll. Inside the facility, they fought and overpowered several of Tambor's D1-series aerial battle droids and managed to find Echo in the core systems room. Before they could access the chamber, the clones were contacted via hologram by a gloating Wat Tambor, who informed them that they had stumbled into a trap. He told them that he had used Rex's strategy algorithm to predict every move they had made since their arrival on Skako Minor. When Tambor accused the clones of violating Skako Minor's neutrality, Rex responded that the Techno Union had already violated the planet's neutrality by bringing a Republic prisoner. Before departing, Tambor praised the clones for doing their part and ordered several D-wing droids to execute the intruders.\nThe clones managed to free Echo from the stasis chamber but found themselves trapped in the tower. By that time, Wat Tambor and several aides had arrived on the facility's ground floor. Tambor ordered his Skakoan associates to prepare the Decimator, a spherical device capable of attacking the Republic forces. However, Skywalker and the clones managed to escape the Core Systems room through an exhaust tunnel before the Decimator could breach the chamber. A confused Tambor demanded to know why the Decimator shut itself off and then looked through the hole it had cut into the door upon being informed that it could detect no organic matter, only to see that the Republic troops had left a \"parting gift\" in the form of several thermal detonators planted about the room. Tambor had just enough time to utter \"Oh, no\" before the explosives detonated in his face, wrecking the core systems room and sending Tambor flying backwards several feet. After entering the damaged room, the foreman was incensed to find Echo, whom he regarded as Techno Union property, missing and the stasis chamber destroyed, ruining what he claimed was years of research. He ordered his forces to locate the Republic group.\nDespite Tambor's best efforts to capture the intruders, Skywalker and the clones managed to tame several winged keeradak reptiles and escape to a Poletec village. In response, Wat sent a force of D-wing droids and octuptarra magna tri-droids to destroy them. However, the clones and their Poletec allies managed to trap them in a valley and defeat them. The surviving D-wing droids retreated and informed Wat of the defeat. The foreman regarded the loss of Echo as a devastating blow to the Techno Union's profit margins and wanted to find a way to recoup on his company's losses. Meanwhile, Skywalker and the clones managed to return with Echo to Anaxes where the Republic devised a plan to defeat Admiral Trench's invasion.\nDespite the serious breach of security on Skako Minor, Tambor stated he would eventually inform the Separatists of the loss of Echo. However, during the closing acts of the battle for Anaxes, Tambor had yet to do so. With the help of Skywalker, Rex and the \"Bad Batch,\" Echo managed to fake a signal from Skako Minor and feed Trench with false strategies. The Separatist Admiral dispatched most of his forces to secure the main Republic assembly plant on Anaxes. This enabled Echo to deactivate them. The Republic and Jedi then managed to defuse one of Trench's bombs, kill the Admiral, and destroy his fleet. As a result, the Republic scored a victory on Anaxes.\nFollowing the Battle of Coruscant, which saw the death of Count Dooku at the hands of General Skywalker, Wat Tambor and the Separatist Council met with the Separatist military leader General Grievous on the sinkhole world of Utapau. Tambor and the Separatist Council later relocated to a protective stronghold on the volcanic world of Mustafar, whose natives had a trade agreement with the Techno Union and mined unique and valuable minerals from the planet's lava rivers on its behalf. Darth Sidious then informed the Separatist Council that his new apprentice Darth Vader would come and accept their surrender. However, Vader instead executed the Separatist Council. As his peers were cut down, Tambor and Rune Haako fled into a conference room in an attempt to hide from the Sith Lord but the effort proved futile as Vader cut down Haako before impaling Tambor with his lightsaber.\nFollowing Tambor's death, Vader underwent a Mission to Skako Minor where he executed all of Tambor's loyalists and installed a new regime loyal to the newly-formed Galactic Empire. The Empire also assumed control of the former Techno Union's assets.\nAt some point following the skirmish aboard the Sorca Retreat during the Galactic Civil War, Doctor Aphra and the Son-tuul Pride raided Wat Tambor's workshop to find out he had acquired the Triple-Zero protocol personality matrix almost a century prior. He became interested in studying it, discovered it was too dangerous to be activated, and sent it to Quarantine World III to be quarantined. Tambor kept the memories of 0-0-0 and stored them in the Techno Union databanks as part of the Separatists' Research and Development. After the Clone Wars, the databanks were transferred over to the Empire and shifted into Hivebase-1.\nBetween 3 ABY and 4 ABY, a pirate named Jul Tambor emerged. Jul claimed to be the grandson of Wat and engineered a blockade of Skako Minor to free it from Imperial control.\nStanding 1.98 meters in height, Wat Tambor had green skin and black eyes.\nStrict and inventive, Wat Tambor had a mind for war machines and was one of the original and most fervent Separatist leaders, having pledging his loyalty and the Techno Union's battle droid armies to the Confederacy of Independent Systems after being attracted to the movement by Dooku's promises of unlimited pursuit of profits. Despite declaring the Techno Union neutral during the Clone Wars, Tambor was an active supporter of the Separatist cause who channeled substantial resources and information to their war effort. On one occasion, he used the drugged clone trooper CT-1409 to provide Admiral Trench with CT-7567's strategy algorithm, which greatly assisted the Separatist campaign to conquer the Republic world of Anaxes. As a businessman, he was concerned with protecting the Techno Union's profit margins and minimizing losses to his company by all means necessary.\nOrkle considered Tambor a ruthless coward. As both a businessman and military commander, Tambor was ruthless and had a disregard for the lives of other sentient beings. During the Separatist occupation of Ryloth, many Twi'leks starved under his rule. During a battle in Nabat, he gave orders for Twi'lek civilians to be used as \"living shields\" to deter the Republic and Jedi forces. Despite his disregard for sentient lives, Tambor was visibly upset when Skywalker and Clone Force 99 destroyed his laboratory along with its machines and years of research.\nLike all members of the Separatist Council, Wat Tambor was a corporate tycoon and was greedy as well. He profited off of the war effort like the other council members and exploited other star systems to enrich himself and acquire more wealth. He would often sack various worlds and strip them of their money and treasure to have for himself. Tambor was also a master strategist as he led many campaigns against the Republic during the war and broke out of Republic custody numerous times. Tambor was also authoritarian as whenever he'd conquer a system, he'd rule the planet with an iron fist and often enslave its native population, strip away the planet's money and treasure, and devastate the planet to benefit the cause of the Separatists.\nAt the bidding of Count Dooku, Tambor exercised a \"scorched earth\" policy towards Ryloth by looting the planet's valuables in order to show the galaxy the \"cost\" of a Republic victory. However, his avarice cost him dearly when he refused to evacuate Ryloth until the last shipment of valuables had arrived; a decision which contributed to his capture by Master Windu.\nOriginally created for the 2002 film Star Wars: Episode II Attack of the Clones, Wat Tambor first appeared in Cloak of Deception, a Star Wars Legends novel written by James Luceno that was released on May 29, 2001. Tambor was voiced by Star Wars sound designer Ben Burtt in Attack of the Clones, where he was an entirely computer-generated creation. Matthew Wood voiced the character in the canon animated series Star Wars: The Clone Wars. Concept artist Michael Murnane developed the character's look, giving him an art deco quality of simple shapes and clean lines.\nA line of dialogue originally belonging to Poggle the Lesser concerning the production of battle droids was later given to Tambor, explaining that the Techno Union were the builders of most of the new droid army seen in Attack of the Clones.\nThe illustrated screenplay of Star Wars: Episode III Revenge of the Sith had Tambor in the main room running to the conference room along with Shu Mai after Vader kills San Hill only to be cut down by Vader later on. In the final cut, Tambor's death scene was cut and can be seen in the deleted scene \"Extended Separatist Slaughter.\" Tambor's cause of death, however, was confirmed by his Databank entry.\nIn 2008, Burtt listed Tambor as his \"favorite Star Wars robot\".\nBoth the 2015 reference book Ultimate Star Wars and 2016 reference book Star Wars Character Encyclopedia: Updated and Expanded state that Tambor's homeworld is Skako. This conflicts with the 2019 reference book Ultimate Star Wars, New Edition, which states Tambor's homeworld is Skako Minor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wat_Tambor",
  "/wiki/Wat_Tambor/Legends",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Darth_Vader_(2020)_28",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_2",
  "/wiki/Catalyst:_A_Rogue_One_Novel",
  "/wiki/Doctor_Aphra_(2016)_15",
  "/wiki/Doctor_Aphra_(2016)_16",
  "/wiki/Doctor_Aphra_(2016)_17",
  "/wiki/Doctor_Aphra_(2016)_30",
  "/wiki/Special:Upload",
  "/wiki/Skako",
  "/wiki/Skako_Minor",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/19_BBY",
  "/wiki/Mustafar",
  "/wiki/Skakoan",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Techno_Union",
  "/wiki/Baktoid_Armor_Workshop",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Executive_Separatist_Council",
  "/wiki/Foreman",
  "/wiki/Separatist_Crisis",
  "/wiki/Clone_Wars",
  "/wiki/Emir_of_Ryloth",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Twi%27lek",
  "/wiki/Twi%27lek_Resistance",
  "/wiki/Cham_Syndulla",
  "/wiki/Ryloth",
  "/wiki/Galactic_Republic",
  "/wiki/Prison",
  "/wiki/Coruscant",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Echo",
  "/wiki/Battle_of_Lola_Sayu",
  "/wiki/Citadel",
  "/wiki/Death",
  "/wiki/Stasis_chamber",
  "/wiki/Rex%27s_battle_strategy_algorithm",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Admiral",
  "/wiki/Trench",
  "/wiki/Battle_of_Anaxes",
  "/wiki/Anaxes",
  "/wiki/Clone_Force_99",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/Standard_day",
  "/wiki/Utapau",
  "/wiki/Mission_to_Mustafar",
  "/wiki/Darth",
  "/wiki/Galactic_Empire",
  "/wiki/Planet",
  "/wiki/Homeworld",
  "/wiki/Metalorn",
  "/wiki/Galactic_Civil_War",
  "/wiki/Triple-Zero_protocol_personality_matrix",
  "/wiki/Standard_year",
  "/wiki/Trade_Federation",
  "/wiki/Viceroy",
  "/wiki/Nute_Gunray",
  "/wiki/InterGalactic_Banking_Clan",
  "/wiki/Chairman",
  "/wiki/San_Hill",
  "/wiki/Commerce_Guild",
  "/wiki/Shu_Mai",
  "/wiki/Geonosis",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Geonosian",
  "/wiki/Archduke",
  "/wiki/Poggle_the_Lesser",
  "/wiki/Battle_droid",
  "/wiki/Geonosian_accord",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Holotable",
  "/wiki/Geonosian_Command_Center",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Galactic_Senate",
  "/wiki/Senator",
  "/wiki/Gume_Saam",
  "/wiki/Wat_Tambor%27s_Belbullab-22_heavy_starfighter",
  "/wiki/Quarmendy",
  "/wiki/Nexus",
  "/wiki/Plo_Koon",
  "/wiki/Clone_Commander",
  "/wiki/Wolffe",
  "/wiki/Jedi_Master",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Orkle",
  "/wiki/D1-series_aerial_battle_droid",
  "/wiki/Thermal_detonator",
  "/wiki/Species",
  "/wiki/Capital",
  "/wiki/City",
  "/wiki/Lessu",
  "/wiki/Tactical_droid",
  "/wiki/TA-175",
  "/wiki/Neimoidian",
  "/wiki/Captain",
  "/wiki/Mar_Tuuk",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Jedi_General",
  "/wiki/Wullf_Yularen",
  "/wiki/Munificent-class_star_frigate",
  "/wiki/Redeemer",
  "/wiki/Defender",
  "/wiki/Hologram",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Mace_Windu",
  "/wiki/Acclamator-class_transgalactic_military_assault_ship",
  "/wiki/Nabat/Legends",
  "/wiki/TX-20",
  "/wiki/Clone_trooper",
  "/wiki/Ghost_Company",
  "/wiki/Gutkurr",
  "/wiki/Emir",
  "/wiki/Jixuan_desert",
  "/wiki/Hyena-class_Droid_Fighter/Bomber",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Starfighter",
  "/wiki/Trooper",
  "/wiki/Imperial_Inspectorate_HQ",
  "/wiki/Lieutenant_Commander",
  "/wiki/Orson_Callan_Krennic",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Purkoll",
  "/wiki/Cyber_Center",
  "/wiki/Poletec",
  "/wiki/Decimator",
  "/wiki/Keeradak",
  "/wiki/Octuptarra_tri-droid",
  "/wiki/Anaxes_assembly_complex",
  "/wiki/Battle_of_Coruscant",
  "/wiki/General",
  "/wiki/Grievous",
  "/wiki/Volcano",
  "/wiki/Mustafarian",
  "/wiki/Magma",
  "/wiki/Rune_Haako",
  "/wiki/Hallio_Bas",
  "/wiki/Mission_to_Skako_Minor_(Darth_Vader)",
  "/wiki/Unidentified_regime",
  "/wiki/Skirmish_aboard_the_Sorca_Retreat",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Son-tuul_Pride",
  "/wiki/Mission_to_Skako_Minor_(Son-tuul_Pride)",
  "/wiki/Wat_Tambor%27s_workshop",
  "/wiki/Personality_matrix",
  "/wiki/Standard_century",
  "/wiki/Quarantine_World_III",
  "/wiki/0-0-0",
  "/wiki/Hivebase-1",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Pirate",
  "/wiki/Jul_Tambor",
  "/wiki/Blockade_of_Skako_Minor",
  "/wiki/Eye",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Cloak_of_Deception",
  "/wiki/Star_Wars_Legends",
  "/wiki/James_Luceno",
  "/wiki/May_29",
  "/wiki/2001",
  "/wiki/Star_Wars",
  "/wiki/Ben_Burtt",
  "/wiki/Matthew_Wood",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Michael_Murnane",
  "/wiki/Star_Wars_Episode_III_Revenge_of_the_Sith:_Illustrated_Screenplay",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Databank_(website)",
  "/wiki/2008",
  "/wiki/2015",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/2016",
  "/wiki/2019",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Storm_Over_Ryloth",
  "/wiki/Innocents_of_Ryloth",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/Hostage_Crisis",
  "/wiki/Senate_Spy",
  "/wiki/Catalyst:_A_Rogue_One_Novel_(audiobook)",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/A_Distant_Echo",
  "/wiki/On_the_Wings_of_Keeradaks",
  "/wiki/Unfinished_Business_(episode)",
  "/wiki/Darth_Vader_(2020)_29",
  "/wiki/Category:Audio_files_of_Wat_Tambor",
  "/wiki/Category:Images_of_Wat_Tambor",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_81",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_87",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_8",
  "/wiki/Helmets",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_37",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_52",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_55",
  "/wiki/Star_Wars_Helmet_Collection_65",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Servants_of_Strife_Squadron_Pack",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Final_Countdown",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Separatists",
  "/wiki/Core_Worlds,_Colonies,_Inner_Rim,_and_Expansion_Region",
  "/wiki/Template:Aphra2016Date",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/The_Bad_Batch_(episode)",
  "/wiki/Star_Wars:_Darth_Vader_(2020)",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Databank_(original)"
 ]
}