{
 "name": "Watcher_X",
 "display_name": "Watcher X",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "3685 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireImperial Intelligence",
      "Imperial Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Watcher X, formerly codenamed Watcher Five and codenamed Minder Eight before that, was a Human male operative of Imperial Intelligence of the Sith Empire.\nBorn in 3685 BBY, Watcher X was genetically altered while still in the womb as part of a joint initiative by the Imperial Science Bureau and Imperial Intelligence. He joined Intelligence at the age of 21 and performed very highly, but Operation: Undertow resulted in a re-evaluation of his service. He started seeing connections and conspiracies where none existed and had to be forcibly retired. He was put in a section of Shadow Town on Nar Shaddaa, being too dangerous to use but too valuable to dispose of.\nAround 3643 BBY he was visited by Cipher Nine and helped the agent bring down the local branch of the Eagle's network. Watcher X explained to Nine that the terror cell were using Cyclone, an dangerous stimulant. He gave the location of a Cyclone seller in the Corellian Sector and serum to make the agent look like a Cyclone addict so they could track down where the drug was produced. Though Nine failed to find to obtain any Cyclone from the two Nautolan sellers, the agent was able to extract a blood sample from a deceased Evocii.\nAt Watcher X's instruction, Nine proceeded to an abandoned medical facility in the Duros Sector to analyze the sample and sent the data to X, who determined that the technology to develop Cyclone belonged to Synchet Industries, which declared bankruptcy five years ago. He identifies a former Synchet executive, Jordel Tlan, who left the company before it was officially dissolved, and was staying at the Star Cluster Casino and suggested poisoning his drink and offer the antidote in exchange for his information. Watcher X hacked into Tlan's security systems and overheard Nine obtain the information, learning that Tlan sold off a medical subsidiary, VerveGen Corporation, to unknown buyers, which he suspected to be the terrorists. Watcher X then instructed Nine to hack terminals around VerveGen headquarters before recalling the agent back to Shadow Town. There, X gave Cipher Nine a series of implants to holographically disguise themselves as a droid to infiltrate VerveGen, though under Kaliyo's supervision.\nAfter Nine successfully infiltrated the building and eliminate the terror cell leaders, Watcher X took note of a cyborg survivor and instructed Nine to uplink his cybernetics so he could pinpoint the communication hub to prevent the remainder of the cell from recovering. But while the agent was accomplishing this, Watcher X took advantage of the hub's disruption, knowing it would disrupt Shadow Town, enabling him to escape. But X couldn't resist informing Cipher Nine of this and knowing that Imperial Intelligence would hunt him down, bargained information on Intelligence and Kaliyo Djannis' true history, in exchange for Nine covering up his escape. Nine accepted.\nUnbeknownst to Nine, the implants Watcher X implanted enabled X to manifest within the agent's mind. In 3642 BBY, when Nine was sent to infiltrate Ardun Kothe's SIS team, the spymaster used the agent's own brainwashing code to force the agent to do his bidding, at which X voiced his observations, Nine being unaware of the mysterious voice in his head. After completing a mission for Kothe on Taris, Watcher X made his presence known to Nine and explained that brainwashing of this type was an Imperial tactic, not a Republic one - which meant that Imperial Intelligence had betrayed Nine and their information was given to the Republic. Secretly entering the archives in Imperial Intelligence HQ back on Dromund Kaas, Nine discovered that the brainwashing had indeed been ordered by Intelligence. Searching through the records, Nine discovered the IX serum that had been used to condition them could be used again to reset and then shut down the conditioning. The chemicals required for it could be found on the poisonous world of Quesh, and Nine was able to secure a ready supply of the required chemical, dimalium-6. However, the serum would take time to make and circulate through the Agent's system.\nAfter Nine recovered the shuttle Starbreeze on Hoth, the agent returned to Quesh at Kothe's order, and discovered that he had preparing to secure the Shadow Arsenal as deterrent to prevent further war. As Nine is ordered to remain at the Arsenal facility shield controls, Adrun Kothe determines that Nine's usefulness had reached its end. While the IX serum hadn't fully circulated through Nine's system, Watcher X determined that it was enough to reset the conditioning, at the risk of being put in a permanent vegetative state. As the conditioning reset itself, X gave Nine final orders to stop the SIS and find out how they obtained Imperial brainwashing codes. Before disappearing, Watcher X told Nine that there were truths that must be uncovered.\nCipher Nine can choose to let Watcher X escape  or can stop Watcher X and kill him at the Nar Shaddaa spaceport . Choosing to kill him will not impact whether he appearances later on, but does change a few possible dialogue choices.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Watcher_X",
  "/wiki/3685_BBY",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Intelligence_(Sith_Empire)",
  "/wiki/Imperial_Science_Bureau",
  "/wiki/3664_BBY",
  "/wiki/Operation:_Undertow",
  "/wiki/Shadow_Town",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/3643_BBY",
  "/wiki/Cipher_Nine",
  "/wiki/Eagle%27s_network",
  "/wiki/Cyclone",
  "/wiki/Corellian_Sector_(Nar_Shaddaa)/Legends",
  "/wiki/Nautolan/Legends",
  "/wiki/Evocii",
  "/wiki/Duros_Sector",
  "/wiki/Synchet_Industries",
  "/wiki/Jordel_Tlan",
  "/wiki/Star_Cluster_Casino",
  "/wiki/VerveGen_Corporation",
  "/wiki/Kaliyo_Djannis",
  "/wiki/3642_BBY",
  "/wiki/Ardun_Kothe",
  "/wiki/Taris/Legends",
  "/wiki/IX_serum",
  "/wiki/Quesh",
  "/wiki/Dimalium-6",
  "/wiki/Starbreeze",
  "/wiki/Hoth/Legends",
  "/wiki/Shadow_Arsenal",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia"
 ]
}