{
 "name": "Waxer",
 "display_name": "Waxer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Died",
     "values": [
      "20 BBY",
      "Umbara"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black",
      "dyed brown; shaved"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "212th Attack Battalion",
      "212th Attack Battalion"
     ]
    }
   ]
  }
 ],
 "content": "\"Waxer\" was the nickname of a clone trooper who served in Ghost Company, a military unit of the Grand Army of the Republic. During the Clone Wars against the Separatist Alliance, he fought in the Battle of Ryloth and the Second Battle of Geonosis alongside fellow 212th trooper Boil. Waxer would later serve as a platoon leader, with the rank of Clone Lieutenant during the Battle of Umbara, where he was killed in a friendly-fire incident orchestrated by the Jedi General Pong Krell who had turned to the dark side of the Force.\nWaxer was a clone of the bounty hunter, Jango Fett, and was a soldier in the Grand Army of the Republic. He served as part of Ghost Company, and in the company he was alongside fellow clone trooper Boil.\nWaxer was part of a detachment of the 7th Sky Corps under Commander Cody of the 212th. He accompanied Senator Padmé Amidala to Krystar to determine if there were prisoners being detained there. As Amidala met with Regent Queb and Representative Vishar Koss, Waxer and several troopers left the shuttle. Together they discovered a compound that had clone trooper prisoners of war guarded by a battalion of Separatist battle droids. Waxer met up with one of the prisoners, Wooley, and convinced them to attack the guards. Waxer and his fellow troopers were able to free the prisoners and return to the shuttle.\nWaxer continued serving under Commander Cody during the Siege of Hisseen. He worked alongside Cody in addition to Clone Commander Wolffe and his Wolfpack in rescuing members of the Hisseenian parliament from several battle droids.\nWaxer was among the troopers of Ghost Company that accompanied Jedi General Obi-Wan Kenobi and Clone Commander Cody as part of the first wave of the Republic's forces landing on Ryloth near the city of Nabat. He rode in a gunship alongside Kenobi, Cody, and clone trooper Boil. After landing, the surviving squads advanced through the trees up to the outer walls of the city, where they came under fire from several B1 battle droids. As their forces were harrowed by a bunker emplacement, Kenobi led Waxer and Boil to take it out. Waxer hefted an electromagnetic pulse grenade towards the bunker, but was too far away to get it over the wall. He told Kenobi that they were too far away, but Kenobi said that he could give him some help, using the Force to propel Waxer's next grenade over the wall, taking out the trio of droids there. The remaining outer defenses were soon defeated at the clones advanced into Nabat.\nAs the clones assembled inside the city walls, Kenobi tasked Cody with taking his best men to scout ahead. Waxer joined Cody, Wooley, and Boil to scout ahead into the city. After he and Boil paired off and split up from Cody and Wooley to investigate the south sector of Nabat, they found the city eerily quiet. The two speculated on where the citizens went, noting that there were no bodies. Hearing a noise from an alleyway, the two troopers took cover before Waxer followed Boil in, blasters raised. However, they came across a little Twi'lek girl named Numa. Waxer said that they should take her with them, but Boil pointed out that she would slow them down and that they had a mission to finish. They continued to discuss what they should do with her when a probe droid came across them.\nAfter hiding, Boil relented and tried to coax Numa to follow them. When he was bitten on the finger, Waxer realized that it was possible that she thought they were droids. He slowly removed his helmet and showed the girl that he was human. Boil pulled out a ration bar and passed it to Waxer, who gave it to Numa. As the girl ate quickly, she smiled at the two and pointed at them, calling them \"nerra.\" As they continued on, Numa followed them and eventually ran off towards where the recon droid had come from. Boil was reluctant to follow her towards the Separatist position, but Waxer said that they could not just let the droids get her and pursued. The two followed Numa to her home and comforted her until they received a signal from Commander Cody. As they were about to leave, Waxer, Boil, and Numa then came under attack from a pair of gutkurrs that had been set loose by the Separatists. They then hid inside a tunnel system.\nWaxer and the others were then able to escape using tunnels under Numa's home. Waxer then met up with Cody, Kenobi, and the rest of Ghost Company. He then told Kenobi and Cody that he and Boil were sidetracked by Numa. However, Waxer told Kenobi that she knew her ways around the tunnels underneath Nabat. Waxer, alongside Boil, then went with Kenobi and Numa to the six J-1 semi-autonomous proton cannon emplacements in the town square. As TX-20 and his troops attacked Cody's men, Waxer, Boil, and Kenobi were able to free the Twi'lek hostages. Waxer then assisted Kenobi in commandeering one of the cannons, loading it with Boil. Despite destroying the cannons, Waxer, Boil and, Kenobi were then knocked out by TX-20's AAT. However, they were saved when the Twi'leks ripped TX-20 apart. Waxer then rejoined the rest of Ghost Company and Windu's forces. He then said goodbye to Numa.\nWaxer then took part in the Republic's retaking of Geonosis, donning ARF trooper armor. On the side of his helmet, he added a small drawing of Numa. He then went with Kenobi and Cody to secure the landing area. Waxer and Boil were then sent to rescue Kenobi and any survivors in a downed gunship. They were then able to find Kenobi and Trapper and successfully bring them. Waxer stayed by Obi-Wan's side as Cody briefed the situation. As the group was cornered by the Geonosians, reinforcements arrived in the form of gunships and the forces of Generals Skywalker and Ki-Adi-Mundi. Waxer was present as the plan to destroy the shield generator was briefed, a plan that ended in a success.\nWaxer then went with Kenobi's and Cody's forces to take the capital city of Umbara, where he served as leader of a platoon, with the rank of Clone Lieutenant. He was then contacted by Jedi General Pong Krell and was deceived into leading his platoon to ambush Umbarans who were said to be disguised as clone troopers. Meanwhile, Captain Rex of the 501st Legion was also told that the Umbarans were wearing clone armor. Both were tricked by Krell into firing on each other, inflicting many casualties until Rex realized they all were clones and managed to stop the fight. However, Waxer was shot and mortally wounded during the attack. He spoke with Rex, telling him that it was General Krell who told them to attack. A tear rolled down his face as he drew his final breath and died from his wounds.\nWaxer helped care for the displaced Twi'lek girl Numa, persuading Boil to do likewise. He was perceptive, realizing that Numa thought they were droids and taking off his helmet to prove otherwise. He was easygoing and friendly to the girl as they continued to watch over her during the battle for Nabat. After providing assistance in finding Numa's parents during the Battle of Ryloth, Waxer added a drawing of Numa to his helmet by the time of his death on Umbara.\nLike all clone troopers, Waxer stood at 1.83 meters  tall. His head was shaved bald, and he had a small goatee.\nAt the Battle of Ryloth, Waxer wore Phase I clone trooper armor, which had custom markings painted in the orange of the 212th Attack Battalion. At the Second Battle of Geonosis, he wore Advanced Recon Force Scout Trooper armor that was painted dark brown and orange to help him camouflage in the deserts of the planet. At the Battle of Umbara, he wore Phase II clone trooper armor that retained his custom orange markings. He also painted a a small depiction of Numa on the right side of his helmet in addition to a series of tally marks.\nWaxer's weapon of choice was the standard issue DC-15A blaster carbine.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Waxer",
  "/wiki/Waxer/Legends",
  "/wiki/Star_Wars_Adventures:_The_Clone_Wars_%E2%80%93_Battle_Tales_3",
  "/wiki/The_Shadow_of_Umbara",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Kamino",
  "/wiki/20_BBY",
  "/wiki/Umbara",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/212th_Attack_Battalion",
  "/wiki/File:FleshAndBlood-IoR.ogg",
  "/wiki/Clone_trooper",
  "/wiki/Ghost_Company",
  "/wiki/Republic_Military",
  "/wiki/Company",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Trooper",
  "/wiki/Boil",
  "/wiki/Platoon_leader",
  "/wiki/Military_rank",
  "/wiki/Clone_Lieutenant",
  "/wiki/Battle_of_Umbara",
  "/wiki/Death",
  "/wiki/Jedi_General",
  "/wiki/Pong_Krell",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/The_Force",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Soldier",
  "/wiki/7th_Sky_Corps",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Krystar",
  "/wiki/Queb",
  "/wiki/Vishar_Koss",
  "/wiki/Eta-class_shuttle",
  "/wiki/Battle_droid",
  "/wiki/Wooley",
  "/wiki/Siege_of_Hisseen",
  "/wiki/CC-3636",
  "/wiki/Wolfpack",
  "/wiki/Hisseenian_parliament",
  "/wiki/File:MissionAccomplished-IoR.ogg",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Ryloth",
  "/wiki/City",
  "/wiki/Nabat",
  "/wiki/Tree",
  "/wiki/B1-series_battle_droid",
  "/wiki/Electromagnetic_pulse_grenade",
  "/wiki/Grenade",
  "/wiki/Twi%27lek",
  "/wiki/Youngling",
  "/wiki/Numa",
  "/wiki/Probe_droid",
  "/wiki/Ration_bar",
  "/wiki/Numa%27s_home",
  "/wiki/Commander",
  "/wiki/Gutkurr",
  "/wiki/J-1_semi-autonomous_proton_cannon",
  "/wiki/TX-20",
  "/wiki/File:ThisIsn%27tTheFunPart-LaPR.ogg",
  "/wiki/Advanced_Recon_Force_Scout_Trooper",
  "/wiki/Trapper_(clone_trooper)",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Deflector_shield_generator",
  "/wiki/Waxer%27s_platoon",
  "/wiki/General",
  "/wiki/Rex",
  "/wiki/501st_Legion",
  "/wiki/Phase_I_clone_trooper_armor",
  "/wiki/Desert",
  "/wiki/Phase_II_clone_trooper_armor",
  "/wiki/DC-15A_blaster_carbine",
  "/wiki/Category:Audio_files_of_Waxer",
  "/wiki/Category:Images_of_Waxer",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Innocents_of_Ryloth",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Senate_Murders",
  "/wiki/Darkness_on_Umbara",
  "/wiki/Carnage_of_Krell",
  "/wiki/The_Clone_Wars:_Stories_of_Light_and_Dark",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Helmets",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Covert_Missions",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/LAAT/i_Gunship_Expansion_Pack",
  "/wiki/Star_Wars_Inside_Intel:_Twi%27lek_Culture",
  "/wiki/Databank_(website)",
  "/wiki/Prisoners",
  "/wiki/Crisis_on_Naboo",
  "/wiki/The_General_(episode)",
  "/wiki/Standard_year"
 ]
}