{
 "name": "Waz-alem_Amir",
 "display_name": "Waz-alem Amir",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cerean"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Culpharm"
     ]
    }
   ]
  }
 ],
 "content": "Waz-alem Amir was a male Cerean, who worked for Culpharm on the planet Cularin, during the waning years of the Galactic Republic.\nAmir worked as a biochemist for Culpharm, a pharmaceutical company that was based on the planet Cularin. He carried out research for the company from a lab that was located in his house, on the edge of the city of Hedrett. He also employed the Tarasin Ta'Mara as a cleaner.\nIn about 32 BBY, Amir began studying a plant that was reputed to have medicinal properties. After examining it in his personal laboratory, he wanted to study the sample using specialist equipment in the Culpharm Central Laboratory, so he called Culpharm Security and arranged for the sample to be transported there. A Human and Wookiee dressed in Culpharm Security uniforms turned up at his house and collected the sample. However, they were in fact employees of Biotherapy, a rival company of Culpharm, who hoped to discover what Amir had been developing. Two genuine Culpharm Security guards, Blut and Mien, turned up a short time later and Amir informed them that the samples had already been collected.\nCulpharm hired the Heroes of Cularin to investigate the disappearance of the samples. They traveled to Amir's house and asked him some questions about the circumstances surrounding their disappearance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Cerean/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Culpharm",
  "/wiki/Planet/Legends",
  "/wiki/Cularin/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Biochemist",
  "/wiki/Hedrett",
  "/wiki/Tarasin",
  "/wiki/Ta%27Mara",
  "/wiki/32_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Biotherapy",
  "/wiki/Blut",
  "/wiki/Mien",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Mix_and_Match"
 ]
}