{
 "name": "Wazellman",
 "display_name": "Wazellman",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Wick 111"
     ]
    },
    {
     "name": "Born",
     "values": [
      "35 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wickwar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3 feet",
      "5 inches"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "125 pounds"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  }
 ],
 "content": "Wazellman was a Wickwar male from the planet Wick 111 who participated in a game of sabacc on the planet Numidian Prime with the gamblers Han Solo and Lando Calrissian. Sitting next to Solo, Wazellman saw him eventually win Calrissian's freighter, the Millennium Falcon. In 34 ABY, the pirate Hondo Ohnaka used Wazellman's stolen identity profile to test several potential new employees of Ohnaka Transport Solutions in Black Spire Outpost on the planet Batuu.\nWazellman was a Wickwar male who was born on the planet Wick 111 around 35 BBY. In 10 BBY, Wazellman took part in a sabacc game at a guarded bar in a hard-to-find jungle outpost on the planet Numidian Prime. Other participants included the gamblers Landonis Calrissian, Pride Aully, and the smuggler Han Solo, who arrived partway through the game and confronted Calrissian about recently abandoning him on the planet Savareen.\nSolo then used a container of coaxium he believed to be worth around 10,000 credits to buy into the game, catching the attention of Wazellman and the rest of the table, as that amount was worth more than the average bargaining chip on Numidian Prime. The Wickwar moved to a different seat at the table to allow Solo and his co-pilot, the Wookiee Chewbacca, to sit down next to him.\nThe group then played on, with Solo losing some rounds and winning others but slowly building a small pile of winnings in front of him. Some of the others left the table in a rage as the seemingly personal battle between Solo and Calrissian played out. Eventually, most of the players other than Solo and Calrissian dropped out or folded, but most, including Wazellman, stayed to watch, as the match was like nothing they had seen before. Calrissian eventually put his YT-1300 light freighter, the Millennium Falcon, up as a bet, but Solo then won the hand and the Falcon. Wazellman and the others who had seen the marathon game of sabacc each went on to give different accounts of what had happened, each focusing on different aspects of the story but all agreeing about the conclusion.\nDuring the First Order occupation of the planet Batuu around 34 ABY, when Wazellman was 69 years old, the pirate Hondo Ohnaka used a stolen identity profile of the Wickwar to test a group of potential new employees for his company, Ohnaka Transport Solutions. Ohnaka was planning a heist and wanted to test the employees' ability to memorize details from a cover identity, so he sent the profile of Wazellman and several other individuals to the prospective employees' datapads and then quizzed them on details from the data.\nWazellman stood 3 feet, 5 inches tall and weighed 125 pounds. He had blue eyes, no hair, and pink facial tentacles. While playing sabacc against Lando Calrissian on Numidian Prime, Wazellman and the other participants were disgruntled and became impatient when Han Solo interrupted their game. Calrissian considered Wazellman and the other players ill-mannered and menacing.\nWazellman wore a gray helmet and chestplate over black clothing on Numidian Prime.\nWazellman first appeared in the 2018 Anthology film, Solo: A Star Wars Story. He was portrayed by actor Warwick Davis, who also portrayed the characters Weazel, W1-EG5, WG-22, and DD-BD in the film.\nThe character was first identified in Star Wars: Datapad, an app that launched alongside the themed land Star Wars: Galaxy's Edge, which opened to guests at Disneyland Park and Disney's Hollywood Studios Park in 2019. The Wazellman costume was reused for an unidentified extra in \"Chapter 1\" and \"Chapter 3\" of The Mandalorian television series in 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wick_111",
  "/wiki/35_BBY",
  "/wiki/Wickwar",
  "/wiki/Gender",
  "/wiki/Foot",
  "/wiki/Pound",
  "/wiki/Color",
  "/wiki/File:Solo-Calrissian-BuyIn.ogg",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Planet",
  "/wiki/Sabacc",
  "/wiki/Numidian_Prime",
  "/wiki/Gambling",
  "/wiki/Han_Solo",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/34_ABY",
  "/wiki/Pirate",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Thief",
  "/wiki/Ohnaka_Transport_Solutions",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Batuu",
  "/wiki/Reproduction",
  "/wiki/10_BBY",
  "/wiki/Cantina",
  "/wiki/Jungle_outpost",
  "/wiki/Pride_Aully",
  "/wiki/Smuggler",
  "/wiki/Showdown_on_Savareen",
  "/wiki/Savareen",
  "/wiki/Coaxium",
  "/wiki/Credit",
  "/wiki/Pilot",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/First_Order",
  "/wiki/Battle_of_Batuu",
  "/wiki/Standard_year",
  "/wiki/Heist_on_a_First_Order_train",
  "/wiki/Datapad",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Limb",
  "/wiki/Helmet",
  "/wiki/Armor",
  "/wiki/Clothing",
  "/wiki/Jon_Favreau",
  "/wiki/File:JonFavreau-Resources-DG.ogg",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Warwick_Davis",
  "/wiki/Weazel",
  "/wiki/W1-EG5",
  "/wiki/WG-22",
  "/wiki/DD-BD",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/2019",
  "/wiki/Chapter_1:_The_Mandalorian",
  "/wiki/Chapter_3:_The_Sin",
  "/wiki/The_Mandalorian",
  "/wiki/Category:Images_of_Wazellman",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition",
  "/wiki/Solo:_A_Star_Wars_Story:_Expanded_Edition_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel",
  "/wiki/Solo:_A_Star_Wars_Story:_A_Junior_Novel_(audiobook)",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/File:FlightCrewsWanted-IDIntro.png",
  "/wiki/File:WazellmanProfile-GEDatapad.jpg",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Fireball_Expansion_Pack",
  "/wiki/Hotshots_and_Aces_Reinforcements_Pack",
  "/wiki/Star_Wars:_Book_of_Lists",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_month",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Galactic_Empire",
  "/wiki/19_BBY",
  "/wiki/File:PrideAullyMission-GEDatapad.jpg",
  "/wiki/File:PrideAullyConv-GEDatapad.png",
  "/wiki/File:PrideAullyConv2-GEDatapad.jpg",
  "/wiki/File:PrideAullyConv3-GEDatapad.jpg",
  "/wiki/File:PrideAullyComplete-GEDatapad.jpg",
  "/wiki/September_25",
  "/wiki/October_6"
 ]
}