{
 "name": "Weasy",
 "display_name": "Weasy",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Weasy was a male Bothan smuggler, who was well known for taking on any cargo, no questions asked, along with being an excellent reporter of information who didn't exaggerate. Shortly after the formation of the Galactic Empire in 19 BBY, Weasy was at the spaceport in Ussa, capital city of the planet Bellassa, when the Empire shut down the spaceport searching for Ferus Olin, a former Jedi Padawan who had escaped a local prison. Following the shutdown, Weasy was forced to wait one week before being allowed to leave the Ussa spaceport. After being allowed to leave Bellassa, Weasey traveled to Mos Eisley, a city on the planet Tatooine. There, Jedi Master Obi-Wan Kenobi overheard Weasy talking about Ferus Olin, and upon learning Weasy was planning a supply run to Ussa, he hired the pilot to bring him along. After arriving in Ussa, Weasy discreetly wished Kenobi luck, and directed him to the passenger check in area before going to arrange docking for his ship. Weasy piloted a Corellian star yacht.\nWeasy first appeared in the young readers novel, The Last of the Jedi: The Desperate Mission, written by Jude Watson, and released in April 2005. Weasy would later receive a brief entry in The Complete Star Wars Encyclopedia, written by Stephen J. Sansweet and Pablo Hidalgo, and released in December 2008",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/The_Last_of_the_Jedi:_The_Desperate_Mission",
  "/wiki/Smuggler/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Ussa",
  "/wiki/Capital/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Bellassa/Legends",
  "/wiki/Ferus_Olin",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/Jude_Watson",
  "/wiki/April",
  "/wiki/2005",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Stephen_J._Sansweet",
  "/wiki/Pablo_Hidalgo",
  "/wiki/December",
  "/wiki/2008"
 ]
}