{
 "name": "Weazel",
 "display_name": "Weazel",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Less than 1.37 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "Cloud-Riders"
     ]
    }
   ]
  }
 ],
 "content": "Weazel was a human male thief turned freedom fighter from the planet Tatooine who lived in the last days of the Galactic Republic and during the reign of the Galactic Empire. As a thief, he worked for the Hutt Clan out of Mos Espa on Tatooine, where he was present for the Boonta Eve Classic podrace in 32 BBY that was won by Anakin Skywalker. During the age of the Empire, Weazel worked with Enfys Nest and her Cloud-Riders, who sought to fight back against the crime lords who had wronged them as well as the Empire. He was Nest's best lieutenant and most vigilant spy.\nWeazel was from the Outer Rim world of Tatooine, where he worked as a thief for the ruling Hutt Clan in the spaceport settlement of Mos Espa in 32 BBY. During the time of the Trade Federation's Invasion of Naboo, Weazel attended the Boonta Eve Classic podrace in Mos Espa, where he sat with Watto, a Toydarian junk dealer who placed a large sum of money on the reigning champion Sebulba to win. Weazel cheered Sebulba on throughout the race, but the Dug racer was ultimately beaten by the young Anakin Skywalker—the boy who would grow up to become Darth Vader, the enforcer of the Galactic Empire that Weazel came to fight against during the Imperial Era.\nBy the time the Empire was in power, Weazel had left behind his life as a thief and joined the Cloud-Riders, a group of vigilante marauders led by Enfys Nest. While rivals such as Tobias Beckett believed them to be pirate thieves, they were actually aspiring rebels who wanted to fight for and bring justice to those who had been victimized by the Empire and the criminal syndicates that ran rampant in the galaxy, such as Crimson Dawn. Weazel became Nest's most trusted lieutenant and vigilant spy, and together they and the Cloud-Riders had numerous run-ins with Beckett and his crew, who often worked for Crimson Dawn.\nIn 11 BBY, Weazel accompanied Nest, Callixido Ryss and Moda Maxa to Gargon to raid an Imperial spice cache in order to retrieve medicinally processed spice. The raid succeeded, and the obtained spice was segmented into ready-to-implement triage kits and emergency packs, but they left the raw spice behind even though they could have stolen it to refine it for narcotic usage and make a fortune by selling it. This action surprised Agent Andressa Divo of the Imperial Security Bureau, who noted that the Cloud-Riders were likely building an army and readying to go to war.\nThe Cloud-Riders had their last run-in with Beckett's gang in 10 BBY, when the Cloud-Riders caught wind of a heist Beckett and his team were pulling on Vandor for Crimson Dawn. While Beckett, his partner Val, pilot Rio Durant, and newcomers Han Solo and Chewbacca attempted to steal the hyperfuel known as coaxium from an Imperial conveyex train, the Cloud-Riders attacked on swoop bikes and attempted to steal the loot for themselves. The encounter led to some Cloud-Rider casualties as well as the deaths of Val and Durant. Neither team was able to steal the loot; as each attempted to take the train car carrying the coaxium for themselves, the pilot Solo detached the car from the AT-hauler he was flying, and it crashed into a mountain. Weazel and the others survived the resulting massive explosion of hyperfuel, and each went their separate ways.\nBeckett arranged a new operation with Crimson Dawn to steal coaxium from the spice mines of Kessel, an operation the Cloud-Riders also caught wind of. Weazel followed Beckett's team as they met with Lando Calrissian and arranged for him and his ship, the Millennium Falcon, to help them make the Kessel Run in enough time to bring the stolen unrefined coaxium to Savareen for refinement. Having learned that Calrissian was part of the operation, Weazel placed a tracking device on the Millennium Falcon so the Cloud-Riders could keep tabs on where Beckett and his team were ultimately headed.\nThe Cloud-Riders confronted Beckett's gang once they arrived on Savareen, and they engaged in a brief standoff. Nest ultimately explained the true motives of the Cloud-Riders, presenting Beckett's team with a choice about whether to hand the coaxium over to Crimson Dawn or allow the Cloud-Riders to take it and use the millions of credits to attain their goals. As such, Solo and Qi'ra ended up killing Dryden Vos and a traitorous Beckett. Due to the actions and help of Han Solo, the Cloud-Riders acquired the coaxium. Weazel secured it in their transports as Nest told Solo what they wanted it for: to fuel a rebellion.\nWeazel was a human male with brown hair, blue eyes, and light skin. Weazel, who stood shorter than most humans, was once a common criminal for one of the five major crime syndicates but ultimately turned against them and believed in bringing justice to those throughout the galaxy who had been hurt by the syndicates and the Empire. As part of his operations, he carried a K21c portable ordnance launcher from Merr-Sonn Munitions and wore a Kalevalan tracker helmet that was equipped with a rangefinder and a device that enabled him to communicate with Nest.\nWeazel was first played by Star Wars veteran Warwick Davis in the 1999 film Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy. Davis reprised the role of Weazel for the 2018 Star Wars Anthology Solo: A Star Wars Story.\nDavis was initially hired to only play the masked character of Wald in The Phantom Menace, but director George Lucas decided during filming that he wanted Davis to appear onscreen unmasked. He accordingly placed Davis inside Watto's viewing box during the Podrace scene, and after hair extensions were glued onto Davis's head. The scene was filmed over one day at Leavesden Studios in England, where, in Davis' own words, he was \"basically sitting in bleachers and moving my head left to right\".\nWeazel's costume in Solo was inspired by the signature Hungarian Hussars' cavalry jacket worn by the English singer and musician Adam Ant in the early 1980s. Additionally, Davis revealed on his Twitter account that Weazel's costume included a piece of Ewok fur on his left shoulder, jokingly adding that the fur wasn't from Wicket, a character he portrayed in Star Wars: Episode VI Return of the Jedi.\nThough Weazel's story between The Phantom Menace and Solo has yet to be revealed, Davis speculated on why Weazel left his life in the criminal underworld to join the Cloud-Riders: in his mind, Weazel realized that he was gambling and getting in the wrong crowd, leading him to think he needed to do something good with his life, though he doesn't know what caused Weazel's transition from criminal to freedom fighter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Weazel",
  "/wiki/Weazel/Legends",
  "/wiki/Tatooine",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Hutt_Clan",
  "/wiki/Cloud-Riders",
  "/wiki/Thief",
  "/wiki/Planet",
  "/wiki/Galactic_Republic",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Mos_Espa",
  "/wiki/Boonta_Eve_Classic",
  "/wiki/Podracing",
  "/wiki/32_BBY",
  "/wiki/Anakin_Skywalker",
  "/wiki/Enfys_Nest",
  "/wiki/Crime_lord",
  "/wiki/Lieutenant_(criminal)",
  "/wiki/Spy",
  "/wiki/Homeworld",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Spaceport",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Watto",
  "/wiki/Toydarian",
  "/wiki/Sebulba",
  "/wiki/Dug",
  "/wiki/File:Enfys-Allies.ogg",
  "/wiki/Tobias_Beckett",
  "/wiki/The_galaxy",
  "/wiki/Crimson_Dawn",
  "/wiki/Beckett%27s_gang",
  "/wiki/11_BBY",
  "/wiki/Callixido_Ryss",
  "/wiki/Moda_Maxa",
  "/wiki/Gargon",
  "/wiki/Raid_on_Gargon",
  "/wiki/Spice",
  "/wiki/Imperial_medical_spice_cache",
  "/wiki/Agent",
  "/wiki/Andressa_Divo",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Army",
  "/wiki/10_BBY",
  "/wiki/Heist_on_Vandor",
  "/wiki/Vandor",
  "/wiki/Val",
  "/wiki/Pilot",
  "/wiki/Rio_Durant",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Coaxium",
  "/wiki/20-T_Railcrawler_conveyex_transport",
  "/wiki/Swoop",
  "/wiki/Y-45_armored_transport_hauler",
  "/wiki/Spice_mines_of_Kessel",
  "/wiki/Kessel",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Savareen",
  "/wiki/Credit",
  "/wiki/Qi%27ra",
  "/wiki/Dryden_Vos",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Galaxy",
  "/wiki/K21c_portable_ordnance_launcher",
  "/wiki/Merr-Sonn_Munitions,_Inc.",
  "/wiki/Kalevalan_tracker_helmet",
  "/wiki/Rangefinder",
  "/wiki/Star_Wars",
  "/wiki/Warwick_Davis",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Prequel_trilogy",
  "/wiki/2018",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/George_Lucas",
  "/wiki/Leavesden_Studios",
  "/wiki/Ewok",
  "/wiki/Wicket_Wystri_Warrick",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Solo_Graphic_Novel_Adaptation",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_2",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_3",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_5",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_6",
  "/wiki/Solo:_A_Star_Wars_Story_Adaptation_7",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Solo:_A_Star_Wars_Story:_Tales_from_Vandor",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Convergence_(Star_Wars:_Destiny)",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Tobias_Beckett_and_Other_Characters_From_the_Underworld",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Solo:_A_Star_Wars_Story_Ultimate_Sticker_Collection",
  "/wiki/September_20",
  "/wiki/April_18",
  "/wiki/2020",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Insider",
  "/wiki/When_Artoo_Met_Wicket",
  "/wiki/Star_Wars_Insider_39",
  "/wiki/The_Art_of_Solo:_A_Star_Wars_Story",
  "/wiki/File:Warwick_Davis_Ewok_fur.png"
 ]
}