{
 "name": "Weeze",
 "display_name": "Weeze",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Security",
      "Galactic Alliance Security"
     ]
    }
   ]
  }
 ],
 "content": "Weeze was a male Rodian sergeant in Galactic Alliance Security. By 43.5 ABY, he was stationed at a secret Galactic Alliance Security blockhouse on Coruscant, where psychotic Jedi Knights Valin and Jysella Horn were being held in carbonite. In 43.5 ABY, he and another Rodian, Rosii, attempted to prevent Jedi Knight Jaina Solo access to the Horns. Weeze quickly panicked, triggering an alarm just before a large group of Jedi and press arrived. Solo then presented a legal document allowing them all access to the Horns, and Captain Atar, who had just arrived with an assault squad, was forced to allow them to enter.\nWeeze was a male Rodian who served in Galactic Alliance Security in the time following the Second Galactic Civil War. By 43 ABY, he had achieved the rank of sergeant and was stationed at Detention Center 81, a secret Galactic Alliance Security blockhouse on Coruscant, under the command of Yaka Colonel Wruq Retk. Two Jedi Knights, Valin and Jysella Horn, developed a mysterious psychosis, and the Galactic Federation of Free Alliances decided to encase them in carbonite, eventually placing them in the blockhouse in which Weeze was stationed.\nThe Jedi Order discovered their location, however, and tricked Arabelle Lorteli, the head judge of the Court of Jedi Affairs, into giving them a document allowing them visitation rights to the Horn siblings. Jedi Knight Jaina Solo was the first to enter the facility, and Weeze and another Rodian, Rosii, confronted her in the lobby. Solo requested to see the Horns, but the Rodians feigned innocence, pretending the building was simply a storage facility. Weeze eventually panicked, however, and pressed an alarm button, causing Solo to push the Rodians backward and toss aside their blasters with the Force as a group of Jedi Masters and press arrived. As Solo finally presented the document to Weeze—who still denied that the facility was used for anything more than storage—a Galactic Alliance assault squad under the command of Captain Atar arrived. The Jedi then showed the visitation rights to Atar, who was forced to allow them access to the Horns.\nWeeze was corpulent and rather fearful of Jedi. Alongside Rosii, a fellow Rodian, Weeze ineffectually attempted to convince Jedi Knight Jaina Solo that the blockhouse was just a storage facility. Even when faced with legal documents proving that the building was the detention center in which the Horn siblings were being held, Weeze feigned innocence, sticking to his story that the facility was used only for storage.\nWeeze was created by author Troy Denning for Fate of the Jedi: Abyss, his first installment—and the third novel overall—in the nine-part Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Sergeant/Legends",
  "/wiki/43_ABY",
  "/wiki/Galactic_Alliance_Security_Detention_Center_81",
  "/wiki/Galactic_Alliance_Security_blockhouse",
  "/wiki/Coruscant/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/Jysella_Horn",
  "/wiki/Carbonite/Legends",
  "/wiki/Rosii",
  "/wiki/Jedi/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Captain/Legends",
  "/wiki/Atar",
  "/wiki/Squad/Legends",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Military_rank/Legends",
  "/wiki/Yaka",
  "/wiki/Colonel/Legends",
  "/wiki/Wruq_Retk",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Valin_Horn",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Mind_trick/Legends",
  "/wiki/Arabelle_Lorteli",
  "/wiki/Judge/Legends",
  "/wiki/Court_of_Jedi_Affairs",
  "/wiki/Telekinesis/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Troy_Denning",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Outcast"
 ]
}