{
 "name": "Wef",
 "display_name": "Wef",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Melbu"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown",
      "with green mottling"
     ]
    }
   ]
  }
 ],
 "content": "Wef was a Melbu arms dealer who operated during the Imperial Era, trading with various individuals for years. Following an encounter with a member of the Hidden Hand criminal syndicate, Wef conducted business with the organization and worked out of an outpost on the world Heva. Sometime before the Battle of Hoth, the cyborg Beilert Valance and his crew of bounty hunters visited Wef's outpost during their hunt for the Sith Lord Darth Vader. The bounty hunters acquired a collection of bot-drones that Wef intended to sell to another buyer and used them against an Imperial Star Destroyer that had pursued them to Heva.\nWef was an arms dealer who conducted deals with various individuals over the years. During the Imperial Era, the dealer arranged a trade with a criminal syndicate, the Pykes, but found the clients dead at the meetup point. There remained standing only a Chagrian, who told Wef that the Hidden Hand criminal organization was offering a deal three times better than the Pykes. In order to stay alive, Wef accepted the deal and went into business with the Hidden Hand. Sales skyrocketed for Wef, who traded with various Hidden Hand go-betweens over the years, including a few humans and a green-skinned individual, and the arms dealer eventually came to operate from a Hidden Hand outpost on the world of Heva.\nAt some point prior to the Battle of Hoth in 3 ABY, Rebak, a member of the Rebellion, expressed interest in purchasing a collection of bot-drones belonging to the Hidden Hand that Wef had been in possession of for years. The weapons were originally intended for use by the Galactic Empire but were ultimately rejected due to their unstable technology. However, Wef found another interested buyer in a crew of bounty hunters led by the cyborg Beilert Valance who had come to the Hidden Hand outpost on Heva during their hunt for the Dark Lord of the Sith Darth Vader.\nAs Wef led Dengar and Honnah, two members of Valance's crew, through the Heva outpost, the arms dealer revealed that they had competition for buying the bot-drones. Wef would have given the bot-drones to the hunters for nothing because of their unreliability but explained that the Hidden Hand had found another buyer, so the hunters would need to offer more money. When the hunters asked what Wef knew about the Hidden Hand, the dealer spoke to the group's secrecy but remarked how partnering with the criminal organization had brought great business. However, Wef also noted that there had been something strange in the behavior of all the Hidden Hand contacts, likening them to bounty hunters.\nWhile Valance's team inspected Wef's bot-drones at the outpost's command center, the arms dealer asked them why they needed the drones. Valance then pointed to the sky, revealing that the Imperial Star Destroyer Formidable had arrived at Heva with Vader on board. The Dark Lord had tracked down the hunters, having received information about their whereabouts from Dengar, the informant in Valance's crew. Upon sighting the Star Destroyer, Wef stated that they were all going to die. However, using the bot-drones they acquired, Valance and his team succeeded in destroying the Imperial warship.\nWef valued life nearly as much as credits and was happy to do business as an arms dealer with anyone so long as there was a paying customer involved. Wef considered the Rebellion to be the \"good guys\" in terms of galactic politics while finding the criminal Pyke Syndicate to be of dubious morality, but the arms dealer nevertheless went into business with the Hidden Hand out of mortal fear.\nWhile dealing with Beilert Valance's group of bounty hunters on Heva, Wef openly disclosed private business information, such as revealing the identity of the other party interested in acquiring the bot-drones and the arms dealer's previous interactions with the Pykes. Wef expressed a personal affinity and trust for the hunters Dengar and Honnah. However, Wef later scolded Valance's slicer, Chio Fain, after seeing him tinkering with the bot-drones and treating them like \"toys.\" The presence of the Imperial Star Destroyer Formidable in Heva's skies convinced Wef that their entire party was doomed. A member of the Melbu species, Wef had orange eyes and brown skin mottled with green.\nWef wore reddish-orange robes and a dark-green, long-sleeved undergarment while on Heva, and also used a breathing mask connected to the respirator horns, which was typical of Melbu. The arms dealer had been sitting on a number of bot-drones for years due to their unreliable technology before Beilert Valance and his bounty hunters acquired them and used them to destroy the Star Destroyer Formidable.\nWef appeared in the third issue of the comic-book miniseries Star Wars: Target Vader, written by Robbie Thompson, illustrated by Stefano Landini, and published by Marvel Comics on September 25, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Melbu",
  "/wiki/Color",
  "/wiki/Arms_dealer",
  "/wiki/Imperial_Era",
  "/wiki/Merchant",
  "/wiki/Standard_year",
  "/wiki/Unidentified_Chagrian_middle_man",
  "/wiki/Hidden_Hand",
  "/wiki/Heva_Hidden_Hand_outpost",
  "/wiki/Heva",
  "/wiki/Battle_of_Hoth",
  "/wiki/Cyborg",
  "/wiki/Beilert_Valance",
  "/wiki/Gender",
  "/wiki/Beilert_Valance%27s_crew",
  "/wiki/Bounty_hunter",
  "/wiki/Hunt_for_Vader",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Anakin_Skywalker",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Bot-drone",
  "/wiki/Rebak",
  "/wiki/Formidable",
  "/wiki/Pyke_Syndicate",
  "/wiki/Death",
  "/wiki/Human",
  "/wiki/3_ABY",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Empire",
  "/wiki/Dengar",
  "/wiki/Honnah",
  "/wiki/Droid",
  "/wiki/Drone",
  "/wiki/Currency",
  "/wiki/Imperial_II-class_Star_Destroyer",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Warship",
  "/wiki/Credit",
  "/wiki/The_galaxy",
  "/wiki/Politics",
  "/wiki/Slicer",
  "/wiki/Chio_Fain",
  "/wiki/Species",
  "/wiki/Eye",
  "/wiki/Robe",
  "/wiki/Clothing",
  "/wiki/Breath_mask",
  "/wiki/Target_Vader_3",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Target_Vader",
  "/wiki/Robbie_Thompson",
  "/wiki/Stefano_Landini",
  "/wiki/Marvel_Comics",
  "/wiki/September_25",
  "/wiki/2019",
  "/wiki/Category:Images_of_Wef",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Hoth",
  "/wiki/Target_Vader_4",
  "/wiki/Target_Vader_2",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide"
 ]
}