{
 "name": "Wehutti",
 "display_name": "Wehutti",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Melida/Daan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pale green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Melida"
     ]
    }
   ]
  }
 ],
 "content": "Wehutti was a leader of the Melida in the generations-long war on the planet Melida/Daan. He was Qui-Gon Jinn and Obi-Wan Kenobi's contact when the Master and Padawan team were sent to the planet to rescue Tahl, a Jedi who had been kidnapped by the Melida after peace negotiations she had been mediating broke down. Wehutti was a staunch Melida, and like many on both sides of the conflict, had lost a loved one to the fighting—his wife. He had two children, a daughter named Cerasi and a son.\nCerasi was one of the Young, a movement of children and teenagers trying to end the centuries of warfare between the the Melida and the Daan. After the Young ended the war and began rebuilding the planet with the help of Obi-Wan Kenobi, infighting led to a split within the group and conflict broke out with the Elders  over the destruction of Melida/Daan's Halls of Evidence, shrines to the war where holograms, ashes, and mementos of the dead were stored. The Elders and the Young confronted each other outside the Hall where the ashes of Wehutti's wife  were kept. Both sides were heavily armed and ready to begin fighting, despite the efforts of Kenobi, when Cerasi emerged from a grate and rushed towards the middle to try and stop the two groups from fighting, but she was shot and killed. Wehutti was devastated by his daughter's death, and like Nield was wracked with guilt because he thought he might have killed her. He withdrew completely, cutting off contact with his followers and isolating himself until Kenobi contacted Qui-Gon Jinn for help and the two talked with him.\nHowever, Wehutti was unwilling to help the Jedi. Meanwhile, another conflict between the two factions of the Young—one of them a splinter group led by Mawat—was gearing up, but it was stopped when Jinn played back a recording of Cerasi where she pleaded for everyone to support peace. Wehutti learned soon afterward that Cerasi was killed by a sniper placed on a rooftop by Mawat, and that he was not responsible for the death of his daughter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Melida/Daan",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Melida",
  "/wiki/Melida/Daan_Civil_War",
  "/wiki/Planet/Legends",
  "/wiki/Qui-Gon_Jinn/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Tahl",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Wehutti%27s_wife",
  "/wiki/Cerasi",
  "/wiki/Cerasi%27s_brother",
  "/wiki/The_Young",
  "/wiki/Daan_(people)",
  "/wiki/Young%E2%80%93Elders_War",
  "/wiki/Elders_(Melida/Daan)",
  "/wiki/Hall_of_Evidence",
  "/wiki/Hologram/Legends",
  "/wiki/Nield",
  "/wiki/Mawat",
  "/wiki/Jedi_Apprentice:_The_Defenders_of_the_Dead",
  "/wiki/Jedi_Apprentice:_The_Uncertain_Path",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}