{
 "name": "Wen_Gallo",
 "display_name": "Wen Gallo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Manaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Selkath"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Manaan Special Warfare Group"
     ]
    }
   ]
  }
 ],
 "content": "Wen Gallo was a Selkath female who was a Colonel of the Manaan Special Warfare Group. Around 3626 BBY when the reconstituted Sith Empire invaded Manaan she was a leader of the Selkath resistance that provided aid to the Galactic Republic. When the leader of Task Force Nova arrived on the planet she helped them disable the ion cannon.\nFounding member and current field leader of the Manaan Special Warfare Group . Gallo distinguished herself early in her service career during the Battle of Gwaria Trench by refusing to retreat after her company suffered significant losses to kolto raiders. Marshaling the remaining soldiers, her group slowed the enemy advance with guerilla tactics until a proper response could be mustered. The incident would later be cited as the final push needed to form the MSWG.\nDuring the Sith Empire's invasion of Manaan Colonel Gallo joined forces with the Republic to prevent the Empire from taking kolto.\nWhen she boarded one of the imperial ships she was nearly killed by Major Cadmael Benthos Dosk who vented out the oxygen from the room she was in. Shortly after leader of Task Force Nova and Jedi Knight Arn Peralun who sabotaged the ship arrived and found her unconcious. They used the escape pods to get her to safety, but also leaving the kolto in the falling ship.\nGallo is known across Manaan as a hero, loyalist, and an uncompromising advocate of her people. Far from a diplomat, her time as leader of the MSWG has only hardened her suspicions towards offworlders and has resulted in the occasional interplanetary incident due to her candor. Gallo has refused several promotions, preferring to remain in the field to personally oversee operations.\nWen Gallo appears in the Republic storyline of Star Wars: The Old Republic: Legacy of the Sith.\nThe player can choose a dark side option to let Gallo die in the falling ship and use the escape pods to save kolto.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wen_(disambiguation)",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Manaan/Legends",
  "/wiki/Selkath/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Manaan_Special_Warfare_Group",
  "/wiki/Colonel/Legends",
  "/wiki/3626_BBY",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Invasion_of_Manaan",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Task_Force_Nova",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Kolto/Legends",
  "/wiki/Major/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Arn_Peralun",
  "/wiki/Star_Wars:_The_Old_Republic:_Legacy_of_the_Sith"
 ]
}