{
 "name": "Westa_Impeveri",
 "display_name": "Westa Impeveri",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Westa Impeveri was a Human male who was an elected senior counselor of the Hedrett Town Council during the waning years of the Galactic Republic.\nWesta Impeveri grew up in the Outer Rim. He was a small-time criminal who served as a spokesperson and intermediary for various minor crime lords. His employers kept changing due to power struggles and assassinations, or sometimes his services were bet away in sabacc games. Trying to escape that life, Impeveri stowed away on a ship heading for Corellia, but he was discovered and tossed off in Hedrett.\nMaking the best of the situation, Westa Impeveri got involved in the local politics in 33 BBY. His knack for gathering secrets served him well in his new career. Sometime during this period, Impeveri fathered a daughter. Eventually, after serving a time as a junior counselor, he used the power of those secrets to oust a popular senior counselor and get elected senior counselor himself. His opponent in the election, Karid Blakken, accused Impeveri of rigging the ballot box. The votes were recounted, but Impeveri was found innocent of that charge.\nWesta had a very open and trustworthy air about him, which made it easy for people to confide in him. He was only a competent senior counselor, but his apparent openness made him a lot of friends on the council.\nIn around 20 BBY, Counselor Impeveri traveled to the Almas Academy, to take part in a private ceremony of gratitude towards the heroes who defeated slaver Phylus Mon.\nIn the 2008 reference book The Complete Star Wars Encyclopedia, Impeveri's slicer handle from the Living Force article Destabilization, \"IMPEVERI,\" was misspelled \"IMPEREVI.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Hedrett",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Alina_Impeveri",
  "/wiki/Karid_Blakken",
  "/wiki/20_BBY/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Phylus_Mon",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Westa_Impeveri",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Destabilization_(RPG_adventure)",
  "/wiki/An_Uneasy_Peace",
  "/wiki/Oblivion%27s_Kiss",
  "/wiki/Quarters",
  "/wiki/Halves",
  "/wiki/Holes",
  "/wiki/Peaces",
  "/wiki/Here_and_Thaere",
  "/wiki/Force_Convergence",
  "/wiki/A_Mon_Alone",
  "/wiki/The_Heart",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Wizards.com",
  "/wiki/A_Changing_Galaxy",
  "/wiki/That_Is_Nirama%27s_Word",
  "/wiki/Political_Platforms",
  "/wiki/Tramsig%27s_Plan",
  "/wiki/Standard_year/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Philology",
  "/wiki/Cularin%27s_disappearance",
  "/wiki/Time/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Night%27s_Homecoming"
 ]
}