{
 "name": "White_Loth-cat",
 "display_name": "White Loth-cat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Loth-cat"
     ]
    },
    {
     "name": "Height",
     "values": [
      "0.94 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  }
 ],
 "content": "A white Loth-cat acted as a guide to Jedi Padawan Ezra Bridger when he returned to his homeworld of Lothal on three occasions. On the first occasion, Ezra was seeking a prisoner named Ryder Azadi who knew his parents Ephraim and Mira Bridger. On the second occasion, the white Loth-cat helped him and Sabine Wren hide a stolen hyperdrive unit from a wrecked TIE/D Defender Elite. The Loth-cat also introduced Ezra to the White Loth-wolf, who carried him and Sabine back to their rebel comrades. On the third occasion, the white Loth-cat helped Ezra and Garazeb Orrelios find the stolen hyperdrive unit.\nIn 3 BBY, the Lothalite rebel Ezra Bridger was sleeping aboard the starship Ghost when he saw the white Loth-cat in a Force vision of his parents Ephraim and Mira Bridger. Ezra later discussed the vision with his Jedi master Kanan Jarrus and leader Hera Syndulla. While focusing on a list of prisoners who had escaped an Imperial prison, Ezra saw a vision of the white loth-cat and a helmeted man known as Prisoner X-10, who turned out to be Ryder Azadi.\nAfter escaping the Imperial assault on Garel, Ezra and his master Kanan Jarrus traveled to Lothal to seek out Prisoner X-10, hoping he could advise on the whereabouts of Ezra's parents. After landing in Capital City, Ezra encountered the white loth-cat that he had seen in his vision. When he approached the creature, it reacted with hostility and led him on a chase. Though the loth-cat managed to escape on a speeder bike, Ezra managed to plant a tracker on the bike. This led them to the adobe of the fugitive Ryder Azadi, the former Governor of Lothal who had been imprisoned for defending Ezra's parents. Ryder informed Ezra that his parents had died during an escape attempt from an Imperial prison.\nIn 1 BBY, Ezra and his fellow Spectres returned to Lothal to resist the Imperial occupation and take out Grand Admiral Thrawn's TIE/d \"Defender\" Multi-Role Starfighter factory. After Ezra and the Mandalorian rebel Sabine Wren stole a prototype TIE/D Defender Elite and crashed it in Lothal's wilderness, the white loth-cat reappeared and guided him to an alcove. Ezra and Sabine hid a hyperdrive which they had stolen from the wrecked TIE Defender Elite inside that alcove. Later in the night, the white loth-cat appeared on top of a White Loth-wolf which came to the aid of the lost Ezra and Sabine. This White loth-wolf helped Ezra and Sabine find their rebel comrades.\nThe following day, the white loth-cat appeared on top of the alcove while Ezra and his rebel comrades Jai Kell and Garazeb Orrelios were searching for the stolen TIE/D Defender Elite's hyperdrive unit. Ezra and a skeptical Zeb followed the Loth-cat and found the hyperdrive unit under a rock. The stolen hyperdrive unit enabled General Syndulla to return to Yavin 4 aboard Ryder's UT-60D U-wing starfighter/support craft with the stolen TIE Defender Elite's flight data recorder.\nAt some point following the Battle of Endor, Ezra's friend Sabine Wren rode her speeder bike past a creature resembling the white loth-cat, who was stalking the grass. A pack of loth-wolves including the white loth-wolf also ran past. She then met with Ahsoka Tano and departed on a mission to find Ezra and bring him home.\nThe White Loth-cat had white fur, blue eyes, triangular ears, and a tail. It had a special connection to the Force and was able to manifest in Ezra's Force visions. While the Loth-cat was initially skittish around Ezra, it appeared to be acquainted with Ryder and even rode on his speeder bike. The White Loth-cat later helped Ezra hide a stolen TIE/D Defender Elite hyperdrive unit and also introduced him to the White Loth-wolf, another creature which had a strong connection to the Force on Lothal. The White Loth-cat later helped Ezra and his rebel comrades recover the TIE/D Defender Elite hyperdrive, which enabled them to bring intelligence about Thrawn's TIE/D Defender program to the Rebel Alliance.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Special:Upload",
  "/wiki/Lothal",
  "/wiki/Loth-cat",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Ezra_Bridger",
  "/wiki/Ryder_Azadi",
  "/wiki/Ephraim_Bridger",
  "/wiki/Mira_Bridger",
  "/wiki/Sabine_Wren",
  "/wiki/Hyperdrive",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/White_Loth-wolf",
  "/wiki/Garazeb_Orrelios",
  "/wiki/3_BBY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Lothalite",
  "/wiki/Starship",
  "/wiki/Ghost",
  "/wiki/Force_vision",
  "/wiki/Kanan_Jarrus",
  "/wiki/Hera_Syndulla",
  "/wiki/Revolt_in_an_Imperial_prison",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Garel",
  "/wiki/Garel",
  "/wiki/Capital_City",
  "/wiki/Speeder_bike",
  "/wiki/Governor",
  "/wiki/1_BBY",
  "/wiki/Spectres",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/TIE/d_%22Defender%22_Multi-Role_Starfighter",
  "/wiki/Mandalorian",
  "/wiki/Jai_Kell",
  "/wiki/General",
  "/wiki/Yavin_4",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Flight_data_recorder",
  "/wiki/Battle_of_Endor",
  "/wiki/Ahsoka_Tano",
  "/wiki/The_Force",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Legacy_(episode)",
  "/wiki/A_Princess_on_Lothal",
  "/wiki/Flight_of_the_Defender",
  "/wiki/Kindred",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:White_Loth-cat",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}