{
 "name": "White_Loth-wolf",
 "display_name": "White Loth-wolf",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Lothal"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Loth-wolf"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow/orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Force"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Ezra Bridger",
      "Kanan Jarrus"
     ]
    }
   ]
  }
 ],
 "content": "The White Loth-wolf was a mysterious Force-sensitive white Loth-wolf from the planet Lothal. It led a pack of loth-wolves and was able to travel through time and space. The white loth-wolf and his pack befriended the Lothalite Jedi Padawan Ezra Bridger and his Spectres rebel cell during the early rebellion against the Galactic Empire. The white loth-wolf and his pack contributed to the Spectres and Lothal resistance group's successful efforts to drive the Empire from Lothal in 1 BBY.\nThe white loth-wolf was the leader of a pack of loth-wolves that roam the grassy plains of the planet Lothal during the Imperial Era. In 1 BBY, the white loth-wolf stalked the Jedi rebel Ezra Bridger while he was infiltrating an Imperial testing facility to steal a TIE/D Defender Elite prototype. After Ezra and his Mandalorian comrade Sabine Wren had crash-landed the starfighter in Lothal's wilderness, the white loth-wolf encountered the two rebels.\nThe white loth-wolf put Sabine to sleep, startling Ezra. At that point, a White Loth-cat appeared on top of the wolf, reassuring Ezra of the latter's peaceful intentions. With an Imperial patrol transport approaching, Ezra told the loth-wolf and loth-cat that he did not like the Empire. The white loth-wolf then gave Ezra and Sabine a ride to the rebel camp where the other Spectres and Ryder Azadi had regrouped. Before leaving, Ezra asked the loth-wolf why he had helped them. The wolf gave him the cryptic message \"Dume\"  before vanishing into the fog. Ezra later related his encounter with the loth-wolf to Kanan. While Kanan was unsure about the loth-wolf, he believed that all paths were coming together.\nAfter retrieving the TIE Defender Elite's hyperdrive, Ezra's Spectres rebel cell and Ryder Azadi's Lothal resistance group fled into a series of caves. There, they encountered three loth-wolves including the white loth-wolf. When Ezra asked the white loth-wolf if it knew the way out, the creature looked at Kanan. The white loth-wolf and his companions then led the rebels through a tunnel, which was lined with cave paintings showing people following wolves. As the wolves led the rebels into a cave, they mysteriously disappeared into the walls. In fact, they had used a tunnel to enter the World Between Worlds, a mystical plane outside of time and space.\nLater, Ezra found his master Kanan spending time with the white loth-wolf inside the cave. Ezra believed that the cave paintings told the story of Jedi coming from space and following the wolves. When Kanan asked the white loth-wolf why it had help them, the wolf merely said \"Dume.\" Through that encounter, Ezra learned that his master Kanan was once called Caleb Dume. Kanan confided with Ezra his belief that the wolves were linked to the Force and that the Empire was doing something \"terrible\" to Lothal. The white loth-wolf then disappeared into the wall.\nDuring General Hera Syndulla's failed raid on the TIE/D Defender factory in Capital City, the white loth-wolf intercepted Kanan while he was traveling on a speeder bike into Lothal's capital. The appearance of the white loth-wolf caused Kanan to brake, causing him to fall off his bike. When the wolf disappeared, Kanan angrily told the wolf that to stay out of his way if he was not there to help. The white loth-wolf then materialized in front of him. When Kanan asked the wolf what he wanted, the creature growled \"Dume\" and was joined by two other loth-wolves. Realizing that he needed to act like the Jedi he was, Kanan rescued Mart Mattin and retreated to the Rebel camp.\nPrior to Kanan's death during the mission to rescue Hera, the white loth-wolf watched Kanan, Ezra, and Sabine as they departed from the Lothal rebel base in three loth-bat gliders.\nFollowing Kanan's death, the white loth-wolf and two smaller black wolves confronted Ezra while he was grieving over his master's death. When Ezra tried to run, one of the black wolves knocked him to the ground. As Ezra faded out of consciousness, he found the white loth-wolf staring down at him.\nThe wolves brought Ezra to their leader \"Dume,\" an abnormally large gray loth-wolf with white markings on its head. \"Dume\" was the manifestation of the Cosmic Force carrying out the will of Jarrus. \"Dume\" told Ezra that the Empire was threatening the Lothal Jedi Temple and left him with a key stone needed to unlock the Painting of the Mortis gods and enter the mystical World Between Worlds.\nThe following day, the white loth-wolf and his pack met with Ezra and the other Spectres outside the Lothal cliff dwelling. Ezra told the white loth-wolf they were ready and ask if he could take them. The white loth-wolf then bent down and allowed Ezra to mount him. The other Spectres also mounted the other loth-wolves with one wolf carrying Chopper in its mouth.\nThe white loth-wolf and his pack then generated a hyper tunnel, which allowed them to travel swiftly to the Lothal Jedi Temple, which was located on the planet's northern hemisphere. The loth-wolves transported the rebels near a cliff overlooking the Jedi Temple. The wolves told Ezra that the Jedi Temple was not far away but that they would have to walk there themselves before departing.\nThe Spectres managed to stop the Empire from gaining access to the World Between Worlds, a mystical realm that allowed one to control time and the universe. However, by sealing the portal to that realm, they cause the Lothal Jedi Temple to sink into the earth. Following the mission to the Jedi Temple, Ezra caught a glimpse of the white loth-wolf. Associating the wolf with Kanan, Ezra said \"goodbye\" to his master before rejoining his rebel comrades aboard a stolen Mining Guild excavation driller.\nThe white loth-wolf and the rest of his pack came to Ezra and the Lothal rebels' aid when Governor Arihnda Pryce's forces attacked the Lothal cliff-dwelling. After Ezra led the Imperial Noghri assassin Rukh and several stormtroopers into a cave, the white loth-wolf and two other wolves attacked the stormtroopers, killing and mauling several. The white loth-wolf also personally flung Rukh down a cliff.\nWhile the surviving stormtroopers surrendered, the white loth-wolf carried Governor Pryce in its jaws and dropped her in front of the rebels Ryder Azadi, Rex, and Alexsandr Kallus. Ezra then accepted Pryce's surrender and took her prisoner.\nEzra later used the white loth-wolf to frighten Pryce into assisting the rebels' plan to infiltrate the \"Dome\" so that they could drive the Empire from Lothal and show the galaxy that the Empire could be defeated.\nThe white loth-wolf later came to the aid of the rebels Mart Mattin, Wolffe, and Cikatro Vizago when they were attacked by Rukh. He stopped Rukh from shooting Mart and forced him to leave on an Imperial patrol transport. By saving Mart and his comrades, the white loth-wolf helped them to carry out Ezra's plan to summon a pod of purrgil to wipe out Grand Admiral Thrawn's blockading fleet and carry Thrawn and Ezra away into the depths of uncharted space.\nTo honor his role in the Liberation of Lothal, the Mandalorian artist Sabine Wren painted a mural depicting the white loth-wolf and another loth-wolf flanking the Spectres, including the late Kanan Jarrus and several loth-cats.\nThe white loth-wolf was a large male canine creature that led a pack of loth-wolves. It had the ability to speak and understand language, as well as traveling through time and space to teleport to other locations. The white Loth-wolf served the will of the Force, and seemingly by extension of the Jedi Knight Kanan Jarrus after his death.\nThe white loth-wolf also had a special bond with the Jedi Ezra Bridger, helping him on several occasions including reuniting him and Sabine with his rebel comrades; transporting him and his fellow Spectres to the Lothal Jedi Temple; defeating Governor Pryce and her stormtroopers; and stopping Rukh from killing Mart Mattin, thus allowing him to initiate Ezra's back-up plan to summon a pod of purrgil to Lothal.\nThe Jedi Knight Kanan was also able to make contact with the white loth-wolf due to his Force sensitivity. As a result, Kanan realized that the white loth-wolf served the will of the Force. The white loth-wolf also once protected Kanan by convincing him to turn back from Lothal's Capital City following Hera's failed attack on the TIE Defender factory. Despite its alpha status, the white loth-wolf once allowed \"Dume\", an incarnation of Kanan's will in the Cosmic Force to take leadership of his pack out of respect for Kanan.\nThe white loth-wolf, like other members of his species, was larger than most sentient beings including humans. He had the ability to put beings such as Sabine Wren to sleep. The white loth-wolf and other members of his species were also capable of teleporting through space and time by generating hyper tunnels. As a loth-wolf, he was capable of inflicting considerable damage with his large jaws and teeth. The white loth-wolf's jaws were big enough to carry an adult human like Governor Pryce.\nThe episode gallery of \"A World Between Worlds\" states on slide 10 that the white Loth-wolf is named Dume. In an interview, series supervising director and writer Dave Filoni stated that the only wolves that are \"real\" are probably the gray wolves, and that the white Loth-wolf was more of a guide.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Lothal",
  "/wiki/Loth-wolf",
  "/wiki/Color",
  "/wiki/The_Force",
  "/wiki/Ezra_Bridger",
  "/wiki/Kanan_Jarrus",
  "/wiki/Force-sensitive",
  "/wiki/Planet",
  "/wiki/Time",
  "/wiki/Realspace",
  "/wiki/Lothalite",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Spectres",
  "/wiki/Early_rebellion_against_the_Galactic_Empire",
  "/wiki/Galactic_Empire",
  "/wiki/Lothal_resistance_group",
  "/wiki/1_BBY",
  "/wiki/Imperial_Era",
  "/wiki/Lothal_Imperial_airfield",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/Mandalorian",
  "/wiki/Sabine_Wren",
  "/wiki/Sleep",
  "/wiki/White_Loth-cat",
  "/wiki/LAAT/le_patrol_gunship",
  "/wiki/Ryder_Azadi",
  "/wiki/Hyperdrive",
  "/wiki/Hyperspace_tunneling",
  "/wiki/World_Between_Worlds",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Attack_on_Lothal",
  "/wiki/Imperial_Armory_Complex",
  "/wiki/Capital_City",
  "/wiki/Speeder_bike",
  "/wiki/Mart_Mattin",
  "/wiki/Death",
  "/wiki/Rescue_of_Hera_Syndulla_(Lothal)",
  "/wiki/Lothal_cliff_dwelling",
  "/wiki/Loth-bat_glider",
  "/wiki/Dume_(Loth-wolf)",
  "/wiki/Cosmic_Force",
  "/wiki/Excavation_of_the_Lothal_Jedi_Temple",
  "/wiki/Lothal_Jedi_Temple",
  "/wiki/Lothal_Jedi_Temple_key_stone",
  "/wiki/Painting_of_the_Mortis_gods",
  "/wiki/Portal",
  "/wiki/Mission_to_the_Lothal_Jedi_Temple",
  "/wiki/Mining_Guild_excavation_driller",
  "/wiki/Governor",
  "/wiki/Arihnda_Pryce",
  "/wiki/Noghri",
  "/wiki/Rukh",
  "/wiki/Stormtrooper",
  "/wiki/Rex",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Imperial_Complex_(Lothal)",
  "/wiki/The_galaxy",
  "/wiki/Wolffe",
  "/wiki/Cikatro_Vizago",
  "/wiki/Purrgil",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Spectres_mural",
  "/wiki/Loth-cat",
  "/wiki/Gender",
  "/wiki/Language",
  "/wiki/Jedi_Knight",
  "/wiki/Human",
  "/wiki/A_World_Between_Worlds",
  "/wiki/Dave_Filoni",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Flight_of_the_Defender",
  "/wiki/Kindred",
  "/wiki/Rebel_Assault",
  "/wiki/Jedi_Night",
  "/wiki/DUME",
  "/wiki/Wolves_and_a_Door",
  "/wiki/A_Fool%27s_Hope",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/In-universe",
  "/wiki/Special:EditPage/:White_Loth-wolf",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/February_25",
  "/wiki/2018",
  "/wiki/February_27"
 ]
}