{
 "name": "Wicket_Wystri_Warrick",
 "display_name": "Wicket Wystri Warrick",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "0.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brownish black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Warrick family",
      "Bright Tree tribe",
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Wicket Wystri Warrick was a male Ewok scout and warrior on the forest moon of Endor. Wicket also played an instrumental role in helping the Rebel Alliance defeat the Galactic Empire during the Battle of Endor. By 35 ABY, Warrick had a son named Pommet, with whom he watched the uprising on Endor.\nWhen Wicket Wystri Warrick was still a young warrior, the Galactic Empire ruled by Emperor Sheev Palpatine landed on Endor to construct a shield generator to protect their second Death Star. Despite the disparity in technology and firepower between the Ewoks and the Imperial forces, Wicket devised plans for defeating the Imperial war machines.\nThe Imperial activity continued on Endor as construction on the new Death Star progressed. Meanwhile, the Rebel Alliance had sent a strike team to the forest moon to deactivate the shield protecting the giant weapon. One day, Wicket came across the crash site of a pair of Imperial speeder bikes. He cautiously approached the only survivor, a human woman, prodding her with his spear until she regained consciousness. This woman was Leia Organa, Princess of Alderaan and a leader of the Rebel Alliance.\nWicket remained leery until the woman offered him some food to eat. He found the food to be very good, but he again became fearful of Organa, though she was merely removing her helmet. He began to inspect the headgear but stopped and grabbed his spear when he heard more Imperials. When the Imperial scout troopers fired at them, Wicket and Organa hid behind a log until another blast hit. At that point Wicket rolled out of sight. Then, as a scout trooper approached Organa at gunpoint, Wicket realized she was no friend of the Imperials, so he attacked the trooper's legs, giving Organa a chance to swing at the trooper, grab her blaster, and shoot the other Imperial before he could get away. As they headed off, Wicket urged Organa to follow him to his home village.\nOn the way home, Wicket and Leia came upon two stormtroopers who had stopped two other Ewoks and were attempting to arrest them. Wicket climbed a nearby tree and created a trap by tying a lasso from a vine. He then lowered the lasso over the stormtroopers, snaring them. Wicket jumped from the tree, holding the other end of the vine in order to hang the stormtroopers from the tree; however, Wicket was not heavy enough to pull the stormtroopers. Organa assisted, grabbing hold of Wicket, causing the stormtroopers to rise and be knocked unconscious by a tree branch. Wicket, Organa, and the two other Ewoks continued to Bright Tree Village. Upon arriving at the village, Wicket presented Organa with a dress as a gift for helping him save his fellow villagers.\nMeanwhile, other Ewoks had captured and brought in the rest of the Rebels: Luke Skywalker, Han Solo, Chewbacca, and the droids R2-D2 and C-3PO. The Ewoks treated C-3PO as a god, and the Ewok shaman Logray insisted that the other Rebels be sacrificed in the droid's honor. The proceedings were halted when Skywalker used the Force to lift C-3PO into the air and convince the Ewoks that it was a show of the droid's \"magic.\" This frightened the Ewoks, including Wicket, and caused them to run away, but they soon returned and untied the Rebels under Logray's orders. Once freed, R2-D2 used one of his built-in devices to deliver a mild electrical shock to Teebo in retaliation.\nThat night, the Rebels had an audience with the Ewok leaders in hopes of encouraging them to join their cause. C-3PO animatedly told the Rebels' tale. At the end of the meeting, Chief Chirpa declared that the Rebels would become part of their tribe. Wicket embraced Captain Solo as the Ewoks welcomed their new comrades.\nWicket and another Ewok, Paploo, then joined with Solo, Organa, Chewbacca, and the droids to meet up with the Rebel commandos. They arrived a ridge overlooking the Imperial landing platform, and from there Wicket and Paploo led them to a \"secret\" entrance on the other side of the ridge. There, as Paploo distracted the scout troopers to allow the Rebels to sneak inside the shield generator bunker, Wicket stayed behind with the droids. He remained there until they spotted more Imperials arriving; realizing the Rebels were in trouble, Wicket ran to get help. After the Rebels were led back out of the bunker at gunpoint, Wicket returned—and he brought with him an entire army of Ewoks. The Battle of Endor had begun.\nThe Ewoks attacked with a variety of weapons and traps. Wicket joined a group hunting with bolas, and while his own attack backfired and knocked Wicket to the ground, the only injury was to his ego. The battle raged on, and the Rebels tried to make their way back into the bunker. The Rebels eventually destroyed the shield generator, allowing the fleet above the planet to destroy the Death Star, and the body of Emperor Palpatine along with it. As the victors celebrated on Endor, Solo and Organa shared an intimate moment—one which Wicket didn't hesitate interrupting to share in the jubilation.\nAt a village-wide party where the Ewoks and Rebels celebrated their victory in the battle, Wicket danced and fraternized with R2-D2. When the Alliance detected Imperial holdouts on the other side of the moon, Wicket and at least five other Ewoks accompanied the strike team out to the site. The Ewoks' curiosity about all the technology and buttons within the shuttle got on the nerves of pilot Shara Bey as she was flying the craft. The strike team quickly took the base and discovered numerous Imperial comm records and plans in the wake of the Emperor's death. Wicket gave Organa an acorn for a serpent's puzzle plant as a gift before she left Endor. At Skywalker's suggestion, the sapling became a part of her meditation exercises.\nEventually, Wicket sired a son, named Pommet Warrick. In 35 ABY, Wicket and Pommet watched as one of the First Order Star Destroyers was destroyed by a heavy freighter via the \"Holdo maneuver,\" as the inhabitants of the galaxy had been inspired by the Resistance's victory against the resurrected Darth Sidious' forces to rise up.\nWicket was portrayed by Warwick Davis in Star Wars: Episode VI Return of the Jedi . The then 11-year-old actor came to be involved in the film after his grandmother heard a radio ad calling for short actors. When Davis' mother called to inquire on his behalf, she was told that Lucasfilm already had enough actors; however, when she mentioned that Warwick was a mere 2 feet, 11 inches tall, they reconsidered him as a possibility for a younger Ewok. Davis then met with production assistant Pat Carr at Elstree Studios, where he was measured for a costume and didn't even have to audition. Davis began work on the film in January 1982. Originally just another Ewok, Davis caught the eye of George Lucas with aspects of his performance, such as his interaction with R2-D2 and the ability to stick his tongue through his Ewok mask. Another part of his performance, inquisitively tilting his head, was inspired by Davis' dog.\nDavis was later taken to America for location shooting. The day Kenny Baker was supposed to shoot the scene in which his character  meets Princess Leia for the first time, Baker fell ill with food poisoning, and so Davis was called in as a replacement. Davis' Ewok eventually became \"Wicket,\" while Baker's became \"Paploo.\" Evidence of the switch remains in the comic book adaptation of Return of the Jedi, where the Ewok stealing the speeder bike is still called Wicket. As for Wicket's voice in the final film, according to Davis, it was performed by an unnamed Native American woman. Since George Lucas' daughter Amanda was a big fan of Wicket, Davis performed the character at a birthday party for her, delivering presents and even letting the kids force-feed him cake.\nConcurrent to the shooting of Return of the Jedi, first assistant director David Tomblin shot a short film on 16 mm film starring Davis called Return of the Ewok. It tells an alternate tale of Warwick Davis landing the role of an Ewok and the trying to find his way to the \"green moon of Endor,\" stopping by Jabba's Palace and Yoda's hut along the way. Davis is in his Wicket costume for much of the film. A short clip, where Boba Fett is pursuing Davis/Wicket on the second Death Star, can be seen in the blooper reel easter egg on the 2004 bonus DVD for the original trilogy.\nDavis reprised his role for the television movies Caravan of Courage: An Ewok Adventure  and Ewoks: The Battle for Endor , and later for Star Wars: Episode IX The Rise of Skywalker . For the latter, a new Wicket costume had to be built, since the original costume and design had been lost. Costume designers used Davis' personal photos for reference in recreating the costume.\nWicket was also a main character in the animated television series Ewoks from 1985–1986, a related 14-issue comic book series from Marvel's Star Comics imprint, and a number of children's books. The animated series and comics introduced Wicket's family and friends, including his love interest Princess Kneesaa, daughter of Chief Chirpa. The Essential Guide to Characters established that Wicket's middle name is Wystri.\nOn the April 27, 2008 edition of Comedy Central's Colbert Report, Stephen Colbert  \"ate\" Wicket , reneging on a promise not to eat Ewok.\nOn June 7, 2013, it was announced that, in honor of the 30th anniversary of Star Wars Episode VI: Return of the Jedi's release, Bean Bunny was selected to represent Wicket Warrick for the Star Wars/The Muppets crossover line.\nIn the animated microseries Star Wars: Forces of Destiny, the voice of Wicket is provided by Dee Bradley Baker.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wicket_Wystri_Warrick",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/The_Kroolok",
  "/wiki/The_Princess_and_the_Scoundrel",
  "/wiki/Traps_and_Tribulations",
  "/wiki/R2-D2_is_LOST!",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Endor",
  "/wiki/Ewok",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Warrick_family",
  "/wiki/Bright_Tree_tribe",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Scout",
  "/wiki/Endor_(planet)",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Endor",
  "/wiki/35_ABY",
  "/wiki/Reproduction",
  "/wiki/Pommet_Warrick",
  "/wiki/Uprising_on_Endor",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Death_Star%27s_shield_generator",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Fire",
  "/wiki/Imperial_Military",
  "/wiki/Death",
  "/wiki/Star",
  "/wiki/Endor_strike_team",
  "/wiki/Forest",
  "/wiki/Moon",
  "/wiki/Deflector_shield_generator",
  "/wiki/Superweapon",
  "/wiki/Standard_day",
  "/wiki/74-Z_speeder_bike",
  "/wiki/Human",
  "/wiki/Spear",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Prince",
  "/wiki/Alderaan",
  "/wiki/Foodstuff",
  "/wiki/Diet",
  "/wiki/Scout_trooper",
  "/wiki/Trooper",
  "/wiki/Limb",
  "/wiki/Blaster",
  "/wiki/Bright_Tree_Village",
  "/wiki/Stormtrooper",
  "/wiki/Tree",
  "/wiki/Clothing",
  "/wiki/Luke_Skywalker",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Droid",
  "/wiki/R2-D2",
  "/wiki/C-3PO",
  "/wiki/Deity",
  "/wiki/Shaman",
  "/wiki/Logray",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Arc_welder",
  "/wiki/Teebo",
  "/wiki/Chief",
  "/wiki/Chirpa",
  "/wiki/Captain",
  "/wiki/Paploo",
  "/wiki/Commando",
  "/wiki/Troop",
  "/wiki/SLD-26_planetary_shield_generator",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Planet",
  "/wiki/Imperial_outpost_(Endor)",
  "/wiki/Special_Forces_Trackers_Unit",
  "/wiki/Shuttle",
  "/wiki/Pilot",
  "/wiki/Shara_Bey",
  "/wiki/Assault_on_an_Imperial_outpost",
  "/wiki/Sanctuary_tree",
  "/wiki/Plant",
  "/wiki/Meditation",
  "/wiki/First_Order",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Unidentified_heavy_freighter",
  "/wiki/Holdo_maneuver",
  "/wiki/The_galaxy",
  "/wiki/Resistance",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal_military",
  "/wiki/Uprising_against_the_First_Order",
  "/wiki/Warwick_Davis",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/1983",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Elstree_Studios",
  "/wiki/January",
  "/wiki/1982",
  "/wiki/George_Lucas",
  "/wiki/Kenny_Baker",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(comics)",
  "/wiki/Amanda_Lucas",
  "/wiki/David_Tomblin",
  "/wiki/Return_of_the_Ewok",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Yoda",
  "/wiki/Boba_Fett",
  "/wiki/2004",
  "/wiki/Star_Wars_home_video_releases",
  "/wiki/Original_trilogy",
  "/wiki/Caravan_of_Courage:_An_Ewok_Adventure",
  "/wiki/1984",
  "/wiki/Ewoks:_The_Battle_for_Endor",
  "/wiki/1985",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/2019",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/1986",
  "/wiki/Ewoks_(Marvel)",
  "/wiki/Marvel_Comics",
  "/wiki/Star_Comics",
  "/wiki/Category:Ewok_Adventure_books",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/Star_Wars:_Forces_of_Destiny",
  "/wiki/Dee_Bradley_Baker",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Forces_of_Destiny:_The_Leia_Chronicles",
  "/wiki/Forces_of_Destiny:_The_Leia_Chronicles_%26_The_Rey_Chronicles",
  "/wiki/The_Adventures_of_Luke_Skywalker,_Jedi_Knight",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Princess_Leia_-_An_Unexpected_Friend",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!_(audiobook)",
  "/wiki/Star_Wars:_Return_of_the_Jedi_(paperback_novel)",
  "/wiki/Ewoks_Join_the_Fight",
  "/wiki/Ewok_Escape",
  "/wiki/Shattered_Empire_1",
  "/wiki/Ewoks_vs._The_Empire_-_Small_but_Mighty",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Poe_Dameron_Annual_2",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_Ashcan",
  "/wiki/Life_Day_Treasury",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Disney_Infinity_3.0",
  "/wiki/Star_Wars_Epic_Yarns:_Return_of_the_Jedi",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/Return_of_the_Return_of_the_Jedi",
  "/wiki/LEGO_Star_Wars:_Droid_Tales",
  "/wiki/Crisis_on_Coruscant",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/Wrapping_Up_The_Falcon",
  "/wiki/LEGO_Star_Wars_Summer_Vacation",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Wicket_Wystri_Warrick",
  "/wiki/Category:Images_of_Wicket_Wystri_Warrick",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_152",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Expert_Guide",
  "/wiki/Star_Wars:_Aliens_of_the_Galaxy",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Princess_Leia:_Royal_Rebel",
  "/wiki/Entertainment_Weekly%27s_Ultimate_Guide_to_Rogue_One",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Meet_the_Heroes",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/A_Galaxy_for_Everyone",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Legacy_(Disney_Gallery:_The_Mandalorian_episode)",
  "/wiki/Practical",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Imperial_Troops",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Unsung_Heroes",
  "/wiki/Star_Wars_Insider_Special_Edition_2021",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_the_Season_2_Finale",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Insider_212",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Wicket_Unleashed",
  "/wiki/Star_Wars_Insider_31",
  "/wiki/Beyond_the_Valley_of_the_Ewoks",
  "/wiki/Star_Wars_Insider_67",
  "/wiki/When_Artoo_Met_Wicket",
  "/wiki/Star_Wars_Insider_39",
  "/wiki/Return_to_Endor",
  "/wiki/Star_Wars_Insider_62",
  "/wiki/Return_of_the_Ewok_(article)",
  "/wiki/Star_Wars_Insider_46",
  "/wiki/January_9",
  "/wiki/2020",
  "/wiki/June_22",
  "/wiki/Star_Wars:_Forces_of_Destiny:_Volume_1"
 ]
}