{
 "name": "Wildis_Jiklip",
 "display_name": "Wildis Jiklip",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Around 29 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Wildis Jiklip, also known as Red Stepla, was a female Human who was known for her mathematical genius.\nAround the same age as Han Solo, Jiklip was born on Coruscant to Corellian parents, which, to her benefit, allowed her to travel the galaxy and be educated on both worlds. Once she was in her early twenties, Jiklip was eligible to become a university professor. However, she soon disappeared and over the next twenty years she became a smuggler under the alias of Red Stepla, and was known for her unusual efficiency to get all of her jobs accomplished. Stepla and her crew eventually retired, shortly before the onset of the Yuuzhan Vong War, and soon Wildis Jiklip reappeared to the public's eye. She became a professor of interplanetary economics and other similar fields at universities on Coruscant and Lorrd.\nJiklip knew Han Solo and trusted him and his wife Leia Organa Solo enough to reveal the secret of her smuggling life. At the start of the Second Galactic Civil War, Han was interested in hearing her opinions on the possible war, however he was unable to get in touch with her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/29_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Corellian/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Lorrd/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Legacy_of_the_Force:_Betrayal",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}