{
 "name": "Wilhalm_Skrim",
 "display_name": "Wilhalm Skrim",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Wilhalm Skrim was a Human male who served as Governor Tour Aryon's secretary during the Galactic Civil War.\nDuring his time as Tour Aryon's secretary, Wilhalm Skrim worked in the Bestine capitol building. Here, he had his own office, not far from Tour Aryon's. In 1 ABY, Wilhalm also found himself working closely with Prefect Eugene Talmont, who also worked in the capitol building. During his time as secretary, Wilhalm came into contact with a local spacer, who was interested in assisting the Empire. Fortunately for the spacer, Wilhalm had a number of jobs that had to be completed. Wilhalm informed the spacer that Rebels had stolen one of his reports. Wilhalm needed the spacer to find the report before the Rebels encrypted it. The spacer, who wanted to gain Wilhalm's trust and gain an appointment with Talmont, agreed to carry out the task. The spacer tracked down the Rebel named Dak Linser and killed the individual.\nThe spacer returned the report to Wilhalm. Though Wilhalm appreciated the spacer's service, he still had work for him to complete before an appointment with Talmont could be scheduled. An informant to Wilhalm, a Twi'lek named Nethlek'Vaa, found information of great importance for the Empire. However, Wilhalm felt that Nethlek'Vaa was asking for an outrageous sum of credits in return for the information. Wilhalm, annoyed by his informant's persistence, instructed the spacer to track down Nethlek'Vaa. The spacer tracked down Nethlek'Vaa, who was being guarded by two Rebels. The spacer had no choice but to kill all three of them, and return the information to Wilhalm.\nWilhalm had one final task for the spacer, after which he promised the spacer his appointment with Talmont. Ananda Dwyce, one of the Prefect's clerks, made the decision to flee Bestine, and defect to the Rebellion. Wilhalm needed the spacer to find Ananda, and arrest her, so that his office could escape considerable embarrassment. Since there was no time to waste, the spacer immediately set out to find Ananda before she could escape. Fortunately for Wilhalm, the spacer managed to locate Ananda, who was being escorted by two Rebels. The spacer immediately killed the two escorts, but spared Ananda, so that she could be apprehended and executed.\nWilhalm was pleased by the spacer's continual support, and informed the spacer that Prefect Talmont could now meet with him.\nWilhalm Skrim is a Non-Player Character  in the MMORPG Star Wars Galaxies. In the game, players must do a series of short quests for him, before being allowed to do quests for Prefect Talmont.\nHis name is based off of the Wilhelm scream, a stock sound effect very common in the Star Wars franchise.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Tour_Aryon",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Bestine_(city)/Legends",
  "/wiki/1_ABY/Legends",
  "/wiki/Prefect/Legends",
  "/wiki/Eugene_Talmont",
  "/wiki/Spacer/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Dak_Linser",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Ananda_Dwyce",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Wilhelm_scream",
  "/wiki/Star_Wars_Galaxies:_An_Empire_Divided_Quick_Reference_Guide",
  "/wiki/Star_Wars_Galaxies:_The_Total_Experience:_Prima_Official_Game_Guide",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Champions_of_the_Force_(SWGTCG)",
  "/wiki/Template:SWGTCG"
 ]
}