{
 "name": "Wilsa_Teshlo",
 "display_name": "Wilsa Teshlo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kessurian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Veiled Sorority",
      "Citizens' Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Wilsa Teshlo was a Kessurian female who was born a thilas, second in line to the throne. Refusing to be royalty, Teshlo fled the palace, becoming a pirate in the Veiled Sorority. She targeted corporate haulers working for the First Order, using her private pilot schooling to her advantage. In 35 ABY, Teshlo was one of many unaffiliated individuals who answered a Resistance call for help, assisting with their fight against the forces of the Sith Eternal above the planet Exegol. Teshlo survived the battle, and returned to celebrate the victory at the Resistance base on the jungle moon Ajan Kloss.\nBorn to a royal family in Kessurian society, Wilsa Teshlo was a thilas, being second in line to the throne. However, Teshlo refused to be trapped in a life of royalty, and fled the royal palace. After Teshlo's disappearance, many assumed that she was kidnapped by pirates, though that was not the case—when Teshlo eventually joined the Veiled Sorority pirate gang, she did so willingly. As a privateer in the Veiled Sorority, Teshlo flew a BTA-NR2 Y-wing starfighter, targeting corporate haulers that worked for the First Order. On one occasion, Teshlo fired upon another vessel from her Y-wing while flying through an asteroid field.\nIn 35 ABY, during the war between the First Order and the Resistance, Teshlo was one of many unaffiliated individuals that received a call for help from Lando Calrissian of the Resistance, requesting reinforcements in their battle against the Sith Eternal's forces. Joining a fleet comprised of many similar unaffiliated pilots, Teshlo made her way to the planet Exegol in the Unknown Regions, entering the battle alongside the Resistance. Once the Sith Eternal's fleet was destroyed, Teshlo returned to the Resistance base on the jungle moon of Ajan Kloss to celebrate the victory among the Resistance and other participants of the battle.\nA Kessurian female, Teshlo had red skin, brown hair, and orange eyes. She refused the trappings of royalty, despite it being her birthright, preferring to instead become a pirate. While Teshlo attempted to stay uninvolved with the galactic war between the First Order and the Resistance, she eventually assisted the Resistance in defeating their enemies at Exegol.\nBefore joining the Veiled Sorority, Teshlo received elite private pilot schooling, and used her skills while working as a pirate.\nTeshlo wore a white flight suit, with a blaster holstered onto her belt. While part of the Veiled Sorority, she piloted a BTA-NR2 Y-wing starfighter. While in flight, Teshlo wore an antiquated K-22995 light flight helmet.\nWilsa Teshlo first appeared in the 2019 film Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, written by Pablo Hidalgo and released alongside the film on December 20, 2019. Teshlo's design was created by Jake Lunt Davies, and the character was portrayed by Latesha Wilson in The Rise of Skywalker , with prosthetics sculpted by Maudie Brady and makeup by Liz Barlow. The character's name is similar to the actress' name.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Kessurian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Veiled_Sorority",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Thilas",
  "/wiki/Pirate",
  "/wiki/First_Order",
  "/wiki/Pilot",
  "/wiki/35_ABY",
  "/wiki/Resistance",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal_military",
  "/wiki/Sith_Eternal",
  "/wiki/Planet",
  "/wiki/Exegol",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Jungle",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Reproduction",
  "/wiki/BTA-NR2_Y-wing_starfighter",
  "/wiki/Starship",
  "/wiki/BTL_Y-wing_starfighter",
  "/wiki/Asteroid_field",
  "/wiki/First_Order-Resistance_War",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Unknown_Regions",
  "/wiki/Final_Order",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/The_galaxy",
  "/wiki/Flight_suit",
  "/wiki/Blaster",
  "/wiki/Belt",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/December_20",
  "/wiki/Jake_Lunt_Davies",
  "/wiki/Latesha_Wilson",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/March_17",
  "/wiki/2020",
  "/wiki/File:WilsonWilsa.png"
 ]
}