{
 "name": "Wilyem",
 "display_name": "Wilyem",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Barabel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Wilyem was a male Barabel Jedi Knight in the New Jedi Order. In 43.5 ABY, Wilyem and fellow Barabel Jedi Zal and Dordi flew with Captain Han Solo as he distracted Galactic Alliance forces, while his wife, Leia Organa Solo, smuggled four psychotic Jedi offworld to keep them from falling into Galactic Alliance control. During the mission, Wilyem operated as a gunner in the Millennium Falcon's tail. Later, in 44 ABY, Wilyem began a nest hidden in the Jedi Temple with Zal, as well as Dordi and Sebatyne's son, Tesar. Soon afterward, the Jedi Order left the planet Coruscant to lure the Lost Tribe of Sith as part of a trap, but the Barabels remained behind with their nest. When the Jedi sprung their trap, the Sith retreated into the Temple, and Allana Solo—granddaughter of Han and Leia Solo, who had accidentally discovered the Barabel nest previously—had a Force vision of the nest coming under attack. The Solos traveled back to Coruscant and battled the Sith in the Temple to warn Wilyem and the other Barabels. The Barabels were safely extracted from the Temple with their younglings aboard the Parting Gift, piloted by ex-Imperial Head of State Jagged Fel.\nWilyem was a male Force-sensitive Barabel. He trained in the ways of the Force with the New Jedi Order and achieved the rank of Jedi Knight. In 43.5 ABY, an enigmatic madness began to befall several young Jedi Knights, causing them to believe that everyone they knew had been replaced by impostors. The Galactic Federation of Free Alliances decided to deal with the issue by imprisoning the psychotic Jedi Knights in carbonite. The Jedi Order resented this, however, and secretly kept as many of the ill Knights as possible hidden in the New Jedi Temple on the galactic capital planet Coruscant to be studied. To prevent Galactic Alliance Security forces from discovering these Jedi and encasing them in carbonite, Captain Han Solo and his wife, Leia Organa Solo, decided to smuggle the Jedi offworld. Wilyem, along with fellow Barabel Jedi Knights Dordi and Zal, served as gunners for Han Solo and his granddaughter, Allana Solo, aboard the Millennium Falcon. It was their job to distract Galactic Alliance forces in orbit over Coruscant while Organa Solo smuggled the four Jedi who had been captured by the Order—Seff Hellin, Natua Wan, Yaqeel Saav'etu, and Bazel Warv—to Shedu Maad in the Hapes Cluster.\nThe Millennium Falcon broke every procedure for departing the planet, attracting the attention of the Galactic Alliance Nargi-class pursuit frigate Fast Death. After failing to respond to the Fast Death's warnings, they were also set upon by Bolt Squadron, a unit of XJ5 X-wing starfighters. Solo flew the Millennium Falcon behind PharmCom Orbital Processing Plant One, a pharmaceutical production facility in orbit over Coruscant, and the Fast Death stayed behind, to be replaced by another pursuit frigate, the Quick End. Solo then ordered Allana to alert Jedi Master Saba Sebatyne and proceeded to tell Dordi and Zal to bring up their guns and targeting computers as a bluff. He then added that only Wilyem would be allowed to shoot, but he wasn't allowed to hit anything.\nMaster Sebatyne then arrived with a squadron of StealthXs and targeted Bolt Squadron. Meanwhile, at Solo's orders, Wilyem fired a proton torpedo out of the aft docking bay. It detonated a few kilometers to their stern, and Solo pretended that they had just suffered a hull breach from a Galactic Alliance torpedo. As he corkscrewed the Millennium Falcon toward the Quick End, pretending to be out of control, he revealed to the Quick End's command that he had Allana—disguised as his adopted daughter \"Amelia\"—on board. The Quick End, finally convinced that Solo wasn't pulling a trick, maneuvered out of his way and broke off all Galactic Alliance pursuit as Solo gave Allana the order to reach out with the Force to Organa Solo, who quietly smuggled the four Jedi Knights offworld in the Gizer Gut. Wilyem, the Solos, Dordi, and Zal jumped into hyperspace to meet up with the Jedi at Shedu Maad.\nIn 44 ABY, Wilyem began a nest hidden in the Jedi Temple's underlevels with Zal, as well as Dordi and Tesar Sebatyne. They were accidentally discovered by Amelia and her friend, Jedi Knight Bazel Warv, one of the Jedi that Wilyem had helped smuggle offworld, and who had since recovered and returned to Coruscant. The Barabels insisted that the two had to stay at the nest until their eggs hatched, so that they would remain hidden, and their eggs would be safe. Amelia, however, suggested that they trade secrets—she told them the truth of her identity; that she was Allana, the daughter of the Jedi Jacen Solo and Queen Mother Tenel Ka Djo, and the heir to the Hapan throne. The Barabels agreed that the secret was important enough, and allowed Amelia and Warv to leave.\nSoon afterward, the Jedi decided to leave the planet in an attempt to lure the emerging Lost Tribe of Sith into a trap. Wilyem and the three other nesting Barabels stayed behind; but when the Jedi decided to spring their trap and assail the Sith, the Tribe pulled back into the Temple. Meanwhile, Allana had a vision of the Barabels' younglings being killed, and she returned to Coruscant and located the nest—along with her grandparents, the Jedi Knight Zekk, the hapan Taryn Zel, and several Hapan commandos— to warn them about her vision. Wilyem was initially wary, but the trespassers revealed that they had wanted to drop off Warv to warn them, but they had been ambushed and Warv had been killed.\nThe Barabels then returned to the nest to gather their younglings, and then fought their way out of the Temple, killing several Sith along the way—although many commandos and some of the younglings were also killed. They were then met by the former Imperial Remnant Head of State Jagged Fel in the Parting Gift, along with Master Saba Sebatyne, former Jedi Knight Tahiri Veila, and Sergeant Major Gef Olazon. Wilyem, Dordi, Zal, Tesar, and their younglings—of whom twenty remained—were all safely extracted from the Temple.\nAs a Barabel, Wilyem shared a sense of humor with other members of his species that other beings rarely understood. Much of what was said between the crew of the Millennium Falcon was taken as a joke between the three Barabel Jedi, who remained high-spirited throughout the mission, even when it seemed that there would be trouble. When Amelia and Warv stumbled upon the Barabel nest, Wilyem and the other Barabels were outraged, and decided to force the two to stay until their eggs had hatched. When Amelia complained that her adoptive mother would kill her—figuratively—Wilyem responded sincerely that it was better if Organa Solo killed her than if he did. Like the other Barabels, Wilyem was very protective of his nest, and he stated that he would never let anyone eat their eggs. When Amelia proposed her trade of secrets and told the Barabels that if they revealed her secret, she would likely be dead within a year, Wilyem and the others agreed to the terms and let the two intruders go. Wilyem was very wary of Allana when she returned with more trespassers, but after she had explained herself, Wilyem took her vision very seriously.\nWilyem learned the ways of the light side of the Force with the Jedi Order and completed his training, ascending to the rank of Jedi Knight. He was an accomplished gunner and was the only one of the three Barabel Jedi Knights that Solo allowed to open fire during their mission to smuggle the Jedi offworld.\nWilyem was created by author Troy Denning for his 2009 novel, Fate of the Jedi: Abyss, his first installment, and the third book overall, in the nine-part Fate of the Jedi series. He later appeared briefly in Fate of the Jedi: Vortex and Fate of the Jedi: Apocalypse, the sixth and ninth novels in the series, also by Denning.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Barabel/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/43_ABY",
  "/wiki/Jedi/Legends",
  "/wiki/Zal",
  "/wiki/Dordi",
  "/wiki/Captain/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Toydarian_double-reverse_spinner",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Force_psychosis",
  "/wiki/Gunner/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/44_ABY",
  "/wiki/New_Jedi_Temple",
  "/wiki/Tesar_Sebatyne",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Allana_Solo",
  "/wiki/Force_vision/Legends",
  "/wiki/Assault_on_the_New_Jedi_Temple",
  "/wiki/Youngling/Legends",
  "/wiki/Parting_Gift",
  "/wiki/Pilot/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Head_of_State/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Orbit/Legends",
  "/wiki/Seff_Hellin",
  "/wiki/Natua_Wan",
  "/wiki/Yaqeel_Saav%27etu",
  "/wiki/Bazel_Warv",
  "/wiki/Shedu_Maad",
  "/wiki/Hapes_Cluster/Legends",
  "/wiki/Nargi-class_pursuit_frigate",
  "/wiki/Fast_Death",
  "/wiki/Bolt_Squadron_(Galactic_Alliance)",
  "/wiki/Squadron/Legends",
  "/wiki/XJ5_X-wing_starfighter",
  "/wiki/PharmCom_Orbital_Processing_Plant_One",
  "/wiki/Frigate/Legends",
  "/wiki/Quick_End",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Saba_Sebatyne",
  "/wiki/StealthX",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/Gizer_Gut",
  "/wiki/Hyperspace/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Queen_Mother",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Hapan",
  "/wiki/Lost_Tribe_of_Sith_emergence",
  "/wiki/Liberation_of_Coruscant_(Lost_Tribe_of_Sith_emergence)",
  "/wiki/Death/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Zekk",
  "/wiki/Taryn_Zel",
  "/wiki/Commando/Legends",
  "/wiki/Tahiri_Veila",
  "/wiki/Sergeant_major/Legends",
  "/wiki/Gef_Olazon",
  "/wiki/Species/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Troy_Denning",
  "/wiki/2009",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)"
 ]
}