{
 "name": "Winborn",
 "display_name": "Winborn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Coruscant Security Force",
      "Coruscant Security Force"
     ]
    }
   ]
  }
 ],
 "content": "Winborn was a Human male police officer with the Coruscant Security Force during the Great Galactic War and Cold War era. Living on Coruscant, he eventually attained the police rank of captain but also served as the Coruscant Security Chief. In 3643 BBY, Coruscant Senator and government leader, Vanara Kayl, ordered Winborn to oust the Migrant Merchants' Guild criminal gang from Coruscant's Old Galactic Market sector. During the fighting Winborn was made aware of a terrorist plot by the Guild to disable the skylanes around the Senate Building which would have killed hundreds. With the help of a Republic individual, the attack was stopped.\nWinborn was a Human male who lived on Coruscant and served as police officer with the Coruscant Security Force. He had attained the rank of captain by the end of the Great Galactic War between the Galactic Republic and the Sith Empire. During the Cold War, Winborn also served as the Security Chief under the command of Coruscant's senator and government leader, Vanara Kayl.\nAround 3643 BBY, Winborn led an attack on the Migrant Merchants' Guild criminal gang who had taken control of the Old Galactic Market sector. At the time of the attack, the Guild was initiating a terrorist plot by attempting to hack into Coruscant's secure skylane infrastructure in order to disrupt it and cause thousands of speeders to fall on the Senate Building. Senator Kayl sent a Republic individual to assist Winborn in stopping the terrorist attack.\nWhile fighting Guild members and securing the skylane speeder access points, the Republic individual discovered a recording of Senator Kayl making a deal with the Guild for money to aid her election campaign. When the deal fell through, Kayl had ordered the CSF to evict the Guild which had led to them planning the terrorist attack. Winborn asked that the Republic individual confront the Senator as he did not want to be responsible for the end of her career. The individual did so and Senator Kayl agreed to inform the Galactic Senate of the deal, after which, she resigned.\nWinborn had light skin with brown hair and green eyes. He led the CSF and his men with a sense of command and authority. However, he felt out of his depth with anything involving major politics. The constant fighting and lack of resources had also left him embittered though he doggedly continued doing his job. For Winborn, Senator Kayl was a bright spot of hope for Coruscant's rebuilding efforts. Even with knowing what she had done, Winborn refused to be responsible for destroying her career.\nWinborn appears in the \"Crisis in Galactic City\" mission of Star Wars: The Old Republic, a massively multiplayer online roleplaying game  by BioWare released on December 20, 2011. Any Republic player can undertake a mission for Senator Vanara Kayl to assist Winborn in stopping the terrorist attack. Through the course of the mission, the character discovers a recording of Senator Kayl, which the character can then choose whether or not to bring to the attention of Winborn. The character can then later choose to destroy the recording or not. Destroying it gives the character Dark Side points. Winborn was voiced by actor Gideon Emery.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Police_officer/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Police_rank",
  "/wiki/Captain/Legends",
  "/wiki/Chief_of_Security/Legends",
  "/wiki/3643_BBY",
  "/wiki/Senator/Legends",
  "/wiki/Vanara_Kayl",
  "/wiki/Migrant_Merchants%27_Guild",
  "/wiki/Old_Galactic_Market",
  "/wiki/Merchants%27_Guild_Crisis",
  "/wiki/Terrorist/Legends",
  "/wiki/Skylane/Legends",
  "/wiki/Senate_Building",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Speeder/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Gideon_Emery",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Coruscant_Security_Force_Senior_Command",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound",
  "/wiki/Republic_Commando:_Triple_Zero"
 ]
}