{
 "name": "Wion_Dillems",
 "display_name": "Wion Dillems",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yelsain"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Tree Dweller tribes",
      "Alliance to Restore the Republic",
      "Green Squadron",
      "Green Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Wion Dillems was a human male from Yelsain who embraced technology so that he could fly at unimaginable speeds. Joining the Alliance to Restore the Republic as a pilot he was stationed onboard the Profundity, the mobile flagship of Admiral Raddus. After pilot Puck Naeco broke his ankle, Dillems stood in for him as Green Twelve in Green Squadron, who were based in the Great Temple on the moon Yavin 4. While on Yavin, Dillems was included in a proposed flight schedule put together by Colonel Bandwin Cor.\nBy 0 BBY, Dillems had downed or destroyed 180 enemy craft and was considered an ace. He attended a meeting in the Great Temple where the Alliance High Command refused to support a plan to steal the plans for the Death Star superweapon from the planet Scarif; however, after a group of rogue rebels traveled to Scarif anyway, Dillems was part of the Alliance Fleet scrambled to support them. He and the rest of Green Squadron then engaged Imperial forces above Scarif.\nWion Dillems was a human male who grew up in the wilds of Yelsain among the rustic Tree Dweller tribes that lived in the dense forests. Joining the Starfighter Corps of the Alliance to Restore the Republic, he became a dangerous hunter of Imperial craft, and by 0 BBY was an ace who had shot down or destroyed at least 180 enemies and attained the rank of lieutenant. Dillems was usually assigned to the Profundity, the flagship of Admiral Raddus, which was stationed with the ever-mobile Alliance Fleet. However, after the pilot Puck Naeco broke his ankle during a rough landing, Dillems stepped in as an emergency replacement to fill the vacant Green Twelve slot in the Green Squadron of the Massassi Group, who were based in the Great Temple headquarters of the Alliance on the moon Yavin 4.\nWhile Dillems was flying with Green Squadron, Colonel Bandwin Cor of Starfighter Command included him on a proposed flight patrol schedule. The schedule was for a mission along the patrol route between Yavin and the Gordian Trace Relays, visiting them in the order coreward, spinward, then rimward. The pilots would be tasked with performing a flyby of the surrounding space and then performing a close uplink of passive relay recordings once they had verified it was all clear. Dillems was placed in shift cycle three on the schedule, flying alongside Green Four, Lieutenant Attico Wred. The proposed schedule was sent by General Jan Dodonna to Mon Mothma, head of the Alliance, and ultimately ended up preserved in the collection of documents that became known as The Rebel Files.\nAfter the rebel agent Jyn Erso returned to Yavin 4 with news of the Empire's Death Star superweapon, a meeting was held in the Great Temple to discuss what the Alliance should do with this information. Willems attended the meeting and stood near Blue Leader Antoc Merrick while the Alliance High Command discussed Erso's proposal to travel to the planet Scarif and steal the Death Star plans, which would reveal a weakness in the Death Star that the Alliance could exploit. Ultimately the plan failed to garner unanimous support from those present, and so the meeting disbanded with a decision not to go through with it. Erso, however, led a rogue squad on an unauthorized mission to Scarif anyway.\nOnce the rebels on Yavin 4 learned of what was happening on Scarif, the Alliance Fleet was scrambled to provide support, including Dillems and the rest of Green Squadron. Upon the arrival of the fleet in the Scarif system, Green Squadron engaged the Imperial forces in orbit, fighting alongside Red Squadron and Gold Squadron as they defended the fleet. Ultimately, the Alliance managed to successfully transmit the plans from the surface of Scarif and escape with them, although they took heavy casualties in the process. In total, fifteen of the fighters from Yavin 4 were destroyed, mostly from Red or Blue Squadrons.\nUnlike most of his compatriots, Dillems was drawn to technology because it afforded him the ability to fly at unimaginable speeds and so embraced technological mastery of vehicles. Dillems had long blonde hair and a moustache with light skin and blue eyes.\nWion Dillems wore an orange flight suit with two code cylinders in the left sleeve, a white flak vest, and a Diagnostech life support unit. He also wore a black belt and flight gloves equipped with a wrist-mounted comlink and beacon. Dillems marked his personal score of downed or destroyed enemy vehicles on his K-22995 light flight helmet, with a \"V\" in a red or yellow circle for every twenty craft. By the time he flew at Scarif, there were at least nine Vs on his helmet, which also had a red and white chequered pattern above the visor, red markings down the back, and a black symbol on each side.\nWion Dillems was portrayed uncredited by Dion Williams in the film Rogue One: A Star Wars Story. Prior to the film's release on December 16, 2016, Dillems was pictured on a card titled \"Rebel Pilots\" that was added to the Star Wars: Card Trader app on October 28, 2016. Dillems' helmet design resembles that of the helmet worn by Puck Naeco in A New Hope and Wes Janson in The Empire Strikes Back, as well as an unidentified Blue Squadron pilot in Rogue One.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Yelsain",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Tree_Dweller_tribes",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Green_Squadron_(Rebel_Alliance)",
  "/wiki/Lieutenant",
  "/wiki/Rebel_pilot",
  "/wiki/Profundity",
  "/wiki/Flagship",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Pilot",
  "/wiki/Puck_Naeco",
  "/wiki/Limb",
  "/wiki/Green_Twelve",
  "/wiki/Green_Squadron",
  "/wiki/Great_Temple",
  "/wiki/Moon",
  "/wiki/Yavin_4",
  "/wiki/Colonel",
  "/wiki/Bandwin_Cor",
  "/wiki/0_BBY",
  "/wiki/Starship",
  "/wiki/Ace",
  "/wiki/Alliance_High_Command",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Planet",
  "/wiki/Scarif",
  "/wiki/Rogue_One",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Forest",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Massassi_Group",
  "/wiki/Rebel_Alliance_Starfighter_Command",
  "/wiki/Core_Worlds",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Realspace",
  "/wiki/Green_Four",
  "/wiki/Attico_Wred",
  "/wiki/General",
  "/wiki/Jan_Dodonna",
  "/wiki/Mon_Mothma",
  "/wiki/The_Rebel_Files",
  "/wiki/Jyn_Erso",
  "/wiki/Blue_Leader",
  "/wiki/Antoc_Merrick",
  "/wiki/Death_Star",
  "/wiki/Fleet",
  "/wiki/Scarif_system",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Flight_suit",
  "/wiki/Code_cylinder",
  "/wiki/Flak_vest",
  "/wiki/Diagnostech_life_support_unit",
  "/wiki/Belt",
  "/wiki/Flight_glove",
  "/wiki/Comlink",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Time",
  "/wiki/Helmet",
  "/wiki/Dion_Williams",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/December_16",
  "/wiki/2016",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/October_28",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Wes_Janson",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Unidentified_Blue_Squadron_pilot",
  "/wiki/Category:Images_of_Wion_Dillems",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Grounded",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/October_29",
  "/wiki/2020",
  "/wiki/Star_Wars_Year_By_Year:_A_Visual_History,_New_Edition",
  "/wiki/May_17"
 ]
}