{
 "name": "Wise_Man_of_Kooroo",
 "display_name": "Wise Man of Kooroo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gelgelar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Glovan Thule, more commonly known as the Wise Man of Kooroo, was a male Human who lived on the world of Gelgelar around the time of the Galactic Civil War.\nThe origin of Glovan Thule could only be puzzled in his late years, allegedly he did not even know his name. However, he had once been a Jedi or at least a padawan, which was known only as a rumor on Gelgelar. Having once followed the path of the Jedi, he was proficient in lightsaber combat, as well as in dealing with power, and used his abilities later. One day, he came to Gelgelar and dived into the only city, Gelgelar Free Port, as he had to flee for reasons unknown to anyone - he had survived Order 66 and fled the newly formed Galactic Empire that replaced the Galactic Republic, but Gelgelar's inhabitants only could still suspect. Glovan Thule then lived in exile as a hermit in the shrine of Kooroo and preached wisdom. Most of the time he was in the center of the shrine where he smoked his pipe. He had to rely on pilgrims to bring him food while he lived there, and if few pilgrims visited the shrine, Thulls brought him fresh food from slippery Gelgelar Eel.\nOne day, he was visited by Platt Okeefe when she was on the run in her disguise as a pilgrim to bounty hunters and the Empire and traveled to the shrine. At some point Glovan Thule also agreed to take the Sullustan child T'laerean Larn as a student in the Force, teaching the power called Merge Senses. The boy was extremely eager to impress his master and become as powerful as he was. Thule was usually found at the Shrine, smoking his pipe and resting on animal skins. His head was graced with a floppy hat. Having no income of his own, his survival was assured through temple donations and gifts of food from Thulls, a local Ithorian. Visitors were granted advice and nuggets of philosophy.\nOne day, when Thule left the city, T'laerean introjected his mind into a reeho, so everyone thought he was dead, his own body lying motionless in bed. Thus, with the help of the bird, he was able to spy on the Glarsaurs who were planning an attack on his settlement, but he got into trouble and could not release his spirit from the body of the bird again. Eventually, Thule returned earlier, as he intended, led by a premonition. He could save the boy who would not have survived if the power had not been so strong in him. He then continued to train T'laerean.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kooroo",
  "/wiki/Gelgelar/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Gelgelar_Free_Port/Legends",
  "/wiki/Order_66/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Hermit/Legends",
  "/wiki/Kooroo_(being)",
  "/wiki/Eel/Legends",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/T%27laerean_Larn",
  "/wiki/The_Force/Legends",
  "/wiki/Merge_Senses",
  "/wiki/Thulls",
  "/wiki/Ithorian/Legends",
  "/wiki/Glarsaur",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/The_Breath_of_Gelgelar",
  "/wiki/Star_Wars_Adventure_Journal_14",
  "/wiki/Category:Images_of_the_Wise_Man_of_Kooroo",
  "/wiki/Platt%27s_Starport_Guide",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}