{
 "name": "Wishan",
 "display_name": "Wishan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Duros"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Wishan was a Duros male Jedi Master who lived at some point by 231 BBY. He was proficient at sculpting clay using the Force and used his abilities to create various statues, and he also created an incense from uneti blossoms. At some point, he attempted to teach Padawan Jabe Rann how to sculpt. A story about the Jedi Master was later told to a group of Padawans by the protocol droid AD-3.\nA Duros male Jedi Master who was active by 231 BBY, Wishan created sculptures out of red clay by utilizing the Force. During one summer, Wishan had gained a visually noticeable amount of weight. Sometime after that summer, Wishan sculpted a statue of a greater krayt dragon, a large creature native to the Outer Rim planet Tatooine; a giant tower; a replica of the Jedi Temple on Coruscant, the Core Worlds capital world of the Galactic Republic; and a statue of Padawan Jabe Rann, who enjoyed watching Wishan while he was sculpting. The sculptures were intended as a gift to the Temple's librarian for their seventy-second birthday.\nAfter demonstrating his skills of sculpture-making to Rann, Wishan attempted to teach the Padawan how to sculpt by using the Force, instructing the Padawan to sculpt his likeness. Despite Wishan's encouragement, the Padawan only succeeded in sculpting creations that looked like frog-dogs with bones in their mouths. However, during the lesson, Rann used his clay to create a large krayt dragon skeleton in order to successfully scare away a Mon Calamari Padawan who was attempting to steal one of Wishan's sculptures. After the incident, Wishan invited Rann to partake in a large dinner in celebration of the Padawan protecting the Jedi Master's sculptures.\nBy the time of the Republic Fair that was held on Valo, an Outer Rim planet in the Galactic Frontier, around 231 BBY, Wishan developed an incense from uneti blossoms, which Jedi High Council member Stellan Gios found invaluable for meditation purposes. Gios enjoyed Wishan's incense to the extent that he brought it with him to Valo aboard Republic Supreme Chancellor Lina Soh's starship, the Coruscant Dawn, and even offered to have some sent to Padawan Bell Zettifar after telling him about it. At some point in history, Jedi Master Kelleran Beq's protocol droid AD-3 spoke about Wishan instructing Rann in Force-sculpting to a group of Padawans undergoing their Jedi Trials aboard the Pelta-class frigate Athylia.\nWishan had green skin and red eyes and was not considered by AD-3 to have been a particularly attractive person. He was rather portly, as during the summer prior to him attempting to teach sculpting to Jabe Rann, Wishan had gained some weight. As a result, when recounting how Wishan gave Rann clay so that the latter could sculpt the former's likeness, AD-3 corrected her initial mention of \"six lumps of clay\" to \"seven.\"\nThe Duros enjoyed creating sculptures via use of the Force. He was friendly with Jabe Rann; after witnessing Rann scare away the Mon Calamari Padawan attempting to steal his sculpture, Wishan noted in a jovial manner that although Rann was not an especially talented artist, he instead had the ability to keep his sculptures safe. Furthermore, the Jedi Master was not self-conscious about his weight, shown by his willingness to joke about gaining more weight when offering to have a feast with Rann.\nAD-3 described the Force-sensitive Wishan as being able to sculpt \"anything\" out of dark red clay, even having enough skill in the technique to give his sculpture of Rann a lightsaber the size of a toothpick. Wishan was also skilled enough to manufacture his own incense from the petals of uneti blossoms.\nWishan wore brown Jedi robes.\nWishan first appeared in the first episode of the children's game show Star Wars: Jedi Temple Challenge as part of an animated story authored by Cavan Scott. The episode was released on June 10, 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Duros",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Master",
  "/wiki/231_BBY",
  "/wiki/Force-sculpture",
  "/wiki/Clay",
  "/wiki/The_Force",
  "/wiki/Incense",
  "/wiki/Uneti_blossom",
  "/wiki/Teacher",
  "/wiki/Padawan",
  "/wiki/Jabe_Rann",
  "/wiki/Protocol_droid",
  "/wiki/AD-3",
  "/wiki/Summer",
  "/wiki/Sculptor",
  "/wiki/Greater_krayt_dragon",
  "/wiki/Homeworld",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Tatooine",
  "/wiki/Imperial_Palace",
  "/wiki/Coruscant",
  "/wiki/Core_Worlds",
  "/wiki/Capital",
  "/wiki/Galactic_Republic",
  "/wiki/Librarian",
  "/wiki/Birthday",
  "/wiki/Frog-dog",
  "/wiki/Bone",
  "/wiki/Mouth",
  "/wiki/Krayt_dragon",
  "/wiki/Skeleton",
  "/wiki/Unidentified_Mon_Calamari_Padawan",
  "/wiki/Diet",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Valo",
  "/wiki/Galactic_Frontier",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Jedi_High_Council",
  "/wiki/Stellan_Gios",
  "/wiki/Meditation",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Starship",
  "/wiki/Coruscant_Dawn",
  "/wiki/Bell_Zettifar",
  "/wiki/Kelleran_Beq",
  "/wiki/Jedi_Trials",
  "/wiki/Pelta-class_frigate",
  "/wiki/Athylia",
  "/wiki/Eye",
  "/wiki/Mon_Calamari",
  "/wiki/Artist",
  "/wiki/Force-sensitive",
  "/wiki/Lightsaber",
  "/wiki/Plant",
  "/wiki/Flower",
  "/wiki/Jedi_robes",
  "/wiki/Star_Wars:_Jedi_Temple_Challenge_-_Episode_1",
  "/wiki/Star_Wars:_Jedi_Temple_Challenge",
  "/wiki/Cavan_Scott",
  "/wiki/June_10",
  "/wiki/2020",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/Category:Images_of_Wishan",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Starlight_Beacon",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/232_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Time",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWars.com",
  "/wiki/July_29",
  "/wiki/2021",
  "/wiki/StarWarsKids.com"
 ]
}