{
 "name": "Wizzich_Mozzer",
 "display_name": "Wizzich Mozzer",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Cyclor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cyclorrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance"
     ]
    }
   ]
  }
 ],
 "content": "Wizzich Mozzer was a Cyclorrian male technician who served the Resistance alongside the rest of his swarm during its war with the First Order. Uncharacteristically inquisitive and independent, Mozzer was interested in interacting with non-Cyclorrians, and also learned sabacc, spreading the knowledge throughout the swarm. In 35 ABY, he was stationed at the Resistance base on the moon Ajan Kloss.\nWizzich Mozzer was a Cyclorrian male who was part of a swarm of Cyclorrians that committed itself to the Resistance and served with them during the war against the First Order. Mozzer worked as a technician for the Resistance and was stationed at their base on the jungle moon Ajan Kloss.\nDuring his service, he learned sabacc from other Resistance personnel and began spreading it through out the swarm. This bothered the taskmaster Vazzet Dipterz, but he allowed it as long as Mozzer and the others only indulged in the distraction on their twenty minute breaks.\nIn 35 ABY, Mozzer stood under the CR90 corvette Tantive IV when Resistance pilot Temmin Wexley reported to General Leia Organa that contact had been lost with the Resistance agents sent to the planet Pasaana. He was later in the base's command center when Organa left in order to reach out to her son Ben Solo through the Force. After Organa's death, Mozzer attended a meeting and stood next to the Wookiee Chewbacca while General Poe Dameron laid out his plan to attack the First Order and Sith Eternal forces on the planet Exegol.\nWizzich Mozzer was uncharacteristically inquisitive and independent for a Cyclorrian, and was the most interested in interacting with non-Cyclorrian personnel. He had gray skin and blue compound eyes.\nMozzer wore a pheromone scent mask and a brown patterened scarf with a brown jacket over a light brown jumpsuit and black boots.\nWizzich Mozzer was portrayed by Star Wars veteran Warwick Davis in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, and was first identified in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, which was written by Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Batuu_Bounty_Hunters",
  "/wiki/Cyclor",
  "/wiki/Cyclorrian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Technician",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Sabacc",
  "/wiki/35_ABY",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Jungle",
  "/wiki/Vazzet_Dipterz",
  "/wiki/Standard_minute",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Resistance_pilot",
  "/wiki/Temmin_Wexley",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mission_to_Pasaana_(Resistance)",
  "/wiki/Planet",
  "/wiki/Pasaana",
  "/wiki/Ben_Solo",
  "/wiki/The_Force",
  "/wiki/Death",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Poe_Dameron",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal",
  "/wiki/Final_Order",
  "/wiki/Exegol",
  "/wiki/Eye",
  "/wiki/Scarf",
  "/wiki/Jumpsuit/Legends",
  "/wiki/Boot",
  "/wiki/Star_Wars",
  "/wiki/Warwick_Davis",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Eyes_Have_It",
  "/wiki/Star_Wars_Insider_202",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/File:WizzichMozzer-WarwickDavisTwitter.png"
 ]
}