{
 "name": "Woetar",
 "display_name": "Woetar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zarian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.3 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green with black spots"
     ]
    }
   ]
  }
 ],
 "content": "Woetar was a Zarian con man. Sometime before sometime between 5 ABY and 9 ABY, he won 1,500 credits in a game of sabacc against a spacer on the planet Tekurr'k. Sometime between 5 ABY and 9 ABY, he agreed to help a courier deliver a passage to a starship in the city of Karren on the Mid Rim planet of Antiquity. As the ship was too big to land on the planet, it was forced to stay in orbit. At this time, Woetar was stationed in the city of Lis'an. However, in preparing to run the job, Woetar ran afoul of a displeased former customer who surrounded his ship with goons, preventing him from escaping. Woetar noticed the arrival of the ship belonging to the spacer he'd met on Tekurr'k; out of options, he approached the spacer to make a deal that would enable him to complete his courier run while eluding his enemies. The spacer agreed to hear Woetar out.\nWoetar wore a loose fitting tunic and had a variety of technology to his use, including a comlink and a sporting blaster. Woetar had thick, resilient green skin and a high, nasal voice. He used his humorous, non-threatening appearance to his advantage in various confidence schemes. He was streetwise and had knowledge of planetary systems, astrography, and piloting.\nWoetar appeared in \"Free Time,\" an adventure in The Politics of Contraband, for the West End Games Star Wars roleplaying game. It was written by Gary Haynes and published in September 1992.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zarian",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/5_ABY",
  "/wiki/9_ABY",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sabacc/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tekurr%27k",
  "/wiki/Courier/Legends",
  "/wiki/Starship/Legends",
  "/wiki/City/Legends",
  "/wiki/Karren",
  "/wiki/Mid_Rim",
  "/wiki/Antiquity",
  "/wiki/Orbit/Legends",
  "/wiki/Lis%27an",
  "/wiki/Mission_to_Antiquity",
  "/wiki/Comlink/Legends",
  "/wiki/Sporting_blaster",
  "/wiki/Star_system/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Free_Time",
  "/wiki/The_Politics_of_Contraband",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars",
  "/wiki/Gary_Haynes",
  "/wiki/September",
  "/wiki/1992",
  "/wiki/Classic_Adventures",
  "/wiki/Heir_to_the_Empire",
  "/wiki/New_Republic_era",
  "/wiki/Leland_Chee",
  "/wiki/5_ABY/Legends",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/9_ABY/Legends"
 ]
}