{
 "name": "Wojarra",
 "display_name": "Wojarra",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Wookiee"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Wojarra was a Wookiee male who lived during the latter years of the Galactic Republic. Around 31 BBY, Wojarra joined the crew of a starship that was to ferry a Mandalorian iron box from the planet Almas to the world of Coruscant on behalf of the Jedi Order. On arrival on Coruscant, Wojarra and his fellow crew members were ambushed by a group of Believer Sith-worshipping cultists who stunned the Wookiee and stole the box.\nWojarra was a Wookiee male who lived during the last years of the Galactic Republic. Around 31 BBY, a team of Jedi researchers discovered the Pulas, an ancient Sith artifact, on the planet Almas. The Jedi Order decided to transport the relic to the world of Coruscant for safekeeping and assembled a fleet to accompany the artifact, with one vessel to carry a Mandalorian iron box containing the Pulas and the remaining transporting decoy boxes. Wojarra joined the company of a starship in the armada, alongside the Human Force Adepts San Herrera and Nia Reston, and the Tarasin female Es'Loma. Wojarra and his fellow crew collected their assigned Mandalorian iron box, containing a fragment of the dark side-imbued city Conkesta, from the Almas Academy Jedi training institution and then departed for Coruscant.\nOn arrival on Coruscant, Wojarra's ship docked on a landing platform and the crew were greeted by the Bothan Jedi Knight Nysis Belzara, who had been sent by the Jedi to accompany them and their box to a safe house. Unknown to Wojarra, his fellow crew member Es'Loma was in league with the Believers, a group of Sith-worshipping cultists who sought to steal the Pulas. Within a minute of arriving on Coruscant, Es'Loma pretended to fall off the side of the landing platform and while Wojarra, Belzara, Herrera and Reston were distracted by her plight, the Believers ambushed them. The cultists shot Belzara and the two Force Adepts and stole the group's Mandalorian iron box. Wojarra succeeded at firing a tracer onto the cultists' speeder but was then hit by a shot from a stun weapon and incapacitated.\nFollowing the attack, a group of spacers who had been assisting the transportation of another Mandalorian iron box for the Jedi arrived on the landing platform to investigate the ambush. Wojarra provided the spacers with an account of the Believers' assault and also gave them a datapad from which the tracer he had shot at the cultists' speeder could be tracked. The spacers then departed to pursue the Believers and recover the stolen box.\nThe Jedi-allied spacers subsequently retrieved the Mandalorian iron box from the Believers. As a token of his thanks, Wojarra gifted a bowcaster weapon to a Wookiee member of the spacer team.\nWhen he was ambushed by the Believers on Coruscant, he was displeased by attack and left feeling very grumpy.\nWojarra was armed with a bowcaster, a projectile weapon commonly used by members of his species. He was also equipped with a tracer tracking device and a datapad that could be used to monitor the tracer.\nWojarra appeared in Coruscani Dawn, a 2002 roleplaying adventure by Morrie Mullins and set within Star Wars Legends continuity that formed part of RPGA's Living Force campaign and which debuted at the Star Wars fan convention Celebration II. In the adventure, the players roleplay as the spacers that Wojarra encounters in the aftermath of the Believer attack. Wojarra provides the player characters information regarding the ambush and either speaks to them directly or with the assistance of a translator droid. The adventure hints that, though Wojarra is innocent of any involvement in planning the Believer ambush, paranoid players might suspect him of collusion with the cultists because he was only stunned during the attack and not critically injured. It is possible for the player characters to take back the stolen box from the Believers and if so, Wojarra bequeaths a bowcaster to any player roleplaying as a Wookiee.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Coruscani_Dawn",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Mandalorian_iron",
  "/wiki/Planet/Legends",
  "/wiki/Almas",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Believers",
  "/wiki/Sith/Legends",
  "/wiki/Sith_cult",
  "/wiki/Stun/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Pulas",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Human/Legends",
  "/wiki/Force_Adept",
  "/wiki/San_Herrera",
  "/wiki/Nia_Reston",
  "/wiki/Tarasin",
  "/wiki/Es%27Loma",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/City/Legends",
  "/wiki/Conkesta",
  "/wiki/Almas_Academy",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Hangar/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Nysis_Belzara",
  "/wiki/Standard_minute/Legends",
  "/wiki/Sith_Cultist",
  "/wiki/The_Force/Legends",
  "/wiki/Homing_beacon/Legends",
  "/wiki/Speeder/Legends",
  "/wiki/Stun_blaster/Legends",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Spacer/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/Canon",
  "/wiki/Bowcaster/Legends",
  "/wiki/Projectile_launcher/Legends",
  "/wiki/Species/Legends",
  "/wiki/2002",
  "/wiki/Roleplaying_game",
  "/wiki/Morrie_Mullins",
  "/wiki/RPGA",
  "/wiki/Living_Force_(roleplaying_campaign)",
  "/wiki/Star_Wars",
  "/wiki/Celebration_II",
  "/wiki/Translator_droid/Legends",
  "/wiki/Living_Force_Campaign_Guide",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Resistance_Within",
  "/wiki/Belly_of_the_Beaast"
 ]
}