{
 "name": "Woldar",
 "display_name": "Woldar",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Chimaera's bridge officer corps",
      "Chimaera's bridge officer corps"
     ]
    }
   ]
  }
 ],
 "content": "Woldar was a human male who served as a commander in the naval forces of the Galactic Empire where he served in Grand Admiral Thrawn's Seventh Fleet by 2 BBY.\nA human male officer in the Galactic Empire's Navy, Woldar was a commander in the Seventh Fleet and often reported to Grand Admiral Thrawn. In 2 BBY, during the Battle of Atollon, Woldar was present on the bridge of the Chimaera, and reported to Thrawn that a ship had escaped their blockade. Although most of the rebels eventually escaped, their base was destroyed.\nIn the aftermath of the battle, Woldar was assigned by Emperor Palpatine with guiding the Seventh Fleet in a search for the rebels who escaped Atollon. He was to be joined by Grand Moff Wilhuff Tarkin in this assignment.\nA year later, Woldar was aboard the Chimaera during the attack on Lothal. When General Hera Syndulla's Rebel Alliance strike force of T-65B X-wing starfighters emerged from hyperspace, Woldar counted 24 starships. In response, Thrawn deployed several TIE fighters, including the new TIE/D Defender Elite prototype piloted by Commander Vult Skerris, to intercept the intruders. After Syndulla steered Skerris into an Imperial light cruiser and a Star Destroyer, Woldar reported the damage to the Grand Admiral. Thrawn expressed regret but praised General Syndulla's skills as a combat pilot. Thrawn then ordered a second wave of TIE fighters to intercept the surviving Alliance crafts. Woldar would later report to Thrawn afterwards that all the rebel ships had been shot down, though some had managed to crash land within Capital City including Hera's lead fighter. When Thrawn asked on the status of the TIE Defender factory, Woldar confirmed it was completely undamaged much to Thrawn's satisfaction.\nCommander Woldar was a human male with brown hair and light skin.\nWoldar shared a character model with different Imperial officers, which first appeared in the Star Wars Rebels Season Two episode \"Legends of the Lasat.\" One of the character models, Woldar, was first identified in the end credits of Zero Hour which first premiered on Disney XD on March 25, 2017. He was voiced by Steve Blum, who also voiced the protagonist Garazeb Orrelios and multiple other characters in the series.\nIn Season Four, Woldar's character model continued to be used to fill in several background Imperial officers. In \"In the Name of the Rebellion,\" the model was used three different times for three unrelated characters, including for Captain Wells.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Woldar",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Chimaera%27s_bridge_officer_corps",
  "/wiki/Commander",
  "/wiki/Imperial_Navy",
  "/wiki/Grand_Admiral",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/7th_Fleet",
  "/wiki/2_BBY",
  "/wiki/Imperial_officer",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Battle_of_Atollon",
  "/wiki/Bridge_(starship)",
  "/wiki/Nightbrother_(Gauntlet_fighter)",
  "/wiki/Blockade",
  "/wiki/Chopper_Base",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Atollon",
  "/wiki/Grand_Moff",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/1_BBY",
  "/wiki/Attack_on_Lothal",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Hyperspace",
  "/wiki/Starship",
  "/wiki/TIE_line",
  "/wiki/TIE/D_Defender_Elite",
  "/wiki/Pilot",
  "/wiki/Vult_Skerris",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Admiral",
  "/wiki/Starfighter",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Star_Wars_Rebels_Season_Two",
  "/wiki/Legends_of_the_Lasat",
  "/wiki/Zero_Hour",
  "/wiki/Disney_XD",
  "/wiki/March_25",
  "/wiki/2017",
  "/wiki/Steve_Blum",
  "/wiki/Garazeb_Orrelios",
  "/wiki/Star_Wars_Rebels_Season_Four",
  "/wiki/In_the_Name_of_the_Rebellion",
  "/wiki/Captain",
  "/wiki/Wells",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Thrawn:_Alliances_(audiobook)",
  "/wiki/Rebel_Assault",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Rebellion_in_the_Rim",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/StarWars.com"
 ]
}