{
 "name": "Wona_Goban",
 "display_name": "Wona Goban",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Gold Squadron",
      "Gold Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Wona Goban was a human female pilot of the Alliance to Restore the Republic who flew with Gold Squadron under the command of Gold Leader Jon Vander. In 0 BBY, Goban was part of the Alliance Fleet that scrambled to support rebel forces trying to steal the plans to the Death Star superweapon on the planet Scarif.\nFlying a BTL-A4 Y-wing assault starfighter/bomber under the callsign Gold Nine, Goban engaged with the Imperial forces stationed above Scarif. Under orders from Admiral Raddus, she led a group of Y-wings in strafing the Imperial I-class Star Destroyer Persecutor with ion torpedos. This disabled the vessel and allowed it to be pushed into the Shield Gate that had been blocking transmissions from Scarif.\nWona Goban was a human female who served as a member of the Starfighter Corps of the Alliance to Restore the Republic. In 0 BBY, the Alliance learned that the Galactic Empire was constructing a superweapon known as the Death Star and that plans revealing a fatal flaw in the weapon's design were being stored on the planet Scarif. After a rogue squad of rebels set out on an unauthorised mission to steal the plans on Scarif, the Alliance scrambled its fleet to provide support.\nGoban was among the forces that arrived in the Scarif system, flying as Gold Nine in one of the BTL-A4 Y-wing assault starfighter/bombers of Gold Squadron under the command of Gold Leader Jon Vander. Admiral Raddus, who commanded the fleet from his flagship, Profundity, ordered Gold Squadron and Red Squadron to defend the fleet from the Imperial Naval forces above Scarif, while Blue Squadron was sent to the provide support on the surface.\nAfter part of Blue Squadron passed through, the Empire closed the Shield Gate above Scarif, blocking any further craft from reaching the surface. Gold Squadron and Red Squadron then conducted repeat attack runs on the gate's defense turrets and control linkages, but it quickly became clear they lacked the firepower to destroy it. Raddus then gave the command for the squadron to engage the Star Destroyers attacking their fleet, and Vander ordered his pilots to take advantage of an opening.\nGoban then led a group of four other Y-wings in strafing the Imperial I-class Star Destroyer Persecutor with ion torpedos. The barrage penetrated the Destroyer's deflector shields, which had been previously weakened by Blue Squadron pilot Barion Raner, and caused a systems shut down that completely disabled the vehicle. With the Persecutor floating dead in space, Raddus ordered the Sphyrna-class Hammerhead corvette Lightmaker to ram into the Destroyer, causing the Persecutor to collide with the Star Destroyer Intimidator and then the Shield Gate, destroying both. With the gate down, the rebels on the surface were able to transmit the Death Star plans up to the fleet and a portion of the rebel forces, including parts of Gold Squadron, then managed to successfully escape with the plans.\nGoban had tan skin and dark eyes.\nWhile flying, Wona Goban wore an orange flight suit with two code cylinders on the left sleeve, a white flak vest, and a Diagnostech life support unit. Goban's K-22995 light flight helmet was white and gray with red-and-yellow highlighting, a checkered black-white pattern on each side, and a symbol emblazoned on the central ridge. She flew a BTL-A4 Y-wing assault starfighter/bomber during the Battle of Scarif.\nWona Goban was portrayed by actress Gabby Wong in the 2016 Anthology Series film, Rogue One: A Star Wars Story. Wong was credited only as Gold Nine in the film, with the character then being identified as Wona Goban, a tuckerization of Wong's name, in the accompanying reference book Star Wars: Rogue One: The Ultimate Visual Guide, which was written by Pablo Hidalgo.\nWong received a call from her agent about the role and went in for a meeting with the casting director; she then read dialogue to a camera for scenes that were later sent to the director. She was booked for a day of costume and helmet fitting and a two-day shoot alongside actor Richard Glover, who portrayed Red Twelve in the film. Despite the fact that they would be shooting only her head, Wong wore a full costume that was fairly intricate and difficult to take off, so she avoided drinking too much water while wearing it. Wong shot her scenes in an X-wing starfighter cockpit, but as it was decided that it should be Y-wings firing the ion torpedos, the footage of her was then rotoscoped into existing archive footage of a Y-wing cockpit.\nWong recorded dialogue as well, but because of the final sequencing of the battle, the lines she had recorded did not quite fit, and she was asked to come back during post-production for ADR. In the end, however, her voice was not used, and the character ended up being dubbed by Vanessa Marshall.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/File:Vander-Goban-RO.ogg",
  "/wiki/Rebel_pilot",
  "/wiki/Commanding_officer",
  "/wiki/Gold_Leader",
  "/wiki/Jon_Vander",
  "/wiki/0_BBY",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Rogue_One",
  "/wiki/Death_Star_plans",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/Planet",
  "/wiki/Scarif",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/Callsign",
  "/wiki/Gold_Nine",
  "/wiki/Battle_of_Scarif",
  "/wiki/Imperial_Navy",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/BTL_Y-wing_starfighter",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Persecutor",
  "/wiki/Ion_torpedo",
  "/wiki/Star_Destroyer",
  "/wiki/Shield_Gate",
  "/wiki/File:Raddus-RedAndGold-RO.ogg",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Galactic_Empire",
  "/wiki/Scarif_system",
  "/wiki/Fleet",
  "/wiki/Flagship",
  "/wiki/Profundity",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/File:Raddus-Disabled-RO.ogg",
  "/wiki/Golan_M3185_space_station",
  "/wiki/Turret",
  "/wiki/Squadron",
  "/wiki/Deflector_shield",
  "/wiki/Barion_Raner",
  "/wiki/Realspace",
  "/wiki/Sphyrna-class_Hammerhead_corvette",
  "/wiki/Lightmaker",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Intimidator",
  "/wiki/Death_Star",
  "/wiki/Eye",
  "/wiki/Flight_suit",
  "/wiki/Code_cylinder",
  "/wiki/Flak_vest",
  "/wiki/Diagnostech_life_support_unit",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Starfighter",
  "/wiki/Bomber",
  "/wiki/Gabby_Wong",
  "/wiki/2016",
  "/wiki/Star_Wars_Anthology_Series",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/Tuckerization",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Gareth_Edwards",
  "/wiki/Richard_Glover",
  "/wiki/Red_Twelve_(Rebel_Alliance)",
  "/wiki/X-wing_starfighter",
  "/wiki/Vanessa_Marshall",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Birth_of_the_Rebellion",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/July_10",
  "/wiki/2017",
  "/wiki/August_9",
  "/wiki/2020"
 ]
}