{
 "name": "Worlohp",
 "display_name": "Worlohp",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo"
     ]
    }
   ]
  }
 ],
 "content": "Worlohp was the Ithorian captain of the Short Range Transit Shuttle SST-67 Fair Gale. Circa 32 BBY, he was contracted through Republic Sienar Systems to serve the Royal House of Naboo by ferrying passengers within the Naboo system. During one trip, in which he counted Hallem Celaar, Kharl Vanneb, and Sakme Kelene amongst his passengers, Worlohp was driven into a state of insanity due to accidental exposure to Kyvalon-4. Despite his attempts to kill those with him on the ship, he was eventually subdued.\nAn Ithorian, Worlohp captained the Fair Gale, a Short Range Transit Shuttle SST-67 from Republic Sienar Systems. The ship, along with many others, had been hired through Republic Sienar Systems itself to work for the Royal House of Naboo. The interplanetary shuttle would see use ferrying people to Naboo's moon Ohma-D'un shortly after the Invasion of Naboo. Over time, Worlohp imposed a ban on weapons while aboard his ship, as he noted that many beings harbored ill feelings toward one another, and were prone to violence. Fearing that the Fair Gale might suffer critical damage if a firefight were ever to break out on his ship, he requested that his passengers surrender their weapons before boarding. He made special exception in the cases of Jedi Knights and their lightsabers.\nOne day, he was tasked with taking a group that contained scientists and technicians to the moon. The group was to aid in the task of establishing a colony on Ohma-D'un. Among their number was Professor Hallem Celaar, Kharl Vanneb, and Sakme Kelene. Confiscating their weapons and storing them as per his procedure, Worlohp launched the Fair Gale, estimating landing on Ohma-D'un within forty-two minutes. The weather was clear, and according to reports a path had been cleared through the debris from the recent Battle of Naboo.\nSeventeen minutes into the flight, however, the reports proved to be false. The ship was struck violently by hull fragments from a Trade Federation craft, but Worlohp was not concerned, sending his technicians about to repair the damage. Kyvalon-4 gas was leaking into the ship, but again the Ithorian was not fazed, asking his passengers to pitch in and aid the repair efforts. What Worlohp did not realize was that Kyvalon-4 caused Ithorians to temporarily become homicidal maniacs.\nThe transformation was swift; Worlohp degenerated into an aggressive lunatic almost instantaneously. Celaar realized the threat far too late, as the captain was already moving to attack Kelene. The young female technician was rammed into the wall of the Fair Gale, rendering her unconscious. The Ithorian then set his sights on Vanneb, and began bellowing loudly. Lashing out at his other passengers with his fists, his rampage also greatly damaged the ship. Eventually, Worlohp was subdued, and the Fair Gale landed on Ohma-D'un. After apologizing to all those inconvenienced, he was reinstated as captain of the Fair Gale.\nWorlohp had a demeanor considered pleasant and friendly by those around him, although his motivations for requesting possession of weapons before sentients boarded his ship would sometimes sow seeds of suspicion. He was cheerful in doing his job, although his booming voice, natural for an Ithorian but unusual to most others, would sometimes throw people off. When under the influence of Kyvalon-4, Worlohp transformed into a rampaging monster with little discrimination between friend and foe, and a callous disregard for his own safety and the wellbeing of his ship.\nWorlohp made his first and only appearance in Peril in the Ionosphere, a role-playing adventure published in Star Wars Gamer 1, written by Steve Miller. Drawn by Stan Shaw, Worlohp is the antagonist in the story. In 2008, the character was given an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Royal_House_of_Naboo/Legends",
  "/wiki/Peril_in_the_Ionosphere",
  "/wiki/Captain/Legends",
  "/wiki/Short_Range_Transit_Shuttle_SST-67",
  "/wiki/Fair_Gale",
  "/wiki/32_BBY/Legends",
  "/wiki/Republic_Sienar_Systems/Legends",
  "/wiki/Naboo_system/Legends",
  "/wiki/Hallem_Celaar",
  "/wiki/Kharl_Vanneb",
  "/wiki/Sakme_Kelene",
  "/wiki/Kyvalon-4",
  "/wiki/Starship/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Ohma-D%27un/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Scientist/Legends",
  "/wiki/Professor/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Sentience/Legends",
  "/wiki/Star_Wars_Gamer_1",
  "/wiki/Steve_Miller",
  "/wiki/Stan_Shaw",
  "/wiki/2008",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars_Episode_I:_The_Gungan_Frontier"
 ]
}