{
 "name": "Worror_Dowmat",
 "display_name": "Worror Dowmat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "990 BBY",
      "Tython"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ithorian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Jedi Order",
      "Army of Light",
      "Army of Light"
     ]
    }
   ]
  }
 ],
 "content": "Worror Dowmat was a male Ithorian Jedi Master. Being a healer by profession, he was known amongst his peers to have never wielded a lightsaber, instead providing support for his allies in combat through his proficiency with Jedi battle meditation. One of the many Jedi to engage Lord Kaan's Brotherhood of Darkness during the New Sith Wars, Worror went to battle alongside such notable Masters as Lord Valenthyne Farfalla. In the final campaign of the war, Worror served with Lord Hoth.\nWorror's career as a Jedi Master ended in the year 990 BBY. He was part of a strike team led by Farfalla to the planet Tython on a mission to eliminate the only surviving Sith Lords of the Sith War, Darth Bane, and his apprentice Zannah. The Jedi believed that their advantage of greater numbers in combat would ensure their victory; however, they were unprepared for the strength of Bane and the cunning of his pupil, and soon became overwhelmed by the Sith's power during their confrontation on Tython. Worror died amongst his companions, after his four throats were slashed by Darth Bane's lightsaber.\nWorror Dowmat was an Ithorian Jedi during the days of the New Sith Wars. Most of his associates referred to him only by his first name, for only members of his native species possessed the four throats and two mouths required to pronounce his last. As a Master, Worror was unique amongst his peers in that he did not carry nor wield a lightsaber; he instead chose to serve the Order as a healer, being enlisted in the Jedi's Army of Light. His services were indeed put to use, as the war saw many of his fellow Jedi wounded in battle against the legions of Lord Kaan's Brotherhood of Darkness. During the Ruusan campaign, Worror served as an adviser to General Hoth, the Army of Light's leader, and his talent with Jedi battle meditation made Worror instrumental in many victories under Hoth's banner. Having also joined the general's contemporary Lord Valenthyne Farfalla in battle, the Ithorian was well recognized as an asset to the Jedi war effort. The war culminated on Ruusan, and the Jedi were eventually successful in their campaign against Kaan's Sith, though not without sustaining heavy casualties of their own; among them was Worror's colleague, Lord Hoth.\nTen years had passed since the end of the war, and the Jedi believed that the Sith had been completely wiped out during the final battle on Ruusan, where Kaan and his Dark Lords unleashed the life-destroying thought bomb. However, rumors of active Sith surfaced when Farfalla's former Padawan, Johun Othone, brought a young man to the Jedi Temple on Coruscant who had proof that at least two Sith Lords had indeed survived Ruusan's devastation. Remembering his vow to Lord Hoth to destroy the Sith, Farfalla called upon Master Worror, as well as the Echani Weapon Master Raskta Lsu, to accompany him to the ancient Jedi homeworld of Tython; on a mission to eliminate the Sith once and for all.\nJoining Farfalla, Othone, Lsu, and her own apprentice Sarro Xaj on board Lsu's vessel, the Justice Crusader, Worror acted as the ship's navigator, and he plotted the perilous route through space into the Deep Core. Lsu expressed concern for the reliability of the hyperspace lane to Tython, but Worror deemed the route safe, and the team made their way into the Core. Upon arriving on Tython right behind their quarry, the Jedi landed in the Crusader and entered the temple of Belia Darzu where the two Sith Lords were. As two entrances provided access to the temple, Farfalla's plan was to eliminate any opportunity for the Sith's escape, by having Knights Othone and Xaj enter through one door, while he and Lsu went in through the other. Armed only with the Force, Worror was to follow behind his fellow Masters, and support them as he had done during the war with his battle meditation. Upon entry, combat immediately ensued between the Jedi and Darths Bane and Zannah. Meanwhile, Worror found a corner of the room where he could both practice his meditations and stay clear of the battle.\nDespite the fierce offensive dueling style of Bane and the near-impenetrable defensive tactics of Zannah, Worror's battle meditation was successfully bolstering his allies' own skills, steadily maintaining the flow of the battle in the Jedi's favor. However, when Bane realized Worror was behind the Jedi's empowerment, he attempted to kill the Ithorian. Worror's life was saved when Othone pushed Worror out of harm's way, though this resulted in a disruption of Worror's concentration. The effects were immediately realized by the Jedi, and Xaj, Lsu, and Farfalla were soon cut down in succession. With no one left to defend him, Bane simultaneously slashed Worror's four throats, and mortally wounded him. The Dark Lord was about to next finish Othone with a torrent of Force lightning, but in a final dying gesture, Worror encased both he and Bane in a bubble of Force energy, causing the lightning to ricochet within. Though Worror died from his prior injuries, his bubble caused Bane to suffer the full strength of his own lightning attack, leaving the Dark Lord a smoking husk on the brink of death himself.\nFollowing his death on Tython, the Jedi High Council, alerted to the existence of Darth Bane by Caleb of Ambria sent a team of Jedi, including Masters Tho'natu and Obba to destroy him. On Ambria, in Caleb's camp, the Jedi discovered the lightsaber hilts of the slain Jedi, including Master Worror's. Upon the team's arrival they were assaulted by a deranged Darovit, whom they assumed to be Bane suffering from overexposure to the orbalisk armor. Slaying him, they deemed that the Sith were extinct, and returned the lightsaber hilts to the Temple.\nOnce returned to the Temple, the Jedi created a memorial to those Jedi who were responsible for the destruction of the Sith. All five Jedi's lightsaber hilts were set into a large white stone block in the gardens around the base of the Tower of First Knowledge. Under each hilt was a depiction of its wielder, along with their name.\nThough he rarely spoke, Worror had a deep, Ithorian voice, one that resonated through the hull of Lsu's Justice Crusader. He was a devout Jedi who never shunned the call for action. This was evidenced by his service during the New Sith Wars, where he entered battle armed with only the Force. He was trusted amongst his peers and General Hoth, who employed Worror as one of his close advisers during the Ruusan Campaign, holding his council in high regard. He understood the necessity of eradicating the Sith, and was one of those selected by Farfalla to seek them out on Tython. However, Worror's decision not to carry a weapon contributed to his own demise; when his allies fell in battle against Darth Bane, he was unable to protect himself from the lightsaber strikes of the Dark Lord.\nMaster Worror was adept in the operation of interstellar spacecraft, acting as the ship navigator when traveling throughout the galaxy. His piloting skills were witnessed when he successfully navigated the Justice Crusader through the perilous hyperspace lane to Tython.\nAs a warrior, Worror's talents were not in areas of offense, but rather in the defense and support of his comrades. Worror was unique among members of the Jedi Order in that he never carried the traditional weapon of his brethren, the lightsaber, nor did he ever wield one in battle. Instead, the Ithorian Master chose to hone his mastery of the Force and apply it in a supporting role for his colleagues when necessary. He was adept in Jedi battle meditation, a skill he implemented to considerable effect during his service with Lord Farfalla on several occasions. Though Worror was not skilled enough to direct the tide of large-scale conflicts, his meditation proficiency was ideal in close-combat situations, such as smaller skirmishes and confrontations. Total focus was required on his part, so much so that any outside influence to disturb him would cause a disruption in his concentration, and the empowerment he was previously providing would cease until he was again able to center himself. He was guarded in combat by other Jedi to prevent the enemy from assailing him, and thus eliminating his allies' sense of empowerment.\nA skill attributed to his Ithorian anatomy, Worror was able to channel the Force though his four throats to create a powerful, offensive, sonic weapon. Worror was also proficient in the creation of defensive protection bubbles through the Force. However, in a creative display, he used a protection bubble offensively to trap Darth Bane, in order to defend the fallen Johun Othone from the Dark Lord's Sith lightning. This unusual application of a normally defensive Force ability would prove to be Bane's undoing; encased in the bubble, the Dark Lord suffered the full brunt of his own lightning attack which nearly killed him.\nAuthor Drew Karpyshyn created the character of Worror for the second of his Darth Bane novels, titled Rule of Two. A portion of his backstory was explored by Karpyshyn, though this remains Worror's first and only appearance to date. In the novel, he is only given one speaking line.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/990_BBY",
  "/wiki/Tython/Legends",
  "/wiki/Ithorian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Army_of_Light/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Jedi_healer/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Battle_meditation",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Skere_Kaan",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/New_Sith_Wars",
  "/wiki/Jedi_Lord",
  "/wiki/Valenthyne_Farfalla",
  "/wiki/Ruusan_campaign",
  "/wiki/Hoth_(Jedi_Lord)",
  "/wiki/Planet/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth/Legends",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Darth_Zannah/Legends",
  "/wiki/Form_V/Legends",
  "/wiki/Sith_magic",
  "/wiki/Duel_on_Tython",
  "/wiki/Death/Legends",
  "/wiki/Throat",
  "/wiki/Species/Legends",
  "/wiki/Army/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Ruusan/Legends",
  "/wiki/Thought_bomb",
  "/wiki/Padawan/Legends",
  "/wiki/Johun_Othone",
  "/wiki/Darovit",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Order_of_the_Sith_Lords",
  "/wiki/Echani/Legends",
  "/wiki/Jedi_Weapon_Master",
  "/wiki/Raskta_Lsu",
  "/wiki/Homeworld/Legends",
  "/wiki/Sarro_Xaj",
  "/wiki/Justice_Crusader",
  "/wiki/Deep_Core/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Hyperlane",
  "/wiki/Belia_Darzu%27s_fortress",
  "/wiki/Belia_Darzu",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Form_III/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Force_lightning/Legends",
  "/wiki/Protection_bubble",
  "/wiki/Caleb",
  "/wiki/Ambria/Legends",
  "/wiki/Tho%27natu",
  "/wiki/Obba",
  "/wiki/Lightsaber_hilt/Legends",
  "/wiki/Orbalisk_armor",
  "/wiki/Confrontation_on_Ambria",
  "/wiki/Tower_of_First_Knowledge/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Drew_Karpyshyn",
  "/wiki/Darth_Bane:_Rule_of_Two",
  "/wiki/Darth_Bane:_Rule_of_Two_(audiobook)",
  "/wiki/Darth_Bane:_Dynasty_of_Evil",
  "/wiki/Darth_Bane:_Dynasty_of_Evil_(audiobook)",
  "/wiki/The_Official_Star_Wars_Fact_File_(2014)",
  "/wiki/The_Official_Star_Wars_Fact_File_Part_14"
 ]
}