{
 "name": "Wrecker",
 "display_name": "Wrecker",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.98 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Grey",
      "White"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Clone Force 99",
      "Clone Force 99",
      "Galactic Empire",
      "Imperial Army",
      "Imperial Army"
     ]
    }
   ]
  }
 ],
 "content": "\"Wrecker\" was a clone commando who served in the Grand Army of the Republic during the Clone Wars as part of Clone Force 99. Due to genetic mutations, Wrecker was much larger and stronger than the average clone trooper. He loved blowing things up, and served as the muscle and demolitions expert for his squad, which was nicknamed the \"Bad Batch.\" Wrecker lived through many dangerous missions during the Clone Wars, including the Battle of Anaxes in the last year of the war. He and his squad-mates were partaking in the Conquest of Kaller when Order 66 was initiated, and as Wrecker, Hunter, Tech, Crosshair, and Echo remained unaffected, they watched with much confusion as their clone brothers turned on the Jedi.\nUpon returning to Kamino, the squad was apprehensive to the new Galactic Empire that was being established as well as the clones' complete loyalty to the new regime. Although Crosshair chose to stay and serve the Empire, Wrecker and the others, joined by the young enhanced clone Omega, decided to go on the run.\nWrecker was a clone created on the planet Kamino. Like other soldiers in the Grand Army of the Republic, Wrecker was created from the genetic template of the bounty hunter Jango Fett with the intention of raising an army of identical warriors to defeat the enemies of the Galactic Republic. However, the cloning process contained a margin of error, resulting in the existence of beings that strayed from Fett's genetic code. One of these beings was Wrecker, who developed physical strength and stature far exceeding that of his fellow clones. Recognizing the strategic value in these genetic divergences, the Republic collected certain mutated clones to create an elite commando unit. This squad included Wrecker, as well as three other clones known as Hunter, Crosshair, and Tech. Together, they formed Clone Force 99, named in honor of Clone 99, who gave his life defending their homeworld during the Battle of Kamino.\nUnofficially referred to as the \"Bad Batch,\" Clone Force 99 went on several missions during the Clone Wars, a pan-galactic conflict between the Republic and the Confederacy of Independent Systems. During this time, the squad maintained a 100% success rate in their operations, traveling in an Omicron-class attack shuttle known as the Marauder. Although it was rare, the squad occasionally worked with regular clone troopers, though the Bad Batch often came at odds with the so-called \"regs,\" with Wrecker claiming the squad's ship would always be shot down when traveling with such clones.\nAt some point during the Clone Wars, Clone force 99 performed an operation on Kuat, which Wrecker described as a \"smash and grab\". In 19 BBY, Wrecker and the other members of Clone Force 99 were sent to Yalbec Prime, where they were tasked with putting down an insurrection. During the mission, Wrecker cut off the stinger of a Yalbec queen while she was still alive, causing male members of the species to attack the team. Although squad leader Hunter believed that the Yalbec intended to eat them, Tech, the unit's information specialist, corrected him and stated that Wrecker's actions caused the aliens to attempt to mate with the clones. Despite this, Clone Force 99 managed to escape the battle unscathed; while still on Yalbec Prime they received a message from Clone Commander CC-2224 \"Cody,\" who requested the team's help on the planet Anaxes.\nOn Anaxes, Republic forces were caught in a tiring battle, struggling to defend the world from the Separatists. Led by Admiral Trench, the droid army seemed to be able to accurately counter the personal strategies of Clone Captain CT-7567 \"Rex,\" leaving the clone forces baffled. With the consent of Jedi Generals Mace Windu and Anakin Skywalker, Cody planned to lead the Bad Batch behind enemy lines to a Cyber Center and learn more about the Separatists' plans. Touching down on the planet, the Bad Batch was joined by Rex, Cody, and fellow clones CT-5597 \"Jesse\" and CT-6116 \"Kix\" of the 501st Legion. Wrecker regaled the \"regs\" with stories of his victory on Yalbec Prime and boasted that he could single-handedly destroy the Cyber Center, despite Cody's insistence that the mission was solely focused on retrieval. En route to the Separatist base, the team's Low Altitude Assault Transport was shot down, a development which Wrecker found delightful.\nThough most of the clones emerged unscathed from the crash, Cody had been caught underneath debris, trapping him in the burning gunship. Putting his trademark strength on display, Wrecker forced the transport to topple onto its side, rescuing the injured commander without assistance just before the LAAT exploded. Alerted to the Republic's presence, battle droids approached on the survivors' position. Hunter led the Bad Batch in \"Plan 82,\" a battle strategy that saw Wrecker use the reinforced doors of the downed gunship as an improvised shield, protecting his squadmates as they engaged the enemy with Electro Magnetic Pulse grenades. Once most of the droids were destroyed, Wrecker rammed the doors into a DSD1 dwarf spider droid, blocking the output of its central laser cannon and causing it to detonate from within. In the aftermath of the skirmish, Wrecker brandished the disconnected head of a B1-series battle droid, pushing it into the face of the team's sniper Crosshair and mockingly suggesting that the droid liked him.\nAfter regrouping at nightfall, Rex took command of the group and ordered the medic Kix to remain with an injured Cody until an evacuation team arrived. Wrecker and Crosshair took issue with the change in management, but Hunter reminded the squabbling clones that they all fought for the same side. The next day, the unit came across an enemy security outpost. While the main squad ascended to the tower's upper level, Wrecker covered the structure's entrance and, to his dismay, did not participate in clearing the outpost's interior. But the brawler would have his chance to wreak havoc, as the group discovered that the Cyber Center was very close. Flanking the building on Flitknot Speeder Bikes, Force 99 stormed the base, allowing Rex and Tech to find that the center was receiving a live signal from Skako Minor. Rex discovered that the broadcast was being given by CT-1409, the clone designation of an Advanced Recon Commando named Echo who was thought to have been killed in action. With this intel, the group escaped and retreated back across Republic lines.\nDetermined to uncover the truth of his friend's disappearance, Rex convinced General Skywalker to lead a rescue mission to Skako Minor, with Clone Force 99 supplying transportation aboard the Marauder. En route to the planet, Wrecker continued to show off his abilities to Rex and Skywalker, lifting a PLNK-series power droid over his head with one hand while eating a deep-fried nuna leg with the other. Upon entering the planet's atmosphere, however, Wrecker placed the power droid down and threw the nuna leg aside, ready for action. Immediately on planetfall, the group were attacked by the native Poletecs; flying atop winged reptiles known as keeradaks, the aliens captured General Skywalker and brought him into their village. Wrecker toppled a large boulder overlooking the village, giving the squad mobile cover as they entered the site, disarmed the Poletecs, and freed their general. After negotiating with the Poletec chief, the group was directed towards the Techno Union city Purkoll. Tensions rose once again between Rex and the Bad Batch; after the clone captain struck Crosshair for suggesting that Echo was better off left for dead, Wrecker restrained Rex and warned him against engaging with the squad. Skywalker broke up the clones, sending Force 99 to find an entrance into the tower base from which Echo's signal originated.\nAfter discovering a turbolift that led into the structure, Wrecker became apprehensive of entering the facility, as he suffered from a fear of heights. Nevertheless, he ascended with his team, and took great joy in decimating the D1-series aerial battle droids that awaited them at the top. As more droids flooded the halls, Rex discovered that Wat Tambor, the leader of the Techno Union, had indeed captured Echo, transforming him into a cyborg and using his mind to predict the Republic's movements. Cornered in Tambor's lab and threatened by the organic-destroying Decimator, the team's only escape was a ventilation shaft in the ceiling; in order to reach the vent, Wrecker tossed each clone into the air, though General Skywalker, a Jedi Knight, was able to easily ascend to the opening. Before departing, Wrecker tossed multiple thermal detonators into the lab, ensuring that Tambor's experiments would not continue. Skywalker used the Force to lift Wrecker himself into the exhaust shaft, pulling the large clone into the vent just as the Decimator entered the lab.\nFleeing through the base's cooling systems, the team exited the facility through a door high in the atmosphere, intending to cross a thin pipe between towers to reach a landing pad. With no choice other than to confront his phobia, Wrecker crossed the gap with discomfort until the squad was once again cornered by droids. Wrecker was forced to dive off of the pipe in order to catch Crosshair, who had lost his balance in the chaos. Tech used recordings he had made earlier to replicate the cry of the keeradaks, summoning the flying reptiles and giving the squad a means of escape. The team was briefly followed by the winged D1 droids, but the Bad Batch swiftly shot down the droids and returned to the Poletec village. Tambor would not so easily let his \"property\" escape, however, and sent further reinforcements after the Republic unit. During the defense of the village, Wrecker again used his power to throw Rex and Hunter into the air, this time to take out the photoreceptors of octuptarra tri-droids. One such droid nearly crushed some of the villagers beneath its legs, but Wrecker pushed the Poletecs aside, grabbing the tri-droid's limb and holding it in place until General Skywalker toppled the walker with the Force. With Echo rescued and the village safe, the team returned to Anaxes.\nDuring the closing phase of the battle, Wrecker, his squad, Rex, Skywalker, and Echo boarded Admiral Trench's flagship, the Invulnerable, allowing Echo to transmit a signal that shut down the Separatist army below. After escaping the Providence-class Dreadnought, Skywalker gave Wrecker a detonator he had stolen from the bridge. Overjoyed at the chance, Wrecker was allowed to annihilate the entire Confederate fleet over the planet, securing a Republic victory. The squad later decided to leave before the medal ceremony, but Sergeant Hunter, realizing that Echo was no longer a regular clone, offered the corporal a place in their squad. Echo agreed to join the commandos, parting ways with Rex when he and the rest of the Bad Batch saluted the Clone Captain.\nDeployed on Kaller due to reassignments from Jedi Master Depa Billaba's clone units and warned by Padawan Caleb Dume, the Bad Batch stormed a battle droid squadron with their unorthodox method, narrowly saving the clones and both Jedi. Crosshair shot two cables that linked together three AAT Mk I, allowing Wrecker to come in and push them all down a mountain side. After the conflict, Wrecker told Dume he missed the fun, with Caleb stating that watching them was the fun part. When Billaba asked about her own forces Hunter stated that they were elsewhere and she only has them. Wrecker confidently stated that they're all she needs, though Tech claimed that with Kenobi entering the fight with Grievous on Utapau, their help would not be necessary, as the separatist movement is sure to collapse after the cyborg's fall. The Bad Batch then offered to let the general go their own way, which Billaba agreed to while allowing her Padawan to join the clone squad. Suddenly, Wrecker and the others halted their progress when they saw the battalion open fire on Billaba, killing her and causing Dume to flee from the Bad Batch and into the forest. Not understanding what had just happened, Tech informed his companions that the radio was repeating \"Execute Order 66,\" something Wrecker heard but did not know the meaning of. Fearing for the Padawan's safety, Hunter ordered Echo and Tech to talk to the Captain, Wrecker to stop other clones from intervening, and for he and Crosshair to pursue Dume. Subsequently, a pair of clones approached Wrecker, demanding to know Dume's whereabouts. Wrecker attempted to brush them off, assuring them that Hunter was handling the situation, but the troopers insisted they were under orders from Supreme Chancellor Palpatine himself. Dismissing their claim as unimportant, Wrecker repeated his previous sentence more forcefully but the troopers just ignored him and forced their way past. Wrecker then radioed Hunter and informed him of the incoming troopers.\nWrecker's unit, known as Clone Force 99 and nicknamed the \"Bad Batch,\" was comprised of \"defective\" clones with desirable genetic mutations. In Wrecker's case, his mutations granted him incredible superhuman strength, strong enough to lift a wrecked LAAT gunship away to recover a wounded comrade trapped underneath.\nWrecker was loud and excitable, and prone to expressing his opinions in a very exuberant manner. He had a deep passion for explosions and destroying enemy material, particularly battle droids, with his bare hands. His only major weakness was his fear of extreme heights, which he described as having a problem with gravity. Despite having some difficulties when working with regular clones, Wrecker and his squad came to respect Clone Captain Rex, even saluting the clone trooper officer after the Battle of Anaxes. He had a stuffed tooka doll named Lula, which was very important to him. Due to his genetic mutation, Wrecker was initially unresponsive to the programming of his inhibitor chip, though he eventually began to develop headaches that were interspersed with minor episodes of Order 66 programming after hitting his head during a crash landing and various other moments where his head was hit, which he was able to resist. He eventually succumbed to his inhibitor chip on Bracca, though he was able to get it removed.\nWrecker developed a bond with the young clone Omega, becoming something of a playful older brother to her. Like the other members of the Bad Batch, Wrecker was protective of Omega and worked hard to make her feel a part of the team. He customized a section of the Marauder to act as her own room. Wrecker displayed a great of deal of guilt when he nearly harmed Omega after succumbing to his inhibitor chip, and he deeply apologized for his actions even though he could not help himself. His boisterous and happy energy often appealed to younger individuals, such as Omega, but also to Cut Lawquane's children, Shaeeah and Jek, who referred to him as \"Uncle Wrecker.\"\nWrecker was shown to be an expert on the operations of explosives and even tutored Omega on how to defuse certain kinds of ordnance, though he had the common sense not to train her using live explosives.\nIn combat, Wrecker was known to use a DC-17m Interchangeable Weapon System and a large knife. He wore modified Katarn-class Commando Armor with a specific helmet.\nGeorge Lucas had a very specific vision of the Bad Batch, in that he wanted a version of The Dirty Dozen with clones. Dave Filoni sketched their appearances which Brent Friedman and Matt Michnovetz used to imagine the Bad Batch's voices and personalities. Matt and Brent worked with Dave to flesh out the characters and their story where Wrecker would be based on something akin to the Hulk from Marvel Comics. Directors Steward Lee and Bosco Ng who are big Marvel fans likes to direct Wrecker the most like in scenes where he gets to rampage like the Hulk. Dee Bradley improvised Wrecker's voice the most and inserted gung-ho things like loud grunts and shouts.\nWrecker was to appear in a four episode arc written by Michnovetz which starred the Bad Batch which now included \"Echo,\" alongside Yoda on Kashyyyk. At the \"Untold Clone Wars\" panel at Celebration Anaheim, Dave Filoni talked about the plot of the arc. He revealed that the characters would ride on \"giant ape lizards,\" that were holy to the Wookiees in a religious way. In one scene Tarfful would ask the tree spirits for permission to go into battle against the enemy, which was a Trandoshan and the Separatist Alliance. To get the enemy out of some of their cities they would have to burn some of the trees. The Clones had no problem with it, but it was upsetting to the Wookiees. A part of the arc would be about the Clones and the Wookiees finding a common ground to fight the separatists. A story reel clip was shown at the panel, which showed the Bad Batch and other Wookiees riding on the \"ape lizards\" and battle against a new beast that was based on Kinraths from the Star Wars: Knights of the Old Republic video game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wrecker_(disambiguation)",
  "/wiki/Template:Cleanup",
  "/wiki/Template:Update",
  "/wiki/Star_Wars:_The_Bad_Batch",
  "/wiki/Talk:Wrecker",
  "/wiki/Kamino",
  "/wiki/Human",
  "/wiki/Cloning",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Clone_Force_99",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Army",
  "/wiki/A_Distant_Echo",
  "/wiki/Clone_commando",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Clone_Wars",
  "/wiki/Clone_trooper",
  "/wiki/Battle_of_Anaxes",
  "/wiki/Conquest_of_Kaller",
  "/wiki/Order_66",
  "/wiki/Hunter",
  "/wiki/Tech",
  "/wiki/CT-9904",
  "/wiki/Echo",
  "/wiki/Jedi",
  "/wiki/Omega",
  "/wiki/The_Bad_Batch_(episode)",
  "/wiki/Planet",
  "/wiki/Soldier",
  "/wiki/Gene",
  "/wiki/Clone_template",
  "/wiki/Bounty_hunter",
  "/wiki/Jango_Fett",
  "/wiki/Army",
  "/wiki/Squad",
  "/wiki/Clone_99",
  "/wiki/Homeworld",
  "/wiki/Battle_of_Kamino",
  "/wiki/The_galaxy",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Omicron-class_attack_shuttle",
  "/wiki/Marauder_(Omicron-class)",
  "/wiki/Starship",
  "/wiki/Kuat",
  "/wiki/19_BBY",
  "/wiki/Yalbec_Prime",
  "/wiki/Insurrection_on_Yalbec_Prime",
  "/wiki/Yalbec_queen_stinger",
  "/wiki/Unidentified_Yalbec_queen",
  "/wiki/Species",
  "/wiki/Yalbec",
  "/wiki/Alien",
  "/wiki/Reproduction",
  "/wiki/Clone_Commander",
  "/wiki/CC-2224",
  "/wiki/Anaxes",
  "/wiki/Admiral",
  "/wiki/Trench",
  "/wiki/Separatist_Droid_Army",
  "/wiki/Rex%27s_battle_strategy_algorithm",
  "/wiki/Clone_Captain",
  "/wiki/Rex",
  "/wiki/Jedi_General",
  "/wiki/Mace_Windu",
  "/wiki/Anakin_Skywalker",
  "/wiki/Cyber_Center",
  "/wiki/CT-5597",
  "/wiki/Kix",
  "/wiki/501st_Legion",
  "/wiki/Low_Altitude_Assault_Transport/infantry",
  "/wiki/Gunship",
  "/wiki/Transport",
  "/wiki/Commander",
  "/wiki/B1-series_battle_droid",
  "/wiki/Plan_82",
  "/wiki/Electro_Magnetic_Pulse_grenade",
  "/wiki/Droid",
  "/wiki/DSD1_dwarf_spider_droid",
  "/wiki/Laser_cannon",
  "/wiki/Battle_droid",
  "/wiki/Sniper",
  "/wiki/Medic",
  "/wiki/Anaxes_Separatist_Security_Outpost",
  "/wiki/Flitknot_Speeder_Bike",
  "/wiki/Skako_Minor",
  "/wiki/Advanced_Recon_Commando",
  "/wiki/Battle_of_Lola_Sayu",
  "/wiki/File:EndToTamborsScienceExperiment-OWK.ogg",
  "/wiki/On_the_Wings_of_Keeradaks",
  "/wiki/General",
  "/wiki/Mission_to_Skako_Minor_(Clone_Wars)",
  "/wiki/PLNK-series_power_droid",
  "/wiki/Atmosphere",
  "/wiki/Power_droid",
  "/wiki/Nuna",
  "/wiki/Limb",
  "/wiki/Poletec",
  "/wiki/Reptile",
  "/wiki/Keeradak",
  "/wiki/Poletec_village",
  "/wiki/Qin_Yazal",
  "/wiki/Techno_Union",
  "/wiki/City",
  "/wiki/Purkoll",
  "/wiki/Purkoll_Tower_Base",
  "/wiki/Turbolift",
  "/wiki/D1-series_aerial_battle_droid",
  "/wiki/Wat_Tambor",
  "/wiki/Cyborg",
  "/wiki/Brain",
  "/wiki/Decimator",
  "/wiki/Jedi_Knight",
  "/wiki/Force_jump",
  "/wiki/Thermal_detonator",
  "/wiki/The_Force",
  "/wiki/Telekinesis",
  "/wiki/Hangar",
  "/wiki/Photoreceptor",
  "/wiki/Octuptarra_tri-droid",
  "/wiki/Walker",
  "/wiki/File:PresentForWrecker-UB.ogg",
  "/wiki/Unfinished_Business_(episode)",
  "/wiki/Invulnerable",
  "/wiki/Trench%27s_army",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Bridge",
  "/wiki/Confederacy_of_Independent_Systems_Navy",
  "/wiki/Sergeant",
  "/wiki/Clone_Corporal",
  "/wiki/Aftermath_(episode)",
  "/wiki/Kaller",
  "/wiki/Depa_Billaba",
  "/wiki/Depa_Billaba%27s_second_battalion",
  "/wiki/Padawan",
  "/wiki/Kanan_Jarrus",
  "/wiki/Armored_Assault_Tank_Mk_I",
  "/wiki/Grievous",
  "/wiki/Utapau",
  "/wiki/CC-10/994",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Clone_trooper_officer",
  "/wiki/Tooka_doll",
  "/wiki/Lula",
  "/wiki/Bracca",
  "/wiki/Omega%27s_Room",
  "/wiki/Cut_Lawquane",
  "/wiki/Shaeeah_Lawquane",
  "/wiki/Jek_Lawquane",
  "/wiki/DC-17m_Interchangeable_Weapon_System",
  "/wiki/Knife",
  "/wiki/Katarn-class_Commando_Armor",
  "/wiki/Helmet",
  "/wiki/George_Lucas",
  "/wiki/Dave_Filoni",
  "/wiki/Brent_Friedman",
  "/wiki/Matt_Michnovetz",
  "/wiki/Steward_Lee",
  "/wiki/Bosco_Ng",
  "/wiki/Yoda",
  "/wiki/Kashyyyk",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/Wookiee",
  "/wiki/Tarfful",
  "/wiki/Trandoshan",
  "/wiki/Kinrath/Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Category:Audio_files_of_Wrecker",
  "/wiki/Category:Images_of_Wrecker",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Clone_Wars:_Season_7:_Volume_1",
  "/wiki/Cut_and_Run",
  "/wiki/Replacements",
  "/wiki/Cornered",
  "/wiki/Rampage_(episode)",
  "/wiki/Decommissioned",
  "/wiki/Battle_Scars",
  "/wiki/Reunion",
  "/wiki/Bounty_Lost",
  "/wiki/Common_Ground",
  "/wiki/Devil%27s_Deal",
  "/wiki/Rescue_on_Ryloth",
  "/wiki/Infested",
  "/wiki/War-Mantle",
  "/wiki/Return_to_Kamino",
  "/wiki/Kamino_Lost",
  "/wiki/The_Bad_Batch_Season_2",
  "/wiki/LEGO_STAR_WARS:_Celebrate_the_Season",
  "/wiki/The_Pumpkin_Batch",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars:_The_Clone_Wars:_The_Final_Countdown",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars:_The_Bad_Batch",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_204",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Prize_Giveaway!",
  "/wiki/Star_Wars_Insider_214",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Sacrifice",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Standard_year",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/File:WreckerTweet.png"
 ]
}