{
 "name": "Wrobie_Tyce",
 "display_name": "Wrobie Tyce",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Warlentta"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.65 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Resistance",
      "Cobalt Squadron",
      "Exegol air team",
      "Cobalt Squadron",
      "Exegol air team"
     ]
    }
   ]
  }
 ],
 "content": "Lieutenant Wrobie Tyce was a human female pilot who served in the Resistance. The wife of the human Larma D'Acy, Tyce served as a courier pilot until D'Acy decided to join the Resistance movement, a venture that Tyce not only supported but also entered, flying in Cobalt Squadron in an RZ-2 A-wing interceptor. She escaped being killed when the rest of her squadron perished at the retreat from the planet D'Qar in 34 ABY, as she was away on a separate mission.\nIn 35 ABY, she was present on the moon Ajan Kloss for multiple meetings, including the funeral of General Leia Organa and a session where plans were made for the Battle of Exegol against the Sith Eternal. She went on to pilot her A-wing starfighter at the battle, which began unfavorably for the Resistance as their expected reinforcements had not yet arrived. Just as the situation seemed particularly dire and General Poe Dameron was about to order a retreat, the Citizens' Fleet arrived, allowing the Resistance to defeat the Sith Eternal's Star Destroyers. Tyce later celebrated the victory with her wife back on Ajan Kloss.\nThe wife of the human Larma D'Acy, Wrobie Tyce was once a courier pilot operating on her homeworld of Warlentta. After D'Acy defended the Warlentta system for many years, she was personally recruited by General Leia Organa to the Resistance movement. Tyce was in full support, and she even chose to come along with her, changing from being a commercial pilot to one of combat. She went on to fly in the Resistance's Cobalt Squadron, becoming a lieutenant and helping the unit defend the astronomical object Fabrin and the Nanth'ri Trade Route. Tyce and D'Acy were then among several married Resistance couples.\nTyce was not present at the Resistance's retreat from the planet D'Qar in 34 ABY—when the First Order had discovered the Resistance's hidden base and set out to destroy it—as she was away on a mission with fellow pilot Snap Wexley. The rest of her squadron was annihilated during the retreat, and Tyce was later reassigned under the command of Wexley. Afterward, Tyce was greatly relieved as she learned that her wife had survived the Battle of Crait, and she reunited with D'Acy following the battle. At some point, she flew her A-wing interceptor through an asteroid field.\nIn 35 ABY, Tyce was stationed at the Resistance's base on the moon Ajan Kloss, which allowed her to spend time with her wife after several months on separate missions. While on the moon, she mentored other pilots.\nTyce was present on Ajan Kloss when Resistance member Poe Dameron confirmed that Emperor Palpatine had returned and was hiding in the Unknown Regions on a world called Exegol, and she later stood next to the deathbed of General Organa during the latter's funeral. She then participated in a briefing where the Battle of Exegol was planned, during which she asked the new general, Dameron, how the Xyston-class Star Destroyers of the Sith Eternal's fleet, the Final Order, were able to take off. Dameron explained that they used a signal from a navigation tower, and the former stormtrooper Finn elaborated that the ground team would take the tower down, preventing the Star Destroyers from leaving the atmosphere. Meanwhile, the light freighter known as the Millennium Falcon would be sent to the Core Worlds in order to gather reinforcements. While standing by her interceptor, Tyce was given a goodbye kiss by D'Acy.\nTyce and the Resistance starfighters flew to Exegol using directions provided by the Jedi-in-training Rey. When they arrived at the world, Tyce pointed out that neither the Falcon nor any additional allies had arrived yet. She flew her A-wing during the battle and was part of the attack force that intended to destroy the navigation tower. However, the tower was deactivated upon their arrival, which she pointed out as they approached it.\nTyce further explained that the tower was therefore no longer transmitting a signal. Finn then discovered that the source of the navigation signal had been transferred to the Sith fleet's command ship, the Resurgent-class Star Destroyer Steadfast. When he suggested that the ship be designated as the ground team's new drop zone, Tyce questioned his intention to launch a ground invasion on a Star Destroyer in disbelief. Finn admitted that he did not want to, but stated that there was no other choice.\nTyce and the other fighter wings covered the ground team's troop carrier as it landed on the Steadfast. Later in the battle, the Resistance pilots began to doubt whether any reinforcements would in fact arrive. When Dameron was asked by the Mon Calamari pilot Aftab Ackbar what they would do, he told them that they needed to damage the Sith Star Destroyers' cannons themselves. Tyce wondered what their fighters would be able to do against Destroyers of their size; Dameron responded that they would just try to stay alive. When he asked if the pilots were with him, Tyce replied affirmatively.\nWhen many of the Resistance's fighters began to be shot down by the Sith TIE fighters, Tyce asked Dameron if they needed to retreat. Just as Dameron prepared to make such an order, the reinforcements of the Citizens' Fleet arrived under General Lando Calrissian's leadership, and the Steadfast was destroyed by Finn and his crewmate Jannah, with the rest of the Xystons also falling to the Resistance. When Dameron attempted to save the pair, who were still on the command ship, Tyce warned that he would not be able to make it back in time. Dameron insisted he was fast, but Calrissian flew in to do the job instead, reminding Dameron that he was not as fast as the general's ship, the Millennium Falcon.\nTyce returned to Ajan Kloss with the rest of the Resistance and participated in the victory celebrations there along with D'Acy, whom she hugged and kissed for a long while. She also danced about during the festivities.\nTyce supported her wife, D'Acy, to the extent of joining the Resistance alongside her. After the Battle of Crait, Tyce was very relieved to hear that D'Acy had survived. The two found courage in each other's presence, though they were not prone to public displays of affection. When they were apart, with D'Acy working with ground forces and Tyce on different missions in her A-wing, the couple were unsure of when they would be reunited; despite this, they were able to remain hopeful, inspired by General Organa who had said that \"Nothing's impossible.\"\nDuring the Battle of Exegol, when Commander Dameron asked his starfighter pilots if they were with him, she assured him that she was without hesitation. When Dameron tried to save Finn and Jannah by himself, Tyce was worried for him and tried to tell him to stop. A particularly aggressive pilot, she had no trouble handling enemies at close range. Tyce was a human female with curly, black hair, brown skin, and brown eyes. She stood 1.65 meters  tall.\nOriginally a courier pilot, Tyce was able to adapt her flying skills to pilot starfighters instead. She was also able to fly through asteroids.\nTyce utilized a green-and-white RZ-2 A-wing interceptor. She also wore a white-and-red flight helmet that bore a yellow Rebel Alliance starbird and the logo of Cobalt Squadron but had room for a new decal. She donned an interstellar-orange flight suit that had a utility belt, emergency oxygen tube, and an equipment pocket. The suit was further covered in a white flight vest and was accompanied by a gray Guidenhauser flight harness, a white FreiTek Incorporated life support unit, and black gloves and boots.\nWrobie Tyce first appeared in the 2019 sequel trilogy film, Star Wars: Episode IX The Rise of Skywalker, where she was portrayed by Vinette Robinson. Her surname was revealed in the credits, and her first name was given in the accompanying reference book Star Wars: The Rise of Skywalker: The Visual Dictionary, written by Pablo Hidalgo. The 2020 novelization of the film mistakenly describes Tyce's starfighter as a Y-wing. The 2021 graphic novel adaptation for The Rise of Skywalker slightly modifies Tyce's dialogue, changing \"The navigation tower has been deactivated\" to \"The navigation tower! It's been deactivated!\"\nThe celebratory kiss between Tyce and D'Acy was notable as the first on-screen LGBTQ+ kiss in the Star Wars films. It was censored in the United Arab Emirates and Singapore.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Warlentta",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Resistance",
  "/wiki/Cobalt_Squadron",
  "/wiki/Exegol_air_team",
  "/wiki/File:Tyce-Dameron-StayAlive-TROS.ogg",
  "/wiki/Lieutenant",
  "/wiki/Resistance_pilot",
  "/wiki/Marriage",
  "/wiki/Larma_D%27Acy",
  "/wiki/Courier",
  "/wiki/Pilot",
  "/wiki/RZ-2_A-wing_interceptor",
  "/wiki/Death",
  "/wiki/Squadron",
  "/wiki/Battle_of_D%27Qar",
  "/wiki/Planet",
  "/wiki/D%27Qar",
  "/wiki/34_ABY",
  "/wiki/35_ABY",
  "/wiki/Moon",
  "/wiki/Ajan_Kloss",
  "/wiki/Funeral",
  "/wiki/General",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal",
  "/wiki/A-wing_starfighter",
  "/wiki/Poe_Dameron",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Homeworld",
  "/wiki/Warlentta_system",
  "/wiki/Standard_year",
  "/wiki/Starfighter_combat",
  "/wiki/Fabrin",
  "/wiki/Nanth%27ri_Trade_Route",
  "/wiki/First_Order",
  "/wiki/Resistance_base",
  "/wiki/Temmin_Wexley",
  "/wiki/Commanding_officer",
  "/wiki/Battle_of_Crait",
  "/wiki/Asteroid_field",
  "/wiki/File:Tyce-Dameron-NavTower-TROS.ogg",
  "/wiki/Resistance_base_(Ajan_Kloss)",
  "/wiki/Time",
  "/wiki/Standard_month",
  "/wiki/Galactic_Emperor",
  "/wiki/Darth_Sidious",
  "/wiki/Unknown_Regions",
  "/wiki/Exegol",
  "/wiki/Fleet",
  "/wiki/Final_Order",
  "/wiki/Navigation_tower",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Finn",
  "/wiki/Exegol_landing_team",
  "/wiki/Star_Destroyer",
  "/wiki/Atmosphere",
  "/wiki/YT-1300_light_freighter",
  "/wiki/Millennium_Falcon",
  "/wiki/Core_Worlds",
  "/wiki/Interceptor",
  "/wiki/File:Tyce-Deactivated-TROS.ogg",
  "/wiki/Starfighter",
  "/wiki/Jedi",
  "/wiki/Jedi_training",
  "/wiki/Rey_Skywalker",
  "/wiki/Command_ship",
  "/wiki/Resurgent-class_Star_Destroyer",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Fighter_wing",
  "/wiki/Fortitude_(transport)",
  "/wiki/Mon_Calamari",
  "/wiki/Aftab_Ackbar",
  "/wiki/Cannon",
  "/wiki/File:Tyce-Dameron-Calrissian-TROS.ogg",
  "/wiki/TIE/dg_starfighter",
  "/wiki/Landonis_Balthazar_Calrissian",
  "/wiki/Jannah",
  "/wiki/Light_freighter",
  "/wiki/File:Tyce-AlphaLeader-TROSJr.ogg",
  "/wiki/Resistance_Army",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Asteroid",
  "/wiki/Flight_helmet",
  "/wiki/Rebel_Alliance_starbird",
  "/wiki/Flight_suit",
  "/wiki/Utility_belt",
  "/wiki/Oxygen",
  "/wiki/Flight_vest",
  "/wiki/Guidenhauser",
  "/wiki/Flight_harness",
  "/wiki/FreiTek_Incorporated",
  "/wiki/Life_support",
  "/wiki/Glove",
  "/wiki/Boot",
  "/wiki/2019",
  "/wiki/Sequel_trilogy",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Vinette_Robinson",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Pablo_Hidalgo",
  "/wiki/2020",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/BTL-A4_Y-wing_assault_starfighter/bomber",
  "/wiki/2021",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_Graphic_Novel_Adaptation",
  "/wiki/Star_Wars",
  "/wiki/Category:Audio_files_of_Wrobie_Tyce",
  "/wiki/Category:Images_of_Wrobie_Tyce",
  "/wiki/Star_Wars_(2020)_25",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Screen_Comix)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_(Disney_Die-Cut_Classics)",
  "/wiki/William_Shakespeare%27s_The_Merry_Rise_of_Skywalker:_Star_Wars_Part_the_Ninth",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2020_Topps_Women_of_Star_Wars",
  "/wiki/Fantasy_Flight_Games",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Heralds_of_Hope_Squadron_Pack",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Star_Wars:_I_Love_You._I_Know.",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Dominic_Monaghan:_Decoding_the_Dark_Side",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Prize_Giveaway!",
  "/wiki/Star_Wars_Insider_210",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Episode_VIII_The_Last_Jedi",
  "/wiki/Battle_of_Starkiller_Base",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_The_Force_Awakens:_The_Visual_Dictionary",
  "/wiki/December_20",
  "/wiki/December_21",
  "/wiki/December_24",
  "/wiki/February_25"
 ]
}