{
 "name": "Wruq_Retk",
 "display_name": "Wruq Retk",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yaka"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances",
      "Galactic Alliance Security",
      "Galactic Alliance Security"
     ]
    }
   ]
  }
 ],
 "content": "Wruq Retk was a male Yaka colonel in Galactic Alliance Security. He commanded a secret Galactic Alliance Security blockhouse on Coruscant, where psychotic Jedi Knights Valin Horn and Jysella Horn were held in carbonite. In 43.5 ABY, the Jedi Council acquired a document granting the Jedi access to the blockhouse to see the two Knights. A contingent of Jedi, accompanied by the Horns' mother, Mirax Terrik Horn, and several journalists, entered the facility, where they found the two carbonite-imprisoned Jedi on display above a large aquarium. Retk arrived shortly after and attempted to take control of the situation, but Terrik Horn, furious at him for mistreating her children, assaulted him and knocked the larger man out with one blow.\nWruq Retk was a male Yaka who served as a colonel in Galactic Alliance Security. By 43.5 ABY, he had become the commander of Detention Center 81, a secret Galactic Alliance Security blockhouse on the galactic capital of Coruscant. Jedi Knights Valin Horn and Jysella Horn, who had come down with an enigmatic madness, were captured by the Galactic Federation of Free Alliances, and, after being deemed too dangerous to be confined in a conventional prison, they were encased in carbonite and eventually placed in the blockhouse that Retk commanded. Retk decided to keep them on display over a large aquarium in the lobby outside of the facility's executive offices.\nShortly after the formation of the Court of Jedi Affairs by Galactic Alliance Chief of State Natasi Daala, the Court's head, Arabelle Lorteli, signed a document giving Jedi permission to enter Retk's blockhouse and see the captive Knights. A group of Jedi, including Master Saba Sebatyne, Jedi Knight Jaina Solo, and the Horns' father, Corran Horn, were accompanied by the Horns' mother, Mirax Terrik Horn, and a large contingent of press, including journalist Javis Tyrr. Galactic Alliance Security forces attempted to prevent the Jedi access to the blockhouse, but to no avail. Retk quickly arrived on the scene, however, insulting Sebatyne with the hopes of provoking the Jedi Master to attack him in front of the press. However, Retk was instantly confronted by Terrik Horn, who accused him of using her children as \"decorations\"—which he denied, claiming he only wished to keep them where he could personally oversee their maintenance—and abruptly hit him, knocking Retk unconscious in one blow. A Security captain, Xanda, began to call for the arrest of Terrik Horn for assaulting Retk, but Daala arrived and took control of the situation, declaring that Terrik Horn would not be punished.\nColonel Wrug Retk was rude and abrasive toward the Jedi and intentionally attempted to provoke the Jedi Master Saba Sebatyne into attacking him, an act that would have, under normal circumstances, resulted in his arm being severed by the Barabel Jedi Master and then used to beat him around the head. He was also callous toward the Horn family; he hung their two carbonite-imprisoned children on his wall as office decorations and was amused by Terrik Horn's distress. However, he underestimated the grief and anger of Mirax Terrik Horn, who punched him out cold.\nWruq Retk was created by author Troy Denning for Fate of the Jedi: Abyss, his first installment and the third of nine novels in the Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Yaka",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Colonel/Legends",
  "/wiki/Galactic_Alliance_Security_Detention_Center_81",
  "/wiki/Galactic_Alliance_Security_blockhouse",
  "/wiki/Coruscant/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/Jysella_Horn",
  "/wiki/Carbonite/Legends",
  "/wiki/43_ABY",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/Jedi/Legends",
  "/wiki/Mirax_Terrik_Horn",
  "/wiki/Journalist/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/The_Galactic_Federation_of_Free_Alliances_versus_Valin_Horn",
  "/wiki/Prison/Legends",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Court_of_Jedi_Affairs",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Arabelle_Lorteli",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Saba_Sebatyne",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Corran_Horn",
  "/wiki/Javis_Tyrr",
  "/wiki/Captain/Legends",
  "/wiki/Xanda",
  "/wiki/Horn_family",
  "/wiki/Troy_Denning",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Allies",
  "/wiki/Fate_of_the_Jedi:_Allies_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)"
 ]
}