{
 "name": "Wullf_Yularen",
 "display_name": "Wullf Yularen",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Death Star",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.81 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown",
      "later white"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Senate Bureau of Intelligence",
      "Galactic Republic Navy",
      "Senate Bureau of Intelligence",
      "Galactic Republic Navy",
      "Galactic Empire",
      "Imperial Security Bureau",
      "Imperial Academy",
      "Naval Intelligence Agency",
      "Imperial Officer Corps",
      "Imperial Security Bureau",
      "Imperial Academy",
      "Naval Intelligence Agency",
      "Imperial Officer Corps"
     ]
    }
   ]
  }
 ],
 "content": "Wullf Yularen was a male human who served as a high-ranking officer in both the Galactic Republic and its successor state, the Galactic Empire. Serving the Republic during the Battle of Malastare Narrows, he was given an admiral's commission in the Republic Navy following the outbreak of the Clone Wars, serving as a fleet admiral assigned to Jedi General Anakin Skywalker. Yularen overcame an initially-rocky relationship with his Jedi superior to successfully combat the Confederacy of Independent Systems in several battles throughout the conflict, including Christophsis, the Kaliida Nebula, and Geonosis. Narrowly escaping the destruction of his flagship, the Resolute, by 20 BBY he was considered one of the preeminent naval officers of the time.\nWith the Republic's transition into the Galactic Empire, Yularen resigned his commission in favor of becoming a colonel in the Imperial Security Bureau, and in this capacity rooted out sedition in the Imperial Senate as well as served as a liaison to the Naval Intelligence Agency. Following the events of the Berch Teller campaign, Yularen was eventually promoted to head the reformed NIA, with the rank of Deputy Director. However, he continued playing an important role in the ISB, and became an early ally of the Chiss Thrawn as he rose through the ranks of the Imperial Navy, assisting him in his campaigns against the rebel agent Nevil Cygni.\nIn response to the growing rebellion, Colonel Yularen assisted now-Grand Admiral Thrawn in hunting for the rebel mole Fulcrum, who leaked Imperial intelligence to the rebels. Working with Thrawn, Yularen discovered that the rebel mole was his former student Agent Alexsandr Kallus. Following the Battle of Scarif, Yularen was one of the officers assigned to the Death Star battle station, where he was killed during the Battle of Yavin.\nWullf Yularen was a human male born on the planet Coruscant. Prior to the start of the Clone Wars, Yularen served as an officer in the Republic Navy. He participated in the Battle of Malastare Narrows, a conflict in which a fleet organized by the Corporate Alliance blockaded the planet Malastare. Despite his best efforts, the enemy fleet, led by the brilliant Harch tactician Admiral Trench, proved impossible to break, and Yularen lost many of his own forces. Eventually, a dispatched Jedi task force turned the tide of the battle, defeating the Corporate fleet, vaporizing Trench's flagship, and seemingly killing him in the process. Despite the victory, Yularen left the battle with a lasting fear of the Admiral's tactical capabilities. He served in the Republic Senate Bureau of Intelligence for a time, until he retired.\nFollowing the eruption of the Clone Wars in 22 BBY and the formation of the Grand Army of the Republic, Supreme Chancellor Sheev Palpatine encouraged Yularen to join the brand new Republic Navy, awarding him the rank of Admiral, making him the youngest member of the naval corps to achieve this rank. Yularen served as a fleet admiral during the war. Since a war bargain struck between the Jedi Order and Chancellor ensured that the new Jedi Generals would be paired with veteran naval officers, Admiral Yularen was assigned to Jedi Knight Anakin Skywalker. Initially in command of a Venator-class Star Destroyer, this starship heavily damaged in the Battle of Teth, after which he would be posted to the cruiser Resolute, the flagship of General Skywalker's fleet.\nDuring the Battle of Christophsis, Yularen initially failed to break through the Separatist blockade of the planet with supplies for Senator Bail Organa's force trapped on the planet. Recognizing his insignia on the Separatist flagship, the dreadnought Invincible, Yularen concluded that Trench had survived at Malastare and was facing him once again. Fearing his capabilities, Yularen regrouped on the far side of Leesis, Christophsis' moon. Reinforced by Jedi Master Obi-Wan Kenobi's Negotiator, Yularen personally participated in a mercy mission aboard a new model of stealth ship to provide relief to the planet below.\nThe ship, fitted with an experimental cloaking device, easily slipped past the blockade. However, Trench, emboldened by the lull in the fighting, ordered a flight of Hyena bombers to attack Organa's position on the planet's surface in an attempt to draw out the Republic force and destroy it. Despite Kenobi's preparations, Yularen recognized that any counterattack would result in heavy casualties for their fleet. The Jedi, Skywalker, was able to outmaneuver Trench's attacks and destroy the Invincible. Despite his initial skepticism and friction with the Jedi, the Admiral was impressed with Skywalker's unconventionality, who commented that they made a good team. Yularen was later forced to withdraw due to a renewed Separatist blockade in orbit, but the destruction of the Separatist shield generator and ensuing surrender of General Whorm Loathsom allowed him to return with Master Yoda's reinforcements and secure a Republic victory.\nYularen then assisted General Kenobi in rescuing what was left of Clone Captain Rex's troops holed up at Teth's B'omarr Monastery. He tried to allow Skywalker, his Padawan Ahsoka Tano and Jabba the Hutt's son, Rotta to land on his ship but were unable to due to Vulture droids attacking the ship's hangar. Following Rotta's return to his father and the establishment of the Republic's treaty with the Hutt Clan, Yularen would assign various missions to Skywalker and Kenobi throughout the war. After the Republic's defeat at Hypori, Yularen sent Kenobi, Commander CC-2224 \"Cody\" and the 212th Attack Battalion to aid Commander Mekedrix and his forces from Roon at a battle on Abrion Major.\nYularen played a pivotal role in the search and destruction of General Grievous's secret weapon, the warship Malevolence. After it was revealed Grievous planned to attack the undefended Kaliida Shoals Medical Center, Yularen briefed the pilots of Shadow Squadron, flying BTL-B Y-wing starfighter/bombers, for their strike on the ship. With the destruction of the Malevolence's massive ion cannons and the disabling of its hyperdrive, Yularen pursued after the ship with three Venator destroyers, including the Resolute, trying to stop it from fleeing to Separatist space, until the ship finally was destroyed on impact with a nearby moon.\nAdmiral Yularen continued to assist Kenobi and Skywalker in their search for Grievous. Yularen then informed them that the Rishi Station had stopped transmitting and then had the fleet alerted to this problem, which turned out to be an attack orchestrated by Grievous. After discovering that Grievous planned to attack Kamino, the homeworld and production center for the Republic's clone army, Yularen was placed in charge of the planet's blockade fleet. The vigorous orbital defense was successful in damaging much of Grievous' fleet, only to discover the space battle was a Separatist ruse in order to launch a ground attack. Despite this, the planet was successfully defended from the attack.\nYularen was involved in multiple other engagements as well throughout the war. He participated in the Battle of Quell, arriving to reinforce the beleaguered fleet of General Aayla Secura, but to no avail. After the Jedi's cruiser inadvertently disappeared into hyperspace, with Secura, Skywalker, Tano, and several clones onboard, Yularen was left to fight on until the battle was lost.\nAs the Republic moved to liberate Ryloth from the Confederacy, Yularen led the Republic fleet in engaging the blockade, commanded by Neimoidian captain Mar Tuuk onboard a modified Droid Control Ship. The initial engagement saw the losses of Blue Squadron and the Redeemer while the Resolute and the Defender were severely damaged. Yularen was also injured during the fighting and went to rest in his quarters. Tano entered his quarters and, believing him to be unconscious, verbalized her insecurities about continuing with the battle. In turn, Yularen vouched for Tano when she proposed a new strategy; turning the Resolute on its belly while the clones flew in from the sides. He also authorized Skywalker's plan to ram the crippled Defender into the Tuuk's flagship while the Jedi pretended to surrender aboard an escape pod. Skywalker and Tano's strategies succeeded in crippling Tuuk's fleet and allowed Kenobi's troops to land on the planet.\nThe admiral also coordinated the aerial support for the three-pronged ground assault in the Second Battle of Geonosis, as well as being given command of a task force of Star Destroyers, Republic frigates and Arquitens-class cruisers during the Battle of Saleucami, while the Jedi attempted to rescue the general Eeth Koth, as well as capture Grievous. He commanded the Republic fleet during the Battle of Sullust, where the Resolute was lost to heavy enemy fire. Yularen, however, was able to evacuate before its destruction. Following the Devaron massacre, Yularen informed Skywalker and Kenobi that Mekedrix had gone rogue and possibly joined a group of assassins known as the Death Wind, striking at multiple Republic, Separatist and civilian targets. Yularen tasked the Jedi with locating the Death Wind on Ando and killing Mekedrix if he had indeed joined them, which they begrudgingly did.\nIn 19 BBY, Yularen, as one of the higher-ranking Republic naval officers, attended the Republic strategy conference at the starbase Valor over Carida, where he almost perished due to a Separatist plot to ram the station with a captured Star Destroyer. He returned to Coruscant to attend the memorial service for the victims of the Jedi Temple hangar bombing. He was a member of the prosecution, headed by lead prosecutor Admiral Wilhuff Tarkin, in the military trial of Ahsoka Tano, now exempt from prosecutorial immunity after being expelled from the Jedi Order, who was accused of orchestrating the bombing. However, moments before the Supreme Chancellor read the final verdict, the true perpetrator, fallen Jedi Barriss Offee, was brought before the court by Skywalker, and Tano was allowed to go free.\nYularen participated in the Battle of Ringo Vinda, directing Skywalker and his team towards the remains of the destroyed Nu-class transport that had been transporting CT-5385 \"Tup\" to Coruscant.\nSometime later, while on a Venator-class Star Destroyer, Yularen spotted an unknown ship, the Silver Angel, in military airspace. Yularen spoke to the passengers onboard through the comlink and asked Trace Martez what she was doing in military airspace. He threatened to confiscate her starpilot license, but Ahsoka Tano switched off the comlink and the ship flew off. Yularen then informed General Skywalker that it was some rookie pilot on their first maneuvers. He said that he was about to send a detachment to arrest them until Skywalker sensed Ahsoka's presence and decided to let them fly off.\nNear the end of the Clone Wars, Yularen would take an interest in Count Dooku and his new right-hand man \"Admiral Enigma,\" who was actually the former Jedi Master Quinlan Vos. After receiving intelligence that Dooku and Admiral Enigma had been sighted on a Providence-class dreadnought that was planning to attack Taris, Yularen informed the Jedi High Council, which had been engrossed in a meeting to discuss rescuing Vos. Using Admiral Yularen's information, the Council decided to rescue Vos and agreed to pardon the former Sith apprentice Asajj Ventress if she agreed to take part in the rescue mission. While the rescue mission was successful, Vos had secretly turned to the Dark Side and become Dooku's newest Sith apprentice.\nFollowing the conclusion of the war, Supreme Chancellor Palpatine transitioned the Republic into the Galactic Empire, with himself as Galactic Emperor. Yularen continued to serve as an admiral within the Imperial Military, albeit briefly. Although the Corporate Sector had largely supported the Confederacy during the Clone Wars, the Corporate Sector Authority was allowed to expand to tens of thousands of star systems by the Emperor, rather than being brought under Imperial control. As such, the Empire maintained a cooperative relationship with the CSA, and shortly after the end of the Clone Wars, Admiral Yularen conducted a campaign in the Corporate Sector against pirates that were launching raids.\nEventually with this New Order, Yularen resigned his admiral's commission in favor of pursuing a career with the Commission for the Preservation of the New Order's Imperial Security Bureau  with the rank of colonel. His first assignment was heading a division whose purpose was to expose instances of sedition in the Imperial Senate. By 14 BBY, the fifth year of the Empire's reign, Yularen had been appointed the head liaison between the ISB and its main rival, the Naval Intelligence Agency, and was responsible for ensuring cooperation between the Empire's different intelligence agencies.\nDuring this time, he personally reviewed the reports of Naval Intelligence operative Commander Gallius Rax, bypassing NIA Vice Admirals Dodd Rancit and Terrinald Screed. Along with his direct superior, Harus Ison, he represented the ISB on Coruscant when Moff Wilhuff Tarkin arrived to give his report about the attack on Sentinel Base. As the Berch Teller campaign progressed, he continued to play an active role in the Imperial response from Coruscant, conferring with both Tarkin and the Joint Chiefs. After the death of Vice Admiral Rancit at Carida, the Emperor promoted Yularen to replace his rival's former role as head of the NIA when it was folded under Imperial Intelligence, with the position of Deputy Director. In this role, he continued to receive Gallius Rax's top-secret intelligence reports, which were marked \"eyes only\" for himself.\nIn 5 BBY, in the aftermath of the heist on the Imperial garrison on Aldhani, Yularen spoke with Emperor Palpatine, who gave the ISB direct control of operations going forward, as well as giving him the authority to arrest anyone who was considered a disrupter to the Empire. The next day, Yularen addressed the board of ISB supervisors inside the ISB Central Office and relayed to them that the criminals responsible for the attack on Aldhani would be punished in a quick and eager retaliation. He then informed the assembled that the Empire would impose a tribute tax five times the amount stolen from Adldhani on any sector harboring rebel activity, emphasizing that this would make it clear that nobody stole from the Empire. He then added that the use of any local custom, festival, or tradition as a cover for rebel activity would also trigger a permanent revocation of Imperial tolerance.\nYularen informed the supervisors about his meeting with Emperor Palpatine, then announced that the Emperor would convene an emergency session of the Senate to propose a legislative package of bills and amendments that will give the ISB unlimited powers of surveillance, search, and seizure. He went to inform them that they would also be invoking the Public Order Resentencing Directive, which meant that any criminal act with even indirect effect on the Empire, would be classified as a Class One offense. Supervisor Dedra Meero listened to Yularen's speech to her fellow officers but was visibly upset, something that ISB Attendant Heert noticed. After the meeting, Heert spoke with Meero privately in her office, and she expressed concerns that Yularen's policies were playing into the rebel's hands. Meero also remarked that the Empire is treating the Aldhani incident as a robbery when it was, in fact, an announcement.\nMajor Partagaz temporarily reassigned the Morlana system to Meero shortly after the meeting with Yularen, as the incident on the planet Ferrix had become a point of interest for Dedra while it had become a distraction for the previous supervisor, Blevin. In this role, Meero presented a report to Yularen and the other supervisors regarding a stolen N-S9 Starpath Unit from Steergard. Yularen, intrigued, informed Dedra that he was listening, and she went on to explain that that very Starpath unit was found on Ferrix the month prior and the apparent thief was a local named Cassian Andor, who was wanted for the murder of two Corporate Security officers. She explained that Andor was in the act of transferring the unit to a person who she identified as \"Axis,\" believing he was a central point to an organized rebel effort based on stealing Imperial gear.\nYularen then looked and began reading the list of supplies that Meero had requested. Upon finishing the list, he admitted that it was \"quite a wishlist,\" but Meero asserted that it was all ready to go, and that if someone was to be talking, they needed to listen. Yularen pointed out that it was a rather large investment, but Meero asserted that it was a fraction of the cost of the lost technology. Yularen asked Dedra what her plan was, and she asserted that they needed to find out who Axis was. Partagaz added that Meero had convinced him that Axis was their largest target, as even though they did not know his identity or region of influence, he had already caused much trouble. Dedra then stated that Ferrix was Axis' biggest mistake, and that what she wanted was to drill down and get a hunt started.\nAround this time, ISB Agent Kallus, Yularen's \"star pupil\" from the Imperial Academy, was after a crew of insurgents known as the Spectres. Yularen kept tabs on Kallus during his service.\nFollowing the Dromedar hijacking, Colonel Yularen accompanied the Lothal Senator Domus Renking, the Chiss Senior Lieutenant Thrawn and Ensign Eli Vanto during an Ascension Week ball at the Alisandre Hotel on Coruscant. Renking introduced Yularen and his colleagues to one of his aides Arihnda Pryce, who worked at one of Renking's citizen assistance offices. Yularen recounted the story of how Thrawn and Vanto single-handedly captured a pirate ship and most of its crew, and saved a valuable shipment of tibanna gas. While Thrawn was modest about his achievements, Yularen pointed out that Thrawn and his crew were outnumbered by the pirates. When Yularen asked Vanto if he was stating the case, Vanto replied in the affirmative but remained despondent about his lack of promotion.\nWhile making conversation with Renking and Pryce, Yularen announced that he had to leave to attend to business with \"friends in high places.\" Before leaving, Yularen took care to introduce Thrawn to other Imperial officials and senators. Another ulterior motive of Yularen's social call was to help Thrawn build connections with sympathetic civilian officials in order to counterweight the High Command in the event they decided to court martial Thrawn for his ingenious but unorthodox tactics on the Dromedar. Thrawn and Yularen then discussed the matter that twelve of the tibanna cylinders recovered aboard the Dromear had been emptied. Yularen deduced that the insurgent leader Nevil Cygni, who was the insurgent leader Nightswan, had somehow found a way to get the gas out of the cylinders. While Thrawn was upset, Yularen reassured the Chiss that he would be welcome in the Imperial Security Bureau in the event that the Navy did not want him. Fortunately for Thrawn, he was cleared by the court martial panel, and was subsequently promoted to Captain.\nContinued their investigation into Nightswan's campaign, Captain Thrawn and Ensign Vanto visited Colonel Yularen's office to seek his help on investigating the wily Nightswan. Yularen shared Thrawn's dismay that Commander Alfren Cheno had taken the fall to protect Thrawn following the Battle over Umbara. Yularen informed Thrawn that he had found multiple references to Nightswan in a range of activities including metal smuggling, antique purchases, and the instigation of protests and unrest. However, he was unable to uncover the insurgent leader's identity. Unable to discern Nightswan's motives, Yularen dismissed him as a troublemaker.\nThrawn speculated that Nightswan was motivated by the usurpation of some personal or mining interests. Following the Circle Bay mayor's office protest, Yularen convinced Thrawn and Vanto to accompany him and the ISB Officers Roenton and Brook on a visit to the dojos that trained bodyguards for Imperial Senators. One of these dojos that Colonel Yularen and his comrades visited was the Yinchom Dojo, which was owned by the Togorian H'sishi. Over the past five years, thirty senators had sent their bodyguards to Yinchom Dojo for training. At the dojo, they met Pryce again, whom they had encountered earlier at the Alisandre Hotel. After losing her job with Senator Renking, Pryce had found work at the Higher Skies Advocacy Group. One of the martial art instructors Juahir Madras at the dojo was a friend of Driller MarDapp, the leader of Higher Skies. Madras was also part of Driller's spy ring, which worked for Nightswan.\nWhen H'sishi arrived, Yularen introduced himself and his companions. He also asked H'sishi whether she had record on government contracts and bodyguard training. Before H'sishi went to fetch the documents, Thrawn convinced H'sishi to engage in a sparring session with sticks. Following the visit, Thrawn related his observations of the dojo to Yularen. He noted that Instructor Madras had ignored them until H'sishi had ordered her to stop. Thrawn also explained that Pryce had alerted him about the advocacy group Higher Skies and that he had sparred with H'sishi to ascertain if she had any hostile intentions. While Thrawn cleared H'sishi of any malevolent intent, he convinced Yularen to investigate Higher Skies.\nFollowing the Yinchom visit, Thrawn secretly met with Pryce, who offered to provide the Imperials with information about Higher Skies' espionage activities in return for immunity. Thrawn agreed to petition Yularen to protect Pryce in return for spying on her colleagues. Acting under Thrawn and Yularen's instructions, Pryce baited Moff Ghadi by offering to provide him with information that Higher Skies had illegally obtained about Grand Moff Wilhuff Tarkin. Pryce then double-crossed Ghadi by exposing Higher Skies' activities and Ghadi's attempted profiteering to Tarkin himself. In addition to granting Pryce immunity, Tarkin agreed to promote her to Governor of Lothal and to promote Thrawn's friend Vanto to Lieutenant Commander.\nFollowing Pryce's deal with Tarkin, Colonel Yularen and several ISB agents arrested members of Higher Skies and Yinchom Dojo including Juahir and the group's leader Driller MarDapp. Yularen personally arrested Juahir after one of the martial arts instructors' students, the bodyguard Kaniki, tried to assassinate Senator Evidorn; after being informed about the \"evils\" of the Empire by Madras. When Juahir pleaded for Pryce's help, Pryce instructed her former friend to cooperate fully with Yularen in return for being spared the death penalty. However, Pryce convinced Yularen to spare H'sishi since there was no evidence of any wrongdoing on her part.\nIn 2 BBY, Colonel Yularen along with Admiral Thrawn and Commander Vanto attended a high-level meeting of Imperial admirals and governors chaired by Fleet Admiral Jok Donassius to discuss the Batonn insurgency. Nightswan's insurgents had taken the Imperial garrison on Scrim Island hostage. Thrawn was assigned to deal with the insurgents but insisted on studying the battle longer. Yularen sided with Thrawn and pointed out that the insurgents had disabled the base's cathtron tubes. An impatient Fleet Admiral Donassius then reassigned Scrim Island to Admiral Durril.\nFollowing the failure of Admiral Durril, Thrawn's Ninety-Sixth Task Force successfully defeated the Scrim Island insurgents and forced their surrender. However, several of the insurgents managed to flee to the Creekpath Mining and Refining complex where they holed themselves up. The siege of Creekpath was complicated by the presence of Governor Pryce's parents Talmoor and Elainye Pryce, who worked at the mine. Pryce managed to convince Colonel Yularen to allow her to accompany Agent Gudry on an undercover mission to disable the insurgents' deflector shield generator. Colonel Yularen briefed Thrawn about the plan and the Admiral provided the undercover agents with comms and data collectors.\nTo ensure coordination between the Navy and the ISB, Yularen agreed to correspond with Commander Vanto on frequencies and passcodes. After briefing Vanto, Yularen asked the Commander about the unusual position of Thrawn's Imperial Star Destroyer Chimaera and the rest of the task force including the disabled light cruisers. Despite the vulnerable position of the ships, Vanto urged Yularen to have faith in Thrawn's tactics. Not fully trusting Thrawn's plan, Yularen asked Vanto to keep an eye on his commanding officer and expressed concern that Thrawn had become obsessed with stopping Nightswan.\nIn secret, Thrawn communicated with Nightswan and the two met at an empty field to discuss a peaceful solution to the siege. Despite their philosophical differences, Thrawn offered to provide Nightswan a means to join the Chiss Ascendancy to safeguard the galaxy against threats from the Unknown Regions. Unwillingly to abandon his men to the tender mercies of Governor Restos, Nightswan declined Thrawn's offer but convinced the Admiral to do his best to minimize civilian casualties at Creekpath. Following the meeting, Yularen picked up Thrawn in his airspeeder and asked Thrawn why he should not shoot him as a traitor.\nIn private, Thrawn reassured Yularen that he was only trying to seek a peaceful outcome to the Creekpath siege. After being assured of Thrawn's loyalty, Yularen questioned him about the placement of the four light cruisers. Thrawn explained that he had positioned them at a distance so that they would be out of range of any surface attack. When Yularen expressed concern that the light cruisers' positions left them vulnerable to attack, Thrawn responded that this was to prevent theft. Not understanding Thrawn's tactics, Yularen chided Thrawn for his lack of political savvy. Yularen also expressed concern about not receiving any contact from Pryce and Gudry.\nUnknown to Yularen, Pryce and Gudry had fallen out. With Gundry reneging on his promise to evacuate Pryce's parents, Pryce had killed him following a struggle. Meanwhile, Colonel Yularen dispatched a special squad to retrieve the two, believing they were in danger. Pryce and her family reached the Imperial lines safely, where they took shelter at Major Talmege's headquarters. Despite the presence of Yularen's special squad and many civilians, Pryce used Gudry's stolen remote to detonate Nightswan's cache of explosives. While this ended the threat of Nightswan's insurgents, many civilians were killed. In space, Thrawn successfully used the four light cruisers as a bait to lure the insurgent fleet into a trap.\nFollowing the breaking of the Creekpath siege, Yularen expressed outrage at the high civilian death toll and likened the incident to the Clone Wars. While official reports theorized that Gudry had detonated the explosives to prevent his capture, Yularen blamed Pryce indirectly for the bombing; unaware that she was directly responsible of the incident. Yularen's forces also found and identified Nightswan's corpse. Yularen and Vanto then departed so that Pryce could talk with Thrawn in private. Pryce convinced Thrawn to take responsibility for the suppression of the Batonn insurgency in return for securing the command of the Seventh Fleet. Thrawn reluctantly obliged and was promoted to the rank of Grand Admiral by the Emperor.\nMuch later, Yularen was invited by Thrawn to help identify a rebel spy who operated under the codename Fulcrum. As part of the screening process, Yularen questioned several Imperial officers on the Sector Command staff in the Lothal sector aboard Thrawn's flagship Chimaera including Captain Brunson, Commander Brom Titus, Lieutenant Yogar Lyste, and his former student Agent Kallus. Lyste and Kallus boarded Thrawn's Imperial Star Destroyer with a captured bounty hunter, who turned out to be the rebel Ezra Bridger.\nDuring a meeting with Kallus and Lyste, Yularen urged his comrades to remain vigilant for any sign of rebel activity. Thrawn also informed the attendees that he was close to locating the Phoenix Cell's Chopper Base on the planet Atollon. After exiting the meeting, Yularen chatted with Kallus about the identity of Fulcrum. Kallus claimed that the rebel spy was definitely an officer since it was a high level intelligence leak and suggested someone in the Communications Division. However, Yularen believed that was too obvious and suspected that Fulcrum had their own communication system. Kallus also promised to help his former mentor. During a private meeting with Thrawn and Pryce, Thrawn voiced his suspicion that the spy had attended their interviews. When Colonel Yularen reported that a coded message had been beamed off the Chimaera following the arrival of Lyste and Kallus' prisoner. Yularen then accompanied Thrawn and Pryce to interrogate the prisoner.\nUpon arriving in the Chimaera's detention block, Yularen and his comrades discovered that the prisoner had been freed. After Yularen found that the records had indicated that someone using Yogar Lyste's code cylinder was the last person to enter the brig, Yularen came to suspect that Lyste was Fulcrum. After Thrawn narrowly survived an assassination attempt in his office, Yularen was contacted by the Grand Admiral who told him to head towards the hangar with stormtrooper reinforcements. Yularen arrived too late to apprehend the rebels but accepted Kallus' account that Lyste was the rebel spy Fulcrum. Despite Lyste's protests, Yularen ordered his stormtroopers to lead the Lieutenant away.\nIn public, Yularen regarded Lyste's code cylinder as proof of the officer's guilt. After Kallus and Pryce had exited Thrawn's office, Yularen privately confided his doubts about Lyste's guilt to the Grand Admiral. Thrawn agreed and then presented Yularen with Ezra's helmet, which was inscribed with an image of a loth-cat. When Yularen asked Thrawn why Kallus had withheld Ezra's identity, Thrawn concluded that Kallus was indeed Fulcrum and had framed Lyste to cover his tracks. Yularen expressed shock that one of his former pupils was a traitor, which prompted Thrawn to remark that Yularen had allowed his fondness for his former pupil to deceive him. With Fulcrum \"officially\" captured, Thrawn decided to allow Kallus to continue operating in order to lure the rebels out of hiding.\nDuring the Liberation of Lothal, the former Lothalian Governor Ryder Azadi imitated Colonel Yularen's voice in order to force a skeptical Imperial office to comply with a faux Protocol 13 order. Due to Yularen's prestige within the Empire, this ploy worked. As a result, the entire Imperial garrison on Lothal was trapped aboard the Dome, a mobile Imperial Planetary Occupation Facility. The destruction of the garrison and the disappearance of Thrawn and his Seventh Fleet ended Imperial rule on Lothal.\nColonel Yularen was present for a meeting of high ranking Imperial personnel aboard the first Death Star battle station, which concerned the security of the station in view of the recent theft of its technical readout by agents of the Alliance to Restore the Republic in the year 0 BBY. He remained quiet throughout the meeting, even when Grand Moff Tarkin announced that the Emperor had dissolved the Imperial Senate.\nAlong with another intelligence officer, he later passed by makeshift rebels Han Solo, Luke Skywalker, and Chewbacca, the former two disguised as stormtroopers in an attempt to rescue the imprisoned Princess Leia Organa of Alderaan. Yularen remained onboard the battle station during the Battle of Yavin, where he perished along with thousands of other Imperials when it was destroyed.\nNot long after the Battle of Yavin, Senior Lieutenant Iden Versio and Lieutenant Junior Grade Gideon Hask reflected on the Death Star's destruction, with Versio noting that Yularen was one of the Empire's top personnel lost when the station was destroyed, feeling that it would have been better had Yularen survived instead of a TIE fighter pilot.\nWhile searching the Hall of Imperial Register on Coruscant in 5 ABY, after discovering that the Emperor's personal Super Star Destroyer Eclipse had disappeared, Grand Admiral Rae Sloane found an image crystal showing a still image of Palpatine and several Imperial personnel, including Yularen.\nEven by the outbreak of the Clone Wars, Wullf Yularen was regarded by his peers as a crisp, efficient veteran naval officer. Despite his disagreements with the brash and reckless General Skywalker, he held a sacred respect for the chain of command, a trait which made him assist his Jedi General in any way he could.\nColonel Yularen respected the Chiss Imperial Navy officer Thrawn's creativity and ingenious tactics enough to consider him worthy of joining the Imperial Security Bureau. Knowing that Thrawn was an outsider in a xenophobic Imperial Military, Yularen went out of his way to cultivate civilian allies for the alien officer. Still, Yularen was disturbed by Thrawn's unorthodox tactics and willingness to negotiate with the enemy. While Yularen recognized that Thrawn cared about avoiding excessive civilian casualties, he warned Thrawn that his attempt to negotiate with Nightswan could be misconstrued as treason. As a member of the ISB, Yularen actively led Imperial counterinsurgency efforts against undercover insurgents. As a veteran of the Clone Wars, Yularen was horrified by the high civilian death toll during the siege of Creekpath mine, which brought back dark memories of that conflict.\nYularen took pride in the achievements of one of his former pupils Agent Kallus, a promising Imperial Security Bureau Agent. Yularen's investigative skills led Thrawn to enlist his help in exposing the rebel spy Fulcrum. Yularen's trust and respect in Kallus led him to overlook the ISB agent as a suspect. Kallus manipulated Yularen's trust by fabricating evidence which implicated another officer Lieutenant Yogar Lyste. While Yularen privately doubted that Lyste was Fulcrum, he was initially convinced by the presence of Lyste's cylinder code. Yularen was shocked that Kallus could become a traitor to the Empire.\nWullf Yularen first appeared as an unnamed background character in Star Wars: Episode IV A New Hope, whom the fan website Aveleyman claims as being portrayed by Robert Carrick, though Ann Skinner's continuity notes identify him as an imperial officer being portrayed by Robin Clarke, and he was given the name Wullf Yularen by the Star Wars Legends card game Star Wars Customizable Card Game.\nYularen would later be adopted by the 2008 Star Wars: The Clone Wars film as a recurring character. In that film, the subsequent television series of the same name, and the Star Wars Rebels television series, he was voiced by Tom Kane. The character returned to live action for the first time in 45 years in the Andor  portrayed by Malcolm Sinclair.\nIn their commentary, the creators of The Clone Wars film describe how they were under the assumption that Yularen had been a Grand Admiral during the time of Episode IV, given his white uniform. As such, they opted to portray Yularen as an admiral, as a means of showing him in the process of rising through the ranks.\nIn the StarWars.com Encyclopedia and the Databank, Yularen's first name was spelled \"Wulff\", rather than \"Wullf\", as spelled in the Star Wars Customizable Card Game, thus making the new spelling part of the Star Wars canon. However, Tarkin and Ultimate Star Wars , a sourcebook published by Dorling Kindersley, use the original Star Wars Legends spelling of his name. This issue was later remedied, with Yularen's Databank page being updated with the \"Wullf\" spelling. In the end credits of several first The Clone Wars episodes, his last name was misspelled as \"Yularan\".\nTimothy Zahn, author of the Thrawn trilogy in Star Wars Legends, stated that he would like to write a novel featuring Yularen, as he is his favorite background Star Wars character. This was later realized in the novel Thrawn, which was released on April 11, 2017 and featured Yularen working with the titular character during his rise.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wullf_Yularen",
  "/wiki/Wullf_Yularen/Legends",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Andor_(television_series)",
  "/wiki/Age_of_Republic_-_Anakin_Skywalker_1",
  "/wiki/Nobody%27s_Listening!",
  "/wiki/Thrawn:_Treason",
  "/wiki/Obi-Wan_3",
  "/wiki/Obi-Wan_4",
  "/wiki/Dawn_of_Rebellion",
  "/wiki/Deal_No_Deal",
  "/wiki/Old_Friends_Not_Forgotten",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Wullf_Yularen",
  "/wiki/Coruscant",
  "/wiki/0_BBY",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Coruscanti",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Senate_Bureau_of_Intelligence",
  "/wiki/Galactic_Republic_Navy",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Imperial_Academy",
  "/wiki/Naval_Intelligence_Agency",
  "/wiki/Imperial_Officer_Corps",
  "/wiki/Officer",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Battle_of_Malastare_Narrows",
  "/wiki/Admiral",
  "/wiki/Clone_Wars",
  "/wiki/Fleet_Admiral",
  "/wiki/Jedi_General",
  "/wiki/Anakin_Skywalker",
  "/wiki/Jedi",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Battle_of_Christophsis",
  "/wiki/Battle_of_the_Kaliida_Nebula",
  "/wiki/Second_Battle_of_Geonosis",
  "/wiki/Battle_of_Sullust",
  "/wiki/Flagship",
  "/wiki/Resolute",
  "/wiki/20_BBY",
  "/wiki/Republic_officer",
  "/wiki/Colonel",
  "/wiki/Imperial_Senate",
  "/wiki/Berch_Teller_campaign",
  "/wiki/Deputy_Director",
  "/wiki/Chiss",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Imperial_Navy",
  "/wiki/Nevil_Cygni",
  "/wiki/Grand_Admiral",
  "/wiki/Fulcrum",
  "/wiki/Agent",
  "/wiki/Alexsandr_Kallus",
  "/wiki/Battle_of_Scarif",
  "/wiki/Imperial_officer",
  "/wiki/Battle_station",
  "/wiki/Death",
  "/wiki/Battle_of_Yavin",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Fleet",
  "/wiki/Corporate_Alliance",
  "/wiki/Malastare",
  "/wiki/Harch",
  "/wiki/Trench",
  "/wiki/File:OfAllTheJedi-CoD.ogg",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/22_BBY",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/Supreme_Chancellor",
  "/wiki/Darth_Sidious",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_Knight",
  "/wiki/Venator-class_Star_Destroyer",
  "/wiki/Starship",
  "/wiki/Battle_of_Teth",
  "/wiki/General",
  "/wiki/Skywalker%27s_fleet",
  "/wiki/Christophsis",
  "/wiki/Senator",
  "/wiki/Bail_Prestor_Organa",
  "/wiki/Providence-class_Dreadnought",
  "/wiki/Invincible",
  "/wiki/Leesis",
  "/wiki/Jedi_Master",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Negotiator",
  "/wiki/IPV-2C_Stealth_Corvette",
  "/wiki/Cloaking_device",
  "/wiki/Hyena-class_Droid_Fighter/Bomber",
  "/wiki/Orbit",
  "/wiki/Deflector_shield_generator",
  "/wiki/Whorm_Loathsom",
  "/wiki/Yoda",
  "/wiki/Clone_trooper",
  "/wiki/Captain",
  "/wiki/Rex",
  "/wiki/Torrent_Company",
  "/wiki/Teth",
  "/wiki/B%27omarr_Order_Monastery",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Hutt",
  "/wiki/Rotta",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I",
  "/wiki/Hutt_Clan",
  "/wiki/Battle_of_Hypori",
  "/wiki/Hypori",
  "/wiki/Commander",
  "/wiki/CC-2224",
  "/wiki/212th_Attack_Battalion",
  "/wiki/Mekedrix",
  "/wiki/Mekedrix%27s_company",
  "/wiki/Roon",
  "/wiki/Battle_of_Abrion_Bridge",
  "/wiki/Abrion_Major",
  "/wiki/Grievous",
  "/wiki/Subjugator-class_heavy_cruiser",
  "/wiki/Malevolence",
  "/wiki/Kaliida_Shoals_Medical_Center",
  "/wiki/Clone_trooper_pilot",
  "/wiki/Shadow_Squadron",
  "/wiki/BTL-B_Y-wing_starfighter/bomber",
  "/wiki/Ion_cannon",
  "/wiki/Hyperdrive",
  "/wiki/Moon",
  "/wiki/Rishi",
  "/wiki/Rishi_Station",
  "/wiki/Defense_of_Rishi_Station",
  "/wiki/Battle_of_Kamino",
  "/wiki/Kamino",
  "/wiki/Homeworld",
  "/wiki/Kamino_blockade",
  "/wiki/Battle_of_Quell",
  "/wiki/Aayla_Secura",
  "/wiki/Hyperspace",
  "/wiki/Battle_of_Ryloth",
  "/wiki/Ryloth",
  "/wiki/Neimoidian",
  "/wiki/Mar_Tuuk",
  "/wiki/Lucrehulk-class_Battleship",
  "/wiki/Blue_Squadron_(Galactic_Republic)",
  "/wiki/Redeemer",
  "/wiki/Defender",
  "/wiki/Marg_Sabl",
  "/wiki/Consular-class_cruiser_(Charger_c70_retrofit)",
  "/wiki/Arquitens-class_light_cruiser",
  "/wiki/Battle_of_Saleucami",
  "/wiki/Eeth_Koth",
  "/wiki/Devaron_massacre",
  "/wiki/Death_Wind_(group)",
  "/wiki/Mission_to_Ando_(Mekedrix)",
  "/wiki/Ando",
  "/wiki/19_BBY",
  "/wiki/Republic_strategy_conference",
  "/wiki/Space_station",
  "/wiki/Valor_(space_station)",
  "/wiki/Carida",
  "/wiki/Carida_incident",
  "/wiki/Funeral_of_the_Jedi_Temple_bombing_victims",
  "/wiki/Imperial_Palace",
  "/wiki/Bombing_of_the_Jedi_Temple_hangar",
  "/wiki/Wilhuff_Tarkin",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Barriss_Offee",
  "/wiki/Battle_of_Ringo_Vinda",
  "/wiki/Nu-class_transport",
  "/wiki/CT-5385",
  "/wiki/Silver_Angel",
  "/wiki/Trace_Martez",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Quinlan_Vos",
  "/wiki/Taris",
  "/wiki/Jedi_High_Council",
  "/wiki/Sith_apprentice",
  "/wiki/Asajj_Ventress",
  "/wiki/Rescue_of_Quinlan_Vos",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sith",
  "/wiki/Galactic_Emperor",
  "/wiki/Imperial_Military",
  "/wiki/Corporate_Sector",
  "/wiki/Corporate_Sector_Authority",
  "/wiki/Star_system",
  "/wiki/Campaign_in_the_Corporate_Sector",
  "/wiki/Pirate",
  "/wiki/New_Order",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order",
  "/wiki/Treason",
  "/wiki/14_BBY",
  "/wiki/Standard_year",
  "/wiki/Imperial_Era",
  "/wiki/Gallius_Rax",
  "/wiki/Vice_Admiral",
  "/wiki/Dodd_Rancit",
  "/wiki/Terrinald_Screed",
  "/wiki/Harus_Ison",
  "/wiki/Moff",
  "/wiki/Attack_on_Sentinel_Base",
  "/wiki/Sentinel_Base",
  "/wiki/Joint_Chiefs",
  "/wiki/Imperial_Intelligence",
  "/wiki/5_BBY",
  "/wiki/Mission_on_Aldhani",
  "/wiki/Aldhani_Garrison",
  "/wiki/Aldhani",
  "/wiki/ISB_board",
  "/wiki/Supervisor",
  "/wiki/ISB_Central_Office",
  "/wiki/Public_Order_Resentencing_Directive",
  "/wiki/Dedra_Meero",
  "/wiki/ISB_Attendant",
  "/wiki/Heert",
  "/wiki/Major",
  "/wiki/Partagaz",
  "/wiki/Morlani_system",
  "/wiki/Ambush_on_Ferrix",
  "/wiki/Ferrix",
  "/wiki/Blevin",
  "/wiki/Imperial_N-S9_Starpath_Unit",
  "/wiki/Steergard",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/Spectres",
  "/wiki/Dromedar_hijacking",
  "/wiki/Lothal",
  "/wiki/Domus_Renking",
  "/wiki/Senior_Lieutenant",
  "/wiki/Ensign",
  "/wiki/Eli_N._Vanto",
  "/wiki/Ascension_Week",
  "/wiki/Alisandre_Hotel",
  "/wiki/Arihnda_Pryce",
  "/wiki/Tibanna",
  "/wiki/High_Command",
  "/wiki/Nightswan%27s_campaign",
  "/wiki/Alfren_Cheno",
  "/wiki/Battle_over_Umbara",
  "/wiki/Circle_Bay_mayor%27s_office_protest",
  "/wiki/Roenton",
  "/wiki/Brook",
  "/wiki/Yinchom_Dojo",
  "/wiki/Togorian",
  "/wiki/H%27sishi",
  "/wiki/Hotel",
  "/wiki/Higher_Skies_Advocacy_Group",
  "/wiki/Juahir_Madras",
  "/wiki/Driller_MarDapp",
  "/wiki/Imperial_espionage_operation",
  "/wiki/Ghadi",
  "/wiki/Grand_Moff",
  "/wiki/Governor",
  "/wiki/Lieutenant_Commander",
  "/wiki/Kaniki",
  "/wiki/Evidorn",
  "/wiki/Jok_Donassius",
  "/wiki/Batonn_insurgency",
  "/wiki/Scrim_Island_Imperial_garrison",
  "/wiki/Scrim_Island",
  "/wiki/Cathtron_tube",
  "/wiki/Ninety-Sixth_Task_Force",
  "/wiki/Creekpath_Mining_and_Refining_complex",
  "/wiki/Siege_of_the_Creekpath_Mining_and_Refining_complex",
  "/wiki/Talmoor_Pryce",
  "/wiki/Elainye_Pryce",
  "/wiki/Gudry",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Chimaera",
  "/wiki/Arquitens-class_command_cruiser",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Unknown_Regions",
  "/wiki/Restos",
  "/wiki/Airspeeder",
  "/wiki/Talmege",
  "/wiki/7th_Fleet",
  "/wiki/Spy",
  "/wiki/Sector_Command_(Galactic_Empire)",
  "/wiki/Lothal_sector",
  "/wiki/Brunson",
  "/wiki/Brom_Titus",
  "/wiki/Lieutenant",
  "/wiki/Yogar_Lyste",
  "/wiki/Bounty_hunter",
  "/wiki/Ezra_Bridger",
  "/wiki/Phoenix_Cell",
  "/wiki/Chopper_Base",
  "/wiki/Atollon",
  "/wiki/Communications_Division",
  "/wiki/Detention_Block_B7",
  "/wiki/Code_cylinder",
  "/wiki/Thrawn%27s_Office",
  "/wiki/Hangar",
  "/wiki/Stormtrooper",
  "/wiki/Loth-cat",
  "/wiki/Liberation_of_Lothal",
  "/wiki/Ryder_Azadi",
  "/wiki/Protocol_13",
  "/wiki/Imperial_Complex_(Lothal)",
  "/wiki/Imperial_Planetary_Occupation_Facility",
  "/wiki/Death_Star_plans",
  "/wiki/Rogue_One",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Dissolution_of_the_Imperial_Senate",
  "/wiki/Han_Solo",
  "/wiki/Luke_Skywalker",
  "/wiki/Chewbacca",
  "/wiki/Rescue_of_Princess_Leia",
  "/wiki/Prince",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Alderaan",
  "/wiki/Yavin_Prime",
  "/wiki/Iden_Versio",
  "/wiki/Junior_Lieutenant",
  "/wiki/Gideon_Hask",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Hall_of_Imperial_Register",
  "/wiki/5_ABY",
  "/wiki/Super_Star_Destroyer",
  "/wiki/Eclipse_(Executor-class)",
  "/wiki/Rae_Sloane",
  "/wiki/Image_crystal",
  "/wiki/Xenophobia",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Ann_Skinner",
  "/wiki/Robin_Clarke",
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/2008",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_Rebels",
  "/wiki/Tom_Kane",
  "/wiki/Malcolm_Sinclair",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/2015",
  "/wiki/Dorling_Kindersley",
  "/wiki/Databank_(website)",
  "/wiki/Thrawn_trilogy",
  "/wiki/April_11",
  "/wiki/Cat_and_Mouse",
  "/wiki/Rising_Malevolence",
  "/wiki/Shadow_of_Malevolence",
  "/wiki/Destroy_Malevolence",
  "/wiki/Rookies",
  "/wiki/Downfall_of_a_Droid",
  "/wiki/Scenes_cut_from_Star_Wars",
  "/wiki/Jedi_Crash",
  "/wiki/Storm_Over_Ryloth",
  "/wiki/Innocents_of_Ryloth",
  "/wiki/Liberty_on_Ryloth",
  "/wiki/Cargo_of_Doom",
  "/wiki/Children_of_the_Force",
  "/wiki/Landing_at_Point_Rain",
  "/wiki/Grievous_Intrigue",
  "/wiki/ARC_Troopers",
  "/wiki/Nightsisters_(episode)",
  "/wiki/Kidnapped",
  "/wiki/Point_of_No_Return",
  "/wiki/The_Jedi_Who_Knew_Too_Much",
  "/wiki/The_Wrong_Jedi",
  "/wiki/The_Unknown",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/Tarkin_(novel)",
  "/wiki/Tarkin_(audiobook)",
  "/wiki/Thrawn_(novel)",
  "/wiki/Thrawn_(audiobook)",
  "/wiki/Thrawn_3",
  "/wiki/Thrawn_4",
  "/wiki/Thrawn_5",
  "/wiki/Thrawn_6",
  "/wiki/Announcement",
  "/wiki/Narkina_5_(episode)",
  "/wiki/Through_Imperial_Eyes",
  "/wiki/Thrawn:_Treason_(audiobook)",
  "/wiki/Family_Reunion_%E2%80%93_and_Farewell",
  "/wiki/Star_Wars:_Heroes_Path",
  "/wiki/Star_Wars_in_Pictures:_The_Original_Trilogy",
  "/wiki/Star_Wars_Treasury:_The_Original_Trilogy",
  "/wiki/An_Incident_Report",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Battlefront_II:_Inferno_Squad",
  "/wiki/Battlefront_II:_Inferno_Squad_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Category:Audio_files_of_Wullf_Yularen",
  "/wiki/Category:Images_of_Wullf_Yularen",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Rebels:_Visual_Guide:_Epic_Battles",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_93",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Helmet_Collection_66",
  "/wiki/Star_Wars_Helmet_Collection_70",
  "/wiki/Star_Wars_Helmet_Collection_73",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_23",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars:_Armada",
  "/wiki/Upgrade_Card_Collection",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Inside_Intel:_The_Death_Star",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_94",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars_Insider",
  "/wiki/A_Certain_Point_of_View_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Nightsisters",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_18",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Kassa_(episode)",
  "/wiki/Battle_of_Endor",
  "/wiki/4_ABY",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/November_5",
  "/wiki/2018"
 ]
}