{
 "name": "Wyl_Lark",
 "display_name": "Wyl Lark",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Polyneus"
     ]
    },
    {
     "name": "Born",
     "values": [
      "15 BBY",
      "Polyneus"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Olive"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Hundred and Twenty",
      "Riot Squadron",
      "Hundred and Twenty",
      "Riot Squadron",
      "New Republic",
      "Riot Squadron",
      "Alphabet Squadron",
      "Wyl Lark's squadron",
      "Deliverance''s starfighter wing",
      "Galactic Senate",
      "Riot Squadron",
      "Alphabet Squadron",
      "Wyl Lark's squadron",
      "Deliverance''s starfighter wing",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Wyl Lark was a human male A-wing starfighter pilot, who during the final months of the Galactic Civil War, served in the New Republic as a member of Alphabet Squadron and later promoted to the rank of wing commander of the Deliverance's starfighter wing.\nWyl Lark was born and raised on the planet Polyneus. During the Galactic Civil War, the Galactic Empire built a weapons platform in the atmosphere of Polyneus, and eventually he became one of the Hundred and Twenty Polynean volunteers that left Polyneus to join the Alliance to Restore the Republic to fight the Empire. Lark joined the Alliance Military as a member of Riot Squadron, flying a RZ-1 A-wing interceptor. During his time on Polyneus, Lark gained a gift for piloting by riding on sur-avka, flying creatures. During his flight training, he befriended his mentor.\nAfter the Battle of Endor, Riot Squadron was assigned to the frigate Hellion's Dare on a scouting mission. They were hounded by the Aerie and elements of the Shadow Wing, which chased the Hellion's Dare into the Oridol Cluster. Lark and the pilots of Riot Squadron and the A/SF-01 B-wing starfighters of Hound Squadron defended the ship, but gradually had their ranks depleted. As the New Republic forces attempted to jump to hyperspace to flee a confrontation, Lark was surrounded by TIE Fighters, just like his many comrades has been killed. However, Lark managed to escape. After jumping to hyperspace, he noticed his cracked canopy and realized his ship was leaking oxygen.\nLark emerged from hyperspace and lost control of his vessel. Hound pilot Chass na Chadic spotted him and fired power disrupting ion blasts at his ship so he could be effectively brought onboard the Hellion's Dare using a tractor beam. Lark was very grateful for the rescue and was prepared to serve a Life debt if it was the belief of Chadic's people.\nLark returned to he new Riot Squadron, which was formed from the survivors of the two squadrons, with Rununja remaining in command. Eventually, Captain Kreskian of the Hellion's Dare tasked the squadron with taking out the pursuing Quasar Fire-class cruiser-carrier. Lark flew as part of the attack that disabled the enemy cruiser-carrier, but the squadron returned to find the Hellion's Dare was also heavily damaged. The remaining pilots guarded the ship while technicians scrambled to make repairs.\nAs the pilots told stories to pass the time, Lark started an open channel in hopes of communicating with their pursuers. Despite being ridiculed by his fellow pilots, TIE pilot \"Blink\" answered and told him about the mythology surrounding the Oridol Cluster.\nHours later, the 204th attacked, leading to the destruction of the vessel, Riot Squadron, and Hound Squadron. When Lark found himself as one of the only survivors, he instructed Chadic to retreat, and when Chadic decided not to, Lark fired on her weaponry and disabled it to convince her to save her life. Chadic was furious at Lark, but the two jumped to hyperspace and were eventually rescued by Agent Caern Adan's working group. The pair of pilots melded into Alphabet Squadron under Adan, Lieutenant Yrica Quell, and Kairos and Nath Tensent.\nDuring one of Alphabet Squadron's first practice maneuvers in the Gobreton minefield, Lark's ship was heavily damaged when the squadron accidentally triggered one of the mines. When the squadron was demoted to practicing in the flight simulators, Lark was bothered when Quell loaded up a simulation of the Battle of Endor, which brought back many memories of his old squadron. Later, he discussed it with Tensent at Ranjiy's Krayt Hut. Lark took to Tensent quickly and the two became friendly. When the squadron took a mission to recover intel from the planet Abednedo, Lark and Tensent remained in orbit while the others made contact with a smuggler. When the group attempted to leave with a group of Imperial prisoners, they were attacked by a group of TIE/sa bombers, which destroyed the freighter carrying the prisoners.\nEventually, the squadron received a new mission, this time being sent to a moon of the planet Harkrova for a salvage mission. When they made camp on their first night, Lark told his squadron stories of home, including how he left Polyneus and joined the Alliance, and explained that he was about to return to his homeworld before his squadron was destroyed by Shadow Wing.\nThe Lodestar's forces were then deployed to the Campaign in the Cerberon system. The fighting stretched on for weeks. During that time he developed a flirtation with the Rodian pilot Neihero of Meteor Squadron. At one point on during the struggle on Troithe, he and Kairos provided air support for Twilight Company, and then Lark and Tensent took out an All Terrain Armored Cargo Transport. The squadron continued to fight while the Governer's forces fell back and the squadron developed a trap for Shadow Wing.\nLater, when Shadow Wing arrived and managed to circumvent the trap, Lark was contacted by \"Blink\", who guided him to return to Troithe with Tensent. They then became trapped on the planet with Twilight Company. Lark agreed to take command of the remaining starfighters and airships, forming a new squadron. He led the forces to Core Nine mining megafacility in order to secure a new base, at the same time as Shadow Wing. They became heavily engaged, and were about to be overwhelmed when New Republic reinforcements arrived in the form of the Temperance and Vanguard Squadron. They chased Shadow Wing's bulk freighter, and when it launched heavy ordnance, Lark ordered them to shoot them. The Republic forces were able to recapture the planet. A few days later, Lark went to the victory party, before planning on writing back home.\nFollowing the destruction of the Lodestar, Syndulla received a new flagship, a refitted Star Destroyer Deliverance, which became the new headquarters for her starfighters. Lark was promoted to the rank of wing commander in charge of the Deliverance's starfighter wing. The wing consisted of Hail Squadron as well as two new ones, Flare Squadron and Wild Squadron, the last one formed from the remaining pilots of his makeshift squadron on Troithe and would continue to serve as a squadron for misfit pilots and starfighters.\nAfter following Shadow Wing through a couple of skirmishes, Lark led his squadron in the battle to save the Imperial-controlled planet of Chadawa from the second Operation: Cinder orchestrated by the 204th Fighter Wing. He successfully goaded Colonel Soran Keize into fighting him one on one, allowing his bomber squadron under the command of Nath Tensent to attack the Yadeez enough to force them to abandon their attack and saving the planet.\nHearing that he was the last of the Hundred and Twenty not to return to his homeworld, Lark decided to stop fighting and tried and failed to convince the rest of his squadron not to participate at the battle of Jakku. However, he stayed on the Deliverance and helped out during the battle, partially foiling a sabotage attempt by Shadow Wing's Palal Seedia who had snuck onboard. While not saving the ship, his actions allowed an evacuation, including himself. He crashed on Jakku and was found by Nath Tensent together with another TIE pilot.\nLark returned to Polyneus where he ended up as a senator for his homeworld. In 10 ABY, he met with Yrica Quell and Chass na Chadic, who had retired together as partners of a small shipping company.\nLark was also known for his kindness and empathy. He also talked to his starfighter, which fellow Riot Squadron pilot Sata Neek would make fun of him for. Lark was a natural flyer, and his commanding officer Yrica Quell noted that he maneuvered with grace that she had never seen before. He frequently recorded holomessages for back Home. During the attack on Troithe, he deleted one message, unable to send it amongst his conflicted thoughts of the war.\nWyl Lark first appeared in the 2019 novel Alphabet Squadron, written by Alexander Freed. He was first revealed by Del Rey on Twitter when they released photos of the Alphabet Squadron roster.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wyl",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Polyneus",
  "/wiki/15_BBY",
  "/wiki/Human",
  "/wiki/Polynean",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Hundred_and_Twenty",
  "/wiki/Riot_Squadron",
  "/wiki/New_Republic",
  "/wiki/Alphabet_Squadron",
  "/wiki/Wyl_Lark%27s_squadron",
  "/wiki/Deliverance%27s_starfighter_wing",
  "/wiki/New_Republic_Senate",
  "/wiki/Sata_Neek",
  "/wiki/A-wing_starfighter",
  "/wiki/Pilot",
  "/wiki/Standard_month",
  "/wiki/Galactic_Civil_War",
  "/wiki/Wing_Commander",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Galactic_Empire",
  "/wiki/Alliance_Military",
  "/wiki/RZ-1_A-wing_interceptor",
  "/wiki/Sur-avka",
  "/wiki/Species",
  "/wiki/Battle_of_Endor",
  "/wiki/Frigate",
  "/wiki/Hellion%27s_Dare",
  "/wiki/Aerie",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Oridol_Cluster",
  "/wiki/A/SF-01_B-wing_starfighter",
  "/wiki/Hound_Squadron",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Chass_na_Chadic",
  "/wiki/Tractor_beam",
  "/wiki/Life_debt",
  "/wiki/Rununja",
  "/wiki/Captain",
  "/wiki/Kreskian",
  "/wiki/Palal_Seedia",
  "/wiki/Agent",
  "/wiki/Caern_Adan",
  "/wiki/Lieutenant",
  "/wiki/Yrica_Quell",
  "/wiki/Kairos",
  "/wiki/Nath_Tensent",
  "/wiki/Gobreton_minefield",
  "/wiki/Flight_simulator",
  "/wiki/Ranjiy%27s_Krayt_Hut",
  "/wiki/Mission_to_Abednedo",
  "/wiki/Abednedo_(planet)",
  "/wiki/TIE/sa_bomber",
  "/wiki/Unidentified_moon_(Harkrova_I)",
  "/wiki/Harkrova",
  "/wiki/Campaign_in_the_Cerberon_system",
  "/wiki/Rodian",
  "/wiki/Neihero",
  "/wiki/Meteor_Squadron",
  "/wiki/Troithe_operation",
  "/wiki/Troithe",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/All_Terrain_Armored_Cargo_Transport",
  "/wiki/Core_Nine_mining_megafacility",
  "/wiki/Temperance",
  "/wiki/Vanguard_Squadron",
  "/wiki/Yadeez",
  "/wiki/Star_Destroyer",
  "/wiki/Deliverance",
  "/wiki/Hail_Squadron",
  "/wiki/Flare_Squadron",
  "/wiki/Wild_Squadron",
  "/wiki/Chadawa",
  "/wiki/Operation:_Cinder",
  "/wiki/Soran_Keize",
  "/wiki/Battle_of_Jakku",
  "/wiki/Jakku",
  "/wiki/Starfighter",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Del_Rey",
  "/wiki/Category:Images_of_Wyl_Lark",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Standard_year",
  "/wiki/4_ABY",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}