{
 "name": "Wyrpuuk_Cha",
 "display_name": "Wyrpuuk Cha",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Koros-Strohna"
     ]
    },
    {
     "name": "Died",
     "values": [
      "27 ABY",
      "Pyria system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yuuzhan Vong"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Yuuzhan Vong empire",
      "Warrior caste",
      "Domain Cha",
      "Warrior caste",
      "Domain Cha"
     ]
    }
   ]
  }
 ],
 "content": "Wyrpuuk Cha was a member of the warrior caste of the Yuuzhan Vong, who held the rank of commander during his species' invasion of the galaxy. During the Yuuzhan Vong War, when elements of the New Republic Defense Force retook Borleias from the Yuuzhan Vong, Cha was chosen by Warmaster Tsavong Lah to assault the planet with his fleet and drive the New Republic from the Pyria system.\nUpon its arrival in the system, Cha's fleet entered into an engagement with the New Republic forces, and planned to set up a staging point on the planet of Pyria VI before attacking Borleias itself. Before Cha could begin to withdraw, however, the Executor-class Star Dreadnought Lusankya arrived in the midst of his fleet, and the commander was killed when the colossal warship opened fire on his matalok cruiser.\nA Yuuzhan Vong commander from a Koros-Strohna, Wyrpuuk Cha led a sizeable fleet during the Yuuzhan Vong War, which he directed from his flagship, a matalok cruiser. Following the capture of the planet Coruscant at the hands of Warmaster Tsavong Lah, the New Republic defenders of the galaxy were routed and set up a defense on the world of Borleias, forcing Domain Kraal, the Yuuzhan Vong domain that had been guarding over the planet, into hiding.\nAs domains Kraal and Cha were rivals, Warmaster Lah dispatched Wyrpuuk Cha to Borleias at the head of his fleet in 27 ABY in order to retake the planet and humiliate the Kraal for having lost territory to the New Republic. Cha, although a relatively experienced warrior, was eager to demonstrate his worth to the warmaster, and thus he entered the Pyria system intending a quick victory.\nHe was taken off guard by the fact that Borleias seemed to lack adequate defenses. Present in Cha's fleet were two yammosks, creatures used by the Yuuzhan Vong empire to coordinate forces and provide information on the enemy, but due to the Pyria system possessing a large number of gravity wells, the gravitic signals used by the yammosks to communicate with the commander were nullified, and thus Cha was unable to attain sufficient data on the New Republic forces.\nForced instead to rely solely on blaze bugs, insectoid creatures that created a visual representation of the immediate battleground, Cha was limited in what he could perceive. The commander became intrigued by the fact that the visible New Republic starships present had congregated over a single point on Borleias's surface, and seemed to have an interest in the moon of Pyria VI, in the form of a small outpost. Cha assumed that Borleias and its moon were the focus of a secret New Republic interest; thus his first action was to send forth probing yorik-et squadrons to reconnoiter the system.\nCha's intention was to leave his command vessel open for attack, luring the New Republic forces in before wiping them out with clinical efficiency. While he waited for this to occur, he sent a force of yorik-et to attack the installation on Pyria 6, and a frigate with its fighters to probe Borleias' defenses. Although Cha's forces overran the outpost on the outer planet, they experienced losses at Borleias itself. The commander decided to concentrate on Pyria VI and use it as a staging area, breaking off the failing assault on Borleias. His tactical musings, however, were interrupted by the arrival of a New Republic Executor-class Star Dreadnought, the Lusankya, which reverted from hyperspace in the midst of his fleet.\nThe mighty warship overwhelmed Cha's cruiser instantly, devastating the vessel with a crippling turbolaser and ion cannon barrage. Cha was in the process of giving the order to retreat when the bridge of the matalok was hit. A huge breach opened in the hull, and he was sucked out to his death in the vacuum of space. In his absence, the rest of his fleet descended upon the Lusankya, only to be destroyed and routed by the combined forces of the Star Dreadnought and the New Republic battle groups that had been hidden throughout the system.\nWyrpuuk Cha was keen to prove himself in the eyes of his superiors, as such he was cautious and unwilling to commit his forces to a battle that he might lose. A capable tactician, Cha comported himself as such; he did not show any doubts in front of his subordinates. Although the arrival of the Lusankya was entirely beyond his control, Cha was by no means a master strategist, as he was lured in by the apparent significance of Pyria 6 and of the congregation of ships in orbit over Borleias, both of which were decoys created by the New Republic commander, Wedge Antilles.\nWyrpuuk Cha first appeared in the 2002 novel The New Jedi Order: Enemy Lines I: Rebel Dream, which was written by Aaron Allston.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Koros-Strohna",
  "/wiki/27_ABY/Legends",
  "/wiki/Pyria_system",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Gender/Legends",
  "/wiki/Yuuzhan_Vong_empire",
  "/wiki/Warrior_caste",
  "/wiki/Domain_Cha",
  "/wiki/Military_rank/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Species/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/The_galaxy/Legends",
  "/wiki/Fleet_Group_Three",
  "/wiki/Combined_Defense_Forces_of_the_New_Republic",
  "/wiki/Battle_of_Borleias_(Yuuzhan_Vong_War;_Second)",
  "/wiki/Borleias/Legends",
  "/wiki/Warmaster",
  "/wiki/Tsavong_Lah",
  "/wiki/Planet/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Pyria_VI",
  "/wiki/Executor-class_Star_Dreadnought/Legends",
  "/wiki/Lusankya/Legends",
  "/wiki/Death/Legends",
  "/wiki/Warship/Legends",
  "/wiki/Matalok",
  "/wiki/Cruiser/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/Battle_of_Coruscant_(Yuuzhan_Vong_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/Domain_Kraal",
  "/wiki/Domain",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Yammosk",
  "/wiki/Gravity_well/Legends",
  "/wiki/Blaze_bug",
  "/wiki/Insectoid/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Yorik-et",
  "/wiki/Squadron/Legends",
  "/wiki/Command_ship/Legends",
  "/wiki/Frigate/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Turbolaser/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Hull/Legends",
  "/wiki/Vacuum/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Star_Dreadnought/Legends",
  "/wiki/Battle_group/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Wedge_Antilles/Legends",
  "/wiki/2002",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream",
  "/wiki/Aaron_Allston",
  "/wiki/The_New_Jedi_Order:_Enemy_Lines_I:_Rebel_Dream_(audiobook)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}