{
 "name": "Xamuel_Lennox",
 "display_name": "Xamuel Lennox",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Death Squadron",
      "Death Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Xamuel Lennox was a Human male who hailed from a long line of military men. Lennox began his career as a naval officer for the Galactic Empire with a noble, proud philosophy, similar to that of his ancestors; he hated the deception and ruthlessness that were commonplace in the New Order. When the Empire became embroiled in a galaxy-spanning conflict with the Alliance to Restore the Republic, Lennox found himself caught between both sides. On the one hand, he saw the Empire as mired with corruption and greed, and on the other, the Rebellion had begun the war and opposed a legitimate government. Despite his conflicted ideology, Lennox finally accepted that corruption was how things would always be. He eventually became a captain in the Imperial Navy with the command of the Imperial I-class Star Destroyer Tyrant. In 1 BBY, Lennox led the Tyrant and nine other Imperial Star Destroyers in an ambush against Rebel forces over the planet Turkana. The battle ultimately ended in an Imperial retreat, due to the success of the Rebels' new T-65 X-wing starfighters against Lennox's combat tactics.\nAt some point following the battle, Lennox and the Tyrant were attached to Death Squadron, the personal battle group of the Dark Lord of the Sith, Darth Vader. In 3 ABY, Lennox and the Tyrant participated in the Battle of Hoth; however, because the Star Destroyer was hit by fire from the Rebels' planetary ion cannon in the early stages of the battle over the planet Hoth, it was unable to assist the Empire until repairs were made. After the Tyrant was repaired of its ion damage, a shuttle brought the captured Rebel general and former Imperial, Crix Madine, aboard so that he could be taken to prison. However, Lennox's incarceration of Madine was short lived—the Tyrant was hit again by the ion cannon's fire, and Rebel commandos boarded the ship and rescued Madine. Near the end of the battle, when the Tyrant was functional again, Lennox attempted to recapture Madine by attacking the Champion, a Mon Calamari cruiser that was evacuating the general from Hoth. Despite Lennox's efforts, the Champion successfully escaped.\nDarth Vader then gave Lennox an assignment to go to the Bespin system and remove the Jedi Diplomat, Rachi Sitra, from Cloud City, a tibanna gas mining colony floating over the gas giant of Bespin. After reaching the system and overseeing the Jedi's dispatch, Lennox ordered his men to remove Rebel sympathizers from the city. The assignment was thwarted by Lando Calrissian, the colony's Baron Administrator, who threw the colony into chaos by telling his people to evacuate. Later in 4 ABY, Lennox and his crew were present at the Battle of Endor, where Emperor Palpatine and Darth Vader were killed and the Empire's Death Star II battlestation was destroyed. Several years later, Lennox was imprisoned when the Tyrant was captured and renamed the Rebel Dream by the New Republic, a government formed from the Rebellion he had opposed.\nXamuel Lennox was a Human male who was born into a proud legacy of military men. During the early days of the reign of the Galactic Empire, Lennox joined the Imperial Navy. At the start of his career, Lennox attempted to follow in his ancestors' footsteps and be an honorable, noble officer. Yet his attitude toward his duty and crew was sharply contrasted to that of the majority of his colleagues, who were content to betray each other and engage in political maneuvering, which Lennox despised. However, Lennox knew that he would not survive long if he continued with his family's traditional philosophy, so despite his intense dislike of such practices, he decided to engage in deceit and political intrigue. By mastering the tactics of deceit, he was able to fend off those who vied for his Navy positions.\nBy 1 BBY, during the Galactic Civil War, Lennox was the captain of the Imperial I-class Star Destroyer Tyrant. That year, Lennox was in command of Imperial naval operations in the Pakuuni sector and was ordered by the sector governor to lead ten Star Destroyers against Alliance to Restore the Republic warships orbiting the planet Turkana. Before dropping his fleet out of hyperspace, Lennox used a group of starfighters to verify the Rebels' presence. Using Formation Besh, Attack Pattern Tartarus to keep the Rebels from escaping, Lennox had the Tyrant serve as the lead ship, with Captain Firmus Piett providing support from the Star Destroyer Accuser. While the Star Destroyers engaged the Rebels' Mon Calamari Cruisers and other capital ships at long range, the fleet's TIE bombers attacked the engines on the Rebel cruisers, while being protected by TIE fighters and interceptors. However, the Rebels launched their own starfighters, including two squadrons of the Rebels' new T-65 X-wing starfighters. Despite warnings from Piett, Lennox stayed with his original tactics, which led to the Imperial starfighters taking heavy casualties. While Piett's orders made it possible to destroy some of the attacking starfighters, the Rebels still dealt serious damage to at least two of the Star Destroyers, without any of the Rebel capital ships being destroyed. Lennox ordered his fleet to jump to hyperspace and regroup at Pakuuni, but his defeat at what became known as the Battle of Turkana resulted in Captain Piett recommending his removal from command of naval operations in the Pakuuni sector.\nUnder the command of Lennox, the Tyrant became part of Death Squadron after the destruction of the Empire's Death Star at the Battle of Yavin. Death Squadron was the personal battle group of Darth Vader, a Dark Lord of the Sith and one of the most powerful men in the Empire. Lennox was an able leader and cunning tactician, earning his position through merit alone, but he was also very dedicated to his crew and ship, caring about their wellbeing more than his own political advancement. Despite his dedication, Lennox was disillusioned with the Empire and military life due to the dishonorable means to which he resorted to keep his captaincy safe. While he had serious qualms about the corruption and lack of moral principles of the Empire he served, he despised the Alliance to Restore the Republic and knew that the Galactic Republic before it was every bit as corrupt as the Empire. Ultimately, Lennox decided that deceit and corruption were the natural order of things.\nIn 3 ABY, Imperial Viper probe droids were launched from the Star Destroyers of Death Squadron to search throughout the galaxy for the location of the Alliance's headquarters. The squadron was near the Qeimet system when a probe droid discovered the Rebel base on the planet Hoth in the Anoat sector. Using the information, Darth Vader ordered the fleet's course to be set for the Hoth system, taking a series of hyperspace jumps to travel there. When Death Squadron arrived in the system, the Rebels activated their energy shield over Hoth, but the Imperials continued with their attack, landing a ground assault to bring down the Rebels' shield generator. The Tyrant was positioned at the front of Death Squadron's formation as one of six Star Destroyers making up a heavy attack line that was backed up by the Executor, Darth Vader's personal command ship. As the Imperial ground forces began their attack, Lennox and the Tyrant moved into position to intercept the Rebels' GR-75 medium transports and their starfighter escorts as they attempted to evacuate rebel personnel from the surface.\nLennox was on the bridge of the Tyrant when his first officer, Lieutenant Cabbel, informed him that the first Rebel transport, named the Quantum Storm, and its T-65 X-wing starfighter escorts were approaching the Tyrant's position. Eager to engage the Rebels, Lennox prepared to attack, but the Rebels had a large planetary ion cannon stationed near the base, which fired two shots that hit the Tyrant. While the Com-Scan aboard the Tyrant was able to pick up the power fluctuations caused by the ion cannon firing, Lennox and the rest of the ship's crew were unable to react quickly enough for the Tyrant to evade the attack. The ion blasts disabled the Star Destroyer's shields and helm control, which allowed the Rebel ships to escape. The ion cannon also affected Lennox's myoelectric hip replacement, which caused his foot to tap wildly. While the Rebels had insufficient ships to destroy the Tyrant, and the ship's trajectory did not place it on a collision course with Hoth, the ion damage eventually caused the Star Destroyer's artificial gravity and other main systems to fail, causing an unusual quiet to fall over the ship. While the Tyrant was disabled, the Accuser took the ship's position in Death Squadron's attack line. The disabled systems put Lennox's and the Tyrant out of the battle temporarily, but the Star Destroyer's crew were able to repair the ship before it ended.\nDuring the battle on the surface, Imperial troops captured a Rebel Alliance general and former Imperial named Crix Madine and sent him to the Tyrant via a shuttle so that he could be sent to prison on the planet Dathomir. After the shuttle entered the Tyrant's docking bay, Captain Lennox ordered one of the Imperial troops to come to the bridge and report to him on the status of the battle. During the report, the Tyrant was hit by another blast from the planetary ion cannon. While overseeing the repair of systems disabled by the ion cannon, Lennox ordered the reporting soldier to ensure that Madine was secure in the ship's brig. A short time afterward, Rebel commandos boarded the ship, rescued Madine, and escaped back to Hoth with the Rebel general on a Lambda-class shuttle that they stole from the docking bay. Captain Lennox was unable to pursue the shuttle due to the ion damage the Tyrant had suffered. Although Lennox's warship was left to float through the system, and several more Rebel transports subsequently escaped, the Battle of Hoth proved a resounding victory for the Empire and kept the Rebels on the run.\nLater, a shuttle brought Madine to the Mon Calamari Cruiser Champion, which then prepared to jump to hyperspace. Lennox engaged the cruiser with the now functional Tyrant, and ordered the launch of the ship's TIE fighters in preparation for battle. Lennox hailed the Champion to say that if they handed over Madine he would call off his attack. The captain of the Champion refused and ordered the launch of his ship's fighters. Lennox and the Tyrant were unable to defeat the Champion and its fighters, and the ship escaped.\nAfterward, Darth Vader sent a communication that gave Lennox a new assignment. Lennox received the message in his ready room with one of the Imperial soldiers who had originally captured Madine. Darth Vader assigned the Tyrant to leave for the Bespin system, where he would dispatch Rachi Sitra, a Jedi Diplomat who was making trouble for Imperial negotiations with officials on Cloud City, a tibanna gas mining colony floating over the gas giant Bespin. Vader ended the message warning Lennox not to fail again, and Lennox assigned the Imperial soldier to lead the attack on the Jedi. After two days the Tyrant reached the Bespin system, and the Imperial soldier took a number of troops in a shuttle to Cloud City. There, the soldier was able to force Sitra to flee from Cloud City in an Actis interceptor.\nThe soldier alerted Lennox of the success via a message, and the Captain ordered the operative to remove Rebel sympathizers from Cloud City's lower levels, giving the soldier locations to search and names of suspected sympathizers. However, before the soldier could investigate any suspects, Lando Calrissian, the Baron Administrator of Cloud City, advised the people of the colony to evacuate. During the chaos that followed, the soldier captured Lobot, Calrissian's aide, and kept Rebel commandos from rescuing the Rebel captain and smuggler, Han Solo, whom Darth Vader had ordered frozen in carbonite and handed over to the bounty hunter, Boba Fett. When Lennox debriefed the operative, he praised the soldier's removal of the Jedi and their work in keeping the Rebels from rescuing Solo. Lennox assured the soldier that the Empire would provide another assignment.\nAfter his assignment to Bespin, Lennox retained his post as captain of the Tyrant and continued to serve as part of Death Squadron until 4 ABY. That year, the Tyrant was part of the Imperial fleet that participated in the Battle of Endor. The Rebels staged a daring assault on the second Death Star, where the Alliance Fleet was able to destroy the battlestation over the forest moon of the planet Endor. Vader and Emperor Palpatine were also killed, leaving the Empire bereft of leadership. The battle continued for a time, until Gilad Pellaeon, the captain of the Star Destroyer Chimaera, ordered the remnants of the Imperial fleet, including the Tyrant, to retreat.\nSeveral years later, shortly after the Bacta War of 7 ABY, Lennox's Tyrant was captured by the Rebel Alliance's successor, the New Republic. With Lennox imprisoned, the New Republic renamed his ship Rebel Dream and made it the flagship of Princess Leia Organa. The Rebel Dream was still in service by the end of the Yuuzhan Vong War in 29 ABY, many years after its capture.\nXamuel Lennox believed himself to be an honorable man and attempted to follow in the footsteps of his forefathers as a dedicated and loyal captain. After proving himself to be an adept tactician and capable leader, he was given command of his own ship and crew. Lennox genuinely cared about and was totally dedicated to the Tyrant and its crew, a view that many of his peers did not share. When his subordinates were successful in their assignments, Lennox complemented them on their success. He hated that the Empire had become mired with corruption, backstabbing, and political maneuvering during his time, unlike the noble regimes his ancestors had served in the past. However, Lennox knew that if he attempted to rise above the Empire's corruption without others doing the same, he would end up swept away by the Imperial war machine, just like the Galactic Republic had been. With this frame of mind, Lennox decided to play his foes at their own game, proving as adept at guile and deception as he was at commanding a Star Destroyer. Despite his command abilities, Lennox's tactics during the Battle of Turkana and his refusal to listen to the recommendations of Captain Piett led to the Empire's defeat during the battle. Ultimately, his refusal to change tactics during the battle led Piett to recommend his removal from command of Imperial naval forces in the Pakuuni sector.\nHowever, the numerous dishonorable deeds that Lennox committed to keep himself in the captain's chair took a significant toll on his conscience. By the time the Rebels launched their campaign against the Empire in 2 BBY, Lennox had grown considerably disillusioned with the manner in which the Empire operated. Although he saw many faults in the Empire, Lennox believed that the Rebel Alliance was even more flawed. Since they had started the Galactic Civil War, in Lennox's opinion, the blood of the dead was on their hands. Additionally, he knew that the Republic that they championed and wished to re-establish was just as riddled with corruption as the Empire against which they spoke out. Lennox viewed the Alliance as immoral and hypocritical, while he perceived the Empire as depraved and unethical. In the belief that a more suitable government would never exist, Lennox sided with the Empire, which he saw as legitimate, and helped fight against the Rebels. By the time of the Battle of Hoth, Lennox was familiar with planetary ion cannon emplacements and other ion weaponry. While some potential recruits entering the Imperial Navy disliked the constant noise aboard a starship, he did not mind it and even missed the sound while not on a ship. Lennox had brown hair and fair skin.\nAs an Imperial captain, Lennox wore the standard gray Imperial Navy officer uniform. By the Battle of Hoth, he had received a myoelectric hip replacement that was susceptible to ion damage.\nXamuel Lennox first appeared in Star Wars: Episode V The Empire Strikes Back in 1980, where he was portrayed by John Dicks, although the character was credited as just \"Imperial officer.\" Lennox's line in the movie was given to Captain Needa in Donald F. Glut's novelization of the film. In 1998, Lennox received his name in the Hoth Limited set of Decipher's Star Wars Customizable Card Game. Captain Lennox was later mentioned in the standard game mode of Star Wars: Galactic Battlegrounds, a 2001 video game by LucasArts, where he was a possible Imperial leader, chosen randomly. However, he did not actually appear in the game, and the mention of \"Captain Lennox\" was part of a non-storyline event, and thus non-canon. His name was used in the same way in Star Wars: Galactic Battlegrounds: Clone Campaigns, a 2002 expansion pack which was also released by LucasArts.\nIn 2007, Lennox was featured in The Empire's Finest: Who's Who in the Imperial Military, an article appearing in Star Wars Insider 96 that was written by to Daniel Wallace and Abel G. Peña. The article added a large amount to Lennox's backstory, including his first name, and was originally written in 2002 to be released in conjunction with Peña and Wallace's Who's Who: Imperial Grand Admirals for Star Wars Gamer magazine. When Star Wars Gamer stopped production, the articles were transferred to Star Wars Insider, and the magazine's editor decided to publish Who's Who: Imperial Grand Admirals while cancelling The Empire's Finest.\nBefore The Empire's Finest was published in 2007, Peña and Wallace revised the original document while preparing the article for release. One change involved Lennox's first name, which Abel G. Peña had originally intended to be \"Corazon,\" the Spanish word for \"heart.\" Peña felt that it tied into Lennox's character and his conflicting inner feelings about the Empire and the Rebellion. However, in 2007, Peña decided that using names that have a meaning in another language had already been used too much and decided to assign Lennox with another first name. He eventually named the character \"Xamuel,\" a play on Samuel Adams, though Peña admitted that at the time he was thinking of Samuel Adams beer.\nThe article also mentioned that there was initially some confusion among fans about Lennox's only line in the film, which is often erroneously attributed to Firmus Piett. Although Lennox's face was not fully visible when he spoke, his voice was much different than Piett's. Insider claims that part of the confusion was due to the fact that the movie novelization assigned the line to Piett, although in the novelization actually gave the line to Needa.\nThree years after The Empire's Finest, Captain Lennox was featured in some of the mission texts for both the light side and dark side campaigns in The Price of Victory, the eighth set of the Star Wars Galaxies Trading Card Game. He also featured as the player's opposing avatar card in the third scenario of the light side campaign. This card was simply used in the game for this scenario and was not available for players to use. The Imperial soldier mentioned in the article above was the player character in the dark side scenario campaign for The Price of Victory. A story featuring Lennox was also at one point written by Jason Fry for The Essential Guide to Warfare, though it did not make it into the final book due to editing decisions. However, in 2014, the story was released on StarWars.com in the eleventh installment of Star Wars: The Essential Guide to Warfare Author's Cut, which presented various material cut from the book.\nIn 2012, a character with a similar appearance to Lennox was featured in Star Wars: Crimson Empire III—Empire Lost 5, a comic written by Mike Richardson, illustrated by Paul Gulacy and Michael Bartolo, and published by Dark Horse Comics. The nameless character appeared as part of the Council of Moffs and was referred to as a commander in the dialogue. The scene the officer appeared in took place on the planet Orinda in 13 ABY, where Admiral Pellaeon called a meeting of the council to discuss a treaty with the New Republic. However, that purpose was dropped when the council believed that the New Republic was responsible for the death of Feena D'Asta, the daughter of the Imperial Baron Ragez D'Asta. The commander objected to retaliation, because he believed that potentially weakening the Imperial fleet was a mistake after the Empire's losses while fighting the New Republic at the planet Pallaxides. Despite the commander's objection, Admiral Pellaeon and the council chose to strike back against the New Republic.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Lennox",
  "/wiki/Xamuel_Lennox",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Lennox_(disambiguation)",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Death_Squadron/Legends",
  "/wiki/File:Cabbel-Lennox.ogg",
  "/wiki/Navy/Legends",
  "/wiki/Officer/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Imperial_Navy/Legends",
  "/wiki/Imperial_I-class_Star_Destroyer/Legends",
  "/wiki/Rebel_Dream",
  "/wiki/1_BBY/Legends",
  "/wiki/Imperial-class_Star_Destroyer/Legends",
  "/wiki/Battle_of_Turkana/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Turkana/Legends",
  "/wiki/T-65_X-wing_starfighter/Legends",
  "/wiki/Fleet/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Planetary_ion_cannon",
  "/wiki/Hoth/Legends",
  "/wiki/Shuttle/Legends",
  "/wiki/General/Legends",
  "/wiki/Crix_Madine/Legends",
  "/wiki/Prison/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Commando/Legends",
  "/wiki/Champion_(Mon_Calamari_cruiser)",
  "/wiki/Mon_Calamari_Star_Cruiser",
  "/wiki/Darth/Legends",
  "/wiki/Occupation_of_Bespin",
  "/wiki/Bespin_system/Legends",
  "/wiki/Jedi_Diplomat",
  "/wiki/Rachi_Sitra",
  "/wiki/Cloud_City/Legends",
  "/wiki/Tibanna/Legends",
  "/wiki/Mining/Legends",
  "/wiki/Gas_giant/Legends",
  "/wiki/Bespin/Legends",
  "/wiki/Star_system/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/City/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Baron_Administrator/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Death/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Battlestation",
  "/wiki/Standard_year/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/File:LennoxTurkana-XW.ogg",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Pakuuni_sector",
  "/wiki/Unidentified_Pakuuni_sector_governor",
  "/wiki/Warship/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Formation_Besh",
  "/wiki/Attack_Pattern_Tartarus",
  "/wiki/Starship/Legends",
  "/wiki/Firmus_Piett/Legends",
  "/wiki/Accuser",
  "/wiki/Capital_ship/Legends",
  "/wiki/TIE/sa_bomber/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Cruiser/Legends",
  "/wiki/TIE/LN_starfighter",
  "/wiki/TIE/IN_interceptor/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/Pakuuni/Legends",
  "/wiki/DS-1_Orbital_Battle_Station/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Imperial_Military/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Viper_probe_droid/Legends",
  "/wiki/Qeimet_system",
  "/wiki/Probe_droid/Legends",
  "/wiki/Echo_Base/Legends",
  "/wiki/Anoat_sector/Legends",
  "/wiki/Hoth_system/Legends",
  "/wiki/Deflector_shield/Legends",
  "/wiki/Ground_warfare",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Executor/Legends",
  "/wiki/Flagship/Legends",
  "/wiki/GR-75_medium_transport/Legends",
  "/wiki/Bridge_(starship)/Legends",
  "/wiki/Executive_officer/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Cabbel/Legends",
  "/wiki/Transport/Legends",
  "/wiki/Quantum_Storm/Legends",
  "/wiki/V-150_Planet_Defender/Legends",
  "/wiki/Com-scan",
  "/wiki/Destroyer/Legends",
  "/wiki/Myoelectric_hip_replacement",
  "/wiki/Limb/Legends",
  "/wiki/Artificial_gravity_generator/Legends",
  "/wiki/Emancipator",
  "/wiki/Troop/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Soldier/Legends",
  "/wiki/Lambda-class_T-4a_shuttle/Legends",
  "/wiki/Mon_Calamari/Legends",
  "/wiki/Star_Cruiser/Legends",
  "/wiki/TIE_Series",
  "/wiki/Space_warfare",
  "/wiki/Unidentified_Rebel_captain",
  "/wiki/Ready_Room",
  "/wiki/Time/Legends",
  "/wiki/Eta-2_Actis-class_interceptor",
  "/wiki/Lobot/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Carbon-freezing/Legends",
  "/wiki/Carbonite/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Death_Star/Legends",
  "/wiki/Alliance_Fleet",
  "/wiki/Endor/Legends",
  "/wiki/Endor_(planet)/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Chimaera/Legends",
  "/wiki/Bacta_War",
  "/wiki/7_ABY/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/29_ABY/Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Blood/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Star_Wars:_X-Wing",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/1980",
  "/wiki/John_Dicks",
  "/wiki/Lorth_Needa/Legends",
  "/wiki/Donald_F._Glut",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/1998",
  "/wiki/Hoth_Limited",
  "/wiki/Decipher,_Inc.",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/2001",
  "/wiki/Video_game",
  "/wiki/LucasArts",
  "/wiki/Canon",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/2002",
  "/wiki/2007",
  "/wiki/The_Empire%27s_Finest:_Who%27s_Who_in_the_Imperial_Military",
  "/wiki/Star_Wars_Insider_96",
  "/wiki/Daniel_Wallace",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/Who%27s_Who:_Imperial_Grand_Admirals",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Star_Wars_Insider",
  "/wiki/2010",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/The_Price_of_Victory",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Jason_Fry",
  "/wiki/The_Essential_Guide_to_Warfare",
  "/wiki/2014",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Guide_to_Warfare_Author%27s_Cut",
  "/wiki/2012",
  "/wiki/Star_Wars:_Crimson_Empire_III%E2%80%94Empire_Lost",
  "/wiki/Crimson_Empire_III:_Empire_Lost_5",
  "/wiki/Mike_Richardson",
  "/wiki/Paul_Gulacy",
  "/wiki/Michael_Bartolo",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Council_of_Moffs/Legends",
  "/wiki/Orinda/Legends",
  "/wiki/13_ABY/Legends",
  "/wiki/Feena_D%27Asta",
  "/wiki/Baron/Legends",
  "/wiki/Ragez_D%27Asta",
  "/wiki/Battle_of_Pallaxides",
  "/wiki/Pallaxides",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(junior_novelization)",
  "/wiki/Star_Wars_Manga:_The_Empire_Strikes_Back_1",
  "/wiki/Star_Wars_(1977)_40",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/1980_Topps_Star_Wars:_The_Empire_Strikes_Back_Series_1",
  "/wiki/The_Empire_Strikes_Back_Notebook",
  "/wiki/Live-Action_Adventures",
  "/wiki/Star_Wars:_The_Annotated_Screenplays",
  "/wiki/Star_Wars_Trilogy_Sourcebook,_Special_Edition",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Behind_the_Magic",
  "/wiki/Star_Wars_Trading_Card_Game",
  "/wiki/Return_of_the_Jedi_(TCG)",
  "/wiki/The_Battle_of_Hoth_(game)",
  "/wiki/Star_Wars_Gamer_6",
  "/wiki/Rebellion_Era_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_4",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Template:SWGTCG",
  "/wiki/2013_Topps_Star_Wars_Galactic_Files_Series_2",
  "/wiki/Star_Wars_in_100_Scenes",
  "/wiki/Star_Wars:_Imperial_Handbook:_A_Commander%27s_Guide",
  "/wiki/Fresian_campaign",
  "/wiki/Death_Star_plans/Legends",
  "/wiki/Battle_of_Kattada",
  "/wiki/Subjugation_of_Ralltiir",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Destroyer-I_ion_engine/Legends",
  "/wiki/File:Tyrant-ESB.png",
  "/wiki/Devastator/Legends",
  "/wiki/File:DevastatorTantiveIV.png",
  "/wiki/Vader:_The_Ultimate_Guide",
  "/wiki/Avenger/Legends",
  "/wiki/File:WhoWillTicketVaderForLittering-ESB.jpg",
  "/wiki/Imperial_II-class_Star_Destroyer/Legends",
  "/wiki/Star_Wars:_X-Wing_Alliance",
  "/wiki/The_Essential_Atlas",
  "/wiki/Galaxy_Guide_3:_The_Empire_Strikes_Back",
  "/wiki/The_Empire_Strikes_Back_(radio)",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Heir_to_the_Empire",
  "/wiki/The_New_Jedi_Order:_The_Unifying_Force",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/The_Force_Unleashed_(novel)",
  "/wiki/Wookieepedia:Interview/Abel_G._Pe%C3%B1a",
  "/wiki/September_8"
 ]
}