{
 "name": "Xanda",
 "display_name": "Xanda",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Alliance Security"
     ]
    }
   ]
  }
 ],
 "content": "Xanda was a Human male captain in Galactic Alliance Security, stationed in 43 ABY at a secret blockhouse where psychotic Jedi Knights Valin and Jysella Horn were being held in carbonite. When a group of Jedi, accompanied by Mirax Terrik Horn and the press, arrived at the facility to visit the Horns, Terrik Horn assaulted the facility's commander for disrespecting her children. Xanda began calling for her arrest, but Chief of State Natasi Daala arrived and declared that no charges would be pressed.\nXanda was a blond Human male who served in Galactic Alliance Security around the time following the Second Galactic Civil War. By 43.5 ABY he had ascended to the rank of captain, and in that year he was stationed at a secret Galactic Alliance Security blockhouse on Coruscant, where psychotic Jedi Knights Jysella Horn and Valin Horn were encased in carbonite and put on display. However, a group of Jedi tricked Judge Arabelle Lorteli into giving them a writ that granted them visitation rights to the Horn siblings.\nThe Jedi, along with the press and the Horns' mother, Mirax Terrik Horn, arrived at the facility and found the two Horns on display. The facility's commander, Colonel Wruq Retk, attempted to provoke the Jedi in front of the press, but Terrik Horn assaulted him, knocking him out. In the ensuing chaos, Xanda began calling for the arrest of Terrik Horn for assaulting Retk, but at the prompting of Jedi Knight Jaina Solo, journalist Javis Tyrr posed a question to Xanda intended to make his claim for the arrest of Terrik Horn sound ridiculous. However, before Xanda could answer, Galactic Alliance Chief of State Natasi Daala arrived on the scene and declared that the Galactic Alliance would not pursue charges against Terrik Horn.\nXanda believed that Terrik Horn's assault on his superior officer was worthy of arrest, and he wasn't afraid to voice this opinion, as he led the Security forces present in the facility in demanding for her imprisonment.\nXanda was created by author Troy Denning for his 2009 novel, Fate of the Jedi: Abyss, Denning's first installment—and the third novel overall—in the nine-part Fate of the Jedi series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Captain/Legends",
  "/wiki/43_ABY",
  "/wiki/Galactic_Alliance_Security_blockhouse",
  "/wiki/Force_psychosis",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Valin_Horn",
  "/wiki/Jysella_Horn",
  "/wiki/Carbonite/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Mirax_Terrik_Horn",
  "/wiki/Wruq_Retk",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Natasi_Daala",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/Military_rank/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Mind_trick/Legends",
  "/wiki/Judge/Legends",
  "/wiki/Arabelle_Lorteli",
  "/wiki/Colonel/Legends",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Journalist/Legends",
  "/wiki/Javis_Tyrr",
  "/wiki/Officer/Legends",
  "/wiki/Troy_Denning",
  "/wiki/2009",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)"
 ]
}