{
 "name": "Xarot_Korlin",
 "display_name": "Xarot Korlin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireInquisitorius",
      "Inquisitorius"
     ]
    }
   ]
  }
 ],
 "content": "Xarot Korlin was a male Human in the Imperial Inquisitorius serving on the planet Dathomir during the Galactic Civil War.\nDuring the Galactic Civil War, Xarot Korlin was stationed on the planet Dathomir where he had been studying the ways of the local witches that used \"magic\". He believed that this \"magic\" came from special stones found in most of the witches elaborate headdresses. To this end, he sent an individual into the Nightsisters territory to kill a Nightsister and bring back one of the Nightsister Force crystals. When the individual came back, his task completed, Xarot informed him that had been exactly what he was looking for and thanked him. Unfortunately, he was unable to discern anything special from this stone and remained confused as to how the witches used their \"magic\". All he discovered was that the stone had a slightly lower temperature than one would expect it to have, and thought that perhaps the witches were in fact using the Force as the Jedi Order had once done.\nKorlin was still positive that the stones did something though, and so he sent the individual out to kill a Singing Mountain Clan witch and bring back her Force crystal. When the individual came back with this stone, he started to compare it to the Nightsister one to see if there was any connection. Again, however, his studies turned up nothing at all and so he requested the help of the individual once more. He thought perhaps that the stones did not work on their own, but in fact worked in tandem with pulses in the witches' brains, but unfortunately did not have one of their brains to test his theories on. Because of this, he sent the individual to capture a Nightsister-in-training and bring her back to him. Once the individual came back with a Nightsister, he performed a lobotomy on her, assuring her it would not hurt for long.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Inquisitorius/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Nightsisters/Legends",
  "/wiki/Nightsister_Force_crystal",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Singing_Mountain_Clan",
  "/wiki/Force_crystal",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Galaxies_Trading_Card_Game",
  "/wiki/Galactic_Hunters",
  "/wiki/Template:SWGTCG"
 ]
}