{
 "name": "Xeelksidlo",
 "display_name": "Xeelksidlo",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink and Purple"
     ]
    }
   ]
  }
 ],
 "content": "Xeelksidlo was a Rodian female trader in the criminal underworld. She tried to rescue an unidentified female that worked for one of the warring factions in the third Galactic War on Dantooine and who was supposed to be sold off at a Nova Blade-slave auction. The unnamed woman did not make it safely back to the base but Xeelksidlo managed to relay her last words. The Rodian informed The Commander - who had allied the Eternal Alliance with one of the factions - that more captives were in need of saving near the Eastern caves. She considered the warning regarding Hugo as a little strange.\nXeelskidlo first appears in Update 5.10.3, released on June 4, 2019, for BioWare's 2011 massively multiplayer online roleplaying video game Star Wars: The Old Republic. In the game, she is identified as \"Underworld Trader Xeelksidlo\".\nAs both the heroic mission \"Beware of Hugo\" is available to players of either class and Xeelskidlo can be found in both factions' Dantooine bases, this article assumes only that she did talk with the Outlander and makes no assumption as to which base they met in or which faction the Outlander supported.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Third_Galactic_War",
  "/wiki/Dantooine/Legends",
  "/wiki/Nova_Blades",
  "/wiki/Slavery/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/June_4",
  "/wiki/2019",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne"
 ]
}