{
 "name": "Xelian",
 "display_name": "Xelian",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "By 1032 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith"
     ]
    }
   ]
  }
 ],
 "content": "Xelian, also known as Xelian the Destroyer, was a Human female Sith who lived during the Republic Dark Age. One of seven children of the Sith Lord Vilia Calimondra, Xelian fought in a war between the siblings, to decide which one would become their mother's heir. Xelian also bore two children, Odion and Daiman, and her preference for Daiman over his brother caused the pair to develop a sibling rivalry. Eventually, Xelian's brother Chagras emerged as the victor of Calimondra's contest, and Xelian died.\nXelian, known to some by the sobriquet \"Xelian the Destroyer,\" was a Human female Sith Lord who lived during the Republic Dark Age. She was one of seven children born to Vilia Calimondra, a Sith Lord who had acquired a large empire in the Grumani sector, and Xelian claimed the right to become her mother's only heir. However, Xelian's brother Chagras and their five other siblings all made similar claims, so Calimondra instigated a contest—the Charge Matrica—in 1066 BBY, to decide which of her children would become her heir. The siblings were tasked with the expansion of Calimondra's holdings, and the Sith Lord planned to appoint as her heir the individual who expanded her territories the farthest. For a time, Xelian and the other siblings cooperated, but eventually Xelian's bid began to flounder. As a result, she declared war on Chagras, which caused all of the siblings to initiate hostilities against each other. To aid her campaign, Xelian had her armies adopt a variant of the Crucible training system, which was first developed by the ancient Sith Lord Ieldis prior to the Great Hyperspace War. She also established a headquarters for herself, inside a temple-like structure.\nAt some point, Xelian gave birth to a son, Odion, who became her heir. In 1057 BBY, she bore another child, who she named Daiman, and following his birth, she stood atop a rocky outcrop next to her temple residence and held up her new baby for her followers to see. Daiman quickly displaced Odion as the subject of Xelian's affections, and a sibling rivalry soon developed between the two brothers. Xelian also eventually became an aunt to Chagras' children, Dromika, Quillan, and Arkadia Calimondra. During 1052 BBY, Xelian seduced the aging Sith Lord Mandragall and subsequently killed him during the night. By 1050 BBY, Chagras was the only one of Calimondra's children who remained active in the Grumani sector, and he became their mother's heir. Xelian herself eventually died, at some point prior to 1032 BBY.\nXelian had fair skin and dark-colored hair. She preferred her son Daiman over her oldest child Odion, considering Daiman to be pretty and Odion ugly. The mercenary leader Jarrow Rusher thought Xelian to be a monstrous individual.\nXelian was created by John Jackson Miller and was mentioned in the 2011 novel Knight Errant. She later featured in the associated Knight Errant comic series, which was also written by Miller, receiving an indirect mention in the 11th issue of the series and making her first appearance in Star Wars Legends continuity in a flashback sequence in the 13th issue.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/1032_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Republic_Dark_Age",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Vilia_Calimondra",
  "/wiki/Charge_Matrica",
  "/wiki/Parent/Legends",
  "/wiki/Odion",
  "/wiki/Daiman",
  "/wiki/Chagras",
  "/wiki/Death/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Vilia_Calimondra%27s_empire",
  "/wiki/Grumani_sector",
  "/wiki/1066_BBY",
  "/wiki/Time/Legends",
  "/wiki/Army/Legends",
  "/wiki/The_Crucible",
  "/wiki/Ieldis",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Temple",
  "/wiki/1057_BBY",
  "/wiki/Dromika",
  "/wiki/Quillan_(Sith)",
  "/wiki/Arkadia_Calimondra",
  "/wiki/1052_BBY",
  "/wiki/Mandragall",
  "/wiki/1050_BBY/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Jarrow_Rusher",
  "/wiki/John_Jackson_Miller",
  "/wiki/2011",
  "/wiki/Knight_Errant_(novel)",
  "/wiki/Star_Wars:_Knight_Errant",
  "/wiki/Knight_Errant:_Escape_1",
  "/wiki/Knight_Errant:_Escape_3",
  "/wiki/Category:Images_of_Xelian",
  "/wiki/StarWars.com",
  "/wiki/Standard_year/Legends",
  "/wiki/The_New_Essential_Chronology"
 ]
}