{
 "name": "Xenteel",
 "display_name": "Xenteel",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  }
 ],
 "content": "Xenteel was a male Human who worked as a bounty hunter during the Cold War between the Galactic Republic and the Sith Empire. During the war he worked on the planet Nal Hutta with a Twi'lek named Zinny. The pair worked out of an industrial town named Jiguuna where provided training and supplies for other bounty hunters and had a stall set up in the town's market area. Xenteel directed a bounty hunter who was hoping to take part in the Great Hunt to Zinny for training during their time on Hutta.\nXenteel was a male Human who lived during the Cold War between the Galactic Republic and the Sith Empire. By the year 3643 BBY he had taken up a career as a bounty hunter and had become talented enough at the job to teach others in the art of bounty hunting. He teamed up with a Twi'lek woman named Zinny and the pair began a business of training and supplying other bounty hunters, using their own experience. Xenteel and her partner set up a stall for their business on the planet Nal Hutta, the adopted homeworld of the Hutt species. The stall was in the market area of an industrial town named Jiguuna, which was controlled by a Hutt crime lord named Suudaa Nem'ro.\nIn the same year, Xenteel recognized a bounty hunter he saw whilst in the Poison Pit cantina in Jiguuna as the protégée of a veteran bounty hunter named Braden. He called over the individual and explained his and Zinny's business before directing them to Zinny to learn some new tricks. The hunter left the cantina and visited Zinny to improve their skills.\nXenteel was considered an experienced bounty hunter during the time of the Cold War and knew enough about tricks, weapons and maneuvers to be able to teach others members of the profession. He thought highly of his partner and would direct others to learn from her. Xenteel had dark skin and brown hair and eyes.\nXenteel first appeared in the video game Star Wars: The Old Republic which was released by BioWare in 2011. In the game Xenteel is located on Nal Hutta which is the starting planet for players of the bounty hunter and Imperial Agent class. He is involved in the quest \"Tools of the Trade\" in which he directs bounty hunters to Zinny to learn their first class skills. Female players have the option to flirt with him. He is voiced by Nolan North.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Zinny",
  "/wiki/Jiguuna",
  "/wiki/Hunter_(individual)",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Homeworld/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Species/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Canon",
  "/wiki/Poison_Pit",
  "/wiki/Cantina/Legends",
  "/wiki/Braden",
  "/wiki/Eye/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Imperial_Agent",
  "/wiki/Nolan_North",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide"
 ]
}