{
 "name": "Xerender",
 "display_name": "Xerender",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3642 BBY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Wyellett"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Sewlor"
     ]
    }
   ]
  }
 ],
 "content": "Xerender was a male Human Jedi Knight of the Jedi Order who lived during the time of the Cold War.\nThe Jedi Knight Xerender was a Padawan of the Jedi Master Wyellett. During the Great Galactic War, they dueled the Sith Lord Darth Baras together, and though the Sith escaped, Wyellett stole Baras' lightsaber and used it ever since, viewing it as a weapon of darkness brought into light. Eventually, Wyellett got captured and was to be delivered to Baras, but his prison ship was shot down over Hoth, and both Baras and Xerender assumed he perished. In truth, Wyellett survived, but was trapped under meters of ice below the wreckage of the Star of Coruscant. He survived for years subsisting only upon the Force and eventually was able to reach out to Xerender and alert him of his presence. Xerender and his Padawan Sewlor mounted a rescue mission to Hoth, where they allied with the Talz commandos led by Fetzellen. However, their actions antagonized Fetzellen's renegade soldier Broonmark, who isolated and killed Xerender's Padawan.\nMeanwhile, Darth Baras learned of Xerender's activities on Hoth and sent his Enforcer to chase him, believing that Xerender was searching for a superweapon. Xerender sliced his pursuer's holocommunications and interrupted the apprentice's report to Baras, which resulted in Baras lashing out and killing Commander Lanklyn. Xerender eventually made it to the Star of Coruscant, but pursuit was hot on his tail, and Broonmark managed to kill Fetzellen, while the Sith took care of the remaining Talz commandos. Xerender finally found his old master, but their reunion was cut short by the Sith's arrival. Xerender dueled the apprentice of Darth Baras, but was defeated. In the end, Xerender and his old Master were buried together under tons of ice.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3642_BBY",
  "/wiki/Hoth/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Wyellett",
  "/wiki/Sewlor",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Sith/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Star_of_Coruscant",
  "/wiki/The_Force/Legends",
  "/wiki/Talz/Legends",
  "/wiki/Fetzellen",
  "/wiki/Broonmark",
  "/wiki/Hunt_for_Xerender",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Superweapon/Legends",
  "/wiki/Slicer/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Lanklyn",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}