{
 "name": "Xev_Xrexus",
 "display_name": "Xev Xrexus",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Drazkel"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 32 BBY",
      "Xev's hideout",
      "Drazkel system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Xrexus Cartel"
     ]
    }
   ]
  }
 ],
 "content": "Xev Xrexus was a human female who founded the Xrexus Cartel during the final decades of the Galactic Republic. Leading her cartel as its Boss-Mistress, Xrexus sold and distributed unlicensed combat automata from semi-legitimate manufacturers. When smugglers under her employ discovered Jedi Padawan Eldra Kaitis in a shuttle crash and took her captive, Xrexus decided to auction her off to the most prominent criminal organizations and groups in the galaxy.\nBefore beginning her auction, Xrexus discovered the Sith Lord Maul aboard her space station. Xrexus, correctly assuming that Maul would steal Kaitis from the winner of the auction, had his ship wired to explode and bombed the craft, crashing it on the moon of Drazkel below. Xrexus decided to capitalize on the turn of events and announced a pay-to-play hunt for the Padawan and her captors. The hunt turned into a massacre as most of Xrexus's guests who journeyed to the site were killed before they fled the system. After slaughtering Kaitis, Maul returned to Xrexus's space station. Maul murdered Xrexus's staff and found Xrexus alone in her private suite, where the Boss-Mistress accepted her fate and was executed to ensure the Sith's secrecy.\nA female human born on Drazkel, Xev Xrexus became the titular founder of the Xrexus Cartel, a semi-legitimate collection of droid manufacturing firms from the Mid Rim Territories that banded together to fix prices and distribute unlicensed combat automata imported from the Outer Rim Territories. The Xrexus Cartel operated out of Xev's personal space station. Xrexus had ties to the The Glitch, a splinter group of the infamous Droid Gotra, a group that supported droid emancipation. As part of a planned droid uprising on the Galactic Republic capital Coruscant, the Glitch ordered a shipment of sham restraining bolts from the Xrexus Cartel. The shipment was intercepted by Coruscant Security Force Inspector Tan Divo, revealing the existence of the Xrexus Cartel to Republic authorities.\nAround 32 BBY, scavengers under Xrexus's employ stumbled on a Republic transport that had been shot down by pirates. All but one passenger, the Jedi Padawan Eldra Kaitis, had been killed in the crash, including the Jedi Knight escort. Xrexus had her scavengers take Kaitis captive, and the Padawan was brought to Xrexus's hideout above the moon of Drazkel. Xrexus quickly decided that she would auction Kaitis off to the highest bidder and started preparations for such an event. Xrexus hand-picked several parties to attend and sent out invitations to various crime lords and their retinues. The invitations only hinted at Kaitis being the prize and vaguely referred to her as \"a treasured rarity of extreme import and interest.\" Xrexus planned for a party before the auction and asked her guests to reply to the invitation with either an acceptance or denial and their choice of entrée by an enclosed date. Among those Xrexus invited were the Black Sun, the Pyke Syndicate led by capo Lom Pyke, Grakkus the Hutt, Hondo Ohnaka and his gang, Moogan industrialist Jee Kra, the Haddrex Gang, and several groups of Kyuzo and Trandoshan hunters. To avoid any legal interference, Xrexus held her auction outside of Republic space and, in addition, arranged several decoy events to distract law dogs from discovering what she was planning.\nWhen Xrexus's guests arrived, they gathered in a large garden hall in her space station. As they mingled and waited for the event to start, Xrexus and her entourage finished preparations, and the Boss-Mistress emerged to address the crowd. With a contingent of droidekas and uniformed underlings behind her, Xrexus welcomed her guests aboard her ship. Xrexus noted that she recognized several familiar faces but was unfamiliar with some attendees. Addressing them all together, Xrexus told them that they were all going to have the chance to win a rare prize in the upcoming auction. Xev started recounting how her scavengers had found Kaitis and revealed a holographic image of the captured Padawan for her guests. She added that although a Jedi Padawan was not as valuable as a Jedi Master, there were assorted uses the criminal element could find for a Knight-in-training. Xrexus announced that, since speed was of the essence, they would conduct the auction in two hours and finished her address by inviting her guests to enjoy themselves and consider the possibilities they would have for the Jedi.\nAfter finishing her speech, Xrexus was notified that one of the auction attendees had gone down to Kaitis's cell. Xrexus and several of her droidekas went to the cell block, where they found a cloaked individual standing in front of Kaitis's cell. Disappointed in her guest, Xrexus told him that he had made an egregious violation of protocol. Xrexus informed him that the area was off-limits, though smugly added that her rogue guest had likely known that. Unknown to Xrexus was that this individual was actually the Sith Lord Darth Maul, who had found out about Xrexus's auction and wanted to kill Kaitis out of an intense and deep rage against the Jedi Order. Maul lied to Xrexus, telling her that he was being rash and wanted to see the Padawan before the auction. Xrexus replied that her other guests would be \"disappointed\" that one of the bidders was afforded a privilege they were not, adding that disappointing clientele of their caliber was not good for business.\nXev asked Maul who he was, and he lied that he was \"Seris Madreth\" of the Haddrex Consortium, who Maul had wiped out while he searched for a way to the auction. Xrexus laughed at Maul's use of the word consortium and suggested that they call his employers for the gang they were. She noted that they would be displeased if one of their representatives was caught running off, which prompted Maul to ask the Boss-Mistress if they could keep his excursion between them. Leading him out of the prison block, Xrexus told Maul that she didn't see any reason they shouldn't avoid unpleasantness and admitted that she appreciated his rashness. Despite forgiving him, Xrexus threatened that her forgiving nature had limits and she would have to vaporize him if he was caught again.\nWhen it was time to begin the auction, Xrexus resumed her position atop a platform with her droidekas and announced that up for auction was a Jedi Padawan for the winner to ransom, maim, or mutilate however they pleased. Xrexus opened the bidding at 500,000 unmarked credits, which was quickly met by a group of Kyuzo hunters. Several other bidders began raising the price, reaching 750,000 credits, then 900,000, 1 million, 1.5 million, and eventually 2 million. Jee Kra cast a bid of 2.5 million, which none of the other bidders sought to challenge. Xrexus announced Kra's bid and added that included in the purchase of Kaitis was her lightsaber, the fabled Jedi weapon. She asked for a bid of 3 million but was met with no response. After an auction chant, Xrexus confirmed Kra as the winner.\nWhile Kra was congratulated on his success, a group of bounty hunters led by Cad Bane, in league with Maul, secretly raided and killed the crew of Kra's transport. Xrexus had suspected that Maul and the \"Haddrax Gang\" would try to steal Kaitis from the winner, so she had several underlings wire a bomb and place it aboard Kra's gunship. While Xrexus held a party to console the auction's losers, Kra was killed by Maul and his bounty hunters, as she had predicted would happen. When Maul tried to escape with his coveted Jedi in Kra's ship, Xrexus had the bomb detonated, sending the gunship spiraling down to the moon of Drazkel below. Away from her guests, Xrexus stood in a private room overlooking the moon. One of her servants arrived to inform her of the ship's disablement. Drinking a glass of wine, Xrexus asked her servant to inform the remaining guests of a new venture: a hunt would begin shortly, with a buy-in of 350,000 credits.\nGathering her auction attendees back together, Xrexus informed them about the crash. She revealed that scans showed several life forms near the freighter, among them Eldra Kaitis and her captors. Xrexus told her guests that the group would prove to be a thrilling challenge for any who wanted to pursue them. Xev promoted her game as a competition for bragging rights and a trophy, with the goal being the deaths of Kaitis's abductors. Before dispatching them to take part in her game, Xrexus added that it was a pay-to-play scenario and they would have to pay to go planetside and join the hunt. Her guests eagerly paid and traveled to the moon to begin the hunt. Kaitis and Maul reluctantly teamed up to fend off the hunters. Making clean work of the oncoming criminals, Kaitis, Maul, and the bounty hunters managed to defeat a majority of the hunters looking for them.\nDisillusioned with the hunt after the bloodshed, several of the crime bosses decided to end their stay with Xrexus and began leaving the system. Watching the moon from her private suite, Xrexus was informed of the turn of events by her servants. Nervous, Xrexus asked if their payments had cleared, which they had. Xrexus was satisfied that there was no danger of losing her profits and told her servants there wasn't any harm in bloodshed, which was what the hunters had paid for. On the moon, meanwhile, Maul and Kaitis turned on each other and the Sith finally appeased his lust for vengeance against the Jedi. With Kaitis dead and Xrexus's guests fleeing the moon, Maul turned to one final debt he had to repay.\nAlone in her private suite, Xrexus ordered more Corellian wine over her comm, but received no response from any of her servants. Irritated, she yelled over her comm for anyone to reply to her demand, but the only response she got was from Maul, who had entered the room. Maul revealed that her servants had all been killed. Seemingly at peace with her fate, Xrexus commented that, had she known she would have had such little time left, she would have ordered a better vintage wine. She finished her glass and despondently asked Maul if she could barter for her life, offering him money in exchange for letting her live. Maul, however, told her that money was useless to him. Setting her glass down at the table beside her, Xrexus asked if his goal was vengeance for Kaitis and rhetorically asked if it was what his kind traded in. She recognized Maul as a Sith and told him that she knew what he was, though she believed they had died out long ago. Maul waited for her to say the word, giving him a reason to strike. Xrexus closed her eyes and said the word \"Sith,\" and Maul struck the Boss-Mistress down with his lightsaber.\nThough Maul tried to keep his actions at Xrexus' auction a secret from his Sith master, Darth Sidious, Sidious knew of what he had done and commended him for it. To cover his apprentice's tracks, Darth Sidious, under his public alias as Supreme Chancellor Sheev Palpatine of the Republic, issued a secret order from the Office of the Chancellor that classified information relating to Xrexus's auction, including the death of Jee Kra at Maul's hands. The fate of Xev Xrexus and Eldra Kaitis were a mystery to all but the two Sith Lords. By 29 BBY, the Xrexus Cartel had disappeared altogether, adding to the mystery of their fates.\nThe events of Xrexus's auction became a cold case for Republic law enforcement, who could not solve the mystery of what had happened. Coruscant Security Force Inspector Divo led a failed investigation into the auction, and in his files referred to the case as a \"maddening dead end.\" All that was known, according to Divo's files and a seized invitation to the auction, was that the Xrexus held an auction and both she and her cartel had \"vanished as if gobbled up by a black hole.\" Xrexus's disappearance was never reported to any other agencies, and the Jedi had no record of what had happened to her or Kaitis. The disappearance of Xrexus and her cartel remained a cold case until 19 BBY, when the Republic's successor state, the Galactic Empire, detained KRONOS-841, a member of the Droid Gotra.\nKRONOS-841 had been present at Xrexus's auction over a decade prior. Divo oversaw the interrogation of the droid, who in return for leniency offered up numerous data memories to the inspector. Among KRONOS's sequestered memories were several pertinent to the Xrexus case, which after being reconstructed revealed images of Xrexus's auction. Through KRONOS's data, Divo and the CSF pieced together that Xrexus was auctioning Jedi Padawan Eldra Kaitis, who was won by industrialist Jee Kra for 2.5 million credits. KRONOS's evidence ended there, though additional research by Divo found that Kra had been killed in a shuttle crash beyond Republic borders. Divo's attempts to look into Kra's death were hindered by Supreme Chancellor Palpatine's old order classifying information on the subject. With no further leads, Divo came to the conclusion that Kaitis had been killed and that Xrexus's disappearance was somehow related to the Jedi, who by the time of his investigation had been wiped out.\nYears after the fall of the Empire and the rise of the New Republic following the Galactic Civil War, Exantor Divo, the grandson of the late Tan Divo and the police commissioner on Hosnian Prime, was gifted his grandfather's old case files, which had been long thought lost during the Clone Wars. Compiling three generations' worth of case files on criminal activity across the galaxy, Exantor published Scum and Villainy: Case Files on the Galaxy's Most Notorious. Among the files featured in the compilation was Tan Divo's cold case on Xrexus and her auction, which Exantor provided context to in his writings. Included in the file was the recreated data memory of the auction from KRONOS-841, as well as the invitation seized by Tan.\nXev Xrexus was a human female with short blonde hair, sideswept to the right with tips colored a gradient of pink and orange hues. A stylish and elegant woman, Xrexus enjoyed finery such as vintage wines and lived an opulent lifestyle. Though sophisticated as such, Xrexus commiserated with the criminal element and had no qualms with dealing outside the borders of legality. Xrexus was a pragmatic leader and was quick to adjust her plans to the current situation. When she encountered Maul in her stronghold, she opted not to penalize him but made sure to threaten his life as insurance that he would not wander off again. Savvy to the possibilities and twists her auction could take, she took the preemptive decision to wire Jee Kra's ship to explode, rightly assuming that Maul and his allies would try to steal Kaitis for themselves. Xrexus turned the situation to her advantage and extorted her guests for a chance to hunt Kaitis and Maul down, in turn both eliminating them and profiting off of it.\nMaul and Kaitis proved to be more than a match for her guests and Xrexus became nervous about what would happen next. Though at first concerned about the bloodshed on the moon below, she dismissed the massacre once she was ensured that her profits were safe. Knowing that her time may be limited, Xrexus became irritable and demanding with her servants. When confronted by Maul, Xrexus made peace with her impending death and joked that she would have ordered a better wine had she known how quick her death would come. She attempted half-heartedly to barter for her life, but with her last words gave a sharpened rebuke of the Sith, guaranteeing her murder moments later.\nAs a leading black marketeer of battle droids, Xev Xrexus had access to a number of droidekas, which acted as bodyguards and protection for Xrexus during her auction and when confronting Maul in front of Eldra Kaitis's cell.\nWhen conducting her auction, Xrexus wore a high-collared white vest with matching gloves, metallic red sleeves with a distinctly geometric design, and a black dress that, while tight above her knees, flared out significantly below her knees and bunched up behind her.\nXev Xrexus first appeared in Darth Maul  2, a 2017 canon comic written by Cullen Bunn and illustrated by Luke Ross.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Drazkel",
  "/wiki/32_BBY",
  "/wiki/Xev%27s_hideout",
  "/wiki/Drazkel_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Xrexus_Cartel",
  "/wiki/Galactic_Republic",
  "/wiki/Boss",
  "/wiki/Battle_droid",
  "/wiki/Jedi",
  "/wiki/Padawan",
  "/wiki/Eldra_Kaitis",
  "/wiki/Auction_of_Eldra_Kaitis",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Jee_Kra",
  "/wiki/Moon_of_Drazkel",
  "/wiki/Death",
  "/wiki/Barabel",
  "/wiki/Unidentified_Barabel_pirate",
  "/wiki/Reproduction",
  "/wiki/Mid_Rim_Territories",
  "/wiki/Outer_Rim_Territories",
  "/wiki/The_Glitch",
  "/wiki/Droid_Gotra",
  "/wiki/Coruscant",
  "/wiki/Restraining_bolt",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Inspector",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Jedi_Knight",
  "/wiki/Black_Sun",
  "/wiki/Pyke_Syndicate",
  "/wiki/Lom_Pyke",
  "/wiki/Grakkus_Jahibakti_Tingi",
  "/wiki/Hutt",
  "/wiki/Hondo_Ohnaka",
  "/wiki/Ohnaka_Gang",
  "/wiki/Moogan",
  "/wiki/Haddrex_Gang",
  "/wiki/Kyuzo",
  "/wiki/Trandoshan",
  "/wiki/Droideka",
  "/wiki/Jedi_Master",
  "/wiki/Cloak",
  "/wiki/Darth",
  "/wiki/Jedi_Order",
  "/wiki/Cad_Bane%27s_group",
  "/wiki/Cad_Bane",
  "/wiki/Wine",
  "/wiki/Corellian_wine",
  "/wiki/Darth_Maul%27s_double-bladed_lightsaber",
  "/wiki/Darth_Sidious",
  "/wiki/Supreme_Chancellor",
  "/wiki/Office_of_the_Chancellor",
  "/wiki/29_BBY",
  "/wiki/19_BBY",
  "/wiki/Galactic_Empire",
  "/wiki/KRONOS-841",
  "/wiki/Great_Jedi_Purge",
  "/wiki/New_Republic",
  "/wiki/Galactic_Civil_War",
  "/wiki/Exantor_Divo",
  "/wiki/Commissioner",
  "/wiki/Hosnian_Prime",
  "/wiki/Clone_Wars",
  "/wiki/Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Hair",
  "/wiki/Darth_Maul_(2017)_2",
  "/wiki/2017",
  "/wiki/Cullen_Bunn",
  "/wiki/Luke_Ross",
  "/wiki/Darth_Maul_(2017)_1",
  "/wiki/Darth_Maul_(2017)_3",
  "/wiki/Darth_Maul_(2017)_4",
  "/wiki/Darth_Maul_(2017)_5",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Databank_A-Z",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars:_Darth_Maul_(Marvel)",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Propaganda:_A_History_of_Persuasive_Art_in_the_Galaxy",
  "/wiki/Standard_year",
  "/wiki/Empire_Day"
 ]
}