{
 "name": "Xexus_Shev",
 "display_name": "Xexus Shev",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "11 ABY",
      "Phaeda"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Crimson Empire"
     ]
    }
   ]
  }
 ],
 "content": "Colonel Xexus Shev was an Imperial officer who, following the death of the reborn Palpatine, swore loyalty to Carnor Jax and the Imperial Interim Ruling Council.\nShev never liked the Empire, but after committing a petty crime, he was given the choice of going to the spice mines of Kessel or the Imperial Academy, and chose the latter.\nAlthough skilled at procedure, Shev was poor in discipline and attitude. As a result, Shev was placed in command of a garrison stationed on the remote world of Phaeda. Very corrupt, he established a black market operation on the world and would often ignore illegal activity in exchange for bribes, thus living easy.\nWhen he learned that Kir Kanos, sought by Carnor Jax as a traitor, had come to Phaeda to hide out from the Imperials, Shev leapt at the chance to get into Jax's good graces by capturing Kanos. However upon informing General Redd Wessel of Kanos' presence on Phaeda, Shev was ordered not to take any action against the former Imperial Royal Guardsman, lest he compromise Kanos' capture.\nNevertheless, when Shev was told by Tem Merkon that Kanos was with the Rebel faction that had dug in on Phaeda, Shev disregarded Jax's order to stand down and sent his entire army against the Rebels. Initially the battle went with Shev, until Kanos stepped in and single-handedly turned back Shev's forces.\nSometime later, Shev met Carnor Jax as he disembarked from his shuttlecraft with General Wessel and Lieutenant Blim. Shev's efforts to explain himself proved futile, and Jax removed the colonel from his command.\nColonel Shev was played by Gary Groomes for the audio drama version of Crimson Empire.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/11_ABY/Legends",
  "/wiki/Phaeda/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Crimson_Empire",
  "/wiki/Colonel/Legends",
  "/wiki/Battle_of_Onderon_(Galactic_Civil_War)",
  "/wiki/Palpatine/Legends",
  "/wiki/Carnor_Jax",
  "/wiki/Imperial_Ruling_Council/Legends#The_.22Council_of_Blood.22",
  "/wiki/Spice/Legends",
  "/wiki/Kessel/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Kir_Kanos",
  "/wiki/General/Legends",
  "/wiki/Redd_Wessel",
  "/wiki/Emperor%27s_Royal_Guard/Legends",
  "/wiki/Tem_Merkon",
  "/wiki/New_Republic/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Geff_Blim",
  "/wiki/Gary_Groomes",
  "/wiki/Crimson_Empire_(audio)",
  "/wiki/Crimson_Empire_1",
  "/wiki/Crimson_Empire_2",
  "/wiki/Crimson_Empire_4",
  "/wiki/Star_Wars_Handbook_2:_Crimson_Empire"
 ]
}