{
 "name": "Xi%27an",
 "display_name": "Xi'an",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.7 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Ranzar Malk's crew"
     ]
    }
   ]
  }
 ],
 "content": "Xi'an was a Twi'lek female mercenary from Ryloth. At some point, she worked with the Mandalorian bounty hunter Din Djarin. Xi'an later encountered Djarin once more when the two of them were hired by Ranzar Malk to rescue Qin, Xi'an's twin brother, who was imprisoned aboard the Bothan-5, a New Republic Correctional Transport. The team intended to betray Djarin and leave him for dead, but Djarin managed to escape, and trapped the members of the team inside one of the transport's cells.\nXi'an became a mercenary, and at some point, worked with her twin brother Qin, the mercenary Ranzar Malk, and the Mandalorian bounty hunter Din Djarin. One of her jobs, alongside Djarin, was on Alzoc III. At one point, Xi'an had a relationship with Djarin, but actions by Djarin led to the fallout of the group.\nAround 9 ABY, Malk formed a team of mercenaries including Xi'an, the human Migs Mayfeld, the Devaronian Burg, and the droid Q9-0 \"Zero\" to rescue Qin. Malk also called in the Mandalorian in order to use his ship, the Razor Crest, which was pre-Imperial Era and was off the Galactic Empire and New Republic grids. Xi'an went to greet Djarin while he met the rest of the team and waved a dagger at him. The team began planning their infiltration of the Bothan-5, a New Republic Correctional Transport that was holding Qin. Djarin was skeptical about getting in trouble with the New Republic but Xi'an told him that the prison ship was crewed by droids, knowing that the bounty hunter hated droids.\nAfter determining their plan, the mercenaries began traveling for the prison ship on the Razor Crest, which Zero piloted. The rest of the team sat in the cargo hold, where Djarin quarreled with Burg. Burg and Mayfeld also talked about Mandalorians and when Mayfeld mentioned Xi'an's experience with them, she asked Djarin to tell the pair about Alzoc III. When Burg tried to remove Djarin's helmet, the bounty hunter fought back and the Devaronian accidentally opened a door, revealing Grogu. Mayfeld asked if Xi'an and Djarin made it and Xi'an asked if the Bounty Hunter Code made the bounty hunter soft when he said it was a pet.\nZero announced to the rest of the team that the Razor Crest was approaching the prison ship and began maneuvering it to land on the transport unnoticed. Xi'an was frustrated that the droid did not give them a countdown. After defeating a group of N5 sentry droids, Xi'an and the rest of the team arrived in a control room where the human Lant Davan was working. He turned and pointed his blaster pistol at the group as Djarin expressed surprise at an organic worker being aboard the ship. He refused to kill Davan, resulting in a standoff with the rest of the team. As Djarin and Mayfeld argued the topic, Xi'an murdered Davan by throwing a knife into his chest.\nUpon reaching Qin's cell, Burg pushed Djarin into the cell and locked the door. The Mandalorian eventually managed to escape, however, and locked the blast doors throughout the prison ship. He incapacitated Xi'an and the other members of the gang, locking them in a prison cell, and killed Zero. Djarin would return to Malk with Qin and receive the reward for the bounty, though Malk and Qin were attacked soon after by a trio of X-wing starfighters who had traced a tracking beacon that Djarin had left on Qin.\nA purple-skinned and blue-eyed Twi'lek female from Ryloth, Xi'an was skilled with bladed weapons. She had an eccentric personality and also claimed to be capable of moving beyond old grudges and working professionally alongside a personal enemy. Xi'an had no qualms with murdering Davan, and she also betrayed Djarin along with the rest of the team.\nAthletic and agile, Xi'an was proficient with melee weapons, such as knives, and could throw them with great accuracy.\nXi'an carried several throwing knives and wore a maroon, long-sleeved shirt with brown pants and a belt.\nXi'an first appeared in Chapter 6 of the 2019 television show The Mandalorian, which aired on December 13, 2019, and was portrayed by Natalia Tena, with Katherine O'Donovan serving as a stunt double. The character was first revealed in a trailer leading up to the show's release on August 23, 2019. Xi'an shares her name with the Chinese city that notably contained the tomb of Emperor Qin.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Chapter_10:_The_Passenger",
  "/wiki/The_Mandalorian:_Allies_%26_Enemies",
  "/wiki/The_Art_of_Star_Wars:_The_Mandalorian_(Season_One)",
  "/wiki/Ryloth",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Ranzar_Malk%27s_crew",
  "/wiki/Mercenary",
  "/wiki/Mandalorian",
  "/wiki/Bounty_hunter",
  "/wiki/Din_Djarin",
  "/wiki/Ranzar_Malk",
  "/wiki/Rescue_of_Qin",
  "/wiki/Qin",
  "/wiki/Prison",
  "/wiki/Bothan-5",
  "/wiki/New_Republic_Correctional_Transport",
  "/wiki/Death",
  "/wiki/Transport",
  "/wiki/Alzoc_III",
  "/wiki/9_ABY",
  "/wiki/Human",
  "/wiki/Migs_Mayfeld",
  "/wiki/Devaronian",
  "/wiki/Burg",
  "/wiki/Droid",
  "/wiki/Q9-0",
  "/wiki/Starship",
  "/wiki/Razor_Crest",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/New_Republic",
  "/wiki/Dagger",
  "/wiki/Pilot",
  "/wiki/Helmet",
  "/wiki/Grogu",
  "/wiki/Bounty_Hunter_Code",
  "/wiki/N5_sentry_droid",
  "/wiki/Lant_Davan",
  "/wiki/Blaster_pistol",
  "/wiki/Blast_door",
  "/wiki/X-wing_starfighter",
  "/wiki/Homing_beacon",
  "/wiki/Chapter_6:_The_Prisoner",
  "/wiki/2019",
  "/wiki/The_Mandalorian",
  "/wiki/December_13",
  "/wiki/Natalia_Tena",
  "/wiki/Katherine_O%27Donovan",
  "/wiki/August_23",
  "/wiki/Category:Images_of_Xi%27an",
  "/wiki/Star_Wars:_The_Mandalorian_Junior_Novel",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Graphic_Novel",
  "/wiki/The_Mandalorian_6",
  "/wiki/The_Mandalorian:_This_is_the_Way",
  "/wiki/Star_Wars:_The_Mandalorian_Season_2_Junior_Novel",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Directing",
  "/wiki/Cast",
  "/wiki/Technology",
  "/wiki/Practical",
  "/wiki/Process",
  "/wiki/Score",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_198",
  "/wiki/Star_Wars:_The_Mandalorian_-_The_Art_%26_Imagery_Collector%27s_Edition,_Volume_Two",
  "/wiki/Matt_Lanter:_The_Animated_Anakin",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars:_The_Mandalorian_Season_One_Companion",
  "/wiki/Star_Wars:_The_Mandalorian:_Guide_to_Season_One",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Black_Series",
  "/wiki/Star_Wars_Inside_Intel:_Twi%27lek_Culture",
  "/wiki/Star_Wars:_Character_Encyclopedia,_Updated_and_Expanded_Edition",
  "/wiki/Star_Wars:_The_Mandalorian_Handbook",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/4_ABY",
  "/wiki/The_Walt_Disney_Company",
  "/wiki/February_3",
  "/wiki/2020",
  "/wiki/October_17"
 ]
}