{
 "name": "Xiaan_Amersu",
 "display_name": "Xiaan Amersu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Died",
     "values": [
      "19 BBY",
      "over Saleucami"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Blue Squadron",
      "Blue Squadron"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "J'Mikel"
     ]
    }
   ]
  }
 ],
 "content": "Xiaan Amersu was a female Rutian Twi'lek Jedi Knight who fought during the Clone Wars. She was the Padawan of J'Mikel, an Anx Jedi killed by the bounty hunter Aurra Sing.\nDiscovered to be Force-sensitive by doctors on the planet Ryloth, Amersu was taken to the Jedi Temple on Coruscant to begin training in the Jedi Order. While still in the academy, Amersu was approached by Padawan Aayla Secura who presented her with a Heart of Fire, a stone that Secura's master had given her during her training. Eventually the Twi'lek graduated from the academy and was selected by the Anx Jedi Master J'Mikel to become his Padawan. During her early years of training with him, the pair were exploring the Coruscant underworld in the Temple Precinct with Master Peerce when the three were ambushed by the bounty hunter Aurra Sing. Amersu could do nothing but watch as both Peerce and her master were slain by the bounty hunter, who only spared the young girl so that she could grow stronger in the Force to make a worthy opponent one day.\nReturning to the Temple to report the attack by Sing, the Council of Reassignment paired her with another master to continue her training. Not long after J'Mikel was killed, Amersu sought out the amnesic Jedi Quinlan Vos in one of the meditation gardens high in the Temple Ziggurat. Telling how he had kept informed on Vos's Padawan, her old friend Aayla Secura, Amersu gave Vos her Heart of Fire in hopes it would jog his memories. After years of training with her new master, Amersu passed her Trials of Knighthood and was elevated to the rank of Jedi Knight. When the Clone Wars broke out across the galaxy, Amersu dutifully took up the rank of General in the Grand Army of the Republic. As she prepared to lead her first battle, her old friend Jedi Secura approached her and returned Master J'Mikel's lightsaber to Amersu; Sing had taken the weapon as a trophy when she killed the Anx, and Secura had retrieved it when she arrested Sing on Devaron.\nOver the years of war Amersu developed a close relationship with fellow Jedi A'Sharad Hett. Accepting many missions together, she sobbed on his shoulder during a brief pause in the fighting on Saleucami when she learned of Councilor Oppo Rancisis' death. With the Thisspiasian's passing, Master Vos was placed in charge of coordinating the assault on the Morgukai clone army base. Leading Blue Squadron during the air battle, Jedi Amersu's interceptor sustained critical damage during the battle. Despite the urging of Jedi Hett to withdraw from the fight, Amersu directed her doomed fighter into the heart of the CIS's ion cannon and deflector shield generator, knocking out their defenses. Her death proved vital to the Republic's victory at Saleucami, though it was short lived as the Order and the Republic were overthrown by the Galactic Empire in the ensuing weeks.\nWhile attachment was strictly forbidden by the Jedi Code, Amersu and fellow Jedi A'Sharad Hett developed strong emotional ties to one another during the Clone Wars. When Amersu gave her life during the Siege of Saleucami, Hett appeared to come to terms with his loss; however, he soon fell to the dark side of the Force following the start of the Great Jedi Purge. Reappearing after more then a hundred years in hiding, Hett reemerged as Darth Krayt and the leader of a new empire of Sith. Amersu, Hett's love, still haunted his thoughts a century after her death.\nXiaan Amersu first appeared as an unnamed character in The Hunt for Aurra Sing comic, written by Timothy Truman and pencilled by Davidé Fabbri. Using the character again in Heart of Fire, writer John Ostrander and artist Jan Duursema decided to base her name on Duursema's daughter Sian. As it was Sian who had convinced Ostrander and Duursema not to kill off Aayla Secura—another Twi'lek Jedi who has since grown to be a fan favorite—early in the Star Wars: Republic comic series, Ostrander and Duursema thought it appropriate to name Xiaan Amersu after her.\nThough Amersu's skin is brown in The Hunt for Aurra Sing and Heart of Fire, in every other appearance she is turquoise.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Saleucami/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Blue_Squadron_(Galactic_Republic)/Legends",
  "/wiki/J%27Mikel",
  "/wiki/Rutian/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anx/Legends",
  "/wiki/Death/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Aurra_Sing/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Aayla_Secura/Legends",
  "/wiki/Heart_of_Fire",
  "/wiki/Jedi_Initiate_Trials",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Coruscant_underworld",
  "/wiki/Temple_district",
  "/wiki/Peerce",
  "/wiki/Duel_on_Coruscant_(30_BBY)",
  "/wiki/The_Force/Legends",
  "/wiki/Council_of_Reassignment/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Jedi_Temple_Meditation_Garden",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_General/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Devaron/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Siege_of_Saleucami/Legends",
  "/wiki/Oppo_Rancisis/Legends",
  "/wiki/Thisspiasian/Legends",
  "/wiki/Morgukai",
  "/wiki/Cloning/Legends",
  "/wiki/Morgukai_Shadow_Army",
  "/wiki/Blue_Leader/Legends",
  "/wiki/Eta-2_Actis-class_interceptor",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/One_Sith",
  "/wiki/Star_Wars:_Republic:_The_Hunt_for_Aurra_Sing",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Timothy_Truman",
  "/wiki/David%C3%A9_Fabbri",
  "/wiki/Heart_of_Fire_(comic)",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars:_Republic",
  "/wiki/Category:Images_of_Xiaan_Amersu",
  "/wiki/Star_Wars_(1998)_28",
  "/wiki/Jedi:_Aayla_Secura",
  "/wiki/Republic_75",
  "/wiki/Republic_76",
  "/wiki/Republic_77",
  "/wiki/Legacy%E2%80%94War_1",
  "/wiki/Star_Wars:_The_Comics_Companion",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)",
  "/wiki/Jedi_Council_Forums",
  "/wiki/January_27",
  "/wiki/2013"
 ]
}