{
 "name": "Xiang",
 "display_name": "Xiang",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Je'daii Order"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Brock"
     ]
    }
   ]
  }
 ],
 "content": "Xiang was a Sith female Je'daii Master of Bodhi, the Temple of Arts, who served the Je'daii Order on Tython at the height of the Infinite Empire's reign.\nXiang was a Forceful Sith member of the Je'daii Order on Tython. A student of Je'daii Master Brock, Xiang would eventually go on to serve as an instructor under Brock's leadership at Bodhi Temple. During the Stargazer Uprising, Je'daii Temple Master Lha-Mi arranged a meeting with Je'daii Ranger Lanoree Brock aboard his Peacemaker-class cruiser in a remote field thirty kilometers south of Akar Kesh. Xiang was invited to attend alongside Masters Dam-Powl, Tem Madog, a Wookiee, and one other. Lha-Mi had arranged the secretive meeting to discuss the growing problem of Dalien Brock's Stargazer cult. Xiang explained to Brock that she had been chosen because of her involvement in the Hang Layden accords on Kalimahr, a successful mission to Nox, and her elimination of the leader of Wookiee dissidents on Ska Gora, Gharcanna; but also because of the fact that Dalien and Lanoree were siblings. Brock and his cult desired to leave the Tython system and planned to do so by activating a hypergate rumored to be located deep within the heart of the Old City far out in the Red Desert on the continent of Talss. Xiang and the others were fearful that Brock intended to construct a device using the ancient technology of the Gree to create dark matter that was theorized to be capable of ripping open a black hole if activated on Tython, and potentially destroy the entire system. Hoping to avoid panic by sending a larger group to find and detain Brock or worse, lead more people to support his cause, the Masters agreed a single Ranger would make for a better outcome.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Je%27daii_Order",
  "/wiki/Lanoree_Brock%27s_father",
  "/wiki/Je%27daii_Master",
  "/wiki/Bodhi",
  "/wiki/Tython/Legends",
  "/wiki/Infinite_Empire",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Stargazer_Uprising",
  "/wiki/Je%27daii_Temple_Master",
  "/wiki/Lha-Mi",
  "/wiki/Je%27daii_Ranger",
  "/wiki/Lanoree_Brock",
  "/wiki/Peacemaker-class_cruiser",
  "/wiki/Kilometer/Legends",
  "/wiki/Akar_Kesh",
  "/wiki/Dam-Powl",
  "/wiki/Tem_Madog",
  "/wiki/Wookiee/Legends",
  "/wiki/Stargazers",
  "/wiki/Hang_Layden",
  "/wiki/Kalimahr",
  "/wiki/Nox",
  "/wiki/Ska_Gora",
  "/wiki/Gharcanna",
  "/wiki/Tython_system/Legends",
  "/wiki/Hypergate",
  "/wiki/Old_City_(Tython)",
  "/wiki/Red_Desert",
  "/wiki/Talss",
  "/wiki/Gree_technology",
  "/wiki/Gree/Legends",
  "/wiki/Dark_matter/Legends",
  "/wiki/Black_hole/Legends",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void",
  "/wiki/Dawn_of_the_Jedi:_Into_the_Void_(audiobook)"
 ]
}