{
 "name": "Xion",
 "display_name": "Xion",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 4 ABY",
      "Nacronis"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "204th Imperial Fighter Wing",
      "204th Imperial Fighter Wing"
     ]
    }
   ]
  }
 ],
 "content": "Xion was a human TIE fighter pilot who flew a TIE/ln space superiority starfighter in the Galactic Empire's 204th Imperial Fighter Wing. Xion held the pilot Yrica Quell's helmet while she threw up on one occasion and also guided her during a mission to the terrestrial object Yethra. Two weeks after the Battle of Endor in 4 ABY, Xion took part in the genocide on the planet Nacronis, protecting TIE/sa bombers from the defending Rebel Alliance X-wing starfighters. The pilot died during the attack.\nDuring the time of the Galactic Empire, Xion served as a TIE fighter pilot in the Empire's 204th Imperial Fighter Wing. Shortly after the pilot Yrica Quell's graduation from an Imperial Academy, she had a moment of acute nausea. Xion held her helmet as she threw up bile. During a mission to the icy terrestrial body Yethra, Xion guided Quell, warning her of enemies attempting to pursue, after the latter was blinded by the reflection of a star from Yethra's ice sheets. At one point, the pilot speculated to Quell that the Feast of Lord-Protector Jarmanidath had been approved by the Empire's Culture Ministry by mistake and that the ministry found it too embarrassing to correct.\nTwo weeks after the Battle of Endor in 4 ABY, the 204th was assigned with the destruction of all civilization on the planet Nacronis as part of Operation: Cinder, the contingency plan that was put in place as a result of the death of the Galactic Emperor two weeks before. Xion participated, flying a TIE/ln space superiority starfighter as a part of a squadron led by Captain Nosteen with Quell as second-in-command. Xion's squadron was tasked with defending TIE/sa bombers, which were dropping vortex detonators to stoke Nacronis's siltstorms, from Rebel Alliance forces. The surface of Nacronis was subsequently devastated by siltstorms, with Xion and some of his squadron perishing while instigating this.\nQuell defected from the Empire following the genocide on Nacronis, coming to fly for the New Republic as a part of the New Republic Intelligence's Alphabet Squadron. Around 5 ABY, she mistakenly called one of her squadron mates, Nath Tensent, by Xion's name during the pursuit of an Imperial cargo shuttle. During a battle on the planet Troithe a short while later, Quell started seeing herself being guided by Xion at Yethra, mistaking the pilot Wyl Lark's voice for Xion's. She also saw visions of Xion and other comrades in the 204th while subjected to force energies from an observatory. In 11 ABY, six years after the Galactic Civil Wars conclusion, Quell brought up Xion's name when she and fellow veterans Chass na Chadic and Wyl Lark recited victims of the war during a get-together.\nXion was first mentioned in the 2019 novel Alphabet Squadron, written by Alexander Freed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/4_ABY",
  "/wiki/Nacronis",
  "/wiki/Human",
  "/wiki/Galactic_Empire",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Pilot",
  "/wiki/Yrica_Quell",
  "/wiki/Helmet",
  "/wiki/Gender",
  "/wiki/Yethra",
  "/wiki/Standard_week",
  "/wiki/Battle_of_Endor",
  "/wiki/Destruction_of_Nacronis",
  "/wiki/Planet",
  "/wiki/TIE/sa_bomber",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/X-wing_starfighter",
  "/wiki/Death",
  "/wiki/IT-O",
  "/wiki/Imperial_Era",
  "/wiki/Imperial_Academy",
  "/wiki/Water",
  "/wiki/Star",
  "/wiki/Feast_of_Lord-Protector_Jarmanidath",
  "/wiki/Culture_Ministry",
  "/wiki/Operation:_Cinder",
  "/wiki/Darth_Sidious",
  "/wiki/Squadron",
  "/wiki/Captain",
  "/wiki/Nosteen",
  "/wiki/Vortex_detonator",
  "/wiki/Siltstorm",
  "/wiki/Alliance_Military",
  "/wiki/New_Republic",
  "/wiki/New_Republic_Intelligence",
  "/wiki/Alphabet_Squadron",
  "/wiki/5_ABY",
  "/wiki/Nath_Tensent",
  "/wiki/Shuttle",
  "/wiki/Troithe_operation",
  "/wiki/Troithe",
  "/wiki/Wyl_Lark",
  "/wiki/The_Force",
  "/wiki/Unidentified_observatory",
  "/wiki/11_ABY",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Jakku",
  "/wiki/Chass_na_Chadic",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Standard_day",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_61",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Kes_Dameron",
  "/wiki/Shara_Bey",
  "/wiki/Yavin_4",
  "/wiki/Spirana",
  "/wiki/Galactic_Civil_War",
  "/wiki/Aftermath:_Empire%27s_End"
 ]
}