{
 "name": "Xodlak%27uvi%27vil",
 "display_name": "Xodlak'uvi'vil",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Xodlak family",
      "Xodlak family"
     ]
    }
   ]
  }
 ],
 "content": "Xodlak'uvi'vil, also known by the core name Lakuviv, was a Chiss male who served as a Councilor within the Chiss Ascendancy on the planet Celwis. Lakuviv was an ambitious ranking distant of the Xodlak family who sought to advance his career and attain the rank of Cousin, and to return the Great Xodlak family to the spot it had once held among the Ten Ruling Families of the Ascendancy. In his ambitions, Lakuviv inadvertently played into a scheme by the Grysk Jixtus and Haplif of the Agbui to draw the Chiss Ascendancy into a civil war.\nDuring the plot to destroy the Chiss Ascendancy, Lakuviv served as the Xodlak family Councilor for Redhill province of Celwis, headquartered at the city of Redhill. While serving there, he was approached by a Chiss mid-ager named Coduyo'po'nekri accompanied by three Agbui named Haplif, Shimkif and Frosif. The Agbui claimed to be \"cultural nomads\" hoping to learn about the culture of the Chiss. In fact, they hoped to draw the Ascendancy into a civil war. The Agbui gave Lakuviv a valuable nyix brooch, which led him to plot to acquire more of the rare metal for the Ascendancy and his Xodlak family. Lakuviv believed the nyix used in the Agbui's jewelry would lead to the Xodlak's return to the Nine Ruling Families, and his own promotion from Ranking distant to Cousin or even Blood.\nLakuviv dispatched his Senior Aide Xodlak'ji'iprip \"Lakjip\" to visit a mining settlement on a supposedly nyix-rich Agbui mining world that Haplif told them about. Upon Lakjip's return and confirmation of what she saw, Lakuviv and Lakjip plotted to claim the planet for the Xodlak family. The pair believed that acquiring the mining world for the Xodlak would enhance the Xodlak family's status enough to allow it to rejoin the Nine Ruling Families and advance their careers.\nLakuviv declared a Xodlak family emergency posing as Patriel Xodlak'oo'nifis, summoning all available Xodlak family members from the Chiss Expansionary Defense Fleet to Celwis, in an attempt to seize control of the Agbui mining world. However, the Task Force Xodlak was met with a fleet from the fellow Great Family the Pommrio family and another fleet from the Great Erighal family. The families were each allied with a Ruling Family that rivaled the other two Great Families' allied Ruling Family.\nHostilities nearly broke out between the forces of the Great Families above the Agbui mining world, until Senior Captains Irizi'in'daro and Mitth'raw'nuruodo were able to convince the Great Families' fleets to work together against a supposed threat, which was in reality a force of remote-controlled fighter craft controlled by Xodlak, Pommrio, and Erighal family members aboard Thrawn's Springhawk heavy cruiser.\nFollowing the skirmish above Hoxim, Lakuviv and Lakjiip were imprisoned for their coup against Patriel Lakooni and stripped of their titles and ranks.\nLakuviv was highly ambitious and sought to increase his standing both within the Xodlak family and the Ascendancy on the whole. He was willing to threaten Patriel Xodlak'oo'nifis at charric-point to try to seize control of a planet rich in the rare and valuable metal nyix.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Xodlak_family",
  "/wiki/Core_name",
  "/wiki/Councilor_(Chiss_Ascendancy)",
  "/wiki/Celwis",
  "/wiki/Ranking_distant",
  "/wiki/Cousin",
  "/wiki/Great_Families",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Jixtus%27s_plan",
  "/wiki/Grysk",
  "/wiki/Jixtus",
  "/wiki/Haplif",
  "/wiki/Agbui",
  "/wiki/Redhill_province",
  "/wiki/Redhill",
  "/wiki/Coduyo%27po%27nekri",
  "/wiki/Shimkif",
  "/wiki/Frosif",
  "/wiki/Nyix_brooch",
  "/wiki/Nyix",
  "/wiki/Blood_(rank)",
  "/wiki/Senior_Aide",
  "/wiki/Xodlak%27ji%27iprip",
  "/wiki/Unidentified_settlement_(Agbui)",
  "/wiki/Hoxim",
  "/wiki/Family_emergency",
  "/wiki/Patriel",
  "/wiki/Xodlak%27oo%27nifis",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Task_Force_Xodlak",
  "/wiki/Pommrio_fleet",
  "/wiki/Pommrio_family",
  "/wiki/Expeditionary_Force_Alpha",
  "/wiki/Erighal_family",
  "/wiki/Hoxim_incident",
  "/wiki/Senior_Captain",
  "/wiki/Irizi%27in%27daro",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Springhawk",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Prison",
  "/wiki/Charric",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)"
 ]
}