{
 "name": "Xodlak%27phr%27ooa",
 "display_name": "Xodlak'phr'ooa",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Glowing red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Xodlak family",
      "Xodlak family"
     ]
    }
   ]
  }
 ],
 "content": "Xodlak'phr'ooa, also known by the core name Lakphro, was a male Chiss individual who served as a rancher. Lakphro was married to Lakansu and the pair had a daughter named Lakris. The family lived in Redhill province on the planet Celwis.\nWhen the Agbui named Haplif came to Celwis with the young Chiss Coduyo'po'nekri, Redhill province's Xodlak family Councilor Lakuviv tasked Lakphro with hosting the Agbui on his homestead. Lakphro cooperated unwillingly, although his wife and daughter were much happier with the arrangement. Over time, Haplif began to flood the market of Celwis with underpriced nyix jewelry as part of a plot to bring the Chiss to civil war. Lakphro became highly suspicious of the nyix brooches Haplif began giving to officials and Lakphro's own family, perceiving them as bribes.\nEventually, Lakphro sent a brooch Haplif gave his wife to his cousin Lakbulbup and his wife Dilpram on Naporar for metallurgical analysis. Lakbulbup, whose job involved staying up-to-date with military matters, suggested they send the brooch to a Chiss officer renowned for his masterful analysis of art. That officer was the legendary Senior Captain Thrawn, who happened to be traveling with the leader of a group of refugees of the species who had manufactured the brooch. This led Thrawn and Senior Captain Irizi'in'daro to uncover Haplif's plot to destroy the Chiss Ascendancy, allowing them to foil it.\nLakphro, having grown suspicious of Haplif, confronted the alien just before the Agbui planned to leave Celwis. Haplif attempted to kill his former host, but Lakphro summoned a growzer with his lure stick, and the growzer ultimately killed Haplif.\nIn 18 BBY, an Agbui, Haplif, attempted to murder the rancher. However, the rancher used various of his tools and ultimately killed the creator of a major deception.\nLakphro had a strong sense of integrity, and hated bribery and corruption. This morality led him to become suspicious of the Agbui he hosted at his ranch.\nXodlak'phr'ooa appeared as a secondary point-of-view character in the 2021 novel Thrawn Ascendancy: Greater Good by Timothy Zahn. In that novel, Lakphro had a fairly major role in the plot.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Xodlak_family",
  "/wiki/Core_name",
  "/wiki/Farmer",
  "/wiki/Marriage",
  "/wiki/Lakansu",
  "/wiki/Lakris",
  "/wiki/Redhill_province",
  "/wiki/Planet",
  "/wiki/Celwis",
  "/wiki/Agbui",
  "/wiki/Haplif",
  "/wiki/Coduyo%27po%27nekri",
  "/wiki/Councilor_(Chiss_Ascendancy)",
  "/wiki/Xodlak%27uvi%27vil",
  "/wiki/Nyix",
  "/wiki/Jixtus%27s_plan",
  "/wiki/Nyix_brooch",
  "/wiki/Lakbulbup",
  "/wiki/Dilpram",
  "/wiki/Naporar",
  "/wiki/Chiss_Defense_Force",
  "/wiki/Chiss_officer",
  "/wiki/Art",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Magys",
  "/wiki/The_Magys%27s_people",
  "/wiki/Senior_Captain",
  "/wiki/Irizi%27in%27daro",
  "/wiki/Hoxim_incident",
  "/wiki/Death",
  "/wiki/Growzer",
  "/wiki/Lure_stick",
  "/wiki/18_BBY",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)"
 ]
}