{
 "name": "Xodlak_family",
 "display_name": "Xodlak family",
 "side_bars": [
  {
   "name": "Familial information",
   "attributes": [
    {
     "name": "Family type",
     "values": [
      "Chiss family"
     ]
    },
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Patriarch(s)",
     "values": [
      "A Patriarch"
     ]
    },
    {
     "name": "Other locations",
     "values": [
      "Xodlak family homestead",
      "Csilla",
      "Cioral",
      "Celwis",
      "Sharb"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation",
     "values": [
      "Ten Ruling Families",
      "Great Families"
     ]
    }
   ]
  }
 ],
 "content": "The Xodlak family was a Chiss family in the Chiss Ascendancy that was based on Cioral. It was formerly one of the Ten Ruling Families, but was later demoted to one of the Forty Great Families. The Xodlak family had considered the Irizi family to be its closest ally during its time as one of the Ruling Families, and the Irizi stood with them following their demotion, albeit less closely than they had prior. Xodlak'in'daro was a member of the family who held the rank of Senior Captain in the Chiss Expansionary Defense Fleet, until she received and accepted the offer to join the Irizi. The Xodlak family possessed a planetary defense fleet, which included Task Force Xodlak. The Xodlak were also allied with fellow Chiss Great Family the Coduyo family.\nMore than other prominent Chiss families, the Xodlak emphasized that all members should strive to bring \"Honor and glory to the family.\" Senior Captain Xodlak'in'daro sought to distinguish herself and her Grayshrike to bring honor and glory to the Xodlak family, of which she was a merit adoptive.\nThe Xodlak family was one of three Great Families involved in Haplif of the Agbui and Jixtus's conspiracy to draw the Chiss Ascendancy into civil war. The other two families were the Erighal family, allied with the Ruling Dasklo family; and the Pommrio family, allied with the Ruling Plikh family.\nThe Xodlak family once ranked among the Ten Ruling Families of the Chiss Ascendancy. However, they were demoted to being one of the Forty Great Families approximately fifty years before the Nikardun campaigns, placing their demotion to around 68 BBY.\nDuring the Nikardun campaigns, the Xodlak family desperately sought to rejoin the Nine Ruling Families. Their almost single-minded focus on bringing honor and glory to the Xodlak family was intended to advance that cause. They demanded all family members bring the Xodlak honor and glory, pushing that raison d'être on \"all those who bore the Xodlak name\". This pressure was particularly felt among Xodlak merit adoptives such as Lakinda, as merit adoptives always occupied a probationary rank within their Chiss family.\nThe successful acquisition of influence to the Xodlak family held promise to members of that family for social and career advancement. Councilor Lakuviv, a ranking distant of the Xodlak family, attempted to claim a supposed nyix mining world for the Xodlak, believing that doing so would lead to the Xodlak rejoining the Ruling Families and advance him personally to the rank of Cousin and perhaps higher. In this way, Lakuviv played into a scheme meant to cause a civil war in the Chiss Ascendancy in about 18 BBY.\nThe Xodlak family first appeared in the 2021 novel Thrawn Ascendancy: Greater Good, the second book of The Ascendancy Trilogy by Timothy Zahn.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Chiss_family",
  "/wiki/Chiss",
  "/wiki/Unidentified_Xodlak_Patriarch",
  "/wiki/Xodlak_family_homestead",
  "/wiki/Csilla",
  "/wiki/Cioral",
  "/wiki/Celwis",
  "/wiki/Sharb",
  "/wiki/Nine_Ruling_Families",
  "/wiki/Great_Families",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Irizi_family",
  "/wiki/Irizi%27in%27daro",
  "/wiki/Military_rank",
  "/wiki/Senior_Captain",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Xodlak_fleet",
  "/wiki/Task_Force_Xodlak",
  "/wiki/Coduyo_family",
  "/wiki/Grayshrike",
  "/wiki/Merit_adoptive",
  "/wiki/Haplif",
  "/wiki/Agbui",
  "/wiki/Jixtus",
  "/wiki/Jixtus%27s_plan",
  "/wiki/Erighal_family",
  "/wiki/Dasklo_family",
  "/wiki/Pommrio_family",
  "/wiki/Plikh_family",
  "/wiki/Standard_year",
  "/wiki/Nikardun_campaigns",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Councilor_(Chiss_Ascendancy)",
  "/wiki/Xodlak%27uvi%27vil",
  "/wiki/Ranking_distant",
  "/wiki/Hoxim",
  "/wiki/Cousin",
  "/wiki/2021",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Attack_on_the_Paataatus",
  "/wiki/18_BBY",
  "/wiki/Boadil_family",
  "/wiki/Chaf_family",
  "/wiki/Clarr_family",
  "/wiki/Mitth_family",
  "/wiki/Obbic_family",
  "/wiki/Ufsa_family",
  "/wiki/Stybla_family",
  "/wiki/Droc_family",
  "/wiki/Tahmie",
  "/wiki/Trial-born",
  "/wiki/Blood_(rank)",
  "/wiki/Chiss_Syndicure",
  "/wiki/Patriarch",
  "/wiki/Speaker_(Chiss_Ascendancy)",
  "/wiki/Syndic",
  "/wiki/Syndic_Prime",
  "/wiki/Patriel",
  "/wiki/Aristocra",
  "/wiki/Rematching",
  "/wiki/Trials",
  "/wiki/Family_emergency",
  "/wiki/Homestead"
 ]
}