{
 "name": "Xonr",
 "display_name": "Xonr",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Prior to the Battle of Hoth",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Horned species"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Left eye",
      "Right leg"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bounty Hunters' Guild"
     ]
    }
   ]
  }
 ],
 "content": "Xonr was a bounty hunter who worked for the Bounty Hunters' Guild during the Imperial Era. After the rogue cyborg bounty hunter Beilert Valance stole several bounties from Xonr, a violation of the Bounty Hunter Code, Xonr tracked Valance to BG-RT's Tavern and Spirits on the planet Coruscant in an attempt to eliminate him for his crimes against the Guild. However, Xonr was instead killed by Valance in the ensuing shootout.\nXonr became a bounty hunter and joined the Bounty Hunters' Guild, eventually acquiring multiple cybernetic replacements. At some point prior to the Battle of Hoth in 3 ABY, the cyborg bounty hunter Beilert Valance broke the Bounty Hunter Code and stole five bounties from Xonr, leading to the latter tracking Valance down in the crowded BG-RT's Tavern and Spirits cantina, within Level 1313 on the planet Coruscant. After entering the cantina, Xonr surrendered a rifle and a blaster pistol to a weapons inspection droid.\nFinding Valance drunk and slouched over a table, Xonr condemned him for stealing bounties and breaking the Code. Xonr then sat down across from Valance and aimed a blaster pistol at him, declaring that it was time for him to die. As a final insult to Valance, Xonr took his beverage and downed it when Valance asked for one last drink. At that moment, Valance revealed that he had allowed Xonr to find him, having also lured several other hunters to the same cantina. While initially alarmed by this revelation, Xonr remained confident about surviving the encounter, but Valance quickly killed his confronter by blowing Xonr's head off with his palm blaster, which started a shootout that left all of Valance's other nemeses dead as well.\nDespite considering other bounty hunters to be scum, Xonr respected the Bounty Hunter Code and denounced Beilert Valance for choosing to break the Code by stealing bounties. To that end, Xonr planned to kill Valance for his transgressions. Even upon realizing that Valance had lured several other hunters into a trap, Xonr mistakenly believed that Valance could be outsmarted, which resulted in Xonr's downfall.\nXonr belonged to a sentient horned species, and had black eyes and red skin.\nXonr had cybernetic replacements for the right leg and left eye, the latter allowing the bounty hunter to spot targets in a crowd and visually highlight selected individuals. During the confrontation with Beilert Valance on Coruscant, Xonr wore a black long-sleeved, ribbed shirt; brown pants; a brown utility belt with a large pouch; a boot on the left foot; and a brown cape and gloves.\nXonr's weaponry included two blaster pistols, an NN-14 holstered at the right hip and another pistol holstered at the chest; and the hunter also carried a rifle slung over the back. Upon entering the cantina, Xonr surrendered the rifle and chest pistol to a weapons inspection droid.\nXonr appeared in the first issue of the comic-book miniseries Star Wars: Target Vader. It was written by Robbie Thompson, illustrated by Marc Laming and Cris Bolson, and published by Marvel Comics on July 3, 2019.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Battle_of_Hoth",
  "/wiki/Coruscant",
  "/wiki/Silvasu_Fi%27s_species",
  "/wiki/Color",
  "/wiki/Eye",
  "/wiki/Limb",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/Bounty_hunter",
  "/wiki/Imperial_Era",
  "/wiki/Cyborg",
  "/wiki/Bounty",
  "/wiki/Hunting",
  "/wiki/Beilert_Valance",
  "/wiki/Thief",
  "/wiki/Bounty_Hunter_Code",
  "/wiki/BG-RT%27s_Tavern_and_Spirits",
  "/wiki/Planet",
  "/wiki/Death",
  "/wiki/Gender",
  "/wiki/Shootout_at_BG-RT%27s_Tavern_and_Spirits",
  "/wiki/Cybernetics",
  "/wiki/3_ABY",
  "/wiki/Cantina",
  "/wiki/Level_1313",
  "/wiki/Rifle",
  "/wiki/Blaster_pistol",
  "/wiki/Unidentified_weapons_inspection_droid",
  "/wiki/Blaster",
  "/wiki/Pistol",
  "/wiki/Time",
  "/wiki/Alcohol",
  "/wiki/Palm_blaster",
  "/wiki/Utility_belt",
  "/wiki/Boot",
  "/wiki/Cape",
  "/wiki/Glove",
  "/wiki/NN-14_blaster_pistol",
  "/wiki/Holster",
  "/wiki/Droid",
  "/wiki/Target_Vader_1",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Target_Vader",
  "/wiki/Robbie_Thompson",
  "/wiki/Marc_Laming",
  "/wiki/Cris_Bolson",
  "/wiki/Marvel_Comics",
  "/wiki/July_3",
  "/wiki/2019",
  "/wiki/Category:Images_of_Xonr",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}