{
 "name": "Xor",
 "display_name": "Xor",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3956 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mandalorians",
      "Mandalorian Neo-Crusaders",
      "Mandalorian Neo-Crusaders"
     ]
    }
   ]
  }
 ],
 "content": "Xor was a Twi'lek male Mandalorian slaver who fought in the Battle of Cathar prior to the Mandalorian Wars, participating in the speciecide of the Cathar people. When the Mandalorian Neo-Crusaders invaded the planet Taris twenty years later, Xor murdered a Cathar male and eventually found the Cathar's daughter, Juhani, on the auction blocks on Taris. However, Jedi forces liberated Taris before the Twi'lek could purchase her. In 3956 BBY, during the Jedi Civil War, Xor encountered Juhani—who was now a Jedi—as she was assisting the Jedi Padawan Revan during his search for the Star Forge, a Rakatan space station fueling the Sith Empire's war effort against the Galactic Republic. Shortly after that meeting, Xor and two henchmen ambushed Juhani and Revan near the latter's starship Ebon Hawk. The two Jedi defeated Xor and his allies, and the injured Twi'lek unsuccessfully attempted to goad Juhani into murdering him before he succumbed to the injuries dealt to him by Revan and the Cathar.\nXor, a Twi'lek male, was a Mandalorian slaver who lived during the time period after the Great Sith War. When the Mandalorians under the command of Cassus Fett, who orchestrated the battle, attacked the planet Cathar in 3973 BBY, Xor participated by fighting and killing many members of the local Cathar species. As he did, the Twi'lek took pleasure in the carnage, due to his hatred of the Cathar people. Although the Mandalorians nearly wiped out the Cathar, Xor sustained injuries during the battle that prevented him from participating in combat.\nTwenty years later, Xor was involved in the Mandalorian Neo-Crusaders' invasion of the planet Taris during the Mandalorian Wars. At some point after that, Xor encountered and murdered a Cathar male in the Lower City, although his wife and daughter, Juhani, were able to evade the Twi'lek. Two years later, Xor saw Juhani and attempted to buy her from the auction blocks on the world. Before he could do so, the Jedi forces under the command of the Jedi Knight Revan liberated Taris, freeing Juhani from slavery.\nIn 3956 BBY, during the Jedi Civil War between the Republic and Darth Malak's Sith Empire, Xor encountered Juhani, who was now a Jedi, as she was aiding Revan—who was formerly a Dark Lord of the Sith and was now a retrained Padawan—in his search for the Star Forge, a Rakatan space station that was fueling the Sith war effort against the Republic. During his conversation with Juhani and Revan, Xor insulted the Cathar by trying to convince Revan to sell her to him. After Revan refused and Juhani threatened to kill Xor for his actions against her people, the Twi'lek vowed to confront them again and capture Juhani.\nXor and two cronies eventually ambushed and attacked Revan and Juhani near the former's starship Ebon Hawk. However, the Twi'lek was mortally wounded by the Jedi, and his thugs were defeated. As Xor was dying, he tried to goad Juhani into striking him down, but Revan helped keep her from giving into her anger by reciting the first precept of the Jedi Code, which denied emotions and encouraged peace. Xor then died, angered that his death was ignorable.\nXor had purple skin and eyes and used a blaster rifle during combat. He hated the Cathar species and desired to eradicate or enslave them, and was among the Mandalorians who attacked the world for the pleasure of destroying it. He also viewed Cathar slaves as pets that were kept for the amusement of their owners. Although he was injured during the battle on Cathar, he continued to fight with the Mandalorians. Xor killed Juhani's father when he ran across him on Taris, and was prepared to purchase Juhani on the auction blocks during the Mandalorian occupation on Taris. When he later encountered Juhani and Revan during the Jedi Civil War, Xor talked disparagingly to Juhani and taunted her, even going so far as to ask Revan if he wished to sell her to him. After Revan and the Cathar defeated him during his attempt to capture her, Xor attempted to pressure Juhani to give in to her hatred and murder him. He also resented the Jedi for their role in hindering his acquisition of slaves during the Mandalorian Wars.\nXor was created as a minor villain by BioWare for the 2003 Xbox and PC video game Star Wars: Knights of the Old Republic. He was voiced by Neil Kaplan. In the Xbox version of Knights of the Old Republic, the character is depicted as a Human; however, he is a Twi'lek in the PC version. Some of his comments in-game seem to suggest that he was Human. However, Xor was officially canonized as a Twi'lek in 2008's Knights of the Old Republic Campaign Guide. In the game, he appears only after the player has learned all that they can about Juhani's past through conversation. If the player visited the spaceports on the planets of Tatooine, Kashyyyk, Manaan, or Korriban with Juhani in their party, Xor would confront the group. Alternatively, the player can convince Juhani to give in to her anger and kill Xor. He never appears at all if Juhani was killed on Dantooine.\nXor is the only purple, male Twi'lek, and one of only two purple Twi'leks in Knight of the Old Republic, with the other being Yuthura Ban.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/3956_BBY",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Mandalorian_Neo-Crusaders/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Battle_of_Cathar",
  "/wiki/Mandalorian_Wars",
  "/wiki/Speciecide",
  "/wiki/Cathar/Legends",
  "/wiki/Species/Legends",
  "/wiki/Taris_Siege",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/3963_BBY",
  "/wiki/Death/Legends",
  "/wiki/Juhani%27s_father",
  "/wiki/Juhani",
  "/wiki/Revanchist",
  "/wiki/Liberation_of_Taris",
  "/wiki/Jedi_Civil_War",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Star_Forge",
  "/wiki/Rakata/Legends",
  "/wiki/Space_station/Legends",
  "/wiki/Darth_Revan%27s_Sith_Empire",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Ebon_Hawk",
  "/wiki/Restoration_Period",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Cassus_Fett",
  "/wiki/Cathar_(planet)",
  "/wiki/3973_BBY",
  "/wiki/Speciesism",
  "/wiki/Lower_City",
  "/wiki/Juhani%27s_mother",
  "/wiki/3961_BBY",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Parent/Legends",
  "/wiki/BioWare",
  "/wiki/2003",
  "/wiki/Xbox",
  "/wiki/Personal_computer",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Neil_Kaplan",
  "/wiki/Human/Legends",
  "/wiki/Canon",
  "/wiki/2008",
  "/wiki/Knights_of_the_Old_Republic_Campaign_Guide",
  "/wiki/Spaceport/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Kashyyyk/Legends",
  "/wiki/Manaan/Legends",
  "/wiki/Korriban",
  "/wiki/Dantooine",
  "/wiki/Yuthura_Ban",
  "/wiki/Knights_of_the_Old_Republic:_Prima%27s_Official_Strategy_Guide"
 ]
}