{
 "name": "Xora",
 "display_name": "Xora",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Falleen"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 ABY",
      "Void Station"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Falleen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jib Kopatha"
     ]
    }
   ]
  }
 ],
 "content": "Xora was a female Falleen who was employed by the Bothan information broker Jib Kopatha during the Galactic Civil War. Her brothers and sisters were killed in 7 BBY when Darth Vader sterilized one of Falleen's major cities in the wake of an outbreak of an experimental bacterial contagion.\nShortly after the Evacuation of Yavin, she, along with several of her Falleen co-workers , attempted to assassinate Darth Vader during his visit to Void Station in revenge for his decimation of their species. As Vader was departing, Xora approached him, promising him information about the Rebels. Vader took the bait and followed her into a seemingly empty room, where he was shot by one of the other Falleen. Xora brandished a knife to strike herself, but Vader knocked her back. They were no match for the mighty Sith Lord, and Xora watched as they were quickly slain. Vader grabbed her by the throat and started choking her. As she struggled to free herself and breathe, Vader told her he didn't like being reminded of his past. Moments from death in his grip, Xora used her last words to tell the Sith Lord that he couldn't escape his past, but Vader ignored her and snapped her neck.\nXora held a deep hatred against Vader and the Galactic Empire, viewing him as a monster. Going against her species' traditions, she openly showed her emotions and acted impatiently, possibly due to the trauma of the losses Vader had caused her.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Falleen_(planet)/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/Void_Station",
  "/wiki/Falleen/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jib_Kopatha",
  "/wiki/Bothan/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Death/Legends",
  "/wiki/7_BBY/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/City/Legends",
  "/wiki/File:XoraDeath.jpg",
  "/wiki/Evacuation_of_Yavin",
  "/wiki/Zuur",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Time/Legends",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Xora",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Empire_19",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}