{
 "name": "XoXaan",
 "display_name": "XoXaan",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 6900 BBY and 17 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Black Legions",
      "Exiles",
      "Sith Empire",
      "Sith Council",
      "Sith Council"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "A'Sharad Hett"
     ]
    }
   ]
  }
 ],
 "content": "XoXaan was a humanoid female who, along with eleven other Jedi defectors, became the first Lords of the Sith. As Marchioness of the Dark Jedi's Black Legions, XoXaan fought in the cataclysmic Hundred-Year Darkness war, but was defeated and exiled from the Jedi Order following a rout on the world of Corbos in 6900 BBY. Guilty of high treason, XoXaan was one of twelve Dark Jedi who were banished from the Galactic Republic only to discover the planet Korriban, where they found and enslaved the aboriginal Sith species. Christened as the first of the Sith Lords, XoXaan and her contemporaries instituted a religion that centered around worship and practice of the dark side of the Force, and ruled their new Sith Empire as part of the Sith Council under the Dark Lord of the Sith, Ajunta Pall.\nAlthough other Sith Lords possessed similar talents, XoXaan was noted among her peers for her skills in dark side healing. She recorded her knowledge in a holocron, which was entombed with her in Korriban's Valley of the Dark Lords. Her spirit waited millennia for an individual whom she felt was worthy of her Sith teachings, and it found one such student in the ex-Jedi A'Sharad Hett around 17 BBY. From XoXaan's spirit and holocron, Hett learned the ways of the dark side and eventually assumed the mantle of Dark Lord under the moniker Darth Krayt, creating a new Sith Order. After his Sith conquered the planet Coruscant in 130 ABY, Krayt erected a massive statue within the Temple of the Sith there in reverence of XoXaan—who was considered his first and greatest Sith teacher.\nA member of the Jedi Order during the reign of the Old Republic, XoXaan was part of a group of beings within the Order who sought to further delve into the Force through exploration of its dark side. Those who espoused the new philosophy were opposed by proponents of the light side, and their disagreement broke into a war that spanned one hundred years. XoXaan commanded the Dark Jedi's Black Legions as Marchioness, and in 6900 BBY, she and the other Dark Jedi mounted a climatic battle against the Jedi Order on the Outer Rim planet Corbos.\nXoXaan fought on the surface of the world alongside fellow Dark Jedi Karness Muur and Baron Remulus Dreypa, and her Black Legions mounted a charge at the battle. Despite their efforts, with the Dark Jedi leadership's horrid creatures requiring all the strength that the Jedi could muster to defeat, the Dark Jedi forces were ultimately routed, bringing the war to an end. She survived the conflict with eleven allies, including Dreypa, Muur, Sorzus Syn, and leading High General Ajunta Pall, all of whom were convicted of high treason by the Jedi Order. With lightsaber tips pointed at their backs, the Dark Jedi, rather than being executed, were marched aboard a galleon headed beyond Republic territory; and so they were exiled into deep space, left to contemplate the error of their ways.\nPursuing rumors of an ancient Kingdom of the Sith, XoXaan and her fellow Dark Jedi, known as the Exiles, traveled into Sith Space. Along the Nache Bhelfia route, they discovered what would become the five sacred Sith worlds: Khar Delba, Krayiss, Rhelg, Ziost, and Korriban. In 6900 BBY, the Exiles arrived on the last and encountered the native Sith people.\nAfter weeks spent deciphering the native culture, they installed themselves as overlords of the Sith, with Ajunta Pall beheading the Sith ruler, Hakagram Graush, in the presence of XoXaan, Syn, and Dreypa. The Exiles were worshipped as gods known as the Jen'jidai, and Pall claimed dominion as Dark Lord of the Sith; Xoxaan, along with other Exiles, became his Shadow Hands and took up the mantle of Sith Lord, beginning the creation of the Sith Empire. At one point on Korriban, Xoxaan appeared triumphant before the Sith people beside Muur.\nAt the Sith citadel on the empire's capital world of Ziost, XoXaan joined those with ambition or ranks to make up the new Sith Council. In her lifetime, XoXaan developed her healing skills, for which she was renowned among the Sith. At one point, despite fellow Sith Lord Sorzus Syn's wish to study the Yoke of Seeming—a skin-burning armature that allowed its wearer to take on whatever appearance they desired, and one of the most powerful Sith artifacts Syn had encountered—XoXaan took the treasure for herself.\nIn her own chronicle—which was assembled into the Book of Sith by Sith Lord Darth Sidious millennia later, around 19 and 18 BBY—Syn wrote of XoXaan's stubborness while recording information about the yoke. Syn also listed Marchioness XoXaan as a prominent co-founder of the Sith, and the chronicle included an illustration of XoXaan and her contemporaries triumphant over the Sith people, as well as an illustration of them at Graush's execution. However, those illustrations erroneously showed her with white hair.\nBefore XoXaan died, she recorded much of her knowledge within a Sith holocron. The Sith ruler was laid to rest within Korriban's Valley of the Dark Lords in her own mausoleum, along with her holocron. Although her flesh had died, the woman's spirit resided within her holocron, its presence shielded from inquisitive outsiders. XoXaan was thus in waiting for an individual whom she felt had—like her—found the teachings of the light side to be lacking.\nMillennia after the Sith Empire's founding, between 2975 and 2974 BBY, the Sith tribe princess Takara Hilts inspected an image of a lightsaber duel that was carved into the ice walls of the Hall of Regret on the planet Kesh. The hall was maintained by the Doomed, a group of descendants of reconciled Jedi and Dark Jedi, and one of their members, Kaliska, retold the history of the Doomed beginning with the Battle of Corbos, listing XoXaan as one of the mighty Dark Jedi combatants there.\nXoXaan's spirit waited millennia more, until around 17 BBY, with the arrival of Jedi Master–turned–bounty hunter A'Sharad Hett on Korriban. From the depths of her tomb, having sensed Hett's presence while he tracked a bounty named Resk, XoXaan's darkness called out to Hett's own darkness after he killed his target. XoXaan's voice beckoned Hett to follow, leading him to XoXaan's resting place, where he found the door to her burial chamber. After Hett shattered it with the Force, he discovered XoXaan's holocron, which released her spirit upon activation. Sensing the darkness within the bounty hunter, the spirit of XoXaan introduced itself to Hett and offered to initiate him in the ways of the dark side, an offer he accepted.\nAs his Master, XoXaan's spirit taught Hett for years, instilling in him the traditions of the original Sith Lords and enhancing his skills through use of the dark side. However, Hett did not initially intend to fully embrace the dark side, and tried to convince himself that he could feign his status as a Sith Acolyte. He only wanted to learn enough about the dark side through XoXaan's teachings to further his own goals, which included toppling the perpetrator of the Great Jedi Purge and reigning Dark Lord of the Sith—Darth Sidious, and his apprentice, Darth Vader.\nWhen Hett completed his training under XoXaan, he exited her tomb prepared to execute his mission against Darth Sidious, only to find that a New Republic had replaced Sidious's Galactic Empire. Dejected, Hett left known space, where he was captured in the Unknown Regions and imprisoned by scouts from the extra-galactic Yuuzhan Vong species, who also tortured and implanted their slave seeds in him. Combined with XoXaan's teachings, those experiences led to his rebirth as Darth Krayt and the formation of his One Sith Order. After Krayt conquered the capital world of Coruscant in 130 ABY, he placed a gigantic statue of XoXaan—which overlooked a fiery pit and held up a luminous ball within the new Temple of the Sith—in honor of his mentor.\nBy 137 ABY, the Yuuzhan Vong implants within Krayt had ravaged his body, to the point that he felt as though his death was on the horizon. Darth Wyyrlok, Krayt's chief lieutenant, delved deep into ancient Sith lore hoping to find a way to cure his Master. He even consulted XoXaan's considerable knowledge of dark side healing for any potential secrets; however, Wyyrlok found that XoXaan's teachings proved unsatisfactory and was thus forced to search elsewhere for answers. Meanwhile, as part of former Jedi Padawan Cade Skywalker's seduction and training to become a Sith, Krayt's own apprentice, Darth Talon, taught Skywalker of how Krayt came to embrace the dark side after he met XoXaan and later the Yuuzhan Vong.\nBy that same time, XoXaan's temple on Korriban had been restored to a habitable capacity and was among other structures that were reconditioned and put to use by the One Sith. Her temple was furnished with stasis chambers and laboratories; its medical facilities would be used to rehabilitate several Sith Lords, who had all suffered grievous wounds and subsequent defeat in battle on the world Had Abbadon.\nXoXaan was a humanoid female with spindly fingers, free-flowing strands of black hair, gray eyes, and white skin. Her face sported symmetrical markings of a dark reddish-brown color, with two spots on the forehead, a pair of teardrop-like markings below the eyes, and pigments extending down from the lips and on the chin. Two streaks of pigments clung onto the humanoid's cheeks, although ornaments took the place of those markings in XoXaan's spirit form.\nOne of the first and most influencial of the Sith Lords, XoXaan was a warrior who found the way of the Jedi unsatisfying. She believed that the teachings of the Jedi were flawed and that a greater truth lay in the path of the dark side. She also felt that the galaxy was empty and that Sith-inspired rule was required to fill it. When the Dark Jedi encountered the native Sith on Korriban, XoXaan was among those who played off of their naiveté, allowing the Sith to treat them as deities.\nShe also adopted their customs, including the creation of holocrons, a secret that could be traced back to the ancient Sith king Adas. As a Sith Master, XoXaan reserved her teachings for those whom she believed had experienced her same disillusion with the Jedi Order, one who believed that the truth lay in the path of the dark side. Sorzus Syn criticized XoXaan as a stubborn individual after the latter took away a Sith artifact that Syn had intended to study.\nA Force-sensitive member of the Jedi Order who fell to the dark side of the Force, XoXaan was noted as a distinguished Dark Jedi by Syn. As with the Black Legions that she commanded during the Battle of Corbos, Marchioness XoXaan took part in lightsaber combat against the Jedi loyal to the Republic, fighting with a protosaber.\nWhile the Dark Jedi forces were defeated at Corbos, XoXaan was one of twelve who survived the ordeal. The fallen Jedi went on use the power of the dark side to conquer beings she considered inferior, such as the malleable Sith race she and her fellow Exiles enslaved on Korriban. XoXaan was well-versed in Sith lore, and stored what she knew within the recesses of her own holocron. Her knowledge included dark side healing techniques, although Darth Wyyrlok found that none of them were able to successfully remove the slave seeds from Emperor Krayt's body.\nAs a Dark Jedi battling on Corbos, XoXaan wielded a yellow-bladed protosaber and wore a modest set of black, gray, and white clothes. As a Sith Lord on Korriban, XoXaan was clothed in a flowing white dress with arm and neck wraps. She also wore an ornamental golden vambrace with three black spikes on her right arm.\nThe Sith Lord wore the same clothing in her spirit form, as did the XoXaan statue at the Temple of the Sith, albeit with a hood up. In the illustrations included in Sorzus Syn's chronicle, XoXaan was depicted as a Sith Lord on Korriban wearing a white overcoat with black linings, brandishing a red-bladed lightsaber. XoXaan eventually possessed the Yoke of Seeming, which allowed the wearer to appear as any person or object through illusion.\nXoXaan was first mentioned in the fourteenth issue of the Star Wars: Legacy series, co-written by John Ostrander and Jan Duursema and published by Dark Horse Comics on July 11, 2007. As there was no context given in the comic as to what XoXaan was—or even how the word was capitalized—questions arose on the TheForce.Net forums on who or what it meant, and what the spelling and correct pronunciation was. Duursema established that the name was capitalized as \"XoXaan\", and that the pronunciation was \"Zoh-Zaahn.\" XoXaan first appeared via holocron in a flashback sequence in Legacy's seventeenth issue, co-written by Ostrander and Duursema, illustrated by the latter, and published by Dark Horse Comics on October 31, 2007.\nWhen reviewing an illustration featured in his 2012 reference book Book of Sith: Secrets from the Dark Side, author Daniel Wallace stated that the depiction of the charge of the Black Legions at the Battle of Corbos could be a part of XoXaan's history as the Black Legions' commander.\nIn the 2011 BioWare video game, Star Wars: The Old Republic's Update 3.2, which was launched as part of the Shadow of Revan expansion in 2015, XoXaan's white outfit—complete with her golden vambrace—was introduced as a clothing item available for purchase in-game via the Cartel Market feature. Articles promoting the clothing set on the game's official website miscapitalize the Sith Lord's name as \"Xoxaan.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/6900_BBY",
  "/wiki/17_BBY/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Black_Legions",
  "/wiki/Exiles",
  "/wiki/Sith_Empire/Legends",
  "/wiki/Sith_Council",
  "/wiki/Darth_Krayt",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Marchioness",
  "/wiki/Hundred-Year_Darkness/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Battle_of_Corbos",
  "/wiki/Planet/Legends",
  "/wiki/Corbos",
  "/wiki/Treason/Legends",
  "/wiki/Discovery_of_Korriban",
  "/wiki/Korriban",
  "/wiki/Slavery/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Species/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Ajunta_Pall",
  "/wiki/Force_healing/Legends",
  "/wiki/XoXaan%27s_holocron",
  "/wiki/XoXaan%27s_tomb",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Force_ghost",
  "/wiki/Millennium/Legends",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/17_BBY",
  "/wiki/Sith_holocron/Legends",
  "/wiki/Darth/Legends",
  "/wiki/One_Sith",
  "/wiki/Battle_of_Coruscant_(Sith%E2%80%93Imperial_War)",
  "/wiki/Coruscant/Legends",
  "/wiki/130_ABY",
  "/wiki/Temple_of_the_Sith",
  "/wiki/Teacher/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Karness_Muur",
  "/wiki/Baron/Legends",
  "/wiki/Remulus_Dreypa",
  "/wiki/Sithspawn/Legends",
  "/wiki/Sorzus_Syn",
  "/wiki/High_General",
  "/wiki/Protosaber",
  "/wiki/Death/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Sith_Empire_(Pre-Republic)",
  "/wiki/Sith_Worlds",
  "/wiki/Nache_Bhelfia",
  "/wiki/Hyperlane",
  "/wiki/Khar_Delba",
  "/wiki/Krayiss_II",
  "/wiki/Rhelg/Legends",
  "/wiki/Ziost/Legends",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Standard_week/Legends",
  "/wiki/Sai_cha/Legends",
  "/wiki/Hakagram_Graush",
  "/wiki/Deity/Legends",
  "/wiki/Jen%27jidai",
  "/wiki/Shadow_Hand",
  "/wiki/Sith_Citadel_(Ziost)",
  "/wiki/Capital/Legends",
  "/wiki/Yoke_of_Seeming",
  "/wiki/Temperature/Legends",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Chronicle_of_Sorzus_Syn",
  "/wiki/Book_of_Sith",
  "/wiki/Palpatine/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/18_BBY/Legends",
  "/wiki/2975_BBY",
  "/wiki/2974_BBY",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Prince/Legends",
  "/wiki/Takara_Hilts",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Water/Legends",
  "/wiki/Hall_of_Regret",
  "/wiki/Kesh",
  "/wiki/The_Doomed",
  "/wiki/Kaliska_(S%27kytri)",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Resk",
  "/wiki/XoXaan%27s_Temple",
  "/wiki/Shatterpoint/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Sith_training",
  "/wiki/Sith_Acolyte",
  "/wiki/Great_Jedi_Purge/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Extra-galactic",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Torture/Legends",
  "/wiki/Yorik-Kul",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Fire/Legends",
  "/wiki/137_ABY",
  "/wiki/Darth_Wyyrlok_(III)",
  "/wiki/Padawan/Legends",
  "/wiki/Cade_Skywalker",
  "/wiki/Darth_Talon",
  "/wiki/Time/Legends",
  "/wiki/Battle_on_Had_Abbadon",
  "/wiki/Had_Abbadon/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/King/Legends",
  "/wiki/Adas",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Vambrace",
  "/wiki/Legacy_(2006)_14",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Dark_Horse_Comics",
  "/wiki/July_11",
  "/wiki/2007",
  "/wiki/TheForce.net",
  "/wiki/Jedi_Council_Forums",
  "/wiki/Legacy_(2006)_17",
  "/wiki/October_31",
  "/wiki/2012",
  "/wiki/Book_of_Sith:_Secrets_from_the_Dark_Side",
  "/wiki/Daniel_Wallace",
  "/wiki/2011",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Star_Wars:_The_Old_Republic:_Shadow_of_Revan",
  "/wiki/2015",
  "/wiki/Cartel_Market",
  "/wiki/Category:Images_of_XoXaan",
  "/wiki/Lost_Tribe_of_the_Sith%E2%80%94Spiral_2",
  "/wiki/Legacy_(2006)_18",
  "/wiki/Legacy_(2006)_30",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_82",
  "/wiki/Guide_to_the_Galaxy",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Duel_on_Tatooine_(Imperial_Period)",
  "/wiki/The_Life_and_Legend_of_Obi-Wan_Kenobi",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Golden_Age_of_the_Sith_3",
  "/wiki/Lost_Tribe_of_the_Sith%E2%80%94Spiral_1",
  "/wiki/Lost_Tribe_of_the_Sith:_Pandemonium",
  "/wiki/The_Essential_Atlas",
  "/wiki/Legacy_(2006)_27",
  "/wiki/Legacy_(2006)_34",
  "/wiki/Evil_Never_Dies:_The_Sith_Dynasties",
  "/wiki/Marvel_Comics",
  "/wiki/October_16",
  "/wiki/2021"
 ]
}