{
 "name": "Xufal_D%27uat",
 "display_name": "Xufal D'uat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tiss'sharl"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Tiss'shar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Xufal D'uat was a Tiss'shar bounty hunter who worked in the vicinity of the planet Elrood. From his ship, the Venom Sting, D'uat made extensive modifications to the Barloz-class freighter, adding anti-intruder sensors and safeguards as well as a pair of turret-mounted quad-laser cannons. During a mission, D'uat captured an undercover Imperial officer Hamaz. D'uat agreed to set Hamaz free after writing a contract forbidding him from hunting him down. However, three years after acquiring the ship, D'uat was caught and killed by another bounty hunter who had been sent by Hamaz himself.\nXufal D'uat was a Tiss'shar bounty hunter.\nHe bought the CEC Barloz-class freighter Harvest from the ship's previous owners, an agricultural combine in the Tion Hegemony that had saved enough to buy a YT-1300 light freighter. D'uat then renamed the ship Venom Sting and began to modify it, adapting it to his needs.\nturned one of the cabins into a magna-sealed cell with shock-filaments in the floor to administer stun charges to his prisoners. The cell's life support was also filled with null-gas canisters to knock down the prisoners. Those customizations were later applied to the whole ship.\nD'uat also added specialized technology to detect any intruder in his ship, interior defense system, an onboard fire-fighting matrix and a long-range communication array allowing him to see movement and thermal readings on his ship.\nDuring three years, D'uat operated as a bounty hunter near Elrood. At some point during this time, he captured a Rebel gunrunner who turned to be Hamaz, an officer of the Galactic Empire. D'uat holorecorded Hamaz confessing to have something to blackmail him with, and then let him go. D'uat then stored the compromising proof in a hidden compartment behind an small access panel, behind the autochef power system, in the galley; D'uat used it to hide a holorecording allowing him to blackmail Hamaz. In successive times, D'uat contacted Hamaz again to blackmail him.\nAfter three years of activity near Elrood, D'uat was murdered by another bounty hunter that had been sent by Hamaz. Hamaz intended to recover the holorecording, but he was unable to do so; the proof remained on the by-then drifting ship.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tiss%27sharl",
  "/wiki/Tiss%27shar",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Elrood/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Twi%27lek_Dancer",
  "/wiki/Barloz-class_medium_freighter",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Hamaz",
  "/wiki/Corellian_Engineering_Corporation/Legends",
  "/wiki/Agricultural_combine",
  "/wiki/Tion_Hegemony/Legends",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Magna-seal",
  "/wiki/Shock-filament",
  "/wiki/Stun_charge",
  "/wiki/Null_gas",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Holorecorder/Legends",
  "/wiki/Stock_Ships",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}