{
 "name": "Xun",
 "display_name": "Xun",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bastatha security forces"
     ]
    }
   ]
  }
 ],
 "content": "Xun was a male Nikto magistrate on the planet Bastatha in 28 ABY. Xun worked with another magistrate, Tosta. Xun was in cahoots with elements of organized crime on Bastatha, and helped lead New Republic Senator Leia Organa into a kidnapping plot when she arrived on Bastatha to investigate Rinnrivin Di's criminal empire.\nXun was a Nikto Magistrate who lived on Bastatha during the New Republic reign. In 28 ABY, Xun and his colleague Magistrate Tosta welcomed a New Republic delegation consisting of senators Leia Organa, Ransolm Casterfo, and their entourage. The delegation had been sent by the Galactic Senate to investigate the Nikto crime lord Rinnrivin Di's cartel, which maintained a presence on Bastatha. While Tosta greeted Leia, Xun greeted the young Casterfo, who was a new senator from the Centrist world of Riosa.\nXun and Tosta also took the opportunity to flatter Leia's entourage including her protocol droid C-3PO. While Tosta informed their guests that they had prepared a banquet at the grandest casino, Xun reassured senator Organa that they were trying to remarket Bastatha as an upmarket gambling destination. While Tosta poured the guests Riosan mead, Xun asked Organa whether the arrangements were to her liking. Leia reassured the Magistrate that she was happy with the arrangements and obtained permission from Tosta for her and her entourage to play sabacc with the other guests.\nDuring the banquet, Xun and Tosta chatted with Leia about the economic development on Bastatha. The two Magistrates spoke of investors but failed to identify them or their financial interests. To compensate for their evasiveness, the two flattered their guests with rhetoric about independence and less government restrictions. In secret, much of Bastatha's gambling revenue was being siphoned by Rinnrivin, who channeled the funds to the First Order, which used them to rebuild the old Imperial fleet.\nFollowing the banquet, Xun's colleague Tosta escorted Leia to a meeting with a Nikto \"business delegation.\" However, Tosta rendezvoused with Rinnrivin's henchmen, who kidnapped the senator for a secret conference with the crime lord himself. Leia managed to escape due to the help of Senator Casterfo. Following their escape, Xun apologized to Leia for the abduction and for the failure of the Bastatha security forces to capture Rinnrivin. Leia accepted his apologies but suspected that the authorities were not pursuing Rinnrivin. She also regretfully informed Xun that the New Republic had placed Bastatha under conditional probational advisory in order to monitor activity on the planet.\nXun was a Nikto Magistrate who lived on Bastatha. He and his colleague Tosta were known for flattering their guests.\nXun first appeared as a minor character in Claudia Gray's 2016 novel Bloodline. His lines are told through the point of view of the main protagonist Leia Organa.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Nikto",
  "/wiki/Gender",
  "/wiki/Bastatha_security_forces",
  "/wiki/Magistrate",
  "/wiki/Planet",
  "/wiki/Bastatha",
  "/wiki/28_ABY",
  "/wiki/Tosta",
  "/wiki/New_Republic",
  "/wiki/Senator",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Mission_to_Bastatha",
  "/wiki/Rinnrivin_Di",
  "/wiki/Rinnrivin_Di%27s_cartel",
  "/wiki/Ransolm_Casterfo",
  "/wiki/New_Republic_Senate",
  "/wiki/Crime_lord",
  "/wiki/Rinnrivin%27s_headquarters",
  "/wiki/Centrists",
  "/wiki/Riosa",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Unidentified_casino",
  "/wiki/Casino",
  "/wiki/Gambling",
  "/wiki/Riosan_mead",
  "/wiki/Sabacc",
  "/wiki/First_Order",
  "/wiki/First_Order_Navy",
  "/wiki/Claudia_Gray",
  "/wiki/2016",
  "/wiki/Bloodline_(novel)",
  "/wiki/Bloodline_(audiobook)",
  "/wiki/Del_Rey",
  "/wiki/File:New_Republic_Bloodline_Twitter_Post.jpg",
  "/wiki/Standard_year",
  "/wiki/Star_Wars:_Episode_VII_The_Force_Awakens",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY"
 ]
}