{
 "name": "Yaddle",
 "display_name": "Yaddle",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "509 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "32 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Yoda's species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "0.61 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Auburn"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green-gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Many",
      "Oppo Rancisis",
      "Oppo Rancisis"
     ]
    }
   ]
  }
 ],
 "content": "Yaddle was a Force-sensitive female being of the same species as Grand Master Yoda and Grogu. She was a Jedi Master and member of the Jedi High Council during the last years of the Galactic Republic. She trained a Thisspiasian Padawan, Oppo Rancisis, who eventually joined Yaddle on the High Council by the time of the Invasion of Naboo.\nIn 32 BBY, Qui-Gon Jinn brought the Chosen One Anakin Skywalker to the Jedi Temple on Coruscant where he met Yaddle and the Jedi elders. Following the Battle of Naboo, Yaddle pursued fellow Jedi Master Dooku after observing suspicious behavior on his part. She ended up encountering the Dark Lord of the Sith Darth Sidious, who ordered the Jedi Master to kill his colleague. Yaddle was subsequently defeated and killed by Dooku, another step on his path to the dark side.\nIn 14 BBY, Yaddle was remembered and mentioned by name by the Latero pilot Greez Dritus, who speculated on her fate during the Great Jedi Purge with his Jedi associates, unaware of Yaddle's actual deathdate. In 12 BBY, the Sith Lord Darth Vader encountered apparitions of several Jedi, including Yaddle, while experiencing a series of Force visions.\nYaddle was born in 509 BBY. A member of the same species as the legendary Jedi Yoda and Grogu, she was found to be Force-sensitive and was taken to the Jedi Temple to be trained in the ways of the Jedi. Eventually, she was promoted to the rank of Jedi Master and was given a seat on the Jedi High Council on which she remained for some time. Yaddle trained many Padawans, including the Thisspiasian Oppo Rancisis, who eventually took up a seat alongside her in the High Council. Yaddle devoted a large amount of her time on scholarly endeavors, spending a lot of time studying in the Jedi Archives. Despite this, she was also an active Jedi in the field as well.\nBy the High Republic Era, Yaddle was in charge of Jedi Initiates at the Jedi Temple. Around 231 BBY, she took a sabbatical on Kronk, but ended up returning to her duties earlier than expected upon realizing that she missed her time with the younglings. Back at the Temple, Yaddle encountered Jedi Knight Vernestra Rwoh, whom she had once taught as an initiate, while leading a group of younglings. Rwoh had recently experienced a troubling vision on the planet Tiikae, and appeared to be lost both physically and spiritually. The Mirialan commented with surprise on Yaddle's presence at the Temple, and Yaddle responded that she had heard stories of Rwoh's deeds. Rwoh said that she hoped she was living Yaddle's teachings, to which the elder Jedi chuckled before resting her hand on Rwoh's arm and instructed her not to reject her instincts. Rwoh felt a shimmer of premonition and agreed, before Yaddle pointed her in the direction of Master Stellan Gios' office, her destination. As Rwoh walked away, Yaddle returned to lecturing her class of younglings on the responsibilities of the Jedi in a changing galaxy.\nOn the eve of his becoming Master Dooku's newest Padawan, around 68 BBY, Yaddle caught a twelve-year-old Qui-Gon Jinn practicing with his lightsaber in the Temple's sparring room late at night and ordered him to go to bed.\nDuring the Invasion of Naboo in 32 BBY, Yaddle was present in the Jedi Council Chamber inside the Temple on Coruscant, when fellow Jedi Master Qui-Gon Jinn presented himself to the High Council with daunting news that the Sith, the ancient enemies of the Jedi had returned to the galaxy.\nSoon after that meeting, Master Yaddle accompanied Jinn through the Temple. Jinn noticed that many of the Jedi they passed had already heard of the news, saying as much to Yaddle. Yaddle then reasoned that it was due to the nature of Jinn's surprising statements. Dooku, who had been visiting the Temple, approached Jinn and called out to him, requesting to hear about the Sith Lord he had encountered on Tatooine. The count surmised that the council had not been eager to validate Jinn's conclusion that his assailant was a Sith Lord. When Jinn confirmed his supposition, Dooku noted that he had been warning the Council of the coming darkness for quite some time. Yaddle then interjected, stating that there was no cause for undue alarm and asserting her authority on the Council in making that statement. Dooku questioned whether she doubted Jinn's claim, to which Yaddle replied in the negative, stating that the Council had taken a stance on being cautious until they knew more. Dooku stated that Yaddle was right about one aspect in particular—a Sith Lord was not to be trifled with. Dooku emphasized his worry that he would not be around to protect Jinn any longer, while Jinn reassured him by stating that his apprentice Obi-Wan filled that role. When the turbolift arrived, Jinn left the two of them. Yaddle then asked whether things were alright with Dooku. The count simply commented on how their Padawans tended to grow very quickly, a statement that Yaddle agreed with. Dooku then took his leave and walked away.\nYaddle was later present during the evaluation of Anakin Skywalker, a nine-year-old Force-sensitive child, who Jinn believed was the Chosen One that was prophesied to bring balance to the Force. The High Council initially agreed that they would not accept him into the Jedi Order, however, they reversed their decision as Jinn's dying wish was for Skywalker to be trained.\nIn the aftermath of the Battle of Naboo, Yaddle decided to take a less active role in Jedi affairs, and stepped down from the Council.\nAfter Jinn's death on Naboo, Yaddle encountered Dooku in the Jedi Temple on Coruscant and discussed the upcoming funeral of his former apprentice. However, he stated that he would not be attending the funeral, which both surprised and raised suspicion to Yaddle as both Jedi were close friends.\nCurious as to what Dooku was up to, she followed him to The Works where she discovered him plotting with Darth Sidious in a building. Yaddle revealed herself and despite Dooku's betrayal, she offered him compassion. After a brief moment of hesitation, Dooku regretfully told Yaddle that he was afraid it was too late. Yaddle eventually engaged in a lightsaber duel with Dooku, challenging his moral stance. However, Dooku defeated her in the duel, claiming that he only wanted to bring peace and order to the galaxy. Yaddle reminded him that so many had already suffered for what he called \"order,\" but Dooku remained unmoved other than to coldly sneer that he would give her peace. The former Jedi Master then killed Yaddle with his lightsaber, an act which brought him closer to the dark side and pleased Sidious.\nYaddle's seat on the Council was taken by Jedi Master Shaak Ti.\nIn 14 BBY, while traveling in hyperspace, Greez Dritus asked if Jedi would come out of hiding if the Order was rebuilt. When Cere Junda questioned if he meant anyone specific, Dritus told her that whilst growing up on Lateron he had heard tales of a legendary green, pointy-eared Jedi Master. When Junda asked if he was speaking about Yoda, Dritus responded that he was talking about Yaddle. Cere then clarified whether he was asking about the Jedi High Council Member, something which Greez affirmed, defensively stating that Yaddle coming out of hiding was a dream of his.\nShortly after the Battle of Fortress Vader, Darth Vader entered a portal constructed by Darth Momin to resurrect his wife Padmé Amidala. While walking through visions, he encountered Yaddle along with several Jedi with their lightsabers ready to battle him. However, Vader defeated all of the illusions with Yaddle being amongst the last to fall, slashed through the chest as the words \"Let the past die\" resounded in Vader's mind.\nAt some point after the war between the First Order and the Resistance, an unknown traveler included a portrait of Yaddle in his journal of stories and sketches. When the archivists of the Graf Archive restored said journal for publication, they added their own facts and stats to its entries, including a brief, if laudatory mention of Yaddle.\nYaddle was highly sought after for her great wisdom, and was also known for her quiet demeanor, patience and kindness. She looked up to Grand Master Yoda, who belonged to the same species as her, but was nearly twice her age. Yaddle had auburn hair that she wore in a pair of long plaits, green-gold eyes, green skin and a height of 0.61 meters. She was greatly revered in the Jedi Temple, and was regarded as legendary by some of the population of the planet Lateron. Yaddle would freely give advice to former students of hers if she felt they needed it, and enjoyed teaching younglings.\nYaddle was devoted to the ideals of the Jedi and was also compassionate and forgiving, offering Dooku a chance at redemption after catching him plotting with Darth Sidious by helping bring him to justice. In her last moments, she showed sorrow and disappointment at Dooku's decision to stand with the Sith.\nWhile loyal to the Jedi cause, like Dooku, Yaddle had grown critical of the order to the point where she resigned her seat on the High Council. She believed that the Council should have listened to Dooku, and that Qui-Gon Jinn's death was unnecessary. Although she claimed that Dooku had been right about \"many things,\" Yaddle also acknowledged Dooku's fall to the dark side when she told him that he was \"running into the arms of evil.\"\nYaddle was skilled in little-known and deadly Jedi powers such as morichro, an ancient art that enabled the user to slow the opponent's bodily functions to the point of death. She utilized Form III of lightsaber combat. She was strong enough in The Force to lift massive metal hangar doors, and was able to contend, if briefly, with Count Dooku in lightsaber combat, but doing so tired her greatly possibly due to her great age.\nYaddle wore Jedi robes and wielded a green-bladed lightsaber.\nYaddle was created for the 1999 film Star Wars: Episode I The Phantom Menace, the first installment of the Star Wars prequel trilogy. Although she is not addressed by name in the film, she is identified in the credits. Her puppet was operated by Phil Eason. The model for Yaddle was originally created by concept artist Iain McCaig as a sketch for a young Yoda, but was later put in the movies as Yaddle, a female member of Yoda's species. In the animated series Star Wars: Tales of the Jedi, Yaddle was voiced by Bryce Dallas Howard.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Yaddle",
  "/wiki/Yaddle/Legends",
  "/wiki/Wookieepedia:Spoilers",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(television_series)",
  "/wiki/Padawan_(novel)",
  "/wiki/The_Sith_Lord",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/509_BBY",
  "/wiki/32_BBY",
  "/wiki/Coruscant",
  "/wiki/Yoda%27s_species",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Oppo_Rancisis",
  "/wiki/Unidentified_artist",
  "/wiki/Unidentified_artist%27s_journal",
  "/wiki/Force-sensitive",
  "/wiki/Species",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Grogu",
  "/wiki/Jedi_Master",
  "/wiki/Republic_Era",
  "/wiki/Jedi_training",
  "/wiki/Thisspiasian",
  "/wiki/Padawan",
  "/wiki/Jedi_Council",
  "/wiki/Time",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Chosen_One",
  "/wiki/Anakin_Skywalker",
  "/wiki/Imperial_Palace",
  "/wiki/Battle_of_Naboo",
  "/wiki/Dooku",
  "/wiki/Duel_in_the_Works",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Darth_Sidious",
  "/wiki/Death",
  "/wiki/14_BBY",
  "/wiki/Latero",
  "/wiki/Pilot",
  "/wiki/Greez_Dritus",
  "/wiki/Great_Jedi_Purge",
  "/wiki/12_BBY",
  "/wiki/Sith_Lord",
  "/wiki/Force_vision",
  "/wiki/Reproduction",
  "/wiki/Jedi",
  "/wiki/Jedi_Archives",
  "/wiki/High_Republic_Era",
  "/wiki/Jedi_Initiate",
  "/wiki/231_BBY",
  "/wiki/Kronk",
  "/wiki/Jedi_Knight",
  "/wiki/Vernestra_Rwoh",
  "/wiki/Youngling",
  "/wiki/Planet",
  "/wiki/Tiikae",
  "/wiki/Mirialan",
  "/wiki/Stellan_Gios",
  "/wiki/68_BBY",
  "/wiki/Standard_year",
  "/wiki/Lightsaber",
  "/wiki/Jedi_temple",
  "/wiki/Jedi_Council_Chamber",
  "/wiki/Sith",
  "/wiki/The_galaxy",
  "/wiki/Tatooine",
  "/wiki/The_Force",
  "/wiki/Naboo",
  "/wiki/The_Works",
  "/wiki/Inquisitorius_Headquarters",
  "/wiki/Lightsaber_duel",
  "/wiki/Shaak_Ti",
  "/wiki/Hyperspace",
  "/wiki/Secret_mission_to_rebuild_the_Jedi_Order",
  "/wiki/Cere_Junda",
  "/wiki/Lateron",
  "/wiki/Ear",
  "/wiki/Battle_of_Fortress_Vader",
  "/wiki/Portal",
  "/wiki/Darth_Momin",
  "/wiki/Marriage",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Ben_Solo",
  "/wiki/Brain",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Archivist",
  "/wiki/Graf_Archive",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Force_power",
  "/wiki/Morichro",
  "/wiki/Form_III",
  "/wiki/Jedi_robes",
  "/wiki/Yaddle%27s_lightsaber/Canon",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars",
  "/wiki/Prequel_trilogy",
  "/wiki/Phil_Eason",
  "/wiki/Iain_McCaig",
  "/wiki/Bryce_Dallas_Howard",
  "/wiki/The_High_Republic:_Cataclysm",
  "/wiki/The_High_Republic:_Cataclysm_(audiobook)",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/Padawan_(audiobook)",
  "/wiki/Master_%26_Apprentice",
  "/wiki/Master_%26_Apprentice_(audiobook)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/A_Different_Path",
  "/wiki/The_Prequel_Trilogy_Stories",
  "/wiki/Star_Wars_Storybook_Collection:_Star_Wars:_The_Prequel_Trilogy_Stories_and_Star_Wars:_The_Original_Trilogy_Stories",
  "/wiki/Star_Wars_Jedi:_Fallen_Order",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Images_of_Yaddle",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Journey_Through_Space_(2015)",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_I_Am_a_Jedi",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Jedi_Master%27s_Quiz",
  "/wiki/Star_Wars_Insider_172",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_46",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_77",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/A_Seat_on_the_Council",
  "/wiki/Star_Wars_Insider_199",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/StarWars.com",
  "/wiki/Databank_(website)",
  "/wiki/22_BBY",
  "/wiki/19_BBY",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Attack_on_Valo",
  "/wiki/Battle_of_Grizal",
  "/wiki/Standard_week",
  "/wiki/80_BBY",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Databank_(original)",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/Mace_Windu",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Even_Piell",
  "/wiki/Yarael_Poof",
  "/wiki/Eeth_Koth",
  "/wiki/Adi_Gallia",
  "/wiki/Depa_Billaba"
 ]
}