{
 "name": "Yael",
 "display_name": "Yael",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ord Mantell"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cathar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red-orange"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Yael was a female Cathar who lived on Ord Mantell during the Cold War between the Galactic Republic and the Sith Empire.\nA Cathar, Yael lived on Ord Mantell in Talloran village during the Great Galactic War. But during the Cold War, the Mantellian Separatist Movement began a civil war in an attempt to secede from the Republic, and separatists stormed Yael's home village of Talloran. The separatists forced the settlers out of the village, destroying many of the buildings and causing them to flee to nearby Fort Garnik.\nThe settlers camped outside of the Republic base, but their lack of supplies forced Yael to steal medical supplies from the Republic. When one of Sergeant Hurd's men fell asleep guarding Garnik's most recent medical shipment, Yael stole it and fled back to the settler's camp. But a group of separatists stole the shipment from her before she could distribute the supplies. When Hurd asked an agent of the Republic to investigate the missing supplies, they followed the guard's description of a female Cathar to Yael.\nThe Cathar forced the agent to agree to bring her back the supplies in exchange for her revealing the location of the separatists. She informed them that the separatists had retreated to Talloran, so the hero traveled to the village and retrieved the medicine from them. They returned to Yael and gave her the supplies, allowing her to treat the injured and sick settlers—including Ryso, a young human child who had asked for Yael's help before the hero had arrived.\nYael appears in the BioWare MMORPG Star Wars: The Old Republic as part of the mission \"Mercy\" on Ord Mantell. She forces the player character to bring her the supplies, and the player has the option to accept her proposal  or refuse and threaten Ryso's life . Once the player retrieves the supplies, the player can also choose to return to either Hurd or Yael.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Cathar/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Talloran_village",
  "/wiki/Great_Galactic_War",
  "/wiki/Mantellian_Separatist_Movement",
  "/wiki/Separatist_War",
  "/wiki/Fort_Garnik",
  "/wiki/Sergeant/Legends",
  "/wiki/Hurd",
  "/wiki/Ryso",
  "/wiki/Human/Legends",
  "/wiki/BioWare"
 ]
}