{
 "name": "Yag_Shushin",
 "display_name": "Yag Shushin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Yag'Dhul"
     ]
    },
    {
     "name": "Died",
     "values": [
      "31 BBY",
      "Dathomir"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Givin"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    }
   ]
  }
 ],
 "content": "Yag Shushin was a Givin male from the planet Yag'Dhul.\nAround 31 BBY Shushin crash-landed on the planet Dathomir and was enslaved by a tribe of Dathomiri Witches. The remains of his ship were modified into a subterine. In that same year a new slave arrived and the two became friends. When the slaves were attacked by a Giant Wuffa the new slave, known as Quin, slew the creature with a lightsaber. Yag Shushin was the first to realize that his new friend was a Jedi. Later on, the two were promoted to Lizard Keepers by Zalem. The task of a lizard keeper was to cut off the paws of the Kwi. The two couldn't bear to let the cruelty continue, subdued the other lizard keepers and freed all the Kwi. Afterward Quinlan asked Yag to steal a subterine.\nYag sneaked into the ship, but Ros Lai was already inside. The two rivals became allies and hurried to the camp to free the Jedi. They succeeded and together they went underground, to the Infinity Gate. They were chased, but they killed one of their pursuers. The other one fired on their cockpit and it burst into flames. Yag jumped in front of his two friends and saved them at the cost of his own life.\nYag had considerable hand-to-hand skills, defeating a lizard keeper wielding a knife unarmed, and later sneaking up on and knocking unconscious a witch standing guard over the subterine.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Yag%27Dhul/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Dathomir/Legends",
  "/wiki/Givin/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Witches_of_Dathomir",
  "/wiki/Subterine",
  "/wiki/Mission_to_Dathomir_(Post%E2%80%93Naboo_crisis)",
  "/wiki/Whuffa_worm",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Lizard_Keeper",
  "/wiki/Zalem/Legends",
  "/wiki/Kwi",
  "/wiki/Ros_Lai",
  "/wiki/Infinity_Gate",
  "/wiki/Star_Wars_(1998)_23",
  "/wiki/Star_Wars_(1998)_24",
  "/wiki/Star_Wars_(1998)_25",
  "/wiki/Star_Wars_(1998)_26",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}