{
 "name": "Yajak",
 "display_name": "Yajak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Dark"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic MilitaryTaris Resettlement Initiative",
      "Republic Military",
      "Taris Resettlement Initiative"
     ]
    }
   ]
  }
 ],
 "content": "Yajak was a Human male Commander of the Republic Military who was stationed on Taris as part of the Taris Resettlement Initiative, where he commanded Waypoint Station Morne during the Cold War.\nBy the time of the Cold War, Yajak had rose to the rank of commander in the Republic military. Brave and fiercly loyal to the Republic, Commander Yajak was in charge of Waypoint Station Morne on Taris. As Morne was one of the more distant of the Taris Resettlement Initiative's outposts, Yajak and his men were prepared to defend their base at any time from rakghouls, pirates, and scavengers.\nDuring the Cold War, Morne relied on a monthly convoy from Waypoint Station Draay to the west for supplies. But one month, the members of Morne's supply convoy deserted on their way back from Draay, leaving Morne without supplies for that month.\nDraay's Quartermaster Kahrin Wek grew concerned when they had not heard of the convoy's successful arrival at Morne. She asked a traveling hero, whom had helped her previously to expose Draay's commander Gardit's corruption, to investigate. The hero reset the sonic emitters along the path to Morne, clearing the way of rakghouls, nexu, and other wild animals.\nThe hero encountered Gilroh, Geozel, Ferdoin, and the other members of the convoy not far from Morne. Gilroh attempted to lie and say that they had stopped because of injury, but finally told the truth—they were deserting. The hero allowed them to flee, as they had served five years on a one year assignment, and told them that the hero wouldn't report them. The hero informed Commander Yajak that they had found the troopers' bodies, enabling the members of the convoy to escape without a problem. Yajak told the hero that he would send home their uniforms to their families, but thanked the hero for their help.\nCommander Yajak appears in the BioWare MMORPG Star Wars: The Old Republic, as the final part of the Taris mission \"AWOL\". The player character can choose to report the deserters to Yajak instead of letting them go free.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Military/Legends",
  "/wiki/Taris_Resettlement_Initiative",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Commander/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Border_assault_post",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Rakghoul",
  "/wiki/Pirate/Legends",
  "/wiki/Scavenger/Legends",
  "/wiki/Bomber_command_post",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Quartermaster/Legends",
  "/wiki/Kahrin_Wek",
  "/wiki/Gardit",
  "/wiki/Nexu/Legends",
  "/wiki/Gilroh",
  "/wiki/Geozel",
  "/wiki/Ferdoin",
  "/wiki/BioWare"
 ]
}