{
 "name": "Yan%C3%A9",
 "display_name": "Yané",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Naboo"
     ]
    },
    {
     "name": "Born",
     "values": [
      "By 44 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Royal House of Naboo",
      "Naboo Royal Handmaidens",
      "Naboo Royal Handmaidens",
      "Naboo resistance",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Yané, born Suyan Higin, was a human female in the service of the Royal House of Naboo. She worked as a weaver, and while she was making blankets for a hospital, Captain Quarsh Panaka recruited her to become one of the royal handmaidens in service of the Queen Padmé Amidala. When Amidala left Naboo for Coruscant, Yané and Saché stayed behind and helped the resistance to the Trade Federation's invasion. Yané often volunteered to help Naboo's orphans, and she devoted more of her time to that cause after she left Amidala's service; she fostered many children at the large house that became her and Saché's home together. The couple married around 24 BBY.\nSuyan Higin was born on Naboo prior to the Invasion of Naboo. She was a seamstress, using a loom to craft fabric and yarn into blankets. She worked in a market to sell her products and was skilled enough to dye her own yarn, embroider, and make fabric that was waterproof or even fireproof. At one point, Higin was making blankets for the Theed Hospital when she was approached by Quarsh Panaka, who was the Head of Security for the recently elected Queen Padmé Amidala. After inquiring about her skills, Panaka asked her to become one of the queen's Naboo Royal Handmaidens. Higin, eager to do good, agreed to serve.\nUpon meeting Queen Amidala and the other handmaidens, Higin was quick to notice that one of Amidala's headpieces could be remade to be lighter and more comfortable if it was made out of Karlini silk. Changing her name to Yané, she became in charge of liaising with the various palace staff. Over time, she assembled a medical profile on the queen. Yané and her fellow handmaiden Saché initially had an awkward relationship and did not want to share a bedroom; they were attracted to each other, but they were unaware that their feelings were reciprocated.\nOne night Yané and the other handmaidens snuck out of the palace with Amidala to the Theed Odeon where the band Neurotransmitter Affection were playing to meet with Harli Jafan the daughter of the planetary director of Jafan who had sent her as an ambassador in his place for a summit hosted by Queen Amidala. While there Jafan handed out glitter-lits to the handmaidens and the undercover Amidala. They were eventually recalled to the palace by Captain Panaka who had learnt of their activities from Saché who's first period had set off the blood sensor in the girls room.\nWhen the Trade Federation blockaded and eventually invaded the planet, Yané and Saché stayed behind while Queen Amidala and the other handmaidens escaped with the Jedi. Saché and Yané were captured and incarcerated in Camp Four. They began to collaborate with fellow prisoners Mariek Panaka, Sergeant Tonra, and several other guards. The two girls were tasked with finding a way to record the group's discoveries about their droid captors in order to create a plan of escape.\nYané quickly realized she could build a makeshift loom using the frame of the cot she shared with Saché and the Karlini silk from their flame-colored robes. The shredded silk was used to weave codes that the Naboo would recognize and the droids would overlook. Although the circumstances were dire, the enforced time together led Saché and Yané to confide in each other about their mutual affections.\nWhen Saché was arrested by battle droids due to her walks around camp, during which she delivered the codes Yané wove, Yané and the others could only listen while Saché screamed from the torture. The guards debated whether to attempt a rescue, both to spare Saché and to prevent their information gathering from being revealed. Yané ordered the royal guards to respect Saché's decision to endure the torture rather than break. After Saché was released, Yané helped tend to her wounds.\nYané's service as a handmaiden ended when Padmé Amidala stepped down from being queen. She and Saché planned to share a home and intended to wait until Saché finished her first term in the planetary legislative assembly before purchasing a house. Yané had often volunteered to help Naboo's orphans, children who were displaced during the Occupation, and she dreamed of being able to foster many children. When the handmaidens told Amidala about their future intentions, Yané admitted that she had already found a large house that she hoped to purchase, even though it was not on the timeline she and Saché had planned. After sharing a hologram with the group, Saché told her it was wonderful. Mariek Panaka had cousins living near the house, and she volunteered them to help Yané with getting the house furnished before the couple moved in.\nSome time after Padmé began work as a Republic senator, Yané began to foster a set of twins. On an evening that Saché made plans to host a dinner party for Amidala and their fellow former handmaidens, Yané had to cancel due to the twins falling ill. Although Saché was disappointed that Yané could not attend, she told Amidala how proud she was of Yané.\nAround 24 BBY, Yané and Saché got married. In accordance with Naboo tradition, Yané's garments incorporated her wedding fabric; her design also included Saché's fabric. Their outfits mirrored each other's and reflected their own personal tastes, with a skirt for Yané and wide-legged trousers for Saché.\nIn 22 BBY, following a mudslide in the eastern reaches of Naboo's secondary continent which destroyed an entire village Yané opened her and Saché's home to the eight child survivors. Four days later four of the children had been taken in by other family members while the remaining four, all cousins, remained in Yané's care.\nThat night, while Saché was at a meeting with the Naboo planetary legislative assembly and the four children slept in the couple's bed, Yané received a call from Amidala asking Yané for advice on how to use her wedding fabric. Yané advised her to use it in her veil before deciding to make Amidala's wedding dress for her. Yané later told her wife about who passed on her congratulations to Amidala.\nYané had brown hair, brown eyes, and light skin. As a weaver, she preferred to use a manual loom instead of a machine so she could pay close attention and have more control. Yané loved children and fostered many including a set of twinsand the eight survivors of the mudslide disaster. Yané was also clever and resourceful using what few items she had available in Camp Four to deliver messages.\nThe character of Yané was played by Candice Orwell in Star Wars: Episode I The Phantom Menace. The character's name is given in the film's closing credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Yan%C3%A9",
  "/wiki/Yan%C3%A9/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Special:Upload",
  "/wiki/Naboo",
  "/wiki/44_BBY",
  "/wiki/Human",
  "/wiki/Naboo_(people)",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Royal_House_of_Naboo",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Naboo_resistance",
  "/wiki/Galactic_Republic",
  "/wiki/Weaver",
  "/wiki/Blanket",
  "/wiki/Captain",
  "/wiki/Quarsh_Panaka",
  "/wiki/Queen",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Coruscant",
  "/wiki/Sach%C3%A9",
  "/wiki/Trade_Federation",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Time",
  "/wiki/Marriage",
  "/wiki/24_BBY",
  "/wiki/Reproduction",
  "/wiki/Theed_Hospital",
  "/wiki/Head_of_Security",
  "/wiki/Monarch_of_Naboo",
  "/wiki/Karlini_silk",
  "/wiki/Theed_Odeon",
  "/wiki/Neurotransmitter_Affection",
  "/wiki/Harli_Jafan",
  "/wiki/Harli_Jafan%27s_father",
  "/wiki/Jafan",
  "/wiki/Ambassador",
  "/wiki/Summit_on_Naboo",
  "/wiki/Glitter-lit",
  "/wiki/Menstruation",
  "/wiki/Blood_sensor",
  "/wiki/Camp_Four",
  "/wiki/Mariek_Panaka",
  "/wiki/Sergeant",
  "/wiki/Tonra",
  "/wiki/Security_Guard",
  "/wiki/OOM-series_battle_droid",
  "/wiki/Flame-colored_robes",
  "/wiki/Silk",
  "/wiki/Naboo_planetary_legislative_assembly",
  "/wiki/Yan%C3%A9_and_Sach%C3%A9%27s_house",
  "/wiki/Hologram",
  "/wiki/Twins",
  "/wiki/Wedding_of_Sach%C3%A9_and_Yan%C3%A9",
  "/wiki/Clothing",
  "/wiki/Wedding_fabric",
  "/wiki/22_BBY",
  "/wiki/Mudslide_disaster",
  "/wiki/Padm%C3%A9_Amidala%27s_wedding_dress",
  "/wiki/Candice_Orwell",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Queen%27s_Peril",
  "/wiki/Queen%27s_Peril_(audiobook)",
  "/wiki/The_Phantom_Menace_Read-Along_Storybook_and_CD",
  "/wiki/The_Prequel_Trilogy_Read-Along_Storybook_and_CD_Collection",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/The_Phantom_Menace_(Golden_Book)",
  "/wiki/Queen%27s_Shadow",
  "/wiki/Queen%27s_Shadow_(audiobook)",
  "/wiki/Queen%27s_Hope",
  "/wiki/Queen%27s_Hope_(audiobook)",
  "/wiki/Darth_Vader_(2020)_4",
  "/wiki/Darth_Vader_(2020)_24",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_54",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/StarWars.com",
  "/wiki/32_BBY",
  "/wiki/Template:QueensPerilDate",
  "/wiki/Standard_year",
  "/wiki/Clone_Wars",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}