{
 "name": "Yani",
 "display_name": "Yani",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gotal"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Team Colossus"
     ]
    }
   ]
  }
 ],
 "content": "Yani was a Gotal resident on the Colossus.\nYani was a Gotal and a citizen of the Colossus. When Neeku Vozo mistakenly believed Kazuda Xiono to be one of the best starfighter pilots in the galaxy, Yani was one of the first individuals Vozo told of Xiono's starfighter pilot expertise. Later at Aunt Z's Tavern, Yani continued spreading the rumor when the Gotal recanted it to Bolza Grool. While Yani was at Aunt Z's, a fight broke out that involved most of the cantina's patrons. When Yani fell onto the bartop during the brawl, Jooks dragged the Gotal off the bar. Yani then defended themselves from Jooks. Right before Jarek Yeager broke up the fight, an object struck Yani in the head and knocked the Gotal to the ground. Yani was present in Aunt Z's when Vozo announced Xiono would race and Z'Vk'Thkrkza began taking bets for said race.\nLater in the day, Yani was present to watch a race be won by Hype Fazon. After the race, the nearby Xiono was introduced to platform by Jak Sivrak and instructed to select a challenger to race from the Aces. Yani witnessed Xiono picked Torra Doza. Later, while fetching lunch for Flix and Orka, Vozo and Xiono passed by Yani conversing with Orthog in the Colossus marketplace. The next day Yani watched the race between Doza and Xiono. The Gotal cheered during the race.\nLater, Yani conversed with an herb vendor in the Colossus marketplace. When the Warbird gang attacked the Colossus, Yani ran through a corridor as the platform's defenses deployed.\nYani was enjoying a drink at Aunt Z's when the patrons of the cantina took noticed of Xiono traversing the outside edges of Doza Tower. Z'Vk'Thkrkza began taking bets on Xiono falling. The Gotal cheered with the others when Xiono succesfully made a daring jump.\nYani discussed a bounty placed on two children, Kel and Eila, with a Rodian in Aunt Z's tavern. When the Rodian stated the bounty was worth 20,000 credits, Yani commented that they would love to find the bounty for that reward. The Rodian theorized the children were on the other side of the galaxy, which Yani refuted that Castilon was the other side of the galaxy. The Gotal shared a laughed with the Rodian.\nYani first appeared in \"The Recruit,\" the premiere episode of Star Wars Resistance. Yani was voiced by Bobby Moynihan, who also voiced Orka in the series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Yani_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Gotal",
  "/wiki/Gender",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Color",
  "/wiki/Team_Colossus",
  "/wiki/Colossus",
  "/wiki/Neeku_Vozo",
  "/wiki/Kazuda_Xiono",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Galaxy",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Bolza_Grool",
  "/wiki/Jooks",
  "/wiki/Jarek_Yeager",
  "/wiki/Z%27Vk%27Thkrkza",
  "/wiki/Hype_Fazon",
  "/wiki/Jak_Sivrak",
  "/wiki/Ace_Squadron",
  "/wiki/Torra_Doza",
  "/wiki/Flix",
  "/wiki/Orka",
  "/wiki/Orthog",
  "/wiki/Colossus_marketplace",
  "/wiki/Race_between_Kazuda_Xiono_and_Torra_Doza",
  "/wiki/Warbird_gang",
  "/wiki/Mission_to_Doza_Tower",
  "/wiki/Doza_Tower",
  "/wiki/Kel",
  "/wiki/Eila",
  "/wiki/Rodian",
  "/wiki/Credit",
  "/wiki/Castilon",
  "/wiki/The_Recruit",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Bobby_Moynihan",
  "/wiki/The_Triple_Dark",
  "/wiki/The_High_Tower",
  "/wiki/The_Children_from_Tehar",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/The_Engineer",
  "/wiki/The_Escape",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars"
 ]
}