{
 "name": "Yantahar_Bwua%27tu",
 "display_name": "Yantahar Bwua'tu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Yantahar Bwua'tu was a male Bothan Jedi Knight who served in the New Jedi Order in 44 ABY.\nYantahar Bwua'tu was a male Bothan Force-sensitive relative of Galactic Alliance Admiral Nek Bwua'tu. By the time following the Second Galactic Civil War, he had achieved the rank of Jedi Knight in the Jedi Order. In 43.5 ABY, several Jedi began falling prey to a Force psychosis, causing tensions between the Order and the Galactic Alliance. Meanwhile, exiled Grand Master Luke Skywalker encountered a Sith Tribe. The Jedi Council wanted to send StealthXs to help him, but interim Grand Master Kenth Hamner was opposed to the action, as he feared it would start a war between the Jedi and the Galactic Alliance. Hamner was eventually relieved from duty and confined to his quarters by the other Masters, who then set the plan to launch the StealthXs in motion.\nBwua'tu, along with the Arcona Jedi Vaala Razelle, was stationed outside of the Jedi Temple hangar. Hamner escaped from his quarters and confronted Bwua'tu and Razelle, but they forbade him entry. Hamner claimed that allowing the StealthXs to launch was an act of treason against the Galactic Alliance, and—upon discovering Bwua'tu's relation to Nek Bwua'tu—attempted to use his emotions about the Admiral's recent comatose state to make him lower his guard. Hamner then attacked the two Jedi, overpowering them and knocking them unconscious. Inside the hangar, he entered into a standoff with Master Saba Sebatyne when the Jedi refused to stop the launch, and in the ensuing skirmish, Hamner was killed and the StealthXs were able to launch.\nYantahar was part of the Jedi infiltration of Coruscant after the Sith takeover. He and Yaqeel Saav'etu, a fellow Bothan Jedi, were apprehended by Galactic Alliance soldiers when suspected of smuggling spice.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/44_ABY",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Admiral/Legends",
  "/wiki/Nek_Bwua%27tu",
  "/wiki/Time/Legends",
  "/wiki/Second_Galactic_Civil_War",
  "/wiki/43_ABY",
  "/wiki/Jedi/Legends",
  "/wiki/Force_psychosis",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Jedi_High_Council_(New_Jedi_Order)",
  "/wiki/StealthX",
  "/wiki/Kenth_Hamner",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Arcona/Legends",
  "/wiki/Vaala_Razelle",
  "/wiki/New_Jedi_Temple",
  "/wiki/Jedi_Temple",
  "/wiki/Treason/Legends",
  "/wiki/Saba_Sebatyne",
  "/wiki/Skirmish_in_the_Operations_Hangar",
  "/wiki/Death/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Yaqeel_Saav%27etu",
  "/wiki/Smuggler/Legends",
  "/wiki/Spice/Legends",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)"
 ]
}