{
 "name": "Yarael_Poof",
 "display_name": "Yarael Poof",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Quermia"
     ]
    },
    {
     "name": "Born",
     "values": [
      "By 232 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "c. 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Quermian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "2.64 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pasty white"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Yarael Poof was a male Quermian Jedi Master who served on the Jedi High Council during the High Republic Era through to the final years of the Galactic Republic. He was both an expert practitioner of Jedi mind tricks and illusions and a skilled diplomat and teacher. Following the Great Hyperspace Disaster, Poof was enlisted by Chancellor Lina Soh to help determine the cause of the incident and prevent it from happening again. After the seeming destruction of the Nihil marauders that had been manipulated into causing the disaster by Marchion Ro, he accompanied Soh to the opening of Starlight Beacon. Two centuries later, Poof witnessed the reemergence of the Jedi's ancient enemy, the Sith, and the discovery of the Chosen One, Anakin Skywalker, who was prophesied to bring balance to the Force. He perished on a mission shortly before the beginning of the Clone Wars and was replaced on the Council by the Vurk Jedi Master Coleman Trebor.\nOriginally from the Outer Rim world of Quermia, the male Quermian Yarael Poof was a revered Jedi Master who, by the year 232 BBY, had become a member of the Jedi High Council, the ruling body of the Jedi Order. A celebrated diplomat and teacher, he was among those summoned by Supreme Chancellor Lina Soh to Monument Plaza, a green space located on the Galactic Republic's capital world of Coruscant, in the aftermath of the Great Hyperspace Disaster. There, Poof informed the Chancellor that the Council did not believe the event was the result of direct action by Force users. While he clarified that the Jedi were not all-knowing, Poof asserted that there was no evidence of that being the case, a claim supported by fellow Council member Jora Malli. Soh assigned everyone present at the meeting, including Poof, to determine the cause of the disaster and prevent it from happening again. The Council then assigned Master Avar Kriss to lead the Jedi response to the Emergences, a series of events that occurred in the aftermath of the Great Disaster throughout the Outer Rim.\nPoof was later present at a Council meeting to discuss Soh's request for the Jedi to work with the Republic Defense Coalition to hunt down and imprison or destroy the Nihil, a group of Outer Rim-based marauders that had been unknowingly manipulated into causing the Great Disaster by the Eye of the Nihil, Marchion Ro. Poof refuted fellow Council member Rana Kant's claim that the galaxy was far from being at war and expressed his belief that the Jedi were the guardians of two ideals that sometimes came into conflict: justice and peace. Ultimately, the Council voted to grant the Chancellor's request for Jedi aid. After the Nihil were believed destroyed with their defeat at the Battle of Kur, Poof accompanied Soh to the dedication of Starlight Beacon, a space station located in the center of the Outer Rim's dark zones to assist with navigation through the dangerous and difficult to navigate area of space.\nNearly a year afterwards, Poof participated by hologram in a High Council meeting after a devastating Nihil attack on the Republic Fair on the planet Valo. When Grand Master Pra-Tre Veter noted that Master Kriss was engaged in battle against the Drengir on Mulita, Master Teri Rosason criticized her for thinking she could do what she wanted. Poof countered that Kriss was operating within the parameters the Council had afforded her, and Adampo added that she was acting in direct response to the Chancellor's request. The Quermian further commented that no one, including Kriss, had known what was occurring on Valo until the journalist Rhil Dairo had managed to get a distress signal out.\nIn 231 BBY, Poof was present during a meeting in Jedi Master Stellan Gios' meeting chambers, in which both Jedi Masters and four senators questioned Jedi Master Cohmac Vitus and Padawan Reath Silas regarding an incident on the Amaxine space station. As the group finished their initial questioning of Vitus, Poof left the room alongside the senators.\nIn 230 BBY, Poof attended the Eiram celebration—which celebrated the Starlight Beacon's arrival to the planet Eiram in order to assist with its recovery following a hemisphere-wide storm—via hologram and watched the festivities.\nFollowing the destruction of Starlight Beacon that same year, Poof attended a meeting in the Chancellor's office alongside Supreme Chancellor Lina Soh, admiral Pevel Kronara, senator Izzet Noor, aide Norel Quo, and Jedi Master Pra-Tre Veter, as well as multiple other individuals, regarding the identity of Eye of the Nihil Marchion Ro and what further action they could take. Poof informed Soh that the Jedi Order was still evaluating the scope of the losses on Starlight Beacon, and expressed hope that some of those unaccounted for had survived, while also recounting the deaths of Jedi Masters Nib Assek and Stellan Gios. Noor then provoked Poof and Veter, revealing their recall of the Jedi Order to Coruscant. The Jedi Masters confirmed Noor's claim, while explaining that they had executed the recall out of prudence, hoping to prevent more Jedi deaths at the hands of the Nihil's creatures known as the Nameless.\nPoof was present when the Council discussed the outcome of Padawan Cere Junda's and Jedi Master Eno Cordova's mission to Nameel. The Council realized that Junda had been provoked during the battle and erupted chaos. As a result, the Council briefed the duo on their assignment to help the Daa Corporation explore a recently uncovered temple on the planet Ontotho. When Cordova asked if it was a Jedi temple, the Quermian explained that, while the temple was not thought to be Jedi in origin but Ontothon, they were being sent in place of a division of Republic troops that had been redirected to help with evacuations in the Bunka system when its star began to collapse.\nShortly before the Battle of Naboo in 32 BBY, by which point he was the most senior of the four Quermians enrolled in the order, Poof was in attendance when Jedi Master Qui-Gon Jinn came before the Council with news that the Sith, the ancient enemies of the Jedi Order, had resurfaced. He later observed Jedi Master Mace Windu evaluate the Force abilities of Anakin Skywalker, a nine-year-old boy from the planet Tatooine whom Jinn had discovered to be Force-sensitive and believed to be the Chosen One, a being who was prophesied to bring balance to the Force. Although the child was strong in the Force, the Council denied Skywalker entrance into the Order as they found his deep emotional attachments troubling and believed that he was too old for training. The Council reversed their decision, however, after Jinn was slain by the Sith Lord Darth Maul on Naboo, allowing Skywalker to become the Padawan of Jinn's former apprentice Obi-Wan Kenobi, per Jinn's dying wish.\nPoof sat on the council until he perished on a mission shortly before the beginning of the Clone Wars in 22 BBY. He was replaced on the Council by the Vurk Jedi Master Coleman Trebor. Around 12 BBY, shortly after the Battle of Fortress Vader, Darth Vader, Skywalker's Sith identity, entered a portal constructed by Darth Momin to resurrect his wife, Padmé Amidala. While walking through visions, he encountered Poof along with many Jedi with their lightsabers ready to battle him. However, Vader killed all the illusions and chopped off Poof's head as the words \"Let the past die\" resounded in his mind.\nYarael Poof was a male Quermian who stood at 2.64 meters tall and had pasty white skin and red eyes. Like other members of his species, Poof possessed two sets of arms and two brains, one in his head and the other in his chest.\nPoof was regarded as a noble thinker among the Jedi High Council. However, although appearing as a serene thinker among the Council members, Poof also had a mischievous side and enjoyed playing mind tricks on colleagues. He believed that, while there sometimes existed conflict between peace and justice, Jedi must always strive to protect both ideals.\nSkilled in teaching and diplomacy, Poof was an expert practitioner of illusions and Jedi mind tricks, which he could use to bring conflicts to a decisive end. He was also a dexterous combatant with a lightsaber and was able to perfect many incredible moves that only his spineless anatomy could allow.\nPoof carried a blue-bladed lightsaber and wore brown Jedi robes with a traditional Quermian cannom collar that concealed his second set of arms. He also possessed a comlink.\nYarael Poof first appeared in the 1999 film Star Wars: Episode I The Phantom Menace, in which he was portrayed by a puppet operated by Michelle Taylor. Although his name was never spoken in The Phantom Menace, it was given in the film's credits. Poof was originally slated to reappear in Star Wars: Episode II Attack of the Clones, but George Lucas was concerned that viewers would confuse him with the Kaminoans, a new species introduced in the film. As no new footage of the Jedi Council chambers were shot for Episode II, archive footage from Episode I was reused. In order to remove him from the film, Poof was digitally painted out of the footage and replaced by Coleman Trebor, a new Jedi Master designed for the movie. Poof appears in the non-canon 2022 video game LEGO Star Wars: The Skywalker Saga as a playable character, unlocked after completing the side quest \"Rala's Day Off.\" Though Poof is voice acted in the title, the identity of his voice actor is not credited.\nAccording to multiple sources, Poof died prior to the outbreak of the Clone Wars. Despite this, he later appeared as part of the Jedi Council in Jedi of the Republic – Mace Windu 5, a story that takes place during the aforementioned conflict. According to Matt Martin of the Lucasfilm Story Group, this was an error and the Council's composition should have been consistent with that previously seen in Jedi of the Republic – Mace Windu 1. Poof also anachronistically appears in LEGO Star Wars: The Skywalker Saga during the side quest \"Rala's Day Off\", which takes place at some point after the beginning of the Clone Wars. As the video game is non-canon, this error does not affect continuity.\nHis first name was misspelled \"Yareal\" in The High Republic: The Rising Storm.\nYarael Poof was a respected teacher, known for guiding a number of Padawans and younglings in the ways of the Force.\nAt one point following the beginning of the Clone Wars, Poof was present on Kamino, where he was looking for a bounty hunter that he hoped would assist him. When he was approached by individuals who did not hold this occupation, Poof informed them they were of no use to him and bid them a good day. When Poof met bounty hunters that refused to help, he resigned himself to staying on Kamino, and expressed his distress over having nothing to wear for casual Friday the following day. When he was finally met by a bounty hunter willing to help, Poof initially mistook them for the head researcher, but quickly realized they were not. He then informed them that he was, in fact, a renowned Jedi Master, but that the Kaminoans had mistaken him for one of their own—Rala De—who had been missing for some time. The Kaminoans put him to work despite his attempts to explain the dilemma and his true identity, believing that he was attempting to shirk responsiblity—a trait De had gained a reputation for. Fearing for the real Kaminoan worker's safety and hoping to leave, he requested that the bounty hunter investigate the situation for him.\nAs the bounty hunter searched for De, a Coruscanti human informed them that they had not seen a Kaminoan lately, but that the bounty hunter should consult Poof, who she claimed to have seen teaching a class of younglings. After traveling to the Jedi Temple, the bounty hunter found De, who was posing as Poof, claiming to be Jedi Master \"Yodel Proof.\" After the younglings realized De was not, in fact, Master Poof, he attempted to escape, forcing the bounty hunter to chase him. After the bounty hunter apprehended De and returned to Kamino, Poof refrained from inquiring about the details of De's return, while also gleefully exclaiming that he could finally leave. Poof then stated that he would relish in proving the research manager wrong, but then collected himself, stating that a Jedi was neither proud nor boastful—but that he was, in fact, leaving.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Yarael_Poof",
  "/wiki/Yarael_Poof/Legends",
  "/wiki/Quermia",
  "/wiki/232_BBY",
  "/wiki/22_BBY",
  "/wiki/Quermian",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jedi_Order",
  "/wiki/Jedi_High_Council",
  "/wiki/Galactic_Republic",
  "/wiki/Jedi_Master",
  "/wiki/High_Republic_Era",
  "/wiki/Standard_year",
  "/wiki/Jedi",
  "/wiki/Mind_trick",
  "/wiki/Diplomat",
  "/wiki/Teacher",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Battle_of_Kur",
  "/wiki/Nihil",
  "/wiki/Pirate",
  "/wiki/Marchion_Ro",
  "/wiki/Starlight_Beacon",
  "/wiki/Standard_century",
  "/wiki/Sith",
  "/wiki/Chosen_One",
  "/wiki/Anakin_Skywalker",
  "/wiki/The_Force",
  "/wiki/Death",
  "/wiki/Clone_Wars",
  "/wiki/Vurk",
  "/wiki/Coleman_Trebor",
  "/wiki/Homeworld",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Planet",
  "/wiki/Supreme_Chancellor",
  "/wiki/Monument_Plaza",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Jora_Malli",
  "/wiki/Avar_Kriss",
  "/wiki/Emergences",
  "/wiki/Republic_Defense_Coalition",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Rana_Kant",
  "/wiki/The_galaxy",
  "/wiki/Dedication_of_the_Starlight_Beacon",
  "/wiki/Space_station",
  "/wiki/Galactic_Frontier",
  "/wiki/Realspace",
  "/wiki/Hologram",
  "/wiki/Attack_on_Valo",
  "/wiki/Valo_Republic_Fair",
  "/wiki/Valo",
  "/wiki/Grand_Master",
  "/wiki/Pra-Tre_Veter",
  "/wiki/Assault_on_Mulita",
  "/wiki/Drengir",
  "/wiki/Mulita",
  "/wiki/Teri_Rosason",
  "/wiki/Adampo",
  "/wiki/Journalist",
  "/wiki/Rhil_Dairo",
  "/wiki/Distress_signal",
  "/wiki/231_BBY",
  "/wiki/Stellan_Gios",
  "/wiki/Senator",
  "/wiki/Cohmac_Vitus",
  "/wiki/Padawan",
  "/wiki/Reath_Silas",
  "/wiki/Skirmish_on_the_Amaxine_station",
  "/wiki/Amaxine_space_station",
  "/wiki/230_BBY",
  "/wiki/Eiram_celebration",
  "/wiki/Eiram",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/Emperor%27s_office",
  "/wiki/Admiral",
  "/wiki/Pevel_Kronara",
  "/wiki/Izzet_Noor",
  "/wiki/Aide",
  "/wiki/Norel_Quo",
  "/wiki/Nib_Assek",
  "/wiki/Nameless",
  "/wiki/Cere_Junda",
  "/wiki/Eno_Cordova",
  "/wiki/Nameel",
  "/wiki/Daa_Corporation",
  "/wiki/Temple_on_Ontotho",
  "/wiki/Ontotho",
  "/wiki/Jedi_temple",
  "/wiki/Division",
  "/wiki/Troop",
  "/wiki/Bunka_system",
  "/wiki/Unidentified_star_(Bunka_system)",
  "/wiki/Star",
  "/wiki/Battle_of_Naboo",
  "/wiki/32_BBY",
  "/wiki/Qui-Gon_Jinn",
  "/wiki/Mace_Windu",
  "/wiki/Tatooine",
  "/wiki/Force-sensitive",
  "/wiki/Sith_Lord",
  "/wiki/Maul",
  "/wiki/Naboo",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/12_BBY",
  "/wiki/Battle_of_Fortress_Vader",
  "/wiki/Darth",
  "/wiki/Portal",
  "/wiki/Darth_Momin",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Lightsaber",
  "/wiki/Ben_Solo",
  "/wiki/Eye",
  "/wiki/Species",
  "/wiki/Limb",
  "/wiki/Brain",
  "/wiki/Yarael_Poof%27s_lightsaber",
  "/wiki/Cannom_collar",
  "/wiki/Comlink",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Michelle_Taylor",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/George_Lucas",
  "/wiki/Kaminoan",
  "/wiki/2022",
  "/wiki/Video_game",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_5",
  "/wiki/Matt_Martin",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Jedi_of_the_Republic_%E2%80%93_Mace_Windu_1",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Youngling",
  "/wiki/Kamino",
  "/wiki/Bounty_hunter",
  "/wiki/Friday",
  "/wiki/Scientist",
  "/wiki/Rala_De",
  "/wiki/Coruscanti",
  "/wiki/Human",
  "/wiki/Imperial_Palace",
  "/wiki/Category:Images_of_Yarael_Poof",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Out_of_the_Shadows",
  "/wiki/The_High_Republic:_Out_of_the_Shadows_(audiobook)",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/The_High_Republic:_Eye_of_the_Storm_2",
  "/wiki/Star_Wars_Journeys:_The_Phantom_Menace",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars:_The_Phantom_Menace_Graphic_Novel_Adaptation",
  "/wiki/Jedi_Fallen_Order_-_Dark_Temple_1",
  "/wiki/Darth_Vader_(2017)_25",
  "/wiki/Darth_Vader_(2020)_26",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Journey_Through_Space_(2015)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Savage_Spirits",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Darth_Vader:_Sith_Lord",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Secrets_of_the_Jedi",
  "/wiki/Star_Wars:_The_Lightsaber_Collection",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Jedi_Pocket_Expert",
  "/wiki/Databank_(website)",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Reproduction",
  "/wiki/Star_Wars_(2020)_2",
  "/wiki/Battle_of_Grizal",
  "/wiki/Standard_week",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Fortress_Vader",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/34_ABY",
  "/wiki/Darth_Vader_(2017)_23",
  "/wiki/Star_Wars:_Darth_Vader_(2017)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Fortress",
  "/wiki/File:PoofDead.png",
  "/wiki/Yoda",
  "/wiki/Ephru_Shinn",
  "/wiki/Lahru",
  "/wiki/Keaton_Murag",
  "/wiki/Ada-Li_Carro",
  "/wiki/Oppo_Rancisis",
  "/wiki/Soleil_Agra",
  "/wiki/Ry_Ki_Sakka",
  "/wiki/Ki-Adi-Mundi",
  "/wiki/Plo_Koon",
  "/wiki/Saesee_Tiin",
  "/wiki/Even_Piell",
  "/wiki/Yaddle",
  "/wiki/Eeth_Koth",
  "/wiki/Adi_Gallia",
  "/wiki/Depa_Billaba"
 ]
}