{
 "name": "Yarli_Yren",
 "display_name": "Yarli Yren",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Non-binary"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Pathfinder",
      "Republic Pathfinder"
     ]
    }
   ]
  }
 ],
 "content": "Yarli Yren was a non-binary human who served as a Republic Pathfinder during the High Republic Era, around 382 BBY. They stayed at Lady Jara's boarding house in the town of Ferdan on the planet Dalna at the same time as Jedi Knight Zallah Macri and her Padawan, Kevmo Zink. Macri arrived at the boarding house first to rent rooms, and was told by Jara of Yren's presence and that they were an investigator. She subsequently passed word to Zink of the investigator's presence, advising him to tread lightly until they were aware of Yren's identity and reason for being on Dalna.\nDuring Macri and Zink's first night at the boarding house, Yren was present at the evening meal. They ignored Zink, who overlooked them, but spoke with Macri and gave her a datacard with a wanted list on it. Yren was present in the dining room the next morning, when Marda Ro, a member of the Path of the Open Hand cult that Macri and Zink were on Dalna to investigate, stopped by the boarding house to invite the Jedi to visit the Path compound. Ro took a quick glance at them, but thought them nondescript. Yren was later called away from Dalna on an investigation, before Ferdan was flooded due to heavy rains. In the aftermath of the flooding, Zink saw the wanted criminal Radicaz Dobbs at Ferdan's docking yard and recognized him due to Yren's list.\nYarli Yren had brown skin and was small in stature. They had a nondescript appearance that caused them to be easily overlooked.\nYarli Yren appeared in the 2022 young-adult novel The High Republic: Path of Deceit, written by Tessa Gratton and Justina Ireland for the Star Wars: The High Republic series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Republic",
  "/wiki/Republic_Pathfinder",
  "/wiki/High_Republic_Era",
  "/wiki/382_BBY",
  "/wiki/Ferdan",
  "/wiki/Planet",
  "/wiki/Dalna",
  "/wiki/Time",
  "/wiki/Jedi_Knight",
  "/wiki/Zallah_Macri",
  "/wiki/Padawan",
  "/wiki/Kevmo_Zink",
  "/wiki/Jara_(Theelin)",
  "/wiki/Detective",
  "/wiki/Datacard",
  "/wiki/Marda_Ro",
  "/wiki/Path_of_the_Open_Hand",
  "/wiki/Religion",
  "/wiki/Mission_to_Dalna_(Macri_and_Zink)",
  "/wiki/Jedi",
  "/wiki/Path_compound",
  "/wiki/Radicaz_Dobbs",
  "/wiki/2022",
  "/wiki/The_High_Republic:_Path_of_Deceit",
  "/wiki/Tessa_Gratton",
  "/wiki/Justina_Ireland",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_Path_of_Deceit_(audiobook)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/232_BBY",
  "/wiki/Template:LightOfTheJediDate",
  "/wiki/StarWars.com",
  "/wiki/Standard_year"
 ]
}