{
 "name": "Yarr_Gatonne",
 "display_name": "Yarr Gatonne",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bonadan"
     ]
    },
    {
     "name": "Born",
     "values": [
      "28 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.8 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Fair"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Neuro-Saav Hifold Sensory Package"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Masters",
     "values": [
      "Resh Gatonne"
     ]
    }
   ]
  }
 ],
 "content": "Yarr Gatonne was a Human male working as an independent bounty hunter in the Testarr sector during the Galactic Civil War. He had been trained by his father, Resh Gatonne, also a bounty hunter. Sophisticated and calm, Yarr Gatonne respected life and would rather deliver a living, captured acquisition than a dead one. If forced to kill, he did so quickly. His preferred approach was to use extortion and disguise to approach a target. His skills were complemented with cybernetically-improved eyesight because he had a Hifold Sensory Package in place of his right eye.\nAlthough not officially affiliated with the Galactic Empire, Gatonne accepted Imperial contracts on agents of the Alliance to Restore the Republic. During this time, he fought Rebel Airen Cracken on the planet Sestria. After the Battle of Endor, Gatonne also tracked members of the New Republic, but the New Republic Intelligence Service was unable to confirm whether the Empire was behind the contracts.\nBorn in 28 BBY on the planet Bonadan, Yarr Gatonne was the son and apprentice of Resh Gatonne, a retired bounty hunter. Yarr Gatonne was raised to use his father's unorthodox approach to understanding the environment, and he also followed Resh's footsteps by becoming a bounty hunter. At some point during his early years, he replaced his right eye with an unrecognizable cybernetic Neuro-Saav Hifold Sensory Package that improved his eyesight and other senses.\nDuring the years before the Battle of Endor, Gatonne operated mainly in the Testarr sector. He was officially an independent bounty hunter unaffiliated with the Galactic Empire, although he possessed a valid Imperial Peace-Keeping Certificate. Despite his independence, Gatonne—like many others in his position—accepted Imperial payments for jobs against agents of the Alliance to Restore the Republic. Several years prior to 7 ABY, Gatonne tracked a Rebel agent, Airen Cracken, through the Crystal spires of the banking planet Sestria. Though Cracken escaped Gatonne, the Rebel was impressed by the bounty hunter's skill.\nIn 7 ABY, Yarr Gatonne operated not only in the Testarr sector, but also in the neighboring trade zones. Gatonne accepted new contracts on engineers, diplomats and military commanders working for the New Republic. The New Republic Intelligence Service discovered Gatonne's activities and, while they could not confirm whether the Empire had sanctioned the contracts or not, they believed this was the case.\nYarr Gatonne was an obsessive individual who respected all life but regularly risked his own. Taking no sadistic pleasure when injuring others, he preferred capturing prey alive and, when the contract stipulated death, he executed the victim expeditiously. He preferred to use subterfuge and disguise, particularly when tracking members of the Alliance or the New Republic. Gatonne captured associates of his victim to question them, and then impersonated the kidnapped individual to approach the prey; but he also utilized bribery, combat and hired mercenaries.\nGatonne was calm and sophisticated, and he had a forceful presence. He was an excellent fighter and tracker, as well as a skilled pilot and a master of disguise. His ability to observe and analyze his environment were improved by his cybernetic enhancement, as were his gambling abilities. Gatonne was known to collect rare, valuable gems, sometimes accepting dangerous tasks if a valuable item of that kind was to be obtained.\nYarr Gatonne was first mentioned in Wanted by Cracken, a 1993 role-playing sourcebook for West End Games' Star Wars: The Roleplaying Game. The book was written by Louis J. Prosperi and included an image of Gatonne drawn by Mike Jackson.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Bonadan/Legends",
  "/wiki/28_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Neuro-Saav_Corporation",
  "/wiki/Hifold_Sensory_Package",
  "/wiki/Resh_Gatonne",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Testarr_sector",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Death/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Time/Legends",
  "/wiki/Airen_Cracken/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sestria",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Standard_year/Legends",
  "/wiki/Imperial_Peace-Keeping_Certificate/Legends",
  "/wiki/7_ABY/Legends",
  "/wiki/Crystal_spires",
  "/wiki/Galactic_Standard_Calendar",
  "/wiki/Engineer/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Wanted_by_Cracken_(sourcebook)",
  "/wiki/1993",
  "/wiki/Roleplaying_game",
  "/wiki/West_End_Games",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/Louis_J._Prosperi",
  "/wiki/Mike_Jackson",
  "/wiki/Galaxy_Guide_10:_Bounty_Hunters",
  "/wiki/Category:Images_of_Yarr_Gatonne",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/4_ABY/Legends"
 ]
}