{
 "name": "Yarttar",
 "display_name": "Yarttar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "2 BBY",
      "Cilare"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Whiphid"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "League of Bounty Hunters"
     ]
    }
   ]
  }
 ],
 "content": "Yarttar was a Whiphid bounty hunter who tried to collect the bounty on Connor Freeman, a Human who owed half a million credits to a powerful crimelord named Tayand. Yarttar, joined by a group of fellow bounty hunters called the League of Bounty Hunters, tracked Freeman to a bar he frequented. Chasing their bounty to a dead end, Yarttar and the group came face to face with the Mandalorian bounty hunter Boba Fett, who was also after Freeman's bounty. Fett advised them to give up the hunt but unwilling to back down, the League of Bounty Hunters engaged Fett in a fight. Amongst the League, Yarttar, and the cyborg Daquinn were the only ones to survive.\nThe two remaining members of the League tracked down Fett and Freeman to a refueling station, and launched an ambush on a distracted Fett, who was engaged in a struggle with Freeman. Firing a missile from their ship, Yarttar and Daquinn and incapacitated Freeman and knocked Fett to his feet. Seizing the chance, Yarttar quickly took Freeman while Daquinn shot Fett with a blaster. Believing that the Mandalorian was finally dead, Daquinn contacted Tayand about the bounty and the pair took him to the planet Cilare, where Tayand's headquarters was located.\nUpon landing on Cilare, Freeman proved uncooperative to his captors and refused to walk, prompting Daquinn to order Yarttar in carrying the Human inside. Seizing his chance, Freeman grabbed Yarttar's blaster and shot the Whiphid in the back, killing him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/2_BBY/Legends",
  "/wiki/Cilare",
  "/wiki/Whiphid/Legends",
  "/wiki/League_of_Bounty_Hunters",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Connor_Freeman",
  "/wiki/Human/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Tayand",
  "/wiki/Mandalorian/Legends",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Cyborg/Legends",
  "/wiki/Daquinn",
  "/wiki/Missile/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Death/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Blood_Ties:_A_Tale_of_Jango_and_Boba_Fett_3",
  "/wiki/Blood_Ties:_A_Tale_of_Jango_and_Boba_Fett_4"
 ]
}