{
 "name": "Yasinda_Bardak",
 "display_name": "Yasinda Bardak",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic EmpireImperial Intelligence",
      "Imperial Intelligence"
     ]
    }
   ]
  }
 ],
 "content": "Yasinda Bardak was a well-educated Human female from Coruscant who is the daughter of the owner of TranStar Construction.\nShe was a mainstay of the social life in Tasariq City's Paradise Square, doing whatever she wanted to do, whenever she felt like doing it. As the Imperial presence on Tasariq grew, Yasinda made more and more anti-Imperial remarks during her parties, and even openly questioned the wisdom of the Tarkin Doctrine. However, few realized that Yasinda was actually an Imperial Intelligence agent who had been recruited by Emperor Palpatine himself for special training. It was planned that she would one day become one of the Emperor's Hands, as Yasinda was found to be Force-sensitive, but her Imperial upbringing made her refuse to accept the possibility that the Force even existed, let alone was accessible to her. She was removed from the training, but continued her education with the Intelligence agency, and eagerly spent her time on Tasariq searching for Rebel cells.\nThe Emperor was curious as to the impact of the native tasar crystals on Force-sensitives, and sent Sarcev Quest to observe the effect on Bardak. To this end, Quest gave her an amulet containing a tasar crystal, and continued to visit her. Unfortunately for Yasinda, her proximity to the Tasar Crystals re-awakened her Force-sensitivity, and she started to hear voices in her head. This slowly drove her insane, and only her years of training kept her from completely losing her mind. The Emperor refused her transfer requests until his \"experiment\" was completed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/TranStar_Construction",
  "/wiki/Tasariq_City",
  "/wiki/Tasariq",
  "/wiki/Tarkin_Doctrine/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Sarcev_Quest",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Yasinda_Bardak",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Tasariq:_The_Crystal_Planet",
  "/wiki/Star_Wars_Adventure_Journal_15"
 ]
}