{
 "name": "Ybann",
 "display_name": "Ybann",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 3643 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green and tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Cartel",
      "Lenico Colony Blue"
     ]
    }
   ]
  }
 ],
 "content": "Ybann was the Hutt Baron-Surgeon of Lenico Colony Blue, a space station orbiting Lenico IV.\nDuring the Great Galactic War between the Galactic Republic and the resurgent Sith Empire, Ybann worked as a surgeon in the Lenico system where took over the management of a space station. He was eventually encountered by Acolyte Teneb Kel and his companion Qawohl who were searching for Exal Kressh, a former Child of the Sith Emperor that betrayed the Empire and her master the Sith Emperor. Ybann feared that they might lead a Sith attack on his station and ordered his droid bodyguards to eliminate them. His droids were no match against them, forcing Ybann to provide information on Exal's location.\nAfter providing the information in which Teneb wanted from the Hutt, Ybann offered Kel and his servant to stay, but the Acolyte declined his offer since he was ordered by the Dark Council to eliminate Exal. Exal discovered Ybann's betrayal and was able to destroy the station. Ybann was able to escape.\nThirty-seven years later, Ybann and Qiltakka were dealing with Lord Rathari's apprentice Girik on Nar Shaddaa, supposedly brokering a treaty between the Hutt Cartel and the resurgent Sith Empire. During the negotiations, the apprentice of Darth Baras barged into the conference, resulting in Ybann stating that the Sith was interrupting a private meeting. Ybann and Qiltakka the suggested that if the intruder defeated Girik, then the Hutts would consider delaying the signing of the treaty. However, the apprentice declined and killed the Hutts.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hutt_Cartel",
  "/wiki/Lenico_Colony_Blue",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Baron-Surgeon",
  "/wiki/Lenico_IV",
  "/wiki/Great_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Doctor/Legends",
  "/wiki/Lenico_system",
  "/wiki/Sith_Acolyte",
  "/wiki/Darth_Thanaton",
  "/wiki/Qawohl",
  "/wiki/Exal_Kressh",
  "/wiki/Children_of_the_Emperor",
  "/wiki/Tenebrae",
  "/wiki/Droid/Legends",
  "/wiki/Dark_Council",
  "/wiki/Qiltakka",
  "/wiki/Rathari",
  "/wiki/Girik",
  "/wiki/Empire%27s_Wrath",
  "/wiki/Darth_Baras",
  "/wiki/The_Old_Republic,_Blood_of_the_Empire_Act_1:_Shades_of_the_Sith",
  "/wiki/The_Old_Republic,_Blood_of_the_Empire_Act_2:_The_Broken_World",
  "/wiki/Category:Images_of_Ybann"
 ]
}