{
 "name": "Yeb_Yeb_Adem%27thorn",
 "display_name": "Yeb Yeb Adem'thorn",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Makem Te"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Swokes Swokes"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Yeb Yeb Adem'thorn was a male Swokes Swokes senator who represented the planet Makem Te in the Galactic Republic Senate around the time of the Invasion of Naboo. He moved from his homeworld to a luxurious residence on the galactic capital planet of Coruscant, a decision that, to some, confirmed Adem'thorn was corrupt. The Swokes Swokes opposed the taxation of trade routes proposed by the Senate, but the resolution passed regardless. Later, when Queen Amidala of Naboo called for a Vote of No Confidence in Supreme Chancellor Finis Valorum, Adem'thorn supported the motion, resulting in the end of Valorum's career.\nYeb Yeb Adem'thorn was a male Swokes Swokes senator in the Galactic Senate around 32 BBY, who represented the world of Makem Te. He was able to move from his homeworld to Coruscant, where he resided in a lavish and luxurious home. Some cited the move as evidence of Adem'thorn's corruption. He opposed Senate Resolution BR-0371, which called for the taxation of trade routes. The resolution was later passed, and the Trade Federation protested the move by blockading the peaceful world of Naboo.\nAdem'thorn was joined by two other Swokes Swokes when Supreme Chancellor Finis Valorum called for a special session of the Senate, to discuss the blockade of Naboo. Naboo's representative senator, Palpatine, introduced his planet's ruler, Queen Amidala, who went on to claim that Naboo had been invaded by the Trade Federation. The Federation's representative, Lott Dod, took exception to the accusation, and recommended that a commission be dispatched to Naboo, in order to discover the truth of the situation. Aks Moe of Malastare concurred with Dod.\nValorum, after conferring with Vice Chairman Mas Amedda, asked Amidala if she would be willing to allow a commission to be sent, but the queen was not satisfied or pleased in the slightest. She, in response, called for a Vote of No Confidence in Valorum. Soon, calls for an immediate vote rang around the Grand Convocation Chamber, and Adem'thorn, in addition to his two companions, joined in. Adem'thorn later supported the Vote of No Confidence, which resulted in the end of Valorum's career, and Palpatine's succession as Supreme Chancellor.\nConsidered corrupt in some quarters, Yeb Yeb Adem'thorn opposed such resolutions as the taxation of trade routes, but would support motions such as the Queen of Naboo's Vote of No Confidence in Chancellor Valorum. In expressing his desire that the vote to decide Valorum's fate be held immediately, Adem'thorn waved his arms around vigorously. The senator also lived in an expensive residence, drawing ire from others. Adem'thorn had black eyes and pale green skin.\nYeb Yeb Adem'thorn first appeared, unnamed, in George Lucas's 1999 film, Star Wars: Episode I The Phantom Menace. He was later provided a name and backstory in the Coruscant Limited expansion set of the Star Wars Customizable Card Game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Makem_Te/Legends",
  "/wiki/Swokes_Swokes/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Time/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Senate_Resolution_BR-0371",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Vote_of_No_Confidence/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Finis_Valorum/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Hyperlane",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Palpatine/Legends",
  "/wiki/Queen/Legends",
  "/wiki/Lott_Dod/Legends",
  "/wiki/Aks_Moe/Legends",
  "/wiki/Malastare/Legends",
  "/wiki/Vice_Chair/Legends",
  "/wiki/Mas_Amedda/Legends",
  "/wiki/Grand_Convocation_Chamber",
  "/wiki/Eye/Legends",
  "/wiki/George_Lucas",
  "/wiki/1999",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Coruscant_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Classic_Moment",
  "/wiki/Star_Wars_Insider_128",
  "/wiki/Databank_(original)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Essential_Chronology_(real-world_book)"
 ]
}