{
 "name": "Yee_Moh",
 "display_name": "Yee Moh",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mottled green"
     ]
    }
   ]
  }
 ],
 "content": "Yee Moh was a male Neimoidian who lost his job in the year 22 BBY. Once unemployed he made his way to the Outlander Club, where he found companionship with Neimoidian siblings Ko and Rina Itub.\nThe male Neimoidian Yee Moh lived during the final decades of the Galactic Republic. In the year 22 BBY, he lost his job, after which he traveled to the Outlander Club on the planet Coruscant. There he met two other Neimoidians, the sisters Ko Itub and Rina Itub and found companionship with the pair. Whilst the trio were at the club, the Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker entered the club in an attempt to find the Clawdite Zam Wesell bounty hunter, whom attempted to attack Kenobi but was defeated and dragged from the club.\nWhilst at the club Moh wore gray robes and headwear as well as a pair of data goggles, which provided a constant stream of holographic data.\nYee Moh first appeared, played by an uncredited extra, in the 2002 movie Star Wars: Episode II Attack of the Clones, in which he was a background character seen briefly in the Outlander Club scene. In the scene he wears clothing identical or very similar to the two Neimoidians he is standing with, as well as those worn by a Separatist Neimoidian ground crewman seen later in the same film. Moh's name was first revealed in 2004 as part of the \"Who's Who in the Outlander Club: It's Ladies' Night\" article written by Daniel Wallace and published in Star Wars Insider 75. The article showed a still of him from the film in which he was wearing a mouthpiece as well as data goggles. A later Insider article though, the \"Rogues Gallery\" section of Star Wars Insider 147 showed an image of him without a mouthpiece. It was not clear if one of the images of him was in fact incorrectly showing a different character, or if the second shot was a behind the scenes image with the mouthpiece removed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Outlander_Club/Legends",
  "/wiki/Ko_Itub",
  "/wiki/Rina_Itub",
  "/wiki/Standard_decade/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Clawdite/Legends",
  "/wiki/Zam_Wesell/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Data_goggles/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/2002",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/2004",
  "/wiki/Who%27s_Who_in_the_Outlander_Club:_It%27s_Ladies%27_Night",
  "/wiki/Daniel_Wallace",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_75",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_147",
  "/wiki/StarWars.com",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_96",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/January_19",
  "/wiki/2014",
  "/wiki/File:NeimoidiansFacebook.pdf"
 ]
}