{
 "name": "Yeep",
 "display_name": "Yeep",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Teek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White",
      "grey"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Sand-colored"
     ]
    }
   ]
  }
 ],
 "content": "Yeep was a Teek male who found his way onto the starship of space-farer Tuner Ryna by 22 BBY. Although unsure if \"Yeep\" was in fact the stowaway's name, Ryna entered him in the annual \"Mobquet Presents: Fastest Land Beings\" event on the planet Teyr. Yeep easily won the competition's biped race and was afterward declared sentient enough to keep his first-place medal, which he attempted to eat.\nA Teek male known as Yeep lived during the waning years of the Galactic Republic. By 22 BBY, he showed up aboard space-farer Tuner Ryna's starship. Yeep was able to communicate his name to Ryna, but the space-farer was not entirely certain what \"Yeep\" meant and considered the possibility that it referred to the stowaway's species or that it was a word for his chest.\nIn that year, Ryna brought Yeep to the city of Pyre Folas on the planet Teyr and entered him in the annual \"Mobquet Presents: Fastest Land Beings\" event. Yeep was a late entrant in the competition's biped race, which he easily won by putting on a burst of speed and outdistancing all of his opponents. This included the Selonian Pumav, who came seventh in that race behind Yeep despite winning the quadruped category. As Yeep was a being of \"unknown origins,\" his victory was protested, but the event's judges declared him \"adequately sentient\" and awarded him the prestigious biped title, which came with a medal.\nAfter receiving the award, Yeep attempted to eat the medal while being photographed by HoloNet News alongside Pumav and the Vratix Yopaxtul. On the date 13:4:18, the photo was used in the \"Sports\" section of an issue of the CoCo District Edition of the HoloNet News, which reported on both how Ryna and Yeep met and the outcome of the sporting event.\nYeep had black eyes, sand-colored skin, and a coat of fur made up of white and grey hair. He had difficulty communicating with Tuner Ryna and was a creature mysterious enough to the judges and spectators of \"Mobquet Presents: Fastest Land Beings\" to have his sentience called into question. Like other members of his species, Yeep could run at a considerably fast speed. After winning the Mobquet race, he placed his medal inside his mouth, despite it being neither edible nor food to be consumed.\nYeep appeared in the online article \"New Galaxy's Fastest Hexaped,\" published on April 18, 2002 in HoloNet News Vol. 531 #52, an installment of the HoloNet News website. It was written by Pablo Hidalgo and Paul Ens and illustrated by Joe Corroney.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Teek_(species)/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Tuner_Ryna%27s_starship",
  "/wiki/Spacer/Legends",
  "/wiki/Tuner_Ryna",
  "/wiki/22_BBY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Mobquet_Presents:_Fastest_Land_Beings",
  "/wiki/Planet/Legends",
  "/wiki/Teyr/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Sentience/Legends",
  "/wiki/Medal/Legends",
  "/wiki/Diet/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Species/Legends",
  "/wiki/City/Legends",
  "/wiki/Pyre_Folas",
  "/wiki/Selonian/Legends",
  "/wiki/Pumav",
  "/wiki/Camera/Legends",
  "/wiki/HoloNet_News/Legends",
  "/wiki/Vratix/Legends",
  "/wiki/Yopaxtul",
  "/wiki/Sports",
  "/wiki/HoloNet_News_CoCo_District_Edition",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Mouth/Legends",
  "/wiki/Foodstuff/Legends",
  "/wiki/April_18",
  "/wiki/2002",
  "/wiki/HoloNet_News_Vol._531_52",
  "/wiki/HoloNet_News_(original_website)",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Paul_Ens",
  "/wiki/Joe_Corroney",
  "/wiki/Great_ReSynchronization",
  "/wiki/Template:YearMathGRS",
  "/wiki/Ewoks:_The_Battle_for_Endor",
  "/wiki/Jedi_Council_Forums",
  "/wiki/September_20",
  "/wiki/2020",
  "/wiki/October_31",
  "/wiki/2006"
 ]
}