{
 "name": "Yeet",
 "display_name": "Yeet",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Meerian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gold"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Silver"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nihil",
      "Kara Xoo's Tempest",
      "Kara Xoo's Tempest"
     ]
    }
   ]
  }
 ],
 "content": "Yeet was a Meerian female pirate who held the rank of Strike in Tempest Runner Kara Xoo's Tempest within the Nihil during the High Republic Era and had a history of tragically losing new Nihil recruits. After arriving on the planet Dalna, the temporary stronghold of Xoo's Tempest, she escorted Avon Starros and the other children who had been kidnapped from their respective planets to join the Nihil off of the Poisoned Barb—the flagship of Xoo—to the world's surface. On Dalna, Yeet and the other Nihil began claiming children for their respective Strikes in order to begin training them with the intention of eventually using them to bring glory to the Nihil.\nYeet was a Meerian female Nihil pirate who held the rank of Strike—the lowest rank in the Nihil hierarchy—in Quarren Kara Xoo's Tempest, one of the Nihil's three Tempests. According to Nihil scientist Doctor Zadina Mkampa, she had a tragic history of losing recruits. Sometime around 230 BBY, the Strike arrived on the planet Dalna—the temporary stronghold of Kara Xoo's Tempest—aboard the Poisoned Barb, Xoo's flagship. The Strike Squib entered the cargo hold of the Poisoned Barb and pointed a blaster at a group of children who had been kidnapped to become recruits for the Nihil, ordering them to follow Yeet off the ship. Yeet led them to the surface, where more children had been kidnapped to join the Nihil.\nShe led the children to a dais and gathered them in a large group, where Xoo informed them they would have to prove their worth to become recruits that would bring glory to the Nihil. Yeet and Squib walked up to Avon Starros, a girl who had been kidnapped from Dalna, and her friends, claiming them for their Strike. Doctor Mkampa and Deva Lompop, another member of Xoo's Tempest, told them they could have all of them except Starros as they needed her to be Mkampa's assistant. A few days later, Yeet taught Petri—a boy who had been abducted from the planet Hynestia—how to use a blaster and later took the boy on a Nihil mission.\nYeet had silver skin and gold, ropey hair.\nYeet appeared in the Justina Irelands 2021 junior novel The High Republic: Mission to Disaster, published as part of the Star Wars: The High Republic multimedia project.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Meerian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nihil",
  "/wiki/Kara_Xoo%27s_Tempest",
  "/wiki/Pirate",
  "/wiki/Strike",
  "/wiki/Tempest_Runner",
  "/wiki/High_Republic_Era",
  "/wiki/Planet",
  "/wiki/Dalna",
  "/wiki/Kara_Xoo",
  "/wiki/Avon_Starros",
  "/wiki/Youngling",
  "/wiki/Poisoned_Barb",
  "/wiki/Flagship",
  "/wiki/Quarren",
  "/wiki/Tempest",
  "/wiki/Scientist",
  "/wiki/Doctor",
  "/wiki/Zadina_Mkampa",
  "/wiki/230_BBY",
  "/wiki/Squib_(Nihil)",
  "/wiki/Blaster",
  "/wiki/Deva_Lompop",
  "/wiki/Standard_day",
  "/wiki/Petri",
  "/wiki/Hynestia_Prime",
  "/wiki/Hair",
  "/wiki/Justina_Ireland",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Mission_to_Disaster",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/The_High_Republic:_Mission_to_Disaster_(audiobook)",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/StarWars.com"
 ]
}