{
 "name": "Yelzrin",
 "display_name": "Yelzrin",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Taris Resettlement Initiative"
     ]
    }
   ]
  }
 ],
 "content": "Yelzrin was a Human male colonist who led a settlement on the planet Taris during the Cold War between the Galactic Republic and the Sith Empire. In 3643 BBY, the Sith assassin Rora Seake was sent to wipe out the colony. Fortunately for Yelzrin and the other colonists, a young Jedi Knight learned of Seake's mission and intercepted the assassin before she could kill the colonists, defeating the assassin and saving the settlers' lives.\nA Human male, Yelzrin was born well before the Cold War between the Galactic Republic and the Sith Empire, and Yelzrin's parents told him stories of the Jedi as he grew up, though he always had some doubt about their veracity. In 3643 BBY, he was among those refugees and settlers who were selected by the Republic to resettle the planet Taris as part of their reclamation effort, and Yelzrin was chosen as the leader of a group of settlers. His group established a colony on the shores of Lake Brell, in an old bunker built into the hills. However, his colony was targeted by the Sith Empire in its efforts to sabotage the Republic's resettlement of Taris; the Sith assassin Rora Seake was sent to wipe out the colony.\nFortunately for the colonists, an Imperial operative leaked Seake's mission to a young Jedi Knight, and the Jedi and a companion reached the settlement before Seake. Yelzrin greeted the Jedi Knight and offered his visitors whatever they wanted from their supplies, but he was confused when the Knight warned him of Seake's impending arrival. Shocked, Yelzrin started to gather the other colonists for evacuation, but it was too late—Seake arrived with two massive creatures known as jurgorans, which she kept as pets. As Yelzrin fell to his knees in terror, the Jedi intercepted Seake and confronted the assassin, defeating Seake's pets and then the assassin herself. Immensely relieved, Yelzrin offered whatever reward he could provide to his saviors, but the Knight refused to accept it. With the Jedi's departure, Yelzrin and his colonists set about building up their settlement's defenses against further incursions.\nYelzrin was dark-skinned with short black hair and green eyes. He admired the Jedi, as he was told stories about them as a child, though he never truly believed them until he met a Jedi in person on Taris. Yelzrin was generous despite his settlement's relative newness; even before the Jedi saved the colony, he was willing to share his settlement's limited supplies with the visiting Jedi.\nYelzrin appears in the Jedi Knight-class mission \"A More Immediate Concern\" in Star Wars: The Old Republic, a video game released by BioWare in 2011. The mission is only received if the player has a positive light side alignment at the end of the previous mission; dark side players are instead sent to acquire stolen Jedi relics from pirates. Players can also refuse the mission to help the colonists, which rewards the player with dark side alignment points. As the Jedi Knight is a Republic class and is thus assumed to make decisions that reward in the maximum light side points, this article assumes the player saved Yelzrin and the colonists.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Taris_Resettlement_Initiative",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Lake_Brell_colony",
  "/wiki/Planet/Legends",
  "/wiki/Taris/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/3643_BBY",
  "/wiki/Sith_assassin/Legends",
  "/wiki/Rora_Seake",
  "/wiki/Hero_of_Tython",
  "/wiki/Assassin/Legends",
  "/wiki/Death/Legends",
  "/wiki/Duel_in_the_Lake_Brell_colony_bunker",
  "/wiki/Reproduction/Legends",
  "/wiki/Yelzrin%27s_father",
  "/wiki/Yelzrin%27s_mother",
  "/wiki/Jedi/Legends",
  "/wiki/Refugee/Legends",
  "/wiki/Lake_Brell",
  "/wiki/Sith/Legends",
  "/wiki/Saboteur/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Watcher_One",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jurgoran",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}