{
 "name": "Yeorg_Captison",
 "display_name": "Yeorg Captison",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Bakura"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 46 BBY"
     ]
    },
    {
     "name": "Died",
     "values": [
      "\u003c 18 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Captison family",
      "Bakuran Senate"
     ]
    }
   ]
  }
 ],
 "content": "Yeorg Captison was a member of the notable Bakuran Captison family of politicians. His grandfather or great-grandfather may have been Deredith Arden. Trim, athletic-looking, and refined, Yeorg was elected to the Bakuran Senate around 26 BBY. He married his wife, Tiree, sometime before then.\nIn 2 BBY, his niece Gaeriel was chosen to attend the prestigious Bakur Senatorial Academy. Due to the proximity of his home to the Academy, Gaeriel lived at Yeorg's house during her tenure at the Academy. Shortly after Gaeriel's enrollment, Yeorg was elected Prime Minister of Bakura; among his appointments was Blaine Harris as Defense Minister.\nIn 0 ABY, the Galactic Empire annexed Bakura, quickly overrunning the planet's defenses. Dol Captison  and his wife Marga were killed in a firefight between Bakuran insurgents and Imperial forces; Yeorg and Tiree all but adopted Gaeriel afterward.\nAlthough the Empire allowed him to remain as Prime Minister, the post held little authority any more, as it was now subservient to the Imperial governor. Yeorg did what he could to ease the occupation for the planet's citizens. Knowing that it was best to go along with the Empire, he urged the other senators to go along with Governor Wilek Nereus; except for a couple following Senior Senator Orn Belden, they followed his advice. When riots broke out amongst the Bakuran citizenry, Yeorg tried to deploy Bakuran police to quell the disturbances, as opposed to Imperial stormtroopers.\nGaeriel graduated from the Academy in 2 BBY, and spent the next year on Imperial Center. During that year, Yeorg's hair became entirely white. When Gaeriel returned in 4 ABY, she took a position as a senator. One month later, the Ssi-ruuvi invasion began, and in the ensuring Invasion of Bakura, Yeorg did his best to maintain calm among his citizens while trying to assist the Imperial and Rebel forces working together. During the battle, Captison had a secretary by the name of Zilpha.\nThe battle ended with Bakura free from both the Ssi-ruuk and liberated from the Empire. Yeorg continued his post as Prime Minister for several more years; when he finally did step down, he helped Gaeriel in her successful bid to succeed him as Prime Minister. Following the election, he retired from public life.\nYeorg and Tiree apparently died sometime before 18 ABY, due to the fact that their orphaned grand-niece, Malinza Thanas, was adopted by another family.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Bakura/Legends",
  "/wiki/46_BBY/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/18_ABY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Captison_family",
  "/wiki/Bakuran_Senate",
  "/wiki/Deredith_Arden",
  "/wiki/26_BBY/Legends",
  "/wiki/Tiree_Captison",
  "/wiki/2_BBY/Legends",
  "/wiki/Gaeriel_Captison",
  "/wiki/Bakur_Senatorial_Academy",
  "/wiki/Prime_Minister_(Bakura)",
  "/wiki/Blaine_Harris",
  "/wiki/Defense_Minister_(Bakura)",
  "/wiki/0_ABY/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Dol_Captison",
  "/wiki/Marga_Captison",
  "/wiki/Wilek_Nereus",
  "/wiki/Orn_Belden",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Ssi-ruu",
  "/wiki/Invasion_of_Bakura",
  "/wiki/Zilpha",
  "/wiki/Malinza_Thanas",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Galaxywide_NewsNets",
  "/wiki/Star_Wars_Adventure_Journal_5",
  "/wiki/The_Truce_at_Bakura",
  "/wiki/West_End_Games",
  "/wiki/The_Public%27s_Pulse",
  "/wiki/The_Truce_at_Bakura_Sourcebook",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_23",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/7_ABY/Legends"
 ]
}