{
 "name": "Yerkys_ne_Dago",
 "display_name": "Yerkys ne Dago",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Ryloth"
     ]
    },
    {
     "name": "Born",
     "values": [
      "27 BBY—22 BBY",
      "Ryloth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.84 meters"
     ]
    }
   ]
  }
 ],
 "content": "Yerkys ne Dago was a notorious Twi'lek loan shark operating out of the Minos Cluster. There, he was one of the most powerful individuals, with numerous individuals owing debts and lives to him.\nYeryks ne Dago was a male Twi'lek who grew up on Ryloth where he was a slave. He managed to escape from slavery by allying himself with a group of smugglers, which he subsequently took control of. When conditions on Ryloth began to deteriorate, ne Dago left the planet, traveling to the Minos Cluster. There he established an extensive network of criminal contacts with smugglers, black-marketeers and other criminal lowlifes—so extensive was the network that few others in the galaxy could rival it. An example of its breadth was that most of the beings in debt in the entire Minos Cluster owed their money to the Twi'lek, such as the freighter captain Axtor Bridgeman. This made him one of the richest individuals in the Cluster, in addition to being one of the most powerful. Because this made him a target for many, ne Dago frequently relocated his base of operations; it was known that he worked out of Shesharile 5 for a time. He also controlled the largest city on Shesharile 6, brooking no interference in his affairs. One of ne Dago's rivals in the Cluster was the Arcona Shlith-dan, although he feared to cross the powerful Twi'lek.\nWithin the Minos Cluster, ne Dago worked to pit the forces of the Galactic Empire and the Alliance to Restore the Republic against each other, knowing the chaos caused by their conflict would aid his criminal designs.\nWhen one of his clients was a month late with payment, he demanded they deliver a Wildebeest alive and unharmed from Yelsain to Travnin for him, as well as pay him an additional 3,000 credits. When he met with them, they did indeed give him the money and the Wildebeast, but they had made it eat a homing beacon which attracted the Nadir Corporation, as the group had stolen equipment from them. This caused the Nadir Corporation to chase after ne Dago, which earned the group the anger of ne Dago.\nIn an attempt to expand his power, Yerkys ne Dago traveled to Kwenn Space Station in the Mid Rim, where he boarded the luxury liner, the Stellar Mermaid. ne Dago had been invited to the liner by Sard Nightbringer to bid on a revolutionary Shield Belt offered up for auction. Competing against other crime lords such as Natja the Hutt, and the Gotal Pari' Notgoth, as well as the former Imperial commander Saz Tyrson, ne Dago bid 10 million for the technology. After competing bids, ne Dago offered up to 30 million before Natja won the auction with a bid of 100 million credits.\nne Dago appeared on the surface to be a gracious, magnanimous individual, but this was merely a front for a very base, corrupt core. He appeared to be a vain individual, wearing expensive robes and changing the ornamental painted designs on his lekku frequently during the day. Ne Dago gesticulated extensively with his lekku, even when speaking Basic, adding flair to his speech.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ryloth/Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Loan_shark",
  "/wiki/Minos_Cluster/Legends",
  "/wiki/Slavery/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Axtor_Bridgeman",
  "/wiki/Shesharile_5",
  "/wiki/Shesharile_6",
  "/wiki/Arcona/Legends",
  "/wiki/Shlith-dan",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Human/Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Wildebeest",
  "/wiki/Yelsain/Legends",
  "/wiki/Travnin/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Nadir_Corporation",
  "/wiki/Kwenn_Space_Station/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Stellar_Mermaid",
  "/wiki/Sard_Nightbringer",
  "/wiki/Crime_lord/Legends",
  "/wiki/Natja",
  "/wiki/Hutt/Legends",
  "/wiki/Gotal/Legends",
  "/wiki/Pari%27_Notgoth",
  "/wiki/Saz_Tyrson",
  "/wiki/Lekku/Legends",
  "/wiki/West_End_Games",
  "/wiki/The_Politics_of_Contraband_(adventure)",
  "/wiki/The_Politics_of_Contraband",
  "/wiki/Classic_Adventures",
  "/wiki/Category:Images_of_Yerkys_ne_Dago",
  "/wiki/Galaxy_Guide_6:_Tramp_Freighters",
  "/wiki/Galaxy_Guide_6:_Tramp_Freighters_(Second_Edition)",
  "/wiki/Pirates_%26_Privateers",
  "/wiki/Challenge_(magazine)",
  "/wiki/Parts_is_Parts",
  "/wiki/Challenge_68",
  "/wiki/The_Art_of_Betrayal",
  "/wiki/4_ABY/Legends",
  "/wiki/9_ABY/Legends"
 ]
}