{
 "name": "Yevra",
 "display_name": "Yevra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "1000 BBY",
      "Korriban"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zabrak"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Brotherhood of Darkness"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Kas'im"
     ]
    }
   ]
  }
 ],
 "content": "Yevra was a female Zabrak Sith apprentice, and later a Dark Lord of the Sith in the years leading up to the Seventh Battle of Ruusan. Yevra trained in the Sith academy on Korriban, and both her and her brother Llokay were fiercely loyal to the strongest of the students, a fellow Zabrak named Sirak. In the year 1000 BBY, Yevra and all the other Sith apprentices in the academy were promoted due to the Brotherhood of Darkness' need for Sith Lords on the front lines of the war against the Galactic Republic and the Jedi. A short time after Yevra's elevation, she, Llokay, and Sirak set a trap to eliminate a rival Sith, Bane, who had defeated, humiliated, and injured Sirak a short time before. However, the three were betrayed by a co-conspirator, Githany, who armed and fought alongside Bane in the confrontation. Yevra and Llokay were killed by Githany's lightwhip, and Sirak was killed shortly thereafter by Bane.\nAt some point, Yevra, a Zabrak, and her brother Llokay were found and recognized as Force-sensitive by the Brotherhood of Darkness. They were considered strong enough to train at the Sith Academy on the ancient Sith world of Korriban, where only those with the potential to become Sith Masters were enrolled. There, they met the strongest of the apprentices, a fellow Zabrak known as Sirak. The siblings became completely loyal to Sirak and were still in training there by the year 1000 BBY. In that year, a fellow apprentice named Bane challenged Sirak to a battle during their combat training lesson presided over by Lord Kas'im, a Sith Master. Upon the issuance of Bane's challenge, Yevra and Llokay pushed their way to the front if the crowd of students that encircled the dueling ring, both of them showing conspicuous eagerness at the fight to come. Sirak, wielding a double-bladed Sith training saber, quickly and easily defeated and injured Bane.\nSome time later, after training in the Force with fellow Sith Githany, combat training with Lord Kas'im, and many hours reading the ancient tomes in the Sith academy's library, Bane challenged Sirak once again. Before the duel commenced, Sirak handed Yevra his training saber as he removed his cloak, and she promptly gave it back to him when he was ready. This time Bane defeated and disfigured Sirak, yet hesitated when he had the opportunity to land a killing blow. Sirak spent time in a bacta tank, and was approached by Githany, who plotted with him to kill Bane. At the time Bane was on an excursion to the Valley of the Dark Lords to investigate the ancient Sith tombs there, and the two agreed to attack Bane once he returned. During the period in between, one of the Sith Masters in charge of the war effort against the Galactic Republic and the Jedi, Lord Kaan, ordered all the students on Korriban to report to the front lines on the planet of Ruusan and promoted them all to the title of Dark Lord of the Sith. Yevra, suddenly a Sith Lord, was given a lightsaber.\nBane finally returned from his journey to the Valley of the Dark Lords before the Sith students were to leave for Ruusan, and the trap was set. Yevra, along with Sirak and Llokay waited in the library upon hearing of his return. Githany lured Bane, who had left his lightsaber in his personal chamber, into the archives where the Zabraks waited. Yevra, Llokay, and Sirak moved to attack Bane, but found themselves betrayed by Githany, who supplied Bane with his lightsaber. Githany herself was armed with a lightwhip, which she quickly used to kill Yevra. Llokay, overwhelmed by the grief and rage caused by his sister's death, ferociously attacked Bane, driving him back several steps while Githany cracked her lightwhip at Llokay's eyes and face. Ultimately, Llokay fell to Githany's whip, and Sirak was killed shortly after by Bane after pleading for mercy.\nBoth Yevra and her brother Llokay were utterly and completely loyal to Sirak, who was generally regarded as the strongest of the Korriban apprentices and carried his personal items while he was fighting. Both Yevra and her brother had red skin.\nYevra and her brother Llokay made their first appearance in Drew Karpyshyn's 2006 novel Darth Bane: Path of Destruction. So far, it is her only appearance in Star Wars canon, although in 2008 Yevra was given an entry in The Complete Star Wars Encyclopedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/1000_BBY",
  "/wiki/Korriban",
  "/wiki/Zabrak/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Brotherhood_of_Darkness/Legends",
  "/wiki/Kas%27im",
  "/wiki/Sith_apprentice/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Seventh_Battle_of_Ruusan",
  "/wiki/Sith_Academy_(Korriban)",
  "/wiki/Llokay",
  "/wiki/Sirak",
  "/wiki/New_Sith_Wars",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Duel_in_the_Korriban_Academy",
  "/wiki/Darth_Bane/Legends",
  "/wiki/Githany",
  "/wiki/Lightwhip/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Sith_training_saber",
  "/wiki/The_Force/Legends",
  "/wiki/Bacta/Legends",
  "/wiki/Valley_of_the_Dark_Lords/Legends",
  "/wiki/Skere_Kaan",
  "/wiki/Ruusan/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Drew_Karpyshyn",
  "/wiki/2006",
  "/wiki/Darth_Bane:_Path_of_Destruction",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/2008",
  "/wiki/Darth_Bane:_Path_of_Destruction_(audiobook)"
 ]
}