{
 "name": "Yfra",
 "display_name": "Yfra",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Hapes"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hapan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Polished pewter"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Polished pewter"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Hapes Consortium"
     ]
    }
   ]
  }
 ],
 "content": "Yfra was a personal female ambassador of the Hapan matriarch Ta'a Chume, in 23 ABY.\nIn 23 ABY, Yfra was the Hapan matriarch Ta'a Chume's personal ambassador. During that year, when the princess of Hapes, Tenel Ka, was attending Luke Skywalker's Jedi Praxeum on Yavin 4, Ta'a Chume, who was Tenel Ka's grandmother, ordered Yfra to observe Tenel Ka in her place of study. Tenel Ka disliked the idea of Yfra visiting her while she was at the Praxeum not only because she had a low opinion of the denizens of her grandmother's court, but also because she did not want her status as the heir to the throne of the Hapes Consortium to be made public. Skywalker realized this and tried to help the young princess keep Yfra from coming to the Jedi academy. When Tenel Ka's friends Jedi trainees Jacen and Jaina Solo were kidnapped and taken to the Shadow Academy, the secret training center of the Second Imperium, Tenel Ka went with Skywalker to rescue them and in the process escaped being being visited by Yfra.\nFollowing a disastrous lightsaber exercise with Jacen which left Tenel Ka's left arm severed, Yfra brought the young heir to Hapes. It was then that Yfra attempted to assassinate Ta'a Chume along with Tenel Ka and her Jedi classmates while they were residing at Reef Fortress. Yfra arranged for their wavespeeder to be sabotaged, a patch of carnivorous seaweed to ambush them, and for a squad of deadly Bartokk mercenaries to attack them.\nTenel Ka and her companions succeeded in foiling Yfra's plot with their budding Jedi skills. In the end, Yfra was arrested.\nYfra first appeared in Young Jedi Knights: Shadow Academy, a 1995 young readers novel by Kevin J. Anderson and Rebecca Moesta, and again appeared in the 1996 Young Jedi Knights: Lightsabers of the same series and by the same authors. She was also mentioned in Jedi Eclipse the second novel in the The New Jedi Order duology Agents of Chaos published in 2000 by James Luceno. Yfra was later given an entry in the 2008 reference book The Complete Star Wars Encyclopedia by Stephen J. Sansweet and Pablo Hidalgo.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hapes/Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Hapan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Matriarch",
  "/wiki/Ta%27a_Chume",
  "/wiki/23_ABY/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Prince/Legends",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Jedi_Praxeum",
  "/wiki/Yavin_4/Legends",
  "/wiki/Throne/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Jaina_Solo_Fel",
  "/wiki/Shadow_Academy",
  "/wiki/Second_Imperium",
  "/wiki/Lightsaber/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Reef_Fortress",
  "/wiki/Hapan_Water_Dragon",
  "/wiki/Carnivorous_seaweed",
  "/wiki/Bartokk",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Yfra",
  "/wiki/Young_Jedi_Knights:_Shadow_Academy",
  "/wiki/1995",
  "/wiki/Kevin_J._Anderson",
  "/wiki/Rebecca_Moesta",
  "/wiki/1996",
  "/wiki/Young_Jedi_Knights:_Lightsabers",
  "/wiki/Star_Wars:_Young_Jedi_Knights",
  "/wiki/The_New_Jedi_Order:_Agents_of_Chaos_II:_Jedi_Eclipse",
  "/wiki/Star_Wars:_The_New_Jedi_Order",
  "/wiki/Agents_of_Chaos_Duology",
  "/wiki/2000",
  "/wiki/James_Luceno",
  "/wiki/2008",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Stephen_J._Sansweet",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Young_Jedi_Knights:_Shards_of_Alderaan",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}