{
 "name": "Ygabba_Hise",
 "display_name": "Ygabba Hise",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    },
    {
     "name": "Born",
     "values": [
      "31 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gilramos Libkath",
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Ygabba Hise was a young girl who stole Boba Fett's Mandalorian helmet. She wore tattered clothes, like an Ugnaught mechanic's smock, which was too big, and tied at the waist with a filthy rope. She was skinny and starved looking, because she rarely got that much to eat. Boba Fett chased her back to the abandoned ship where she lived, where Fett found that the Neimoidian Gilramos Libkath was having children like Ygabba do work for him, like stealing weapons for him to trade, in exchange for food. If any of these children left the planet, a tracker implant would release a toxin into their blood stream, therefore, the children were terrified of leaving, and fear kept them on the planet. Later, she told Boba that he owed her for her teaching him to be more careful with his helmet and belongings. Boba reluctantly admitted this was a pretty good point. When Boba Fett suggested hiding out in the vast deserts of Tatooine, she refused because she knew the younger children wouldn't survive without her to guide them. Having been taken some five years before, Fett killed Libkath for a bounty, and Ygabba was reunited with her father Gab'borah Hise at Jabba's Palace. Durge was also presumed dead in the explosion Boba used to kill Libkath, but was not. Ygabba and Fett became very close friends over the years. She would stay on as a chef with her father, giving Fett a tailored set of Mandalorian armor, and a holoshroud to help him in a future mission.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Gilramos_Libkath",
  "/wiki/Jabba_Desilijic_Tiure%27s_criminal_empire",
  "/wiki/Boba_Fett/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Ugnaught/Legends",
  "/wiki/Neimoidian/Legends",
  "/wiki/27_BBY/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Gab%27borah_Hise",
  "/wiki/Jabba%27s_Palace",
  "/wiki/Durge/Legends",
  "/wiki/Holographic_image_disguiser",
  "/wiki/Boba_Fett:_Hunted",
  "/wiki/Boba_Fett:_A_New_Threat",
  "/wiki/Boba_Fett:_Pursuit",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}