{
 "name": "Yils",
 "display_name": "Yils",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Alderaan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House Alde"
     ]
    }
   ]
  }
 ],
 "content": "Yils was a Human male who served the noble House Alde as a guard captain during the Cold War between the Galactic Republic and the reconstituted Sith Empire. A native of the planet Alderaan, Yils was assigned to the Alde embassy on the grounds of Castle Organa, the palace of fellow Galactic Republic ally House of Organa, but he failed to prevent the death of Count Alde in the embassy when the noble was targeted by the superweapon known as the Death Mark laser. Yils attempted to arrest the bystanders, a Jedi Knight, a companion and a Mirialan woman named Aleyna Hark, but was convinced to allow the Jedi to depart.\nA Human male from the planet Alderaan, Yils served the noble House Alde as a guard captain by the year 3643 BBY, during the Cold War between the Galactic Republic and the Sith Empire. Yils was stationed at the Alde embassy on the grounds of Castle Organa, the ancestral home of the House of Organa, a family that House Alde had supported for centuries. Count Alde himself was present at the embassy when a Mirialan woman named Aleyna Hark arrived, claiming that she had come from the Mensaav Military Laboratory, where the Death Mark laser project was being developed using funds supplied by both the Republic and House Alde.\nHark and Count Alde were discussing how the Sith had captured the Death Mark laser research facility when a young Jedi Knight and a companion arrived at the embassy, having just restored the damaged communications relays in the surrounding area that forces of the Imperial-aligned House of Thul had sabotaged as part of the ongoing civil war. However, Hark, in actuality an Imperial spy, tagged the unknowing Count Alde using the Death Mark laser's targeting device, and the laser murdered Alde partway through the conversation.\nYils and his men rushed into the room to find the count dead on the floor, and he immediately moved to arrest the Knight, Hark, and the Knight's companion. Ignoring the Jedi's assertion that the count had not been killed by a lightsaber, Yils ordered the three to back up against the wall of the room and raise their hands. When Hark protested that he was attempting to arrest a Jedi Knight, Yils stated that they would verify the three's identities and alibis over the next few days. However, the three convinced Yils to allow the Jedi to leave.\nDark-skinned with brown eyes and black hair, Yils was brusque and efficient as a police officer, taking note of the situation in the embassy and immediately acting to ensure that the suspects did not escape.\nYils wore blue-and-white armor and carried a blaster rifle.\nYils first appeared in Star Wars: The Old Republic, a 2011 video game released by BioWare and LucasArts. He is featured in the Jedi Knight-class mission \"The Death Mark\" and is the focus of a conversation choice with three options when he attempts to arrest the Knight. The neutral option of asking to be let go causes Hark to offer herself in the Knight's place, and the player later learns that Hark killed Yils and the other guards before escaping the castle grounds. The dark-side option sees the player killing the other guards and defeating Yils before Hark steps in and also results in Yils' death at Hark's hands. However, the third option, which is also neutral, allows players to Force-persuade Yils to release both the player and Hark, and as a result, Hark does not kill Yils. As a Republic character, the Jedi Knight is assumed to only choose the light-side options, so this article ignores the dark-side option of attacking but leaves the player's choice and Yils' fate open for the reader to decide.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Alderaan/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_Alde",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Noble/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Alderaanian/Legends",
  "/wiki/Planet/Legends",
  "/wiki/House_Alde_embassy",
  "/wiki/Castle_Organa",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Death/Legends",
  "/wiki/Count/Legends",
  "/wiki/Alde_(Count)",
  "/wiki/Superweapon/Legends",
  "/wiki/Death_Mark_laser",
  "/wiki/Hero_of_Tython",
  "/wiki/Mirialan/Legends",
  "/wiki/Aleyna_Hark",
  "/wiki/Jedi/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Standard_century/Legends",
  "/wiki/Mensaav_Military_Laboratory",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Sith/Legends",
  "/wiki/House_of_Thul",
  "/wiki/Alderaan_Civil_War",
  "/wiki/Spy/Legends",
  "/wiki/Laser/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Limb/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Police_officer/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/LucasArts",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}