{
 "name": "Yittreas",
 "display_name": "Yittreas",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "6 ABY",
      "New Geddes"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "New Geddes"
     ]
    }
   ]
  }
 ],
 "content": "Yittreas was a Moff of the Galactic Empire.\nA Human male, Yittreas was a contemporary to Grand Moff Wilhuff Tarkin. Tarkin recognized his management talents and although categorized him as an unstable sociopath, he gave him the Krant system to control. Yittreas, as an Imperial Moff and warlord, governed the system unchecked and as he saw fit. He executed thousands of Krantians for 'political treason' in order to have less population so that a smaller garrison would be needed, earning him the nickname \"Butcher of Krant.\"\nDuring the Krantian Civil War, several forces, including the Krantian resistance and Ghost Base, were activated against the Empire. Yittreas ordered Strike Force Alpha to capture Ghost Base. Annoyed by the resistance, he ordered the capture of the towns of Peche and Theenes but his actions were stopped by the Rebel emissary Leia Organa and the exiled Jedi Echuu Shen-Jon. He soon lost Krant to the Rebel Alliance and fled to the orbiting asteroid Geddes, which he terraformed to convert it to a military base.\nYears later, near the end of the war, he established himself in New Geddes and controlled the Terraform Processor. Organa returned to Hanoon along with her brother, the future Jedi Master Luke Skywalker, and helped the Hanoon resistance recapture the processor. The \"Butcher of Krant\" was then hunted and killed at his Fortress, thus finishing the war and liberating the world.\nYittreas was voiced by Joe Paulino in the 2001 video game Star Wars: Galactic Battlegrounds. His in-game portrait was based on Imperial Advisor Sim Aloo, although his character model is the same as an Imperial commander. He was first mentioned in the game's strategy guide, and was also included in the game's 2002 expansion pack, Clone Campaigns.\nThere is a discrepancy in the timing of his death. His entry in the game's DataBank states the Krantian Civil War lasted 10 years, but the 2009 reference book The Essential Atlas establishes that the Battle of Hanoon takes place in 6 ABY, or only about six years since the start of the war.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/6_ABY/Legends",
  "/wiki/New_Geddes",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Wilhuff_Tarkin/Legends",
  "/wiki/Krant_system",
  "/wiki/Warlord/Legends",
  "/wiki/Krantian/Legends",
  "/wiki/Treason/Legends",
  "/wiki/Garrison/Legends",
  "/wiki/Krant",
  "/wiki/Krantian_Civil_War",
  "/wiki/Ghost_Base",
  "/wiki/Strike_force_Alpha",
  "/wiki/City/Legends",
  "/wiki/Peche",
  "/wiki/Theenes",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Jedi/Legends",
  "/wiki/Echuu_Shen-Jon",
  "/wiki/Orbit/Legends",
  "/wiki/Asteroid/Legends",
  "/wiki/Hanoon",
  "/wiki/Terraforming/Legends",
  "/wiki/Terraform_Processor",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/Battle_of_Hanoon",
  "/wiki/Fortress/Legends",
  "/wiki/Joe_Paulino",
  "/wiki/2001",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Galactic_Battlegrounds",
  "/wiki/Imperial_Advisor",
  "/wiki/Sim_Aloo/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Prima%27s_Official_Strategy_Guide",
  "/wiki/2002",
  "/wiki/Star_Wars:_Galactic_Battlegrounds:_Clone_Campaigns",
  "/wiki/2009",
  "/wiki/The_Essential_Atlas",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook"
 ]
}