{
 "name": "Yiv",
 "display_name": "Yiv",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Nikardun"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nikardun Destiny",
      "Nikardun military",
      "Nikardun military"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Jixtus"
     ]
    }
   ]
  }
 ],
 "content": "General Yiv the Benevolent, or Yiv was the Nikardun male leader of the Nikardun sentient species' nation of the Nikardun Destiny. Preceding the Destiny's series of conquests and alliances throughout the Unknown Regions, the Benevolent and his species were nurtured and trained for conquest by the Grysk agent Jixtus, who sought to destroy the interstellar government of the Chiss species, the Chiss Ascendancy. Following his training, he led a series of conquests planned by the Grysk from the Destiny's capital—and flagship—of the Deathless, subjugating the Urchiv-ki species' Tower Dimension, the Paataatus species' Paataatus Hiveborn and the Lioaoi Lioaoin Regime and keeping those nations encircling the Ascendancy fearing the Nikardun. As his campaign advanced, he engaged the Chiss Ascendancy more directly, at first sending the Paataatus Hiveborn to attack the Chiss capital planet of Csilla, covering up the attack on the Paccosh refugees which were escaping Yiv and his attempt to subjugate their nation of the Paccian Governance.\nHowever, the Chiss also learnt more and more about him, Senior Captain Mitth'raw'nuruodo core name \"Thrawn\" uncovered the attempt to cover up the attack on the Paccosh, and later uncovered the occupation of the Rapacc system by Yiv, and later met the general himself at the Vak Combine's capital Primea, where he attempted to kill the Senior Captain, and was later defeated by his target and a fleet of Chiss Expansionary Defense Fleet warships. Being captured by the Chiss and imprisoned at a prison at Csilla, Yiv spent a imprisoned during the scattered Nikardun military's campaigns across the Unknown Regions. Following the remnants' defeat, Admiral Ar'alani of the Chiss questioned the general in an attempt to learn more about Jixtus and his nation, the Grysk Hegemony, which had allied himself with the Kilji Illumine, the theocracy of the Kilji species. Giving the information Jixtus had shared with the Benevolent, Yiv was exiled as he wanted.\nAt some point before the Nikardun conquests, Yiv was trained by Jixtus, a Grysk agent of the hegemonic government of the Grysk warlike species, the Grysk Hegemony. Jixtus trained both Yiv and the Nikardun sentient species in the arts of conquest for years. At some point, Jixtus ordered Yiv to construct the Listening post KR20 and Listening post KR21.\nIn 19 BBY, the Nikardun general sent the Paataatus sentient species' government of the Paataatus Hiveborn—one of the nations controlled by the Nikardun—to the ice planet of Csilla, the capital planet of the Chiss Ascendancy. At the same time, a reunion of the Chiss Syndicure was taking place, which alerted Speakers and Syndics. As the Paataatus had attacked the Chiss, the Ascendancy believed they were the true masterminds of the attack, and attacked them, in which Senior Captain Mitth'raw'nuruodo, Core name \"Thrawn\" participated.\nHowever, Supreme General Ba'kif of the Chiss Expansionary Defense Fleet and Senior Captain Thrawn discovered that the attack was a distraction from another attack at the edge of the Dioya system and the Chiss Ascendancy, where Paccosh—which were a target of Yiv's conquests—refugees attempted to escape the Nikarduns' control, however, their attempt proved unsuccesful, as the Nikardun destroyed them. Both Chiss boarded the remnants of ship in which the refugees traveled. Thrawn studied the architecture and clothing of the Paccosh, obtaining information that led him to the Rapacc system of the Unknown Regions.\nThrawn's Chiss heavy cruiser Springhawk and Admiral Ar'alani's Nightdragon man-of-war traveled to the Rapacc System. Upon their arrival, they found Nikardun forces—which the Chiss did not recognize—patrolling the system. The Sprighawk investigated the inner Rapacc system, while Thrawn and his sky-walker's caregiver, Mitth'ali'astov \"Thalias\" visited a mining station. At the station, some Paccosh informed Thrawn and Thalias of Yiv and the Nikardun. A Paccosh official, Uingali foar Marocsaa later gave Thrawn a ring depicting a Chimaera, forming an alliance. Afterward, Thrawn left the mining station and raided the blockade of the planet of Rapacc, and captured a Nikardun blockade frigate with the aid of a pathfinder, Qilori, an agent of the Nikardun which had previously traveled with Thrawn.\nAr'alani and Thrawn traveled with Ambassador Boadil'par'gasoi \"Ilparg\" aboard the Vigilant to the Urch system, looking to visit the capital of the Tower Dimension, which was also being controlled by the Nikardun Destiny. When Ilparg attempted to contact senior members of the nation, the Urchiv-ki rejected him and the Chiss' visit. Afterward, the Urchiv-ki, with Lioaoin reinforcements attempted to capture the Vigilant in retaliation to the capture of the Nikardun frigate. However, their attempt was unsuccesful. Thrawn later contacted his old Garwian contact Frangelic at the Garwian capital of Solitair. Frangelic, informed the Chiss that his nation, the Garwian Unity would soon undertake a diplomatic mission to Primea, the capital of the Vak Combine and the homeworld of the Vak species. Furthermore, Primea served as a diplomatic and trade hub for the region, so Thrawn would likely be able to learn about Yiv and his Nikardun there. Frangelic invited Thrawn and Thalias to join the Garwians' diplomatic mission, where Thrawn acted as Artistic Master Svorno, the chief curator of the Nunech Art Collection. Thalias acted as Thrawn's Chiss family hostage, but was mainly referred to as \"Thrawn's companion\" to avoid intrigue and suspicion from observers. Thrawn told Frangelic that he trusted the Security Chief, and also let him in know that Thalias was his \"family hostage\". Attempting to plant enough seeds of the rumor of family hostages for them to reach Yiv, but not enough to look as disinformation.\nAfter Thrawn and Thalias arrived at the Primea diplomatic reception, Thrawn discovered that Yiv was in the event. As Thrawn also saw Qilori, he punished Thalias for wearing her hostage makeup incorrectly, stating that a family hostage should meet certain criteria for appearances, making sure the pathfinder heard it. Thrawn, posing as \"Artistic Master Svorno,\" engaged Qilori in a conversation about an academic theory he claimed to be trying to refute. However, Thrawn gave up the topic as he realized the Pathfinder was not interested. Thrawn then asked Qilori to introduce him to the Benevolent, the Chiss then stated he knew about most of the species present but that he had never met one of Yiv's species before.\nYiv discussed art and architecture with Thrawn, acting as he did not know it was in fact him, however, he had been informed by Qilori that he was in fact Thrawn. The Chiss and the Nikardun challenged each other to analyze something that was their counterpart's specialization, Yiv analyzed a work of art while \"Svorno\" analyzed architecture. Yiv discussed the implications of a secret tunnel from the reception area to the Vak premier's private office. And Thrawn studied a Vak tapestry that Yiv believed showed \"inexpert\" design, but Thrawn replied that it in fact showed that the Vaks valued both the individual and the whole, working for unity while at the same time celebrating difference and uniqueness.\nThrawn said that he saw a great deal of artwork at the reception, all of which displayed the Vaks' culture. Thrawn attempted to gather information by asking what Yiv saw to the general, the Nikardun stated that he saw opportunity, and upon further questioning, that if the Combine did not accept his and the Nikardun's friendship, he would deal with it. The general complimented Thrawn on his observational skills, and the Chiss retired to his quarters. Following Thrawn's departure, Qilori discussed the Chiss with Yiv. The general stated that he now understood Thrawn and the danger he posed to the Nikardun. He complimented the Navigator for bringing Thrawn before him, Qilori then brought up the subject of Chiss family hostages he had observed, which led Yiv revealing he knew that the family hostages' supposed existence was an attempt at making himself think he did not know the Chiss.\nYiv planned to capture and kill Thrawn as the Garwian diplomatic ship left Primea, however, Thrawn was not aboard the ship. Instead, he and Thalias remained on the planet to use Thrawn's ability to learn about species' culture through art. Thrawn wished to learn more about the Combine and how the Vaks would respond to Yiv's diplomatic and military advances. The two Chiss entered a Vak art gallery where Thrawn learned more about Vak culture and discussed the opinions of the common Vak people with the museum's curator. Thalias stated that the people who frequented art galleries were not the decision-makers of their species, to which Thrawn replied that she did not see what he saw.\nHe explained that the Vaks valued all of their members' points of view, which they called thought lines, and as such they sought consensus making decisions. The communal decision making made the Vak Combine slower in deciding their policies and courses of action than most sentient species. However, the Vak would distrust a faction which wanted to subordinate the Vaks' many thought lines to those of the faction's leader. Which Yiv wanted to do. Thrawn and Thalias wanted to spread that warning before they were caught by Nikardun or Vak security forces to prevent the general from controllating the Combine. Thrawn and Thalias stole a patrol boat from the Vak spaceport, they then escaped aboard the patrol boat.\nAdmiral Ar'alani was sent by the Defense Hierarchy Council to retrieve Thrawn and Thalias from Primea. Ar'alani commanded the Vigilant and was accompanied by the Springhawk, temporarily under Mid Captain Ufsa'mak'ro's command. Ar'alani was accompanied by Syndic Irizi'stal'mustro \"Zistalmu\" of the Chiss Irizi family, who wanted to ensure the two Chiss ships would obey the Chiss non-aggression protocols. The Chiss force called the Primea diplomatic office to ask the whereabouts of artistic master Svorno. The Vaks responded that the Garwian diplomatic ship had departed three days ago.\nMeanwhile, the Chiss ships were confronted by thirteen Vak patrol boats arranged in a lens formation. The local patrol boats and Chiss warships engaged in limited shows of force against each other, demonstrating the capability to engage if necessary but limited enough to display a lack of desire for combat. A fourteenth Vak patrol boat, which was piloted by Thrawn, later joined the other thirteen. Thrawn's patrol boat opened fire on the Vigilant with moderate laserfire, which appeared to be a Vak attack on the Chiss. In reality, Thrawn was sending Admiral Ar'alani the schematics of the Vak patrol boats so she and the Springhawk could disable them without destroying them. Thrawn used the same communication method he had created for a pirate attack at Stivic. Thrawn's attack then authorized the Chiss to engage in combat.\nJust before the Vigilant could fire to disable the Vak fighters, four Lioaoin warships commanded by Yiv appeared from hyperspace. The Lioaoi commander hailed Ar'alani from his flagship, identified themself and his forces as part of the Lioaoin military and telling the Chiss they had disrupted the peace of the Vak Combine. They told the Chiss to depart immediately, however, Ar'alani replied that they were only there to search for one of their people. At that point, the warships attacked the Chiss. Ar'alani was fully aware that she and Samakro did not have enough plasma spheres to destroy all their attackers, so they planned a quick escape. Which angered her Syndic guest.\nAlthough the Chiss Ascendancy's laws forbade pre-emtive strikes, it allowed retaliatory strikes against enemies who had established their identity as enemies. Therefore, the Lioaoin attack at Primea required the Chiss Expansionary Defense Fleet to counterattack the Lioaoin Regime. The Syndicure and Defense Hierarchy Council then sent the Vigilant and the Springhawk to attack the Lioaoin heartworld.\nAfter the Chiss forces arrived at the heartworld, they witnessed twelve Lioaoin warships. Thrawn knew that no more than four would engage the Springhawk and Vigilant, as the Chiss had a reputation that they would have reinforcements waiting. If the Lioaoi sent their entire fleet to engage two Chiss ships, they would open their planet to attack by the Chiss reinforcements they believed would come. Which were not coming. At that point, Ar'alani hailed the Lioaoin ships, asking for an \"explanation\" of their attack at Primea. The Lioaoi did not attempt to deny or justify the attack, leading Thrawn to reason that Nikardun forces were present and the Lioaoi feared reprisals by the Nikardun if they downplayed their aggression at Primea. A battle ensued, with the Springhawk and the Vigilant using shuttles as decoys and bombs containing breachers—missiles with acid payloads which weakened enemy hulls and disabled electronic systems near the point of impact. The Chiss were victorious, and maximized their message while minimizing permanent damage to the Lioaoin Regime in the hopes that the Lioaoi would remember the Ascendancy's restraint in the future. Soon after, Che'ri and Thrawn traveled to the Outer Rim Territories planet Mokivj, where Thrawn retrieved a Deflector shield generator.\nThrawn sent sky-walker Che'ri and Caregiver Thalias to Primea aboard the Vak patrol boat he had previously stolen with an apology and a warning to the Vak Combine. Thalias carried one copy of Thrawn's message to the Combine while a second and longer copy was stored in the patrol boat's computer. The copy in the returned ship included a warning that Yiv might capture Thalias and Che'ri and replace the contents of their message with something innocuous. If the copy the Vaks' leaders received matched the copy aboard the ship's computer, then all was fairly calm and they would have time to deliberate. However, if the messages did not match, that would indicate the Nikardun general had altered the message and could therefore not be trusted, leading to a shift in Vak thought lines to oppose the Nikardun Destiny, which would frustrate Yiv mentally and strategically.\nThrawn's warning to the Vak Combine included data he had collected on other civilizations that Yiv had made treaties with, which he hoped to convince the Vaks that Yiv's promises and words were in fact deception prefacing an iron fist that would follow if they accepted the destiny the Nikardun's had planned for them. The message also included an invitation for the Vak Combine to form am alliance with the Chiss Ascendancy against the Nikardun.\nThe two female Chiss wore the adequate clothing for Chiss family hostages and were told to give their message directly to the highest ranking defense official in the Vak Combine. Thrawn and Thalias expected that their message would be intercepted and replaced by an agent of Yiv, but did not tell Che'ri that detail. He prepared for this possibility by including a second copy of his warning on the databanks of the returned patrol boat's computer with an additional message added. The second message, which was only present in the boat's computer, warned the Vaks that if the message they receive from Thalias and Che'ri differed from that on the vessel's computer, then Yiv was lying to them and they should be swift to make a decision to form an alliance with the Chiss.\nYiv then captured Thalias and the young sky-walker, taking them hostage. He then sent a message to Csilla demanding that Thrawn delivered a monetary ransom aboard of univers and an unarmed freighter in exchange for the release of the captive Chiss, which was false, as Yiv wanted to kill Thrawn. The message specified coordinates in high orbit of Primea, and demanded that Thrawn came alone in an unarmed freighter. If Thrawn failed to retrieve Thalias and Che'ri on his own, a Chiss fleet would soon follow and arrive at Primea. In reality, Yiv arranged for the navigator to be Qilori and Qilori to bring Thrawn and the freighter somewhere in the outer reaches of the Primea system. Thrawn expected that and planned to invoked Yiv's treachery to justify the Chiss fleet that followed him to Primea. Thrawn had studied the schematics of Yiv's flagship and the Nikardun Destiny's capital, the Nikardun Battle Dreadnought Deathless, which contained a large viewport as many Nikardun vessels did. Thrawn then told the Defense Fleet to make special modifications to the freighter he was going to bring to the Concourse and then to Primea, so its nose would first puncture and then perfectly seal a vacuum in the viewport of the Deathless' bridge. The Fleet also installed a prototype of the deflector shield Thrawn had retrieved earlier on the freighter.\nAs Thrawn arrived at the Primea system, Thrawn and his navigator, Qilori, saw the Deathless accompanied by three other Nikardun Battle Dreadnoughts. Thrawn announced his arrival to the Nikardun general personally, and also announced the arrival of the univers, the ransom. Yiv said that Thrawn misunderstood, and that Thrawn was the ransom, not the univers. The Nikardun leader told the Chiss officer that he had earned death for capturing one of his ship and killing Nikardun. Yiv then asked the Chiss if he wanted the General to shoot his freighter instead of bringing him aboard to be killed at the hands of Yiv, to which Thrawn replied that he did not prefer that. The Chiss complimented Yiv for his cleverness in arranging the meeting at a different location than promised, and asked if that meant the other provisions of the meeting had changed too. The General fooled probably before proceeding to brag about the Vaks' awareness of his substantial military forces in the system and nearby. As Thrawn's freighter approached the Deathless, Thrawn said he wished to revisit the provision that he came to Primea alone.\nAt that time, the Vigilant, Springhawk, and other Chiss cruisers arrived in the Primea system from hyperspace. They called Primea Central Command to announce their arrival and inform the locals of the presence of Nikardun warships. After the Chiss vessels performed a sensor scan, the Springhawk's second officer Plikh'ar'illmorf \"Kharill\" noted that the Nikardun dreadnoughts had formed a blockade formation. The Chiss understood that the blockade was meant to prevent the Vaks or any others in the system from stumbling upon Yiv's covert meeting with Thrawn, however, the Combine did not suspect that. Ar'alani then sent the Nikardun formation data to Primea Central Command, who informed them that they were being blockaded. Ar'alani askedfor the Vaks' permission to clear out the blockading vessels from the system, which the Vaks granted. Her message also included a plan which stated how the Vaks could join the battle on the side of the Chiss if they wished. As a result, the battle over Primea began. The battle commenced between the Chiss Expansionary Defense Fleet on one side and the Nikardun on the other. With the Combine remaining neutral.\nYiv was furious after seeing the arrival of the Chiss fleet at Primea. Thrawn angered the General even more by pointing out a dilemma the Chiss had set for him, the Chiss fleet was much stronger than the Nikardun patrol boats forming the apparent blockade of Primea. Although Yiv could sacrifice those small warships, that would bring disgrace on Yiv as the Vaks knew that Yiv had stronger battle dreadnoughts that could reinforce his patrol boats. On the other hand, Yiv was able to send his dreadnoughts to reinforce his blockade formation, but if he sent all of them, it would seem that he was fleeing an unarmed freighter, which would be humiliating. Additionally, even if Yiv sent all three of the Deathless' companion dreadnoughts to reinforce his blockade ships, it would appear that Yiv was too cowardly to join the battle himself. Ultimately, Yiv settled on the third.\nYiv, extremely angered at the trap laid before him, began hurting Thalias to try to learn Thrawn's plan. Thrawn, still on the comm display, informed the Nikardun that there was no need for such actions, and laid out his plan transparently for the General. Thrawn wanted to trap Yiv in a box, which he insisted he had. He told Yiv the only way forward would be for Yiv to capture Thrawn's freighter with the Deathless' tractor beams and release Thalias and Che'ri, as provided in the two's original agreement. Yiv rebuked that he had always wished something like that, but said he would kill and dismember Che'ri and Thalias in front of Thrawn so the Chiss knew what he had done to his entire species. Meanwhile, Ar'alani told Mid Captain Samakro, now commanding the Springhawk, to play dead, and appealed to several non-combatant Vak patrol boats for humanitarian aid. The Vaks agreed after a short period of protest, but were promptly shot and destroyed by several Nikardun warships, although the Chiss warned the Nikardun not to. The Vak culture treated an attack on any Vak as an attack on the entire Vak Combine, therefore, the Vak forces then joined the battle against the Nikardun on the side of the Chiss.\nAt that point, Yiv was apoplectic, he ordered Thrawn's freighter to be captured by tractor beams and fired at with spectrum lasers at the same time. Meanwhile, Che'ri and Thalias stripped their hostage disguise and released tava mist, limited the reaction time and reflexes of the Deathless' bridge crew. Using the Republic shield generator technology the fleet had installed, Thrawn's freighter endured the Nikardun laser fire without significant damage. Thrawn's ship crashed into the bridge of the Deathless, at first opening the viewport and making a vacuum before sealing it with the perfectly shaped custom nose the Chiss Fleet had installed on Thrawn's freighter following the Senior Captain's command. Thrawn then rescued Che'ri and Thalias from the Nikardun, knocked Yiv unconscious with more tava mist, and seized the General, his questis data-link reader, and his data banks before escaping with his friends and prisoner. The departure of Thrawn's freighter once again opened the bridge of the Deathless to the vacuum, killing all of Yiv's bridge crew and thus leaving no witnesses, as the General himself had wished to do with the Chiss.\nWithout the general, the Nikardun Destiny quickly collapsed. Thrawn also made one of Yiv's agents, the Pathfinder Qilori, promise not to tell anyone how Yiv had been defeated, or else he would be removed from the Pathfinders, and the Pathfinders themselves would be removed from the Navigators' Guild. However, when another enemy of the Chiss, a Grysk calling himself Jixtus, threatened to leave the Pathfinder on a derelict ship light-years from any star system, Qilori told him that Thrawn was the Chiss who had taken down Yiv. Wanting revenge on the Chiss himself, as they had defeated Yiv, which he considered his \"life,\" Qilori also agreed to ally with Jixtus. Following the battle over Primea, the Syndicure called several hearings regarding the Nikardun threat, how they had been discovered, and how they were defeated. After Yiv's capture and interrogation, the Syndicure became convinced that the remnants of Yiv's forces had to be eliminated. As such, they authorized the Nikardun campaigns to neutralize any Nikardun remnants in the Chaos. Thrawn also participated in the campaigns.\nJixtus had expected Yiv's efforts against the Chiss Ascendancy to fail, and sought to destroy the Ascendancy, believing the destruction of the Chiss nation would allow the easy conquest of the Chaos. He thus had servants of the Grysk Hegemony, including the telepathic Agbui named Haplif, conduct a plot to instigate a civil war among the Chiss. That plot unfolded at the same time as the Chiss Expansionary Defense Fleet undertook the Nikardun campaigns to eradicate the remnants of the Nikardun Destiny within the Chaos, in which Jixtus indirectly collaborated.\nAround 18 BBY, Ar'alani visited Yiv on his personal jail at Csilla, Yiv sat in his casual arrogant position, and told her that in the months since his capture, he had grown fond of solitude. Ar'alani began the topic of betrayal, and informed him that his empire had scattered and that the nations conquered by it were free. He dismissed her statement, as many had told him that, and he believe the Chiss would not keep him alive for nothing, but, that they kept him alive so when the Nikardun Destiny returns, they have something to stop their conquests. She stated that the Chiss did not kill defeated enemies, and that they kept him alive in case they needed information.\nAr'alani asked him about Jixtus' allies, the general initially attempted to say nothing, however, when he heard of the Kilji Illumine and the Agbui, his arrogance did not let him keep silence. He expressed his dislike towards the Agbui, calling them arrogant and useless creatures. He also asked the Admiral why she was there, the Nikardun leader was informed that Jixtus—his master—had destroyed his listening posts, as the Nikardun did not do their listening posts well, Jixtus had killed them all and sent his own people. Yiv dismissed the Chiss' statements, however, Ar'alani showed him recordings of the Nikardun being killed. Yiv asked Ar'alani to stop them, softly, showing sadness from the one who had shown none throughout his campaigns.\nThe Chiss asked him for more names, not the Grysks, that Yiv had already shared, but more allies that Yiv had mentioned, more of Jixtus' tools like Generalirius Nakirre's Illumine or Haplif's Agbui. Yiv told her that the price to pay for all those names was his exile, at an unknown planet in which he could live the rest of his life, feel wind, see the sun, him alone, with some supplies to begin his life once again. Ar'alani told him she was going to attempt to give him his exile, with no promises, as the Aristocra probably did not want him alone with the possibility of the Nikardun coming back. After leaving, Ar'alani informed Supreme General Ba'kif that Yiv expected the Chiss to lose, and that he wanted to get off Csilla before the \"final assault on Csilla\" happened.\nYiv was an arrogant and extremely confident male Nikardun, which eventually was his undoing, with his arrogance, he easily became furious, which had an effect on his thinking, and strategizing. Yiv had two living epaulets on his shoulders, two fungoid strands of strange creatures he took on as symbionts, which tested the air for toxins and other harmful substances. Yiv considered himself fearless, however, instead of fear, he became constantly enraged. The Nikardun also had much knowledge on architecture, which he was proud of. He was ruthless, being able to kill an entire species just to have revenge on one member of the species, he only cared about his nation and his personal gain.\nJixtus was an ally of Yiv, who had trained him in the arts of conquests, as well as the Nikardun species. The Nikardun general believed the Nikardun were the single allies of the Grysks, however, when Yiv failed, Jixtus got new allies, the Kilji Illumine and the Agbui. During the Agbui attempt to precipitate a Chiss Ascendancy civil war, Nikardun worked on two listening posts in the Chaos, Listening post KR20 and Listening post KR21. However, when Jixtus considered the Nikardun useless to his cause, his forces entered the listening posts and killed every Nikardun aboard. After Ar'alani informed the general of this development, Yiv thought it was false, however, upon seeing many recordings of Nikarduns lying dead, he accepted the truth, getting weak at first, but getting apoplectic quickly.\nAlthough General Yiv held a hatred for all members of the Chiss species, the reason and main focus of his malice was Thrawn. The Chiss Senior Captain had killed members of Yiv's species, the Nikardun—which affected Yiv—and also captured a Nikardun blockade frigate. Thrawn also discovered and alerted the Chiss Ascendancy of the Nikardun Destiny and the threat it produced, which the Aristocra and the Ascendancy had not noticed and would not notice for some time, removing the element of surprise from Yiv's conquests. He also weakened the Paataatus Hiveborn, and later evaded capture by the Tower Dimension and Yiv's forces, frustrating Yiv.\nThe Chiss continued to slow and complicate Yiv's conquests, he prevented the Vak Combine from joining the Nikardun Destiny by sending them many messages, above the planet, Thrawn's \"games\" frustrated and angered Yiv, clouding his judgment, which was his undoing. Allowing Thrawn to defeat him and once again, kill Nikardun. Thanks to Thrawn's efforts, Yiv was sent to prison, where he spent his time since the end of the Nikardun conquests until his exile.\nThe Nikardun could analayze architecture, identifying cultural elements in buildings and constructions. He was also able to convince and manipulate alien species and governments, which aided him during his conquests. He was a powerful leader, and a good tactician thanks to Jixtus' training on the matter.\nYiv first appeared in the 2020 novel Thrawn Ascendancy: Chaos Rising, the first volume in Star Wars: The Ascendancy Trilogy written by Timothy Zahn. In the novel, he was the main antagonist.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Nikardun",
  "/wiki/Gender",
  "/wiki/Nikardun_Destiny",
  "/wiki/Yiv%27s_battle_forces",
  "/wiki/Jixtus",
  "/wiki/General",
  "/wiki/Sentience",
  "/wiki/Species",
  "/wiki/Nikardun_conquests",
  "/wiki/Unknown_Regions",
  "/wiki/Grysk",
  "/wiki/Jixtus%27s_plan",
  "/wiki/Star",
  "/wiki/Chiss",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Capital",
  "/wiki/Flagship",
  "/wiki/Deathless",
  "/wiki/Urchiv-ki",
  "/wiki/Tower_Dimension",
  "/wiki/Paataatus",
  "/wiki/Paataatus_Hiveborn",
  "/wiki/Lioaoi",
  "/wiki/Lioaoin_Regime",
  "/wiki/Planet",
  "/wiki/Csilla",
  "/wiki/Attack_on_the_edge_of_the_Dioya_system",
  "/wiki/Paccosh",
  "/wiki/Refugee",
  "/wiki/Paccian_Governance",
  "/wiki/Senior_Captain",
  "/wiki/Mitth%27raw%27nuruodo",
  "/wiki/Core_name",
  "/wiki/Blockade_of_Rapacc",
  "/wiki/Rapacc_system",
  "/wiki/Vak_Combine",
  "/wiki/Primea",
  "/wiki/Death",
  "/wiki/Battle_over_Primea",
  "/wiki/Fleet",
  "/wiki/Chiss_Expansionary_Defense_Fleet",
  "/wiki/Warship",
  "/wiki/Prison",
  "/wiki/Unidentified_prison_(Csilla)",
  "/wiki/Standard_year",
  "/wiki/Nikardun_campaigns",
  "/wiki/Admiral",
  "/wiki/Ar%27alani",
  "/wiki/Grysk_Hegemony",
  "/wiki/Kilji_Illumine",
  "/wiki/Kilji",
  "/wiki/Exile_(punishment)",
  "/wiki/Hegemony",
  "/wiki/Listening_post_KR20",
  "/wiki/Listening_post_KR21",
  "/wiki/Unidentified_Obbic_family_Speaker",
  "/wiki/Obbic_family",
  "/wiki/19_BBY",
  "/wiki/Water",
  "/wiki/Chiss_Syndicure",
  "/wiki/Speaker",
  "/wiki/Syndic",
  "/wiki/Attack_on_the_Paataatus",
  "/wiki/Supreme_General",
  "/wiki/Ba%27kif",
  "/wiki/Dioya_system",
  "/wiki/Chiss_heavy_cruiser",
  "/wiki/Springhawk",
  "/wiki/Nightdragon_man-of-war",
  "/wiki/Sky-walker",
  "/wiki/Caregiver",
  "/wiki/Mitth%27ali%27astov",
  "/wiki/Unidentified_Paccosh_mining_station",
  "/wiki/Uingali_foar_Marocsaa",
  "/wiki/Marocsaa_subclan_ring",
  "/wiki/Chimaera_(creature)",
  "/wiki/Aelos",
  "/wiki/Pathfinder",
  "/wiki/Qilori",
  "/wiki/Lioaoin_pirate_campaign",
  "/wiki/Ambassador",
  "/wiki/Boadil%27par%27gasoi",
  "/wiki/Urch_system",
  "/wiki/Starfighter",
  "/wiki/Garwian",
  "/wiki/Frangelic",
  "/wiki/Garwian_Unity",
  "/wiki/Solitair",
  "/wiki/Trade",
  "/wiki/Chief_curator",
  "/wiki/Nunech_Art_Collection",
  "/wiki/Primea_diplomatic_reception",
  "/wiki/Thought_line",
  "/wiki/Patrol_boat",
  "/wiki/Vak_spaceport",
  "/wiki/Defense_Hierarchy_Council",
  "/wiki/Mid_Captain",
  "/wiki/Ufsa%27mak%27ro",
  "/wiki/Irizi%27stal%27mustro",
  "/wiki/Irizi_family",
  "/wiki/Standard_day",
  "/wiki/Vak_patrol_boat",
  "/wiki/Pirate_attack_at_Stivic",
  "/wiki/Stivic",
  "/wiki/Lioaoin_cruiser",
  "/wiki/Hyperspace",
  "/wiki/Unidentified_Lioaoi_commander",
  "/wiki/Plasma_sphere",
  "/wiki/Lioaoin_heartworld",
  "/wiki/Bomb",
  "/wiki/Breacher",
  "/wiki/Missile",
  "/wiki/Acid",
  "/wiki/Hull",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Mokivj",
  "/wiki/Deflector_shield_generator",
  "/wiki/Univer",
  "/wiki/Thrawn%27s_freighter",
  "/wiki/Nikardun_Battle_Dreadnought",
  "/wiki/Primea_Central_Command",
  "/wiki/Plikh%27ar%27illmorf",
  "/wiki/Nikardun_patrol_boat",
  "/wiki/Tava",
  "/wiki/18_BBY",
  "/wiki/Agbui",
  "/wiki/Generalirius",
  "/wiki/Nakirre",
  "/wiki/Haplif",
  "/wiki/Epaulet",
  "/wiki/Fungus",
  "/wiki/Poison",
  "/wiki/Agbui_attempt_to_precipitate_a_Chiss_Ascendancy_civil_war",
  "/wiki/Listening_post",
  "/wiki/Alien",
  "/wiki/2020",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Star_Wars:_The_Ascendancy_Trilogy",
  "/wiki/Timothy_Zahn",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil",
  "/wiki/Thrawn_Ascendancy:_Lesser_Evil_(audiobook)",
  "/wiki/Thrawn:_Alliances",
  "/wiki/Clone_Wars",
  "/wiki/Trial_of_Ahsoka_Tano",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Mission_to_Mustafar",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Ahsoka_Tano",
  "/wiki/Jedi_Order",
  "/wiki/Attack_on_Csilla",
  "/wiki/Del_Rey"
 ]
}