{
 "name": "Ymojin",
 "display_name": "Ymojin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Qalydon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lurmen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Gray"
     ]
    }
   ]
  }
 ],
 "content": "Ymojin was an old female Lurmen villager who lived on the planet Qalydon. After the Freemakers arrived the planet, she speculated that they must have come for the marriage. Though the Lurmen initially thought that the Freemakers were working for the Galactic Empire, the Lurmens eventually accepted them as guests. The Freemakers later recovered the Lurmen's kyber crystals from the Imperial officers Durpin and Plumestriker.\nYmojin lived in a Lurmen village on the planet Qalydon with her fellow villagers including Chief Biz, Elan, and their daughter Maynar. After the Freemakers arrived at their village, she speculated that they had come for a marriage. The Lurmen initially thought the Freemakers were working for the Galactic Empire since they had come to search for kyber crystals, which the villagers used to commune with the Force. Despite a brief confrontation, Kordi Freemaker calmed them down by convincing the Lurmen they were not Imperials.\nLater that night, Chief Biz and Elan hosted the offworlders. Shortly thereafter, the Imperial officers Durpin and Plumestriker raided the village and confiscated the villagers' kyber crystals. Rowan Freemaker and Maynar drove the Imperials away with their starship StarScavenger's laser cannons. After the Imperials' Gozanti-class cruiser crashed in the nearby mountains, the Freemakers undertook a mission to recover the crystals from the Imperials, winning them the respect of the Lurmen villagers.\nYmojin was a female Lurmen with gray fur, blue eyes, and white hair.\nYmojin first appeared in the LEGO Star Wars: The Freemaker Adventures Season Two episode \"The Lost Crystals of Qalydon,\" which premiered on Disney XD on August 7, 2017. She was voiced by Pamela Adlon, who also voices Elan.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars",
  "/wiki/Qalydon",
  "/wiki/Lurmen",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Planet",
  "/wiki/Freemakers/LEGO",
  "/wiki/Galactic_Empire",
  "/wiki/Kyber_crystal",
  "/wiki/Imperial_officer",
  "/wiki/Durpin",
  "/wiki/Plumestriker",
  "/wiki/Unidentified_Lurmen_village",
  "/wiki/Chief",
  "/wiki/Biz",
  "/wiki/Elan_(Lurmen)",
  "/wiki/Maynar",
  "/wiki/The_Force",
  "/wiki/Kordi_Freemaker/LEGO",
  "/wiki/Rowan_Freemaker/LEGO",
  "/wiki/StarScavenger",
  "/wiki/Laser_cannon",
  "/wiki/Gozanti-class_cruiser",
  "/wiki/Mission_to_Qalydon",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures_Season_Two",
  "/wiki/The_Lost_Crystals_of_Qalydon",
  "/wiki/Disney_XD",
  "/wiki/August_7",
  "/wiki/2017",
  "/wiki/Pamela_Adlon"
 ]
}