{
 "name": "Yo-Hann_Innk",
 "display_name": "Yo-Hann Innk",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kintan"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kadas'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Gardulla Besadii the Elder"
     ]
    }
   ]
  }
 ],
 "content": "Yo-Hann Innk was a male Kadas'sa'Nikto who was active during the waning years of the Galactic Republic. The Nikto was imprisoned but managed to escape his confinement and fled to the planet Tatooine where he came to be affiliated with Gardulla Besadii the Elder. The Bounty hunter Jango Fett captured Innk on Tatooine, claiming a bounty placed on him by the Republic Correctional Authority.\nBy the year 32 BBY, Yo-Hann Innk had been previously incarcerated but managed to escape his imprisonment, leading to the Republic Correctional Authority placing a bounty on the convicts head. The Authority labeled him armed and dangerous and offer to pay 2,000 for his capture alive but only 1,000 if he was Dead. After his escape Yo-Hann made his way to the planet Tatooine where he became affiliated with the Hutt crime lord Gardulla Besadii the Elder. In 32 BBY the Mandalorian bounty hunter Jango Fett traveled to Tatooine in order to track down a Hutt affiliated with Bando Gora, a cult lead by the former Jedi Komari Vosa on whom a bounty had been placed which Fett meant to claim. Jabba Desilijic Tiure, another Hutt crime lord and a rival of Gardulla, informed the hunter that Gardulla was the Hutt he sought and so the Mandalorian traveled to her palace via the Dune Sea.\nWhilst traveling in the Dune Sea Fett encountered Yo-Hann, who was traveling on board a Bantha-II cargo skiff and fighting the native Tusken Raiders amongst the desert canyons. Fett used his jetpack to reach Innk's vehicle and then subdued the Nikto capturing him alive and claiming the bounty of 2000.\nInnk was a male member of the Nikto Subspecies known as the Kadas'sa'Nikto, who normally had green colored skin, although unusually he possessed purple colored skin. The convict had red eyes and was hairless over his entire body.\nThe Nikto choose to use a blaster rifle in combat and wore armor on his torso. During whilst in the Dune Sea he rode on a Bantha-2 cargo skiff from which he fired down on Tusken Raiders.\nYo-Hann Innk first appeared in the video game Star Wars: Bounty Hunter released in December 2002 by LucasArts. Innk appears in the game in the level titled \"Tusken Canyon\", the second level to take place on Tatooine which is the fifth setting visited in the game. Innk's role is that of a secondary bounty, part of an optional objective found on each level which lets the player capture some of the enemies they fight to unlock bonus content. The Nikto is one of fifteen such bounties on the \"Tusken canyon\" level and is the fourth one the player will encounter. Players have several options upon meeting Innk being able to capture him alive, claim the bounty on him dead or simply kill him without claiming the bounty at all. Each of the possibilities is optional in terms of completing both the level and the game but this article assumes that the player captures Innk alive as this rewards the player the most credits.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kintan/Legends",
  "/wiki/Kadas%27sa%27Nikto/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Gardulla_Besadii_the_Elder/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Nikto/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tatooine/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/Bounty/Legends",
  "/wiki/Republic_Correctional_Authority/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Credit",
  "/wiki/Death/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Mandalorian/Legends",
  "/wiki/Bando_Gora/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Komari_Vosa",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Imperial_Station_Bravo",
  "/wiki/Dune_Sea/Legends",
  "/wiki/Canon",
  "/wiki/Bantha-II_cargo_skiff/Legends",
  "/wiki/Tusken_Raider/Legends",
  "/wiki/Jetpack/Legends",
  "/wiki/Subspecies/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Bounty_Hunter",
  "/wiki/December",
  "/wiki/2002",
  "/wiki/LucasArts",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Star_Wars:_Bounty_Hunter:_Prima%27s_Official_Strategy_Guide",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Galaxy_Guide_12:_Aliens_%E2%80%94_Enemies_and_Allies"
 ]
}