{
 "name": "Yomie",
 "display_name": "Yomie",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Between 19 BBY and 18 BBY",
      "Shihon"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Chiss"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Chiss Ascendancy",
      "Coduyo family",
      "Coduyo family"
     ]
    }
   ]
  }
 ],
 "content": "Yomie was a Chiss female of the Coduyo family and the betrothed of Coduyo'po'nekri. She and Yoponek embarked on a wandering year prior to their final education, choosing to travel the Chiss Ascendancy. When Haplif of the Agbui attempted to study the Chiss in order to spark a civil war within the Ascendancy, he encountered Yomie and Yoponek, offering them passage aboard his starship. He claimed it would save the two Chiss funds and provide guidance for the Agbui, but in reality wished to learn about the Ascendancy to sow the seeds of civil war. Haplif secured Yomie's consent to journey with the Agbui by giving her a beautiful nyix brooch.\nDuring their travels, Yomie recorded information about Haplif and his people in her cloud diary. Yomie eventually deduced that the Agbui were manipulating them and that they were telepathic, forcing Haplif to kill her. Haplif claimed that Yomie wished to remain behind on Shihon for several weeks to watch birds, allowing Yoponek and the Agbui to move on to the planet Celwis, where Haplif intended to further his plans.\nBetween their primary and final education, Yomie and her betrothed Coduyo'po'nekri \"Yoponek\" agreed on spending the traditional wandering year by traveling the Chiss Ascendancy. They had five months to go, when Haplif of the Agbui overheard them discussing finances and their next destination within the Ascendancy on an unknown planet. Haplif, eager to gather more information about the Chiss to sow the seeds of civil war on behalf of the Grysk Jixtus, quickly offered the couple passage aboard his starship. He assured it would save the two Chiss funds and provide guidance for the Agbui, claiming they were cultural nomads. Yoponek was immediately convinced, while Yomie hesitated. She was intrigued by the offer when it came to their finances, but wasn't particularly happy traveling with strangers, or even more so, non-Chiss. In the end, she was convinced by her betrothed and Haplif giving her a beautiful nyix brooch made by the people of Sunrise.\nFor the first five weeks, everything worked out fine for the young Chiss. Trouble began when Haplif learned from Yoponek about Councilor Xodlak'uvi'vil \"Lakuviv\" on Celwis, who the Agbui deemed as the perfect handle for his plans. He tried to convince Yoponek that meeting with Lakuviv would help the young Coduyo to make a name for himself in the Ascendancy. After getting word of the Nikardun loss against the Chiss and the mysterious vanishing of General Yiv, Haplif feared to have little time left, and urged to go to Celwis immediately.\nUnfortunately for him, both he and Yoponek had assuered Yomie to visit the Grand Migration of birds on the planet Shihon, which took a full month, and Yomie was determined not to miss a single day. Her dislike for the Agbui and their recurring tries to touch her temples with their hand made sure that Haplif had no chance of convincing her otherwise. Haplif and Shimkif  both agreed that they had to do something about Yomie. They first tried it the friendly way, even celebrating a faked wedding to soften Yomie's heart. But the young Chiss didn't care for the Agbui. Especially not after the hyperdrive failing on their way to Shihon, which she believed was just another attempt to disrupt her plans for the Grand Migration. Indeed, the failure of the hyperdrive caused their ship to be one day late for the migration. Haplif apologized humbly for the inconvenience, and discovered Yomie's Cloud diary, in which she had recorded information about the Agbui. Yomie prevented him from reading anything in there though.\nEven though they were late for the Grand Migration on Shihon, Yomie and Yoponek could enjoy the first four days of bird watching. Because Shimkif poisoned some landing fields of the birds of the migration, however, the swarms changed course and the Grand Migration was cancelled. Furious and because she begrudged Haplif the possibility of going to Celwis, Yomie discovered that there were two more large bird migrations happening on Shihon, one in the Panopyl Mountains. She was able to convince Yoponek to go there, and as Haplif needed Yoponek to introduce him to Lakuviv, he had no choice playing along.\nThis time, unable to disrupt the migration again, Shimkif succeeded in poisening Yomie with the help of the venomous Greenstripe, incapacitating the young Chiss. Still not ready to give up, Yomie sent Yoponek to watch the birds on the next day on his own, while she remained in her room aboard the Agbui ship. As Haplif tried to convince her that it was finally time to go to Celwis, Yomie tricked him to touch her head while she appeared to be weak. Haplif, not expecting to read any violent emotion by using his telepathy ability, was shocked when he felt her hatred. Yomie, who had had already suspected the touches to her and Yoponek's head to be more than just a sign of friendship, was raging, accusing Haplif of being responsible for the cancellation of the Grand Migration. When she threatened him to tell Yoponek that the Agbui had been manipulating him, Haplif had no chance but to kill her.\nTo still being able to use Yoponek as his guide, Haplif claimed that Yomie wished to remain behind on Shihon alone, while the Agbui and Yoponek would be free to move to Celwis and speak to Councilor Lakuviv. The young Coduyo was first surprised that his betrothed would go watching birds alone without telling him herself, but also eager to go to Celwis. On their way there, when Yoponek was fast asleep, the ship quickly dropped out of hyperspace to shove Yomie's body out the airlock into the vacuum of space, accompanied by her cloud diary and any information she had gathered about the Agbui.\nYomie was hesistant to spend time with non-Chiss like the Agbui, or worse be in debt to them. In her relationship with Yoponek, she was the more pratical and the decision maker of the two. She also appreciated fine jewelry and showed a great interest in wild birds. According to Shimkif, she longed for wide-ranging travel and a balanced family.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/19_BBY",
  "/wiki/18_BBY",
  "/wiki/Shihon",
  "/wiki/Chiss",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Chiss_Ascendancy",
  "/wiki/Coduyo_family",
  "/wiki/Marriage#Betrothal",
  "/wiki/Coduyo%27po%27nekri",
  "/wiki/Wandering_year",
  "/wiki/Haplif",
  "/wiki/Agbui",
  "/wiki/Starship",
  "/wiki/Jixtus%27s_plan",
  "/wiki/Nyix_brooch",
  "/wiki/Cloud_diary",
  "/wiki/Telepathy",
  "/wiki/Death",
  "/wiki/Bird",
  "/wiki/Planet",
  "/wiki/Celwis",
  "/wiki/Core_name",
  "/wiki/Grysk",
  "/wiki/Jixtus",
  "/wiki/Sunrise",
  "/wiki/Councilor_(Chiss_Ascendancy)",
  "/wiki/Xodlak%27uvi%27vil",
  "/wiki/Nikardun",
  "/wiki/General",
  "/wiki/Yiv",
  "/wiki/Grand_Migration",
  "/wiki/Shimkif",
  "/wiki/Hyperdrive",
  "/wiki/Panopyl_Mountains",
  "/wiki/Greenstripe",
  "/wiki/Hatred",
  "/wiki/Hyperspace",
  "/wiki/Airlock",
  "/wiki/Vacuum",
  "/wiki/Thrawn_Ascendancy:_Greater_Good",
  "/wiki/Thrawn_Ascendancy:_Greater_Good_(audiobook)",
  "/wiki/Battle_over_Primea",
  "/wiki/Thrawn_Ascendancy:_Chaos_Rising",
  "/wiki/Template:ChaosRisingDate",
  "/wiki/Attack_on_the_Paataatus",
  "/wiki/Standard_year"
 ]
}