{
 "name": "Yonak",
 "display_name": "Yonak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Cybernetics",
     "values": [
      "Cybernetic right eye"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Son-tuul Pride"
     ]
    }
   ]
  }
 ],
 "content": "Yonak was a Rodian male who was a member of the Son-tuul Pride. He was the successor to his father and held a grudge against Darth Vader and Sutha the Hutt for killing him. He attended an auction for Eternal Rur that was hosted by Doctor Chelli Lona Aphra and held at the Sorca Retreat space station.\nAt some point, Yonak was buying a droid, while knee-deep in waste. On that occasion, he met Chelli Aphra. Yonak's father was the leader of the Son-tuul Pride, the leading criminal organization on Son-tuul. Following his father's death, however, Yonak was forced to take his place.\nA short while after ascending as leader of the Son-tuul Pride, Yonak represented them at the auction of the Eternal Rur, a technopathic A.I. copy of a long-dead member of the Ordu Aspectu stored in a giant Kyber crystal. He and his companions were greeted by 0-0-0, Aphra's murderous droid, and told to mingle and drink with the other guests until Aphra, the auction's host, arrived. Yonak saw Sutha, a servant of Jabba the Hutt and the alleged murderer of his own father, and tried to start a fight with her. Aphra, though, arrived to prevent this from happening.\nAphra started her presentation of the Eternal Rur, explaining it and its technopathic abilities. When a blue Cyban Front droid countered that technopathy was impossible, Aphra allowed Rur to possess that droid to disprove his point. The droid was promptly destroyed by Aphra's muscle, Krrsantan, to keep it from being a threat. When the presentation was done, Aphra promised to meet everyone and see what they offered her for Rur. Aphra assigned 0-0-0 and his astromech companion BT-1 the chore of repairing the Cyban Front droid who protested.\nYonak and Sutha made a deal to join together and give themselves a better chance of winning. If they won the crystal, they would fight it out between themselves to see which organization would get the prize of Eternal Rur, Yonak representing the Son-tuul Pride and Sutha representing Jabba.\nWhen the auction was finally won by the Shadow University, the blue Cyban Front droid, once again possessed by Eternal Rur, went on a rampage of killing people with his blue lightsabers and automatic guns, supposedly possessed by Rur, started firing. It turned out that 0-0-0 and BT-1 had put the Rur crystal inside the blue Cyban Front droid and set the guns to auto-target. 0-0-0 also called Darth Vader about the auction, and Darth Vader and Imperial stormtroopers arrive.\nWhen Rur started to target Yonak, Yonak and Sutha extended their deal to take out the blue Cyban Front droid and take the crystal with the same ending of them fighting it out between themselves. When Aphra is summoned by 0-0-0, she makes 0-0-0 free as part of a deal that 0-0-0 won't kill Aphra in return. Yonak and Sutha find a position where they used the dean of the Shadow University as bait for Rur. Unfortunately for them, Dean dies when Yonak and Sutha think Aphra is Rur. They both try to take Aphra as bait, but she escaped before they could.\nEventually Yonak, Sutha and Aphra got caught between Rur and Darth Vader dueling and his stormtroopers fighting the guests. Yonak escaped by using someone as a body shield, and Aphra did the same but used Sutha as a body shield. Sutha died shortly afterwards. Yonak found a ship where all the stormtroopers guarding it were dead. 0-0-0 and BT-1 arrived and they revealed that they killed the stormtroopers for Yonak but only so they could board with him.\nShortly afterwards, Yonak was attacked for raiding fellow criminals with whom he previously had an alliance. They stormed the throne room, but found Yonak sitting on the throne with 0-0-0 behind him. Yonak pleaded for help, and BT-1 killed the raiders before they realized the situation. Crying, Yonak congratulated his new masters.\nYonak loved and respected his father enough to try murder his father's killers, although he was cruel enough to use Dean as bait and selfish enough to use one of his allies as a body shield so he could live. He was soon reduced to a blubbering slave after the events at the Sorca Retreat space station.\nYonak was a green-skinned Rodian with one purple eye and one cybernetic eye. He wore drab and dirty armor.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Rodian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Cybernetics",
  "/wiki/Eye",
  "/wiki/Son-tuul_Pride",
  "/wiki/Yonak%27s_father",
  "/wiki/Anakin_Skywalker",
  "/wiki/Sutha",
  "/wiki/Hutt",
  "/wiki/Auction_of_Rur",
  "/wiki/Eternal_Rur",
  "/wiki/Doctor",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Sorca_Retreat",
  "/wiki/Space_station",
  "/wiki/Droid",
  "/wiki/Son-tuul",
  "/wiki/Technopathy",
  "/wiki/Death",
  "/wiki/Ordu_Aspectu",
  "/wiki/Kyber_crystal",
  "/wiki/Rur_crystal",
  "/wiki/0-0-0",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Cyban_Front",
  "/wiki/Krrsantan",
  "/wiki/Astromech_droid",
  "/wiki/BT-1",
  "/wiki/Shadow_University",
  "/wiki/Blade_of_Rur",
  "/wiki/Unidentified_Shadow_University_dean",
  "/wiki/Armor",
  "/wiki/Doctor_Aphra_(2016)_9",
  "/wiki/Doctor_Aphra_(2016)_10",
  "/wiki/Doctor_Aphra_(2016)_11",
  "/wiki/Doctor_Aphra_(2016)_12",
  "/wiki/Doctor_Aphra_(2016)_13",
  "/wiki/Doctor_Aphra_(2016)_22",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Covert_Missions",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Scarif_and_Other_Outer_Rim_Planets",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals"
 ]
}