{
 "name": "Yopaxtul",
 "display_name": "Yopaxtul",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Thyferra"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vratix"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A Vratix from the planet Thyferra, Yopaxtul was an athlete who was active during the last years of the Galactic Republic. In 22 BBY, Yopaxtul participated in the prestigious Mobquet Presents: Fastest Land Beings racing meet on Teyr, winning the one hundred meter hexaped race, setting a new speed record of 6.132 seconds in the process.\nOriginally from the planet Thyferra in the Polith system, Yopaxtul was a member of the six-limbed, insectoid Vratix species and a sprinter active during the last years of the Galactic Republic. In 22 BBY, Yopaxtul competed in the prestigious Mobquet Presents: Fastest Land Beings racing meet, held annually in the city of Pyre Folas on the planet Teyr. The Vratix won the meet's one hundred meter hexaped race, setting a new speed record of 6.132 seconds in the process. For the Vratix's victory, Yopaxtul was awarded a medal, and later posed in a picture along with the meets' biped and quadruped race winners—the Teek Yeep and the Selonian Pumav, respectfully. The event of that year's Mobquet Presents, along with Yopaxtul's participated, were reported on by the HoloNet News.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Thyferra/Legends",
  "/wiki/Vratix/Legends",
  "/wiki/Color/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Mobquet_Presents:_Fastest_Land_Beings",
  "/wiki/Teyr/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Standard_second",
  "/wiki/Polith_system",
  "/wiki/Limb/Legends",
  "/wiki/Insectoid/Legends",
  "/wiki/Species/Legends",
  "/wiki/City/Legends",
  "/wiki/Pyre_Folas",
  "/wiki/Medal/Legends",
  "/wiki/Teek",
  "/wiki/Yeep",
  "/wiki/Selonian/Legends",
  "/wiki/Pumav",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_52"
 ]
}