{
 "name": "Yoshi_Raph-Elan",
 "display_name": "Yoshi Raph-Elan",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Yoshi Raph-Elan was a Human male Jedi Knight who served the Jedi Order prior to the Clone Wars. Having fashioned his own lightsaber, he had used a rare orange crystal in its construction.\nShortly following his elevation to the rank of Knight in 31 BBY, Raph-Elan was traveling away from the Jedi Temple when his starfighter was shot down over a backwater planet. Forced to crash-land on the barren world, he managed to activate a rescue beacon before his ship exploded. Gathering himself, he set out to a nearby city in need of assistance. There he found a frantic population, governed by the feared Yahk-Tosh conqueror, Lord Gar-Oth. After a brief skirmish in the streets with a battle droid, Raph-Elan discerned the location of the droid's base, and headed there in an attempt to free the people of the town.\nAs the Jedi ascended the Royal Palace, he came upon a balcony occupied by Princess Lourdes, the heir-apparent to the throne of the desolate world. Realizing the man on her balcony was a Jedi, she described how her father was killed by Gar-Oth, and that a vision describing a hero known as the Foreseen gave her people hope of freedom. As her aid Skeeter prepared the Princess for a ball that was to be held that night, Lourdes declared that Raph-Elan would accompany her as a servant. Dressed in formal-wear, Raph-Elan was horrified to learn that the dictator planned to marry Lourdes to make his conquering of the planet legal. Revealing himself, the Jedi brandished his lightsaber, only to discover that it had been damaged during his crash. Angered by the Jedi's arrival, Lord Gar-Oth presented his bride-to-be's wedding gift, a Goliath droid. Ordering the droid to destroy the Jedi, Raph-Elan managed to damage the hulking machine with the Force, while using wiring from the damaged droid to mend his lightsaber. Defeating the droid, the Jedi discovered Lourdes had killed Gar-Oth with a sword she had taken from his Jilruan guard.\nSoon after in the Princess' chambers Raph-Elan asked whether she believed that he was the Foreseen. She responded by revealing that the Foreseen was said to be a woman, meaning that she was the individual of prophecy. Revealing that she had feelings for him, Lourdes told him to return to her when he had grown up a bit more. Skeeter informed the two that the Jedi rescue team had arrived, and Raph-Elan departed safely for Coruscant. On board the ship, Raph-Elan confided in the pilots that he might return one day to Princess Lourdes.\nAfter having recently attained knighthood, Raph-Elan lacked a constant focus vital to a Jedi Master. However, he was not want for effort, as he constantly reminded himself to focus on the Living Force and draw from it to gain strength. Compassionate and eager to help others in need, he was quick to step into and assist in the overthrow of a tyrannical regime. Although living in a time when attachment was banned by the Jedi High Council, he fell for Princess Lourdes while stranded on her planet. Although he had feelings for her, he stayed true to the Jedi Code and returned to the Order without pursuing a romantic affair with the princess.\nAs with many Jedi, Raph-Elan was not only a skilled lightsaber practitioner, but also highly versed in hand-to-hand combat. While trapped on a backwater planet with a broken lightsaber, Raph-Elan was able to defeat a GX1-series battle droid with his hands. In addition to his strengths as a combatant, he was trained in fighter piloting. While skilled, his craft was shot down and destroyed on a desolate world.\nSeveral years after his creation for the Republic comic, author Abel G. Peña had planned to kill off Yoshi Raph-Elan. Peña intended to place Raph-Elan on General Grievous's Jedi kill list in Unknown Soldier: The Story of General Grievous, but his appearance was removed by Lucasfilm before being published.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Yoshi",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Lightsaber_crystal",
  "/wiki/Knighting_ceremony/Legends",
  "/wiki/31_BBY/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Starfighter/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Lourdes%27_homeworld",
  "/wiki/Yahk-Tosh",
  "/wiki/Lord/Legends",
  "/wiki/Gar-Oth",
  "/wiki/GX1-series_battle_droid",
  "/wiki/Prince/Legends",
  "/wiki/Lourdes",
  "/wiki/Lourdes%27_father",
  "/wiki/Skeeter",
  "/wiki/Goliath_(droid)",
  "/wiki/The_Force/Legends",
  "/wiki/Jilruan/Legends",
  "/wiki/Security_Guard/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_courier_1101",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Living_Force/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Abel_G._Pe%C3%B1a",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/Unknown_Soldier:_The_Story_of_General_Grievous",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Star_Wars_(1998)_27",
  "/wiki/The_Official_Star_Wars_Fact_File",
  "/wiki/The_Official_Star_Wars_Fact_File_128",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_111",
  "/wiki/Jedi_Council_Forums"
 ]
}