{
 "name": "Yotts_Oren",
 "display_name": "Yotts Oren",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "4 ABY",
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kadas'sa'Nikto"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba Desilijic Tiure's criminal empire"
     ]
    }
   ]
  }
 ],
 "content": "Yotts Oren was a Kadas'sa'Nikto male who served in the criminal empire of the Hutt crime lord Jabba Desilijic Tiure on the planet Tatooine. In 4 ABY, he flew aboard a Bantha-II cargo skiff to the Great Pit of Carkoon in order to watch the execution of three of Jabba's prisoners: the Jedi Luke Skywalker and the smugglers Han Solo and Chewbacca.\nUpon reaching their destination, the skiff carrying the prisoners stopped over the pit, where they were to be fed to a sarlacc. Skywalker was selected to be pushed in first, but attacked the guards after being armed with his lightsaber. After all of the guards on the prisoners' skiff had been defeated, the skiff carrying Oren approached so that the guards on board could try and take down Skywalker. Instead, the Jedi boarded their skiff and defeated Oren and his colleagues, knocking the Kadas'sa'Nikto into the maw of the sarlacc.\nThe Kadas'sa'Nikto male Yotts Oren worked as a guard for the Hutt crime lord Jabba Desilijic Tiure and served as part of his criminal empire in Jabba's Palace on the planet Tatooine. In 4 ABY, Jabba ordered that three of his prisoners—the Jedi Luke Skywalker and the smugglers Han Solo and Chewbacca—be transported by skiff to the Great Pit of Carkoon and fed to the sarlacc that dwelt there. Oren was part of a group of guards that flew on a second Bantha-II cargo skiff piloted by the Skrilling Pote Snitkin and traveled alongside the vehicle that carried the prisoners. Once the vehicles reached the pit, the skiff carrying the prisoners flew out over the sarlacc, while the skiff carrying Oren began joyriding around in circles over the desert.\nJabba, who had traveled to the pit aboard his sail barge, Khetanna, to view the executions, gave the prisoners one last chance to beg for their lives. When they refused, Jabba ordered that the first prisoner, Skywalker, be pushed in to the waiting maw of the sarlacc. However, Skywalker managed to leap back onto the skiff and, armed with a lightsaber provided by his astromech droid R2-D2, attacked the guards aboard the prisoners' skiff. As Skywalker dispatched the last of the guards aboard his own skiff, Snitkin piloted his skiff closer so that Oren and the others on board could fire at Skywalker. The Nikto leaned out over the railing of the skiff and fired at Skywalker with a blaster pistol, after which the Jedi boarded the second skiff and began to fight the guards that were on board.\nOnce Skywalker was aboard the skiff, Oren initially dropped back toward Snitkin at the rear of the vehicle. After Skywalker knocked Brock Starsher and another guard overboard, the Nikto rushed forward past his other comrades to attack. The Jedi then slashed at Oren's face, causing him to tumble backward over the skiff's railing and directly into the maw of the sarlacc. Skywalker and his allies subsequently defeated the remainder of the guards and killed Jabba before destroying the sail barge and escaping.\nOren had green skin and black eyes.\nWhile on the skiff, Oren wore a black hood and pauldron with two black bandoliers crossed over a gray shirt and gray pants. He also wore black shoes, gray wristbands, and used a DL-18 blaster pistol.\nYotts Oren first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The character's full head mask measured thirty-six centimeters by fifty-three centimeters by thirty-three centimeters. The scream used for Oren's fall into the sarlacc pit is the Wilhelm scream, which is used for multiple other characters throughout Return of the Jedi and the other Star Wars films. The scenes on Oren's skiff were filmed in the Yuma desert in Arizona between April 12 and April 24, 1982, with the skiffs then moved to Industrial Light \u0026 Magic in California for blue screen shots that were filmed between May 10 and 14.\nIn the new Star Wars canon, Oren was first identified in \"The Battle of Hoth and the Second Death Star,\" an issue of the Star Wars Encyclopedia series published by De Agostini on December 11, 2020. The character's name originated as \"Yotts Orren\" in the Star Wars Legends continuity on a card in the 2001 Tatooine Limited set of the Star Wars Customizable Card Game; however, the card incorrectly pictured the Kadas'sa'Nikto Klaatu. The hooded Nikto was then identified as Yotts Orren in the \"Rogues Gallery\" feature of Star Wars Insider 143 on July 23, 2013. Despite this, a card added to the Star Wars: Card Trader app in 2017 as part of the \"Galactic Underworld: Live-Action\" series misidentified an image of Yotts Oren as Klaatu.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Yotts_Oren",
  "/wiki/Yotts_Orren",
  "/wiki/Yotts_Oren/Legends",
  "/wiki/4_ABY",
  "/wiki/Tatooine",
  "/wiki/Kadas%27sa%27Nikto",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/File:YottsOrenDeath.ogg",
  "/wiki/Hutt",
  "/wiki/Crime_lord",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Planet",
  "/wiki/Bantha-II_cargo_skiff",
  "/wiki/Great_Pit_of_Carkoon",
  "/wiki/Death",
  "/wiki/Prisoner",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/Smuggler",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Skiff",
  "/wiki/Sarlacc",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Luke_Skywalker%27s_green_lightsaber",
  "/wiki/Mouth",
  "/wiki/Boba_Fett%27s_Palace",
  "/wiki/Skrilling",
  "/wiki/Pote_Snitkin",
  "/wiki/Desert",
  "/wiki/Sail_barge",
  "/wiki/Khetanna",
  "/wiki/Astromech_droid",
  "/wiki/R2-D2",
  "/wiki/Nikto",
  "/wiki/Blaster_pistol",
  "/wiki/Brock_Starsher",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/Pauldron",
  "/wiki/Bandolier",
  "/wiki/Shirt",
  "/wiki/DL-18_blaster_pistol",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Wilhelm_scream",
  "/wiki/Star_Wars",
  "/wiki/Yuma",
  "/wiki/April_12",
  "/wiki/April_24",
  "/wiki/1982",
  "/wiki/Industrial_Light_%26_Magic",
  "/wiki/May_10",
  "/wiki/May_14",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/De_Agostini",
  "/wiki/December_11",
  "/wiki/2020",
  "/wiki/Star_Wars_Legends",
  "/wiki/2001",
  "/wiki/Tatooine_Limited",
  "/wiki/Star_Wars_Customizable_Card_Game",
  "/wiki/Klaatu/Legends",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_143",
  "/wiki/July_23",
  "/wiki/2013",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/2017",
  "/wiki/Klaatu",
  "/wiki/Star_Wars:_Complete_Vehicles",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Disney_Gallery:_The_Mandalorian:_Making_of_Season_Two",
  "/wiki/Tatooine_(Star_Wars_Encyclopedia)",
  "/wiki/Databank_(website)",
  "/wiki/Category:Images_of_Yotts_Orren",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Return_of_the_Jedi:_Beware_the_Power_of_the_Dark_Side!",
  "/wiki/From_Star_Wars_to_Indiana_Jones:_The_Best_of_the_Lucasfilm_Archives",
  "/wiki/February_22",
  "/wiki/2018",
  "/wiki/June_2",
  "/wiki/The_Making_of_Return_of_the_Jedi",
  "/wiki/July_10",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Insider_134",
  "/wiki/Titan_Magazines"
 ]
}