{
 "name": "Yrica_Quell",
 "display_name": "Yrica Quell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gavana Orbital"
     ]
    },
    {
     "name": "Born",
     "values": [
      "During or after 18 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Academy",
      "204th Imperial Fighter Wing",
      "Imperial Academy",
      "204th Imperial Fighter Wing",
      "New Republic",
      "Alphabet Squadron",
      "Alphabet Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Yrica Quell was a human female X-wing starfighter pilot who, during the final months of the Galactic Civil War, served in the New Republic Starfighter Corps as leader of Alphabet Squadron. Raised aboard the Gavana Orbital space station, Quell joined the Imperial Military as a member of the 204th Imperial Fighter Wing during the reign of the Galactic Empire. She defected to the New Republic after initially participating in Operation: Cinder, and was granted command of a mixed starfighter squadron. Prior to the Battle of Jakku, General Hera Syndulla ordered Quell to hunt down and destroy the 204th.\nBorn around 18 BBY in the early years of the Galactic Empire, Yrica Quell was raised on a space station, the Gavana Orbital, prior to her military service under the Empire. Her father drank brandy, which Quell developed a taste for with help from her brother. Her mother was a pilot who operated a YT-2400 light freighter. When she was sixteen years old, Quell and her friend Nette saw one of Mon Mothma's transmissions speaking out against the Empire. Nette convinced Quell that she should join the Rebellion. However, without any sort of training, Quell decided to join the Empire first and then defect to the Rebellion after training at the Imperial Academy.\nQuell enlisted with the Imperial Starfighter Corps intending to defect to the Rebel Alliance after graduation until she decided that she wanted to learn more and changed her plans, telling herself she would defect after a few missions. Quell soon graduated from the Academy, became a TIE fighter pilot in the 204th Imperial Fighter Wing. However, she soon decided the Empire was not as bad as the propaganda made it out to be and didn't want to abandon her colleagues, and stopped planning to defect. She became completely loyal to the Empire, despite her earlier desires to join the Rebellion. Her mentor, Soran Keize, knew this and made her keep it a secret.\nSometime after the Battle of Hoth, Quell and the rest of the 204th were engaged in combat against Rebel forces. Zin Graw, member of Squadron Five, had broken off from her squadron was busy taking out enemy A-Wing fighters, when one of them snuck up behind her fighter and almost took her out. Quell came in and destroyed the fighter just in time, saving Graw's life. Arriving back at the hangar, Graw thanked Quell for saving her life. Quell then mentioned her observation that the A-Wing pilot she'd shot down had been trained at the Imperial Academy. Quell then started to air her doubts but then promptly cut herself off and excused it as a stupid joke. She told Graw to tell Ganem Kahi that he owed Quell one, before Quell stalked off, leaving Graw to herself.\nAs Operation: Cinder began two weeks after the Battle of Endor, Shadow Wing was ordered to destroy the planet of Nacronis. Quell carried out her orders and destroyed the planet, but felt tremendous guilt afterwards. Keize found her, and told her to finally defect to the Rebellion. After defecting, Quell was taken to Traitor's Remorse, along with twelve thousand other defectors who were processed at the base. While the New Republic was wary of her, she was deemed a low-value target, as she did not possess any classified or useful information; the New Republic was under the impression that she defected during Operation: Cinder, and tried to stop the attack. The reprogrammed Imperial IT-O droid used by New Republic Intelligence Agent Caern Adan was convinced that Quell was lying about something.\nAdan approached Quell to discuss the 204th Imperial Fighter Wing with her, and to share with her that he was beginning a task force to neutralize the group. He stated that he would approach her again when he decided if he would like her on the team or not and that she should have an answer ready. Later, she went to Warren to try to \"swap rumors\" and try to get information about Caern Adan. While she was there, a bomb exploded, and she rescued a brand new defector, who she thought was \"a bastard\" because he arrived with a group of defectors that took too long to defect in her eyes.\nQuell accepted the job with Caern Adan to join the task force. Her first task was to recruit Nath Tensent, who had defected along with his entire squadron before the destruction of Alderaan after getting caught accepting bribes from pirates, from the trading outpost known as the Entropian Hive to join the task force. The mission was ultimately successful, though Tensent didn't agree to join until Adan quietly bribed him. After Tensent's arrival, Adan tasked Quell with listening to recordings of Imperials that New Republic Intelligence had assembled to help gather information on Shadow Wing. Quell was frustrated by this task and also was traumatized by having to listen to hours of recordings regarding Operation: Cinder, which she had participated in and helped the Empire commit terrible crimes against innocent worlds. Several days later, Quell decided to steal a T-65B X-wing starfighter, and, with the help of D6-L, went on her own scouting mission to gather information about Shadow Wing. She returned and faced minor discipline from Adan, but he was more concerned about Quell's findings. She had discovered that Shadow Wing had attacked a New Republic ship, the Hellion's Dare, and killed almost all of the squadron pilots defending it except the two that escaped, Wyl Lark and Chass na Chadic. Both pilots joined Adan's working group, and after a couple weeks, the five of them were invited onto the Lodestar, where General Hera Syndulla agreed to let them search for Shadow Wing. Adan reluctantly assigned Quell to be the leader of the new squadron.\nQuell led the newly minted Alphabet Squadron in a series of practice maneuvers to help the group learn to fly together. During a practice in the Gobreton minefield, Lark's ship was heavily damaged, and Adan demoted the squadron to only practicing in the Lodestar's Flight simulators. Quell had her squadron simulate the Battle of Endor. When the squadron was not flying together, Quell began to assemble a program to simulate combat against Shadow Wing and also creating personnel files for the pilots of her old unit.\nLater, Quell led the squadron on a Mission to Abednedo. She and Chadic made contact with a Verpine smuggler, who showed her a group of Imperial prisoners. She sent the first prisoner back to Kairos and the U-wing with Chadic and followed the Verpine, finding over a dozen more prisoners. Quell made a deal for the Verpine to fly the 690 light freighter with the prisoners back to the Lodestar. However, when Quell and the freighter made it into orbit, she found Tensent, Lark, and the others being attacked by TIE/sa bombers. Quell dived at the last bomber as it attempted to destroy the freighter, but missed her shot and watched with horror as the bomber rammed into the freighter, killing everyone onboard.\nWhen they returned to the Lodestar, Adan grew frustrated with her. Quell then lashed out at him, saying it was his fault for not giving them anything to work with and had unrealistic expectations from them. When Adan roared at her, Quell struck him in the stomach. She later vomited in the bathroom when she thought about her failure and the bodies she had witnessed floating in the vacuum of space.\nExpecting retribution for their failed mission, Quell was surprised when General Syndulla assigned them a new mission. She told Quell to lead the squadron to Harkrova I to recover a Rebel Alliance supply cache. Knowing the non-combat mission was a sort of punishment, Quell knew her squadron needed to succeed on this mission, and Syndulla told her that their performance on the mission would dictate if there was another mission for them. Alphabet Squadron landed on a mountaintop near the temple where the cache was located. The squadron planned to hike down the mountain to reach the temple. When they made camp, Quell listened to Lark tell stories, but denied a request to share stories of her own. Quell later saw the mysterious Kairos share stories through drawings, but still did not open up. When they spotted pirates potentially attempting to steal supplies from the cache, Quell hiked back up to the ships alone to keep watch over them. When the squadron finished their mission, Quell was relieved to see them more friendly with each other and held some reservations about her lack of an attempt to bond with her new wingmen.\nNot long after returning to the Lodestar, General Syndulla tasked Alphabet to assist with another salvage operation in Argai Minor. As this was part of a larger operation, Quell led Alphabet in support efforts. This was the squadrons first time in an active combat operation, and led to further operations around Argai Minor. Not long after the Argai Minor mission, Quell sought to make a gesture to her squadron that reinforced her commitment to them. After deliberation, Quell asked the mechanic Ragnell for a favor, and got her to paint the Alphabet Squadron insignia on their ships as a surprise to the squadron. When she witnessed their surprised reactions, she rolled up her sleeve to show them her new tattoo of the insignia on her bicep, trying to show her commitment to her team. While Tensent was somewhat annoyed by the surprise, the squadron was happy with the result and Quell's show of support.\nEventually the various hints and intelligence gathering Adern had done paid off and they tracked the 204th to Pandem Nai, where the wing had established a base in one of the Tibanna gas platforms. The area was protected by a dense minefield that would have seriously damaged the battle group if they attempted a direct assault and provided more than enough time for the 204th to deploy and possibly escape. Also, Pandem Nai's atmosphere was so volatile that turbolaser fire from capital ships would ignite it. Yrica came up with a plan, which Adern and Hera Syndulla approved, that involved alphabet squadron picking its way through the minefield without the rest of the battlegroup and then staging a direct assault on the launch bays installed on the mining platform, sealing most of the 204th in the base. Meanwhile Kairos's U-wing would deploy a commando assault squad to secure the base before the pilots could deploy, keeping them grounded.\nAlphabet was able to seal the launch bays but there were still enough TIEs deployed to make the fight problematic. Quell stayed mostly on Chass's wing, escorting and defending the B-wing as it launched its assault on the stations' weapons after the docking bays were sealed. They were holding on well enough but two near disasters occurred simultaneously; Colonel Nuress ordered the hangar bay doors blown up to clear the way for launch, and the station's Tibanna containment began failing. The failing containment left the platform to both explode and fall out of the sky. The 204th largely concerned itself with escaping, leaving Pandem Nai to die. With memories of Nacronis forefront in her mind, Quell ordered the squadron to help in preventing the tibanna stores on the platform and transport ships from detonating. She herself took her X-wing into the atmosphere to disintegrate parts of the station falling that posed a threat due to their size. The effort was largely successful but Quell's X-wing and droid were heavily damaged and she crashed on the surface.\nCaern Adan and IT0 eventually found her. Having received her service record from Nath Tensent, Adan confronted her about her actual participation in Operation Cinder on Nacronis, where she confessed that she'd fully and willingly completed the mission to scour the planet and only defected afterward. Adan then told her that She would be working for him directly, and the information would stay between them as long as she was compliant.\nFollowing the Pandem Nai battle, Hera Syndulla's battle group moved to the Cerberon system to engage the planet Troithe. The overall mission was to liberate the planet from control of the Imperial governor. Caern Adan had been granted more resources by New Republic Intelligence to locate the 204th and had Quell working with him on that effort, even though Alphabet Squadron was performing mostly standard air support missions for the ground troops taking the planet. At the same time Quell was being mentored by Hera Syndulla in New Republic/Rebel thinking and organization, and continuing \"counseling\" with ITO over her feelings about Nacronis and her participation in it.\nDespite having a plan to siege the major settlement and force the governor's forces to surrender, Adan and Quell devised a plan to take the settlement more directly. It would cost more lives on the New Republic side, but it would make an enticing target for the 204th as it would seem like they didn't have solid control of the planet. Despite her own misgivings about the plan, Adan reminded her of his blackmail and got her to support it when they presented it to Syndulla. She approved the plan.\nAfter that, Quell experienced a number of setbacks. First, while the attack succeeded, Kairos was badly injured. In trying to visit Kairos, Caern Adan ended up captured by unknown forces. Finally, Hera was called away to assist with another campaign, and took Vanguard Squadron with her. She left Quell in charge of general operations as she was the mastermind behind the trap for the 204th and assured her Adan would be found. Quell was worried about him spilling her Nacronis secret, however, so she got Nath Tensent to help her locate him. Using a nondescript freighter they'd captured, they eventually tracked down a renegade Imperial group that held him and mounted a rescue, but it was too late for Quell. A failsafe set up by Adan released the true story of her participation in Operation Cinder to her squadmates, who confronted her on her return and demanded she surrender to New Republic authorities for war crimes.\nBefore that situation could be fully resolved, the 204th attacked. Ignoring the trap set by Quell and Adan, they instead sent fighters to attack Troithe's main city and used an old Star Destroyer to engage the Lodestar, thinking Hera Syndulla was still on it. Locked out of her fighter, Quell instead commandeered the freighter again, thinking the 204th had a hidden agenda that wasn't obvious. Adan and ITO were on the freighter but didn't stop her. Ignoring the main battle, Quell located the 204th's Quasar Fire-class cruiser-carrier and mounted an assault by towing a large piece of debris at the ship. The impact destroyed the carrier, but Soran Keize personally disabled the freighter, causing them to crash on a planetoid in the system.\nThe crash left Adan wounded and ITO missing. Insisting they find the droid, Adan had them set out to find the rest of the ship's wreckage. As they traveled, Adan told Quell about his time in an Imperial prison where he'd met Kairos and another inmate had reprogrammed ITO, allowing them to escape. They eventually found the droid low on power, but by then Adan couldn't walk any more due to his injuries. ITO, however, had located a power source that turned out to be a sith-style temple, though Quell was only vaguely aware of its origins from old propaganda broadcasts. They soon discovered when the system's black hole was aligned a certain way with the temple, it initiated a telepathic connection with Quell, forcing her to relive memories of significant emotional times in her life. ITO detected some response from the temple depending on her mood, so she continued to interact with it.\nHer progress stalled quickly. ITO sustained more damage than it let on, and eventually the power loss and continued degradation caused it to revert to its originally programming as an IT-O Interrogation Unit. Quell was forced to destroy the droid but not before it accused her of being a war criminal. Shortly afterward, Adan succumbed to his wounds and died. The losses left Quell in a dark emotional state, so her next interaction with the temple she gave up her pretenses of defending or denying her actions. The temple responded and revealed a ship inside.\nBelieving her New Republic comrades would never forgive her or understand her at that point, she used the unknown ship's stealth systems to sneak through the final battle of Troithe and attach to the bulk freighter the 204th's survivors had stolen from Troithe's mining megafacility without being detected by either side. She then surrendered herself to Soran Keize as Lieutenant Yrica Quell, her previous Imperial rank.\nQuell did not reveal that she had been working with the New Republic and claimed to have been in a reclamation camp between the time she left the squadron and her return. As part of the ruse, she'd burned off her Alphabet Squadron tatoo. Soran Keize took her on as a personal aide because of his own need to work and talk with someone who would share his philosophy for leading the squadron, one that didn't necessarily match the post-Endor Empire.\nIn secret, Quell worked to undermine the 204th. Using parts stolen during repairs, she created a simple burst transmitter and hid it on the bulk freighter Yadeez the 204th was using as a carrier. While the 204th carried out their orders to continue Operation: Cinder, Quell waited for Hera Syndulla to catch up to them. When Syndulla arrived with Alphabet squadron in the Deliverance, she began sending out burst transmissions so the New Republic could follow them. Keize quickly realized someone was tipping off the New Republic and ordered the crew to search the vessel. Knowing she would be discovered, she went to where the transmitter was hidden and broke it, but also ran afoul of the Sentinel Messenger Droid, which she shot and destroyed.\nKnowing she couldn't hide it, she reported it to Keize. Keize saw an opportunity to learn the root thinking behind Cinder, and began working to disassemble the droid with Quell. After they had stripped it down and exposed its encrypted memory bank, Keize ordered Quell to take a small team to the planet Netalych where the droid masters of the world could decipher the memory. When the 204th began the next phase of Cinder over the planet Chadawa, Quell took the stealth ship she'd retrieved in Cerberon and left. Unfortunately Chass and Kairos followed her.\nLanding on Netalych, she was vague with the members of the squadron who'd come along regarding the nature of their mission; Keize had warned her many of the squadron members almost worshipped the Emperor's messenger and would not understand their need to figure out its workings. After some investigation, Quell located a droid who would decipher the memory for her, though the price was a year of servitude from one of her crewmates. Unbeknownst to her, one of them had volunteered after Quell told him the mission was vital to the Emperor's vision.\nShe retrieved the decrypted data from the droid but ran into two problems simultaneously. Upon returning from the droid's workshop, the rest of her crew confronted her with the destroyed and disassembled messenger. Suspecting her of treason, they locked her in a room in their on-planet apartment. Before they could act on their suspicions, however, Chass and Kairos attacked, having tracked Quell to the planet. Quell escaped through a window but made sure to complete her mission; she reviewed and uploaded the data from the messenger to Keize. Just as she finished that, however, Chass found her, beat her badly, and dragged her back to Kairos's U-wing, triggering a firefight with the Imperials.\nThe fight in turn triggered the droid security forces, who damaged the U-wing's hyperdrive and navicomputer. Despite not trusting her, Chass and Kairos allowed Quell to fix the hyperdrive. Both she and Chass were then horrified when Kairos made a jump without programming or calculating coordinates. Somehow the jump took them to Kairos's homeworld, where they landed in the dense jungle. They located an abandoned Imperial facility where they guessed there might be enough spare parts to repair the navicomputer. Journeying on foot, they arrived and looted the facility, though Quell secretly gathered equipment that would let her send a long-range transmission.\nThey were briefly held up at the facility when other members of Kairos's species surrounded it, but Kairos snuck them out and they rigged the facility to explode, scaring off the rest of the locals long enough for them to make it back to the U-wing. After briefly observing Kairos perform a sort of local burial/farewell ritual, they got the ship repaired.\nAt night, Quell contacted Keize. By that time her team had returned to the Yadeez and voiced their suspicions about Quell's allegiance. Also, communications during sorties over Chadawa had revealed Quell's association with Alphabet Squadron. Quell and Keize's discussion was brief but each seemed to realize they were stuck on opposite sides from then on.\nWhen the ship returned to the Deliverance it was after the ship had finished engaging the 204th at Chadawa; all ships on both sides were being recalled as a prelude to the Battle of Jakku. Hera did not order Quell's arrest or Imprisonment, but remained frustrated at her reluctance to share what her mission on Netalych had been. Quell was conflicted because of the larger implications of the knowledge and her divided loyalties. In the end, however, she decided to tell Hera and Alphabet squadron the truth.\nThe Messenger Droid's memory bank revealed the messengers all got their information from a central databank the Emperor had constructed, which gathered information on every person in Imperial service. It catalogued their attitudes, general loyalty, what crimes and missions they'd participated in, their Midi-chlorian count, and other demographic data. The droids used the information to identify Imperial units that would carry out Operation Cinder. Keize and Quell both feared that if the databanks fell into the hands of the New Republic, it would kick off an endless hunt for everyone on the list; no Imperial would ever be free of their past because Imperial service almost always involved participation in or knowledge of some kind of questionable activity. She revealed that Keize intended to destroy the databank on Coruscant, but doing so would damage a large portion of the city, killing many thousands of people.\nHera took the information to Mon Mothma and other New Republic leaders, who agreed it should be dealt with, but nobody could spare teams to do anything about it until after the battle. In the end, Hera gave Quell special dispensation to intercept Keize, giving her the use of a new prototype T-70 X-wing starfighter to do it. Kairos also accompanied her in her U-wing, but the rest of Alphabet Squadron stayed with the Deliverance.\nArriving at Coruscant, Keize had already foiled the blockade enough to slip through to the planet's surface and Quell and Kairos followed his path. Some of the TIE/sk defense force had rallied by then, however, and Kairos dropped back to delay them. Quell chased Keize through the towers and streets of the city en route to the databanks. They each avoided engaging each other in favor of fighting off the TIEs, but when they arrived at the databank there was a more direct confrontation. Keize stuck to his belief that leaving the databank intact would doom former Imperials to endless persecution, while Quell argued that destroying the databanks would kill thousands of people.\nNeither gave in and they fought, Keize gradually taking out the supports that kept the databanks suspended, while Quell tried to damage him. Keize was a far better pilot however, and Quell made no headway. Keize tried to understand why Quell didn't agree with him, and Quell finally admitted that she had accepted her guilt over her crimes, and didn't feel she had the right to kill thousands of people just on the chance that the New Republic wouldn't act responsibly with the information. That admission on an open channel convinced Kairos that Quell was not to blame and she got a swarm of TIEs to follow her to the site of their duel where she detonated her U-Wing, causing Keize's TIE to crash.\nQuell landed and found Keize trying to manually rig the databanks to explode, but he was far too wounded and she stopped him. They talked briefly before Keize succumbed to his wounds, but she was left with the feeling that while Keize could have been a good man, his loyalties had been in the wrong place for too long.\nEventually she was found by Kairos, who had survived the jump from her ship. Declaring she had moved on to a new phase in her life, Kairos left her to return to the New Republic alone.\nImmediately after the Battle of Jakku, Quell was thoroughly debriefed and Mon Mothma had her placed on house arrest, rather than imprisoned. She and the rest of the New Republic leadership recognized Quell's case was precedent setting, and would determine how the rest of the Imperials would be treated after the war. Quell expected life imprisonment to be the most lenient option she could expect, and was therefore shocked when Hera visited her and announced she was to be set free and given a medal for her work in infiltrating the 204th and stopping Keize. The tradeoff was that she could not participate in New Republic government in any way and was restricted from owning weapons or armed craft. Quell felt that she didn't deserve the medal, and Hera counseled her to think of it as politics; giving her the medal after everything she did let them be lenient with Imperials who hadn't done as much to redeem themselves.\nIn the years following, Quell acquired an intra-system cargo ship and began making cargo runs, mostly for medical facilities. Eventually she took on Chass na Chadic as a partner when the latter found herself destitute and lost after her New Republic pension ran out on Corulag. At some point the two became lovers.\nQuell was a human female who, along with the rest of Alphabet Squadron, was attempting to find their place in the galaxy. Quell had a strong sense of duty that kept her from defecting from the Empire despite her intentions to do so after graduating from Academy. She had an extremely good memory. Not long after its formation, Quell had the Alphabet Squadron crest tattooed on her biceps. She was known to be temperamental, withdrawn, and a superlative flyer.\nQuell found comfort in order and regularity, something she and others believed kept her in service to the Empire. She only actually left Imperial service after being ordered to by her commanding officer at the time. Despite wanting to serve with the New Republic, she never felt completely comfortable with its lax style and patterns, though she recognized the advantages of some of their unorthodox or improvisational combat plans.\nFor most of her time in Imperial service she felt a sense of discomfort about the nature of some of their missions and was greatly influenced by Soran Keize to focus on serving her comrades rather than thinking about the larger implications of their missions. This left her with a profound sense of guilt, particularly after the mission to eliminate Nacronis as part of Operation: Cinder. It took her years to come to terms with the guilt, and even after she carried a lingering sense that she was spared the punishment she deserved.\nPrior to her defection from the Imperial Starfighter Corps, Yrica Quell had relationships with several individuals. At the age of 16, Quell was close with a young woman named Nette who was one year older than Quell. One day, Nette joined the Rebel Alliance and convinced Quell to train as a pilot so she could also join the Alliance one day. In fact, Quell joined the Imperial Academy to gain experience as a combat pilot with defection to the Alliance in mind.\nUpon her defection to the New Republic in the weeks following the battle of Endor, Quell was questioned by an interrogator droid named IT-O. Quell told IT-O that she would be willing to talk about anything, including her first girlfriend or last boyfriend, if it would prove to the droid that she was fit to command the newly-formed Alphabet Squadron. Despite being frequently frustrated and annoyed at the droid's indirect, leading method of talking to her, she missed the droid when it was destroyed, thinking for a time that it was the only person she could honestly talk to.\nQuell had an antagonistic relationship with Caern Adan, who she felt never really trusted her and eventually blackmailed her. Despite that she developed a functional working relationship with him during their time on Troithe, although by the time of Adan's death she didn't feel much real affection for him and believed he thought of her as nothing more than a war criminal he could use.\nShe saw Hera Syndulla as a mentor, particularly in understanding New Republic/Rebellion attitudes and thinking. She thought Hera was the first person to show confidence in her as a squadron commander and disliked the fact she thought Hera would disapprove when she went back to the 204th.\nRomantically, Quell was also known to have at least one girlfriend and at least one boyfriend prior to joining up with the New Republic, and she admitted to a casual liaison with one of the pilots of the 204th before they began Operation: Cinder. During her time with Alphabet Squadron, there was an undercurrent of mutual attraction between herself and Chass na Chadic, but Quell didn't pursue it because of her own unease with the New Republic and because she was the squadron leader. Any chance of exploring it seemed to disappear once Quell's actual role in Operation: Cinder became public knowledge, but in the years following the Battle of Jakku the two eventually became regular lovers.\nQuell was a skilled pilot, as she flew for the elite 204th Imperial Fighter Wing. She was highly familiar with flying a TIE/ln space superiority starfighter, thanks to her training at the Imperial Academy and combat experience with the Imperial Navy. Quell was also able to pilot an X-wing starfighter but the controls and idiosyncrasies of the X-wing were less familiar to her and flying one was not as comfortable as a TIE fighter.\nHer life before joining Imperial Service included working on several independent starships, so she also had a passing familiarity with starship maintenance and repair, enough that she was able to do field repairs on a U-Wing's hyperdrive and navicomputer.\nYrica Quell was created for the 2019 novel Alphabet Squadron, written by Alexander Freed. She was first revealed by Del Rey on Twitter when they released the official cover of the novel with some story details.\nOn March 18, 2021, StarWars.com announced that Star Wars comic books released by Marvel Comics in June will have Pride Month variant covers that feature gay and transgender artists paired with LGBTQ+ characters. The artwork was revealed on May 7, and includes Quell on the Bounty Hunters 13 variant cover by Jacopo Camagni.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Quell_(disambiguation)",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Yrica_Quell",
  "/wiki/Wookieepedia:Layout_Guide",
  "/wiki/Wookieepedia:Manual_of_Style",
  "/wiki/Gavana_Orbital",
  "/wiki/18_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Academy",
  "/wiki/204th_Imperial_Fighter_Wing",
  "/wiki/New_Republic",
  "/wiki/Alphabet_Squadron",
  "/wiki/X-wing_starfighter",
  "/wiki/New_Republic_pilot",
  "/wiki/Standard_month",
  "/wiki/Galactic_Civil_War",
  "/wiki/New_Republic_Starfighter_Corps",
  "/wiki/Alphabet_Leader",
  "/wiki/Space_station",
  "/wiki/Imperial_Military",
  "/wiki/Pilot",
  "/wiki/Imperial_Era",
  "/wiki/Desertion",
  "/wiki/Operation:_Cinder",
  "/wiki/Commanding_officer",
  "/wiki/Starfighter",
  "/wiki/Squadron",
  "/wiki/Battle_of_Jakku",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/Hunt_for_Shadow_Wing",
  "/wiki/Imperial_hunter",
  "/wiki/Death",
  "/wiki/Reproduction",
  "/wiki/Yrica_Quell%27s_father",
  "/wiki/Alcohol",
  "/wiki/Brandy",
  "/wiki/Yrica_Quell%27s_brother",
  "/wiki/Yrica_Quell%27s_mother",
  "/wiki/YT-2400_light_freighter",
  "/wiki/Nette",
  "/wiki/Mon_Mothma",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Imperial_Starfighter_Corps",
  "/wiki/Imperial_Starfighter_Pilot",
  "/wiki/Soran_Keize",
  "/wiki/Zin_Graw",
  "/wiki/Squadron_Five_(Shadow_Wing)",
  "/wiki/Ganem_Kahi",
  "/wiki/Battle_of_Endor",
  "/wiki/Nacronis",
  "/wiki/Traitor%27s_Remorse",
  "/wiki/IT-O",
  "/wiki/New_Republic_Intelligence",
  "/wiki/Caern_Adan",
  "/wiki/Warren_(Traitor%27s_Remorse)",
  "/wiki/Nath_Tensent",
  "/wiki/Entropian_Hive",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/D6-L",
  "/wiki/Hellion%27s_Dare",
  "/wiki/Wyl_Lark",
  "/wiki/Chass_na_Chadic",
  "/wiki/Lodestar",
  "/wiki/Gobreton_minefield",
  "/wiki/Flight_simulator",
  "/wiki/Mission_to_Abednedo",
  "/wiki/Verpine",
  "/wiki/Unidentified_Verpine_smuggler",
  "/wiki/690_light_freighter",
  "/wiki/TIE/sa_bomber",
  "/wiki/Harkrova_I",
  "/wiki/Unidentified_temple_(Harkrova_system)",
  "/wiki/Argai_Minor",
  "/wiki/Ragnell",
  "/wiki/Pandem_Nai",
  "/wiki/Tibanna_gas_platform",
  "/wiki/Shakara_Nuress",
  "/wiki/Cerberon_system",
  "/wiki/Troithe",
  "/wiki/Vanguard_Squadron",
  "/wiki/Quasar_Fire-class_cruiser-carrier",
  "/wiki/Sith",
  "/wiki/IT-O_Interrogation_Unit",
  "/wiki/Yadeez",
  "/wiki/Deliverance",
  "/wiki/Sentinel_(Contingency)",
  "/wiki/Netalych",
  "/wiki/Chadawa",
  "/wiki/Kairos%27s_homeworld",
  "/wiki/Emperor_Palpatine",
  "/wiki/Midi-chlorian",
  "/wiki/Coruscant",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/TIE/sk_x1_experimental_air_superiority_fighter",
  "/wiki/Corulag",
  "/wiki/Galaxy",
  "/wiki/Interrogator_droid",
  "/wiki/Yrica_Quell%27s_girlfriend",
  "/wiki/Yrica_Quell%27s_boyfriend",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Imperial_Navy",
  "/wiki/2019",
  "/wiki/Alphabet_Squadron_(novel)",
  "/wiki/Alexander_Freed",
  "/wiki/Del_Rey",
  "/wiki/March_18",
  "/wiki/2021",
  "/wiki/StarWars.com",
  "/wiki/June",
  "/wiki/May_7",
  "/wiki/Bounty_Hunters_13",
  "/wiki/Jacopo_Camagni",
  "/wiki/Category:Audio_files_of_Yrica_Quell",
  "/wiki/Category:Images_of_Yrica_Quell",
  "/wiki/TIE_Fighter_1",
  "/wiki/Alphabet_Squadron_(audiobook)",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/Shadow_Fall",
  "/wiki/Shadow_Fall_(audiobook)",
  "/wiki/Victory%27s_Price",
  "/wiki/Victory%27s_Price_(audiobook)",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_200",
  "/wiki/Standard_year",
  "/wiki/Secret_Cargo",
  "/wiki/Declaration_of_the_Rebel_Alliance",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Battle_of_Yavin",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Yavin_Prime",
  "/wiki/0_BBY",
  "/wiki/2_BBY"
 ]
}