{
 "name": "Yuehiro",
 "display_name": "Yuehiro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "c. 6 years after the Sith rebellion"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi",
      "Empire",
      "Hanrai's clan",
      "Hanrai's clan"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Hanrai"
     ]
    }
   ]
  }
 ],
 "content": "Yuehiro was a Force-sensitive Twi'lek trans male who was adopted into the Jedi clan led by the Jedi lord Hanrai. As a curious fourteen-year-old apprentice, Yuehiro was not satisfied when higher ranked members of Hanrai's clan would not address the rumors about the Sith demons. He sought answers himself by sneaking into Hanrai's private library after curfew, but he was caught and brought before his lord.\nYuehiro was a Twi'lek trans male who was born around six years after the Sith rebellion. The Force-sensitive youngling was adopted into Hanrai's clan, the Jedi clan led by the Jedi lord Hanrai, under the gender and name that had been assigned at birth. After trying three different names in the course of four years, he ultimately chose \"Yuehiro\" as his name and relocated to the boys' dormitory. He trained with Tsuden, who led meditations, and his cohort included Ogara, who led their cohort during their third year.\nBy the time that twenty years had passed since the Sith rebellion, Yuehiro was fourteen years old and had become a Jedi apprentice in the service of the Empire. He sought answers about the rumored Sith demons by sneaking into Hanrai's private library in the hours after curfew, but he was caught in the act and summoned by Hanrai himself to explain his actions. As one of Hanrai's many apprentices who were also legal adoptees, Yuehiro had believed himself beneath Hanrai's notice and was surprised that the lord knew his name. The boy explained that he sought answers regarding why the bones of dead Jedi were not being returned to the clan for interment in the shrine; specifically, Master Numoda had not returned and was presumed dead after being sent to the Engai system. Yuehiro was researching the Sith rebellion and the witch by himself as he did not trust his other masters to answer his questions about the rumored Sith demons.\nHanrai provided Yuehiro with a seal to continue accessing the library prior to curfew, along with an admonishment that Yuehiro was to stop skipping on sleep and drills. Hanrai's aide, Masamu, expressed confusion about that decision afterward and thought Hanrai was being indulgent; however, the lord explained to Masamu that he had ensured he would know when Yuehiro was in his files and what files Yuehiro viewed. Privately, Hanrai also wanted the boy to trust him and not keep secrets.\nAfter Hanrai dueled the man known as the Ronin in Seikara Caverns, the Ronin was taken prisoner due to entering a fugue state when he saw two Jedi guardians, Ogara and Tsuden, that had been killed and resurrected. The Sith demons were also taken prisoner upon Hanrai's Imperial Dreadnought flagship, the Reverent. Due to Yuehiro's talent for the black current of the Force, he was paired with an individual who was gifted with the white flare as guards assigned to the Ronin's cell.\nYuehiro had pale blue skin and utilized hormones. He kept his robes tidy and looked out for his fellow apprentices. When the Jedi ranked above him would not provide answers, his curiosity led him to break the rules to conduct research on his own. He believed that a Jedi could not protect against that which they did not recognize; thus, he did not understand why records regarding present threats were being kept private.\nYuehiro appeared in Ronin: A Visions Novel, a tie-in to the 2021 Star Wars: Visions short film \"The Duel,\" which was written by Emma Mieko Candon and published in the same year. The character does not appear in the short film.\nThrough social media, Candon confirmed that the hormones referenced in Ronin: A Visions Novel are hormone replacement therapy used by transgender individuals.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Visions",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Standard_year",
  "/wiki/Sith_rebellion",
  "/wiki/Twi%27lek",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Jedi",
  "/wiki/Empire_(feudal)",
  "/wiki/Hanrai",
  "/wiki/Jedi_lord",
  "/wiki/Ronin:_A_Visions_Novel",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_clan",
  "/wiki/Jedi_apprentice_(feudal)",
  "/wiki/Sith_demon",
  "/wiki/Reproduction",
  "/wiki/Youngling",
  "/wiki/Jedi_Training",
  "/wiki/Tsuden",
  "/wiki/Ogara",
  "/wiki/Time",
  "/wiki/Standard_hour",
  "/wiki/Lord_(feudal)",
  "/wiki/Bone",
  "/wiki/Death",
  "/wiki/Jedi_Master",
  "/wiki/Numoda",
  "/wiki/Unidentified_witch",
  "/wiki/Sleep",
  "/wiki/Masamu",
  "/wiki/The_Ronin",
  "/wiki/Seikara_Caverns",
  "/wiki/Jedi_guardian_(feudal)",
  "/wiki/Flagship",
  "/wiki/Black_current_of_the_Force",
  "/wiki/White_flare_of_the_Force",
  "/wiki/Hormone",
  "/wiki/Robe",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Yuehiro",
  "/wiki/2021",
  "/wiki/The_Duel_(short_film)",
  "/wiki/Emma_Mieko_Candon",
  "/wiki/Ronin:_A_Visions_Novel_(audiobook)",
  "/wiki/StarWars.com"
 ]
}