{
 "name": "Yug",
 "display_name": "Yug",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Skar'kla"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nova Blades"
     ]
    },
    {
     "name": "Owner(s)",
     "values": [
      "Yarvok"
     ]
    }
   ]
  }
 ],
 "content": "Yug was the name of a Skar'kla owned by Yarvok, an officer of the Nova Blades pirates. Yarvok raised Yug himself, just like he did his other two pet Skar'kla, Rox and Wa-Vendeg. Krupo, Yarvok's beast wrangler, lost Yug along with several of Yarvok's other pets after a ship carrying the pets crashed on the world of Dantooine, angering Yarvok greatly. Yarvok said he would kill Krupo if his missing pets, including Yug, were not found quickly.\nWhen the Commander arrived on Dantooine to investigate reports of Darth Malgus at the Jedi Enclave, Yug could be seen with several of Yarvok's other lost pets, Fuzzy and Ol' Cronchy, wandering near the Enclave's approach. Yug had a preference for the crash-landed shipments of cryo crates in the area.\nYug appeared in the flashpoint Secrets of the Enclave and was mentioned in the Codex entry for Invasive Species on Dantooine in the 2019 expansion Onslaught to the 2011 massively multiplayer online role-playing game Star Wars: The Old Republic by the company BioWare.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Special:Upload",
  "/wiki/Canon",
  "/wiki/Skar%27kla",
  "/wiki/Nova_Blades",
  "/wiki/Yarvok",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Officer/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Rox",
  "/wiki/Wa-Vendeg",
  "/wiki/Krupo",
  "/wiki/Planet/Legends",
  "/wiki/Dantooine/Legends",
  "/wiki/Death/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Darth_Malgus",
  "/wiki/Jedi_Enclave",
  "/wiki/Fuzzy_(Xuvva)",
  "/wiki/Ol%27_Cronchy",
  "/wiki/2019",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/BioWare"
 ]
}