{
 "name": "Yuln",
 "display_name": "Yuln",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "138 ABY",
      "Agamar"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Humanoid"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red and black Sith tattoos"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "One Sith",
      "Darth Krayt's Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Yuln was a humanoid female Sith who served Darth Krayt's Galactic Empire during the Second Imperial Civil War. In 137 ABY, Yuln and her fellow Sith Bokar were dispatched to the planet Agamar to search for surviving enemy forces following a clash between Sith forces and an allied group of Imperial Knights and Jedi. Three days after the attack on Agamar, Yuln and Bokar were slain by Imperial Knight Azlyn Rae and Jedi Master Rasi Tuum, respectively.\nYuln, a humanoid female Sith, served in Dark Lord of the Sith Darth Krayt's Sith Order during the Second Imperial Civil War. In 137 ABY, Sith–Imperial forces traveled to the planet Agamar, intending to capture or kill exiled Emperor Roan Fel. After the battle, Yuln and fellow Sith Bokar were sent to Agamar's surface to search for Fel and eliminate any of his surviving Imperial Knights and Jedi allies.\nThree days after the attack on Agamar, as the two Sith were searching for survivors of the battle, Yuln informed Bokar that all the remaining Jedi and Imperial Knights were dead. The two Sith began arguing over the strength of the Sith, Jedi, and Imperial Knights who perished during the battle. They were interrupted by Jedi Master Rasi Tuum, who slew Bokar, as Yuln was impaled and killed by Imperial Knight Azlyn Rae's lightsaber.\nYuln's body was covered in red and black Sith tattoos, and she had three stitches across a scar on her left cheek. She also owned a double-bladed lightsaber. She questioned Bokar when he interpreted the deaths of so many Jedi and Imperial Knights on Agamar to mean that the Sith were superior to both orders.\nYuln was introduced by John Ostrander, author of the Star Wars: Legacy comic series, in the first issue of the Extremes story arc. She was penciled by Jan Duursema.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/138_ABY",
  "/wiki/Agamar/Legends",
  "/wiki/Humanoid/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Sith_tattoo",
  "/wiki/One_Sith",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/Sith/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/137_ABY",
  "/wiki/Bokar",
  "/wiki/Planet/Legends",
  "/wiki/Operation:_Thunderstroke",
  "/wiki/Imperial_Knight",
  "/wiki/Jedi/Legends",
  "/wiki/Time/Legends",
  "/wiki/Death/Legends",
  "/wiki/Azlyn_Rae",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Rasi_Tuum",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Darth_Krayt",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Roan_Fel",
  "/wiki/Shiak",
  "/wiki/Lightsaber/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Legacy_(2006)_48",
  "/wiki/Star_Wars:_Legacy:_Extremes",
  "/wiki/Jan_Duursema"
 ]
}