{
 "name": "Yupe_Tashu",
 "display_name": "Yupe Tashu",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "5 ABY",
      "Jakku"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith",
      "Galactic Empire",
      "Imperial Ruling Council",
      "Imperial Future Council",
      "Imperial Ruling Council",
      "Imperial Future Council",
      "Acolytes of the Beyond"
     ]
    }
   ]
  }
 ],
 "content": "Yupe Tashu was a male human who served in the Galactic Empire as one of Darth Sidious' closest advisers. Although he could not use the Force himself, Tashu was a historian of the dark side and a Sith cultist. Following the death of the Emperor during the Battle of Endor, Tashu became a part of the Imperial Future Council, a group of high-ranking officials who met on Akiva to decide the future of the shattered Empire. However, Tashu was captured when the fledgling New Republic learned Imperial leaders were flocking to Akiva and attacked.\nTashu was later imprisoned by the New Republic on Chandrila. In 5 ABY, he managed to escape New Republic custody with the help of Fleet Admiral Gallius Rax. Tashu later resurfaced with the shadowy Acolytes of the Beyond on the planet Devaron. During the Battle of Jakku, Rax and Tashu traveled to the Jakku Observatory to initiate the Emperor's Contingency plan. After Tashu had donned several Sith artifacts, Rax threw him into a borehole which led to Jakku's core. Tashu was killed and the Sith artifacts he was wearing triggered a chain reaction that almost destroyed Jakku. Tashu's death completed the penultimate step of the Emperor's Contingency plan. However, Rax's enemy Grand Admiral Rae Sloane managed to stop the Contingency by sealing the borehole, saving Jakku from destruction.\nA male human, Yupe Tashu served as an adviser to Darth Sidious, the Sith Lord publicly known as Sheev Palpatine who served as the last Supreme Chancellor of the Galactic Republic and the first Emperor of the Galactic Empire. Tashu's dealings with Sidious dated back to the last years of the Galactic Republic. In 30 BBY, Adviser Tashu visited the barren Inner Rim planet of Jakku, which lay at the edge of the Unknown Regions. After landing in Sidious' yacht Imperialis, he instructed six droids to begin excavating the Plaintive Hand plateau before returning to his ship.\nUnknown to Tashu, he was being watched by a local human boy named Galli. Galli sneaked aboard the Imperialis but was discovered by Sidious, who gave the boy a choice between death and fulfilling his destiny. Galli ultimately chose to serve Sidious and returned to guard the Plaintive Hand excavation site. The excavation site became the Jakku Observatory, which was part of the Emperor's network of Observatories around the galaxy. The Jakku Observatory stored a replica of the Imperialis, various Sith relics and artifacts, ancient computers which projected a map of the Unknown Regions, and a borehole which led to Jakku's core. The Jakku Observatory was central to Sidious' Contingency plan to destroy the Empire should he die prematurely. Tashu kept in touch with the young Galli and reported that the boy had been very loyal indeed. After Galli joined the Empire and adopted the named Gallius Rax, Sidious tasked Rax with carrying out the Contingency.\nIn 3 ABY, the Empire routed the Alliance to Restore the Republic from their headquarters on Hoth. The Commission for the Preservation of the New Order immediately released an official statement in which an exulting Tashu welcomed the fact that, even on a remote and desolate world, the Alliance could not escape Imperial justice.\nBy 4 ABY, Tashu had become one of the Emperor's closest advisers, and as such he was part of the Empire's uppermost tiers. He was even considered a friend of his Imperial master, or at least as much as one could be. Although he could not wield the Force, a mystical energy field generated by all living things, Tashu had embraced the cult of the Sith, an ancient and malevolent order whose members sought to gain power over the whole galaxy. The Imperial adviser considered himself a historian of the dark side, an aspect of the Force that focused on fear, anger and aggression. Tashu possessed at least one Sith artifact, a red metal mask with demonic features. Due to his close relationship with the Emperor, Tashu was one of the few people who was aware that he was a Sith Lord. He and Rax were also privy to the Contingency.\nAfter a twenty-three–year reign, Darth Sidious died during the Battle of Endor, when the Rebel Alliance destroyed the second Death Star battle station. With the Emperor's untimely demise, the Empire was plunged into turmoil, and the Rebel Alliance evolved into the New Republic. Adviser Tashu, along with a few other high ranking officials, agreed to meet on Akiva, a backwater planet of the Outer Rim Territories that still fell under Imperial jurisdiction, to discuss the future of the Empire.\nTashu felt that the remaining Imperial forces should retreat \"beyond the veil of stars,\" searching for the source of the dark side. According to the Imperial adviser, that was the only way to rebuild a stronger, better organized Empire that would hide in the shadows, and then strike the New Republic in due course.\nTashu's words went at odds with other members of the newly-created Imperial Future Council. The self-proclaimed Grand Moff Valco Pandion wanted to go on the offensive, using the planets still under Imperial control to conscript more soldiers and using their remaining starships to attack the New Republic and nip it in the bud. The banker Arsin Crassus, for his part, wanted to negotiate with the enemy.\nDuring the proceedings, Tashu also took the time to interrogate and torture a New Republic starfighter pilot named Wedge Antilles, who been captured by the convener Admiral Rae Sloane while on a scouting mission.\nHowever, the Imperial Future Council was short-lived, as the New Republic disrupted its meeting on Akiva, inciting that planet's citizens to overthrow the Imperial occupation. During the ensuing battle, Adviser Tashu was captured by the enemy, along with General Jylia Shale.\nDue to his refusal to cooperated with his New Republic captors, Yupe Tashu was housed in a spartan cage with little comforts. He smeared the walls of his cell with food waste and drew strange symbols and maps. The New Republic guard assigned to guard Tashu was the Chandrilan man Windom Traducier, who was an undercover agent of the Imperial Fleet Admiral Gallius Rax. In 5 ABY, Tashu was visited by the former Imperial loyalty officer Sinjir Rath Velus and his friend Temmin Wexley, who had joined a group of rebels who hunted down Imperial war criminals.\nAfter some delays, Sinjir managed to force the guard to open the door to his cage. Tashu recognized Sinjir, who returned the greeting and then asked him about Imperial prisons. After some babbling, Tashu reluctantly told Sinjir to visit the Siniteen prison builder Golas Aram on the planet Irudiru on the edge of Wild Space. Using this information, Sinjir and his team managed to free a hundred prisoners from the automated Ashmead's Lock prison on the planet Kashyyyk including Temmin's father Brentin Lore Wexley. However, this turned out to be a ruse by Rax to use the prisoners to attack the New Republic leadership.\nDuring the attack, Traducier freed Tashu from prison. After being reassured that Traducier had not come to kill him, Tashu thanked the darkness for saving him. Traducier then directed Tashu towards a ship on Docking Platform E-22. When Tashu queried about Shale, Crassus, and Pandion, Traducier revealed that Pandion was long dead and that he had murdered Shale and Crassus. When Tashu inquired why, Traducier replied that he had received orders to kill them and to free Tashu. Traducier clarified that Rax was the new Emperor and that Rax served Sidious. Tashu praised the late Sidious for having a plan before making his escape.\nIn the months following the attack on Chandrila, Yupe Tashu escaped to Jakku, where the self-proclaimed Counselor to the Empire Gallius Rax had brought the Empire in order to test their mettle. Due to his close connection to the Emperor, Tashu and Rax were among those privy to the Contingency, the late Emperor's plan to destroy the Empire in the event of his death. On Jakku, Tashu watched as Rax killed his former master during the Counselor's time on the planet, the Anchorite Kolob. Tashu regarded this death as an offering to the dark side.\nYupe Tashu then informed Counselor Rax that he had a visitor in the form of one of the Emperor's sentinel droids. The sentinel droid informed the Sith cultist and Counselor Rax that Grand Admiral Sloane was traveling with Niima the Hutt's convoy to the Jakku Observatory. Subsequently, Rax ordered the Observatory's turbolasers to bombard the convoy before Yupe Tashu.\nLater, Tashu traveled to the Colonies planet of Devaron where a cell of the Acolytes of the Beyond had gathered for an attack on a New Republic outpost near the Karatokai Mountains. This was part of a series of coordinated strikes against New Republic targets throughout the galaxy. Among the Acolytes was a young Pantoran woman named Kiza and her lover Remi. Remi had stolen a lightsaber from the archive beneath the Peace and Security station in the Corellian city of Coronet City. As the master of this group, he gifted Kiza the mask of Viceroy Exim Panshard at the wishes of the venerable specters of fallen Sith.\nWhen Remi tried to seize the mask for himself, Tashu chastised the youth for angering the venerable specters. As punishment, Tashu seized Remi's lightsaber and handed it to Kiza. During the attack on the New Republic outpost, Kiza fully embraced the dark side and entered into a homicidal rampage. Overcome by the dark side, Kiza murdered Remi with the lightsaber after he tried to recover his prized weapon.\nTashu also supplied an associate of the Acolytes, the Sith cultist and assassin Ochi of Bestoon, with forbidden Sith texts.\nDuring the Battle of Jakku, Yupe Tashu traveled with Counselor Rax, Brendol Hux, Armitage Hux, and Rax's locally-recruited child solders to the Jakku Observatory. While the Huxes and the child soldiers boarded a replica of the Emperor's luxury yacht Imperialis, Tashu and Rax entered the Observatory to initiate the Contingency. After making their way past several computers which the Empire had been using to calculate safe routes through the Unknown Regions, the two men entered a hallway containing artifacts from the old Sith Empire including a red mask, a white lance, a bloody banner, and a black holocron.\nTashu donned the Sith artifacts and carried the holocron, which caused him to grow paler from touching it. The two then crossed a walkway which extended over a deep borehole which led to Jakku's core. Before Tashu could give a prayer to the Sith, Rax told him that Sidious would be pleased with them. Tashu responded that they had activated the Contingency and called on them to give a prayer to the darkness. However, Rax interjected and asked Tashu what he would say to the Emperor when they saw their Master again. Before Tashu could give an answer, Rax threw him over the walkway.\nTashu hit a rock and was killed on impact. His body then fell down the borehole into the planet's core. Since the artifacts contained a great deal of energy, they triggered a chain reaction that caused Jakku's mantle to crack. As part of the Contingency, Rax wanted to destroy Jakku and the surrounding Imperial and New Republic forces. He and a select group of Imperials would then travel to the Unknown Regions to restart the Empire.\nUltimately, Rax's efforts were foiled by Grand Admiral Sloane and the New Republic operatives Norra and Brentin Wexley. Sloane led surviving Imperial forces into the Unknown Regions, eventually forming the First Order, whose technologically-advanced military, hidden away from the wider galaxy, was incorporated into Darth Sidious' vision decades later for a unified galaxy under his rule—the Final Order.\nAdviser Tashu was a man whose age was hard to tell from his appearance. He had beady eyes, and his face was covered with the dark striations. Despite having impeccably white teeth, he had a frightening, snake-like smile. He wore plush purple robes that had bundled, puffy sleeves ending in tassels, and an emerald hat. As with all the other Imperial advisers, his choices of clothes were reminiscent of the Naboo noblemen's sartorial extravagance.\nYupe Tashu was a wild-eyed religious zealot who refused to abandon his loyalty to the Empire and Darth Sidious. He put the Empire above his own self interest and needs. While Tashu saw himself as a zealot and loyalist, others like the former Imperial loyalty officer Sinjir viewed him as an insane fanatic. Tashu's loyalty to Sidious led him to believe that the void awaited those who betrayed the Emperor. While Tashu was reluctant to accept Rax as the new Emperor, he was mollified when Windom Traducier reassured him that Rax served the late Emperor.\nAs a follower of the dark side, Tashu served as the master of a cell of the Acolytes of the Beyond, a cult that worshiped Sith. Tashu was known to officiate over the sacrifice of sentient beings and to consult with the specters of fallen Sith. He owned a collection of Sith artifacts and masks. Tashu also had half-broken teeth and was regarded as both mad and fanatical by his Imperial and Acolyte peers. Tashu believed that the Contingency served as a means of punishing the \"undeservers\" but did not realize that he would have to die as well.\nAlthough Tashu was no Force user, he claimed to have been trained by the best in an ancient Sith art involving the red mask he possessed. Tashu was resistant to interrogation due to his ties with the dark side. Due to his connections to Darth Sidious, Tashu was aware of the Contingency and Ashmead's Lock prison. Tashu also owned a collection of Sith masks which he dispensed to worthy Acolytes after consulting with the specters of fallen Sith.\nYupe Tashu first appeared as a secondary antagonist in Chuck Wendig's Star Wars: The Aftermath Trilogy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Shadow_of_the_Sith",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/5_ABY",
  "/wiki/Jakku",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Sith",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Ruling_Council",
  "/wiki/Imperial_Future_Council",
  "/wiki/Acolytes_of_the_Beyond",
  "/wiki/Darth_Sidious",
  "/wiki/Emperor%27s_adviser",
  "/wiki/The_Force",
  "/wiki/Historian",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Sith_cultist",
  "/wiki/Death",
  "/wiki/Battle_of_Endor",
  "/wiki/Emergency_summit_on_Akiva",
  "/wiki/Akiva",
  "/wiki/New_Republic",
  "/wiki/Rebellion_on_Akiva",
  "/wiki/Prisoner",
  "/wiki/Chandrila",
  "/wiki/Fleet_Admiral",
  "/wiki/Gallius_Rax",
  "/wiki/Planet",
  "/wiki/Devaron",
  "/wiki/Battle_of_Jakku",
  "/wiki/Jakku_Observatory",
  "/wiki/Contingency",
  "/wiki/Sith_artifact",
  "/wiki/Grand_Admiral",
  "/wiki/Rae_Sloane",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Supreme_Chancellor",
  "/wiki/Galactic_Republic",
  "/wiki/Galactic_Emperor",
  "/wiki/30_BBY",
  "/wiki/Inner_Rim_Territories",
  "/wiki/Unknown_Regions",
  "/wiki/Imperialis",
  "/wiki/Plaintive_Hand_plateau",
  "/wiki/Observatory",
  "/wiki/The_galaxy",
  "/wiki/3_ABY",
  "/wiki/Battle_of_Hoth",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Echo_Base",
  "/wiki/Hoth",
  "/wiki/Commission_for_the_Preservation_of_the_New_Order",
  "/wiki/4_ABY",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Force-sensitive",
  "/wiki/Galaxy",
  "/wiki/Advisor",
  "/wiki/Color",
  "/wiki/Demon",
  "/wiki/Sith_Lord",
  "/wiki/Imperial_Era",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_station",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Star",
  "/wiki/Grand_Moff",
  "/wiki/Valco_Pandion",
  "/wiki/Soldier",
  "/wiki/Starship",
  "/wiki/Arsin_Crassus",
  "/wiki/Time",
  "/wiki/Torture",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Wedge_Antilles",
  "/wiki/Admiral",
  "/wiki/Mission_to_Akiva",
  "/wiki/General",
  "/wiki/Jylia_Shale",
  "/wiki/Foodstuff",
  "/wiki/Senate_Guard_(New_Republic)",
  "/wiki/Chandrilan",
  "/wiki/Windom_Traducier",
  "/wiki/Agent",
  "/wiki/Loyalty_officer",
  "/wiki/Sinjir_Rath_Velus",
  "/wiki/Temmin_Wexley",
  "/wiki/Prison",
  "/wiki/Siniteen",
  "/wiki/Golas_Aram",
  "/wiki/Irudiru",
  "/wiki/Wild_Space",
  "/wiki/Ashmead%27s_Lock",
  "/wiki/Kashyyyk",
  "/wiki/Parent",
  "/wiki/Brentin_Lore_Wexley",
  "/wiki/Attack_on_Chandrila",
  "/wiki/Docking_Platform_E-22",
  "/wiki/Counselor_to_the_Empire",
  "/wiki/Anchorite",
  "/wiki/Kolob",
  "/wiki/Sentinel_(Contingency)",
  "/wiki/Niima",
  "/wiki/Hutt",
  "/wiki/Turbolaser",
  "/wiki/Colonies",
  "/wiki/Attack_on_a_New_Republic_outpost",
  "/wiki/Devaron_New_Republic_outpost",
  "/wiki/Karatokai_Mountains",
  "/wiki/Pantoran",
  "/wiki/Kiza",
  "/wiki/Remi",
  "/wiki/Kiza%27s_lightsaber",
  "/wiki/Peace_and_Security_Headquarters",
  "/wiki/Corellia",
  "/wiki/Coronet_City",
  "/wiki/Mask_of_Viceroy_Exim_Panshard",
  "/wiki/Viceroy",
  "/wiki/Exim_Panshard",
  "/wiki/Lightsaber",
  "/wiki/Sith_assassin",
  "/wiki/Ochi",
  "/wiki/Brendol_Hux",
  "/wiki/Armitage_Hux",
  "/wiki/Gallius_Rax%27s_child_soldiers",
  "/wiki/Imperialis_(Jakku)",
  "/wiki/Sith_Empire",
  "/wiki/Sith_holocron",
  "/wiki/Norra_Wexley",
  "/wiki/First_Order",
  "/wiki/Final_Order",
  "/wiki/Eye",
  "/wiki/Tooth",
  "/wiki/Snake",
  "/wiki/Naboo_(people)",
  "/wiki/Noble",
  "/wiki/Chuck_Wendig",
  "/wiki/Star_Wars:_The_Aftermath_Trilogy",
  "/wiki/Aftermath_(novel)",
  "/wiki/Aftermath_(audiobook)",
  "/wiki/Aftermath:_Life_Debt",
  "/wiki/Aftermath:_Life_Debt_(audiobook)",
  "/wiki/Aftermath:_Empire%27s_End",
  "/wiki/Aftermath:_Empire%27s_End_(audiobook)",
  "/wiki/Star_Wars:_The_Rebel_Files",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Kylo_Ren_and_Other_Followers_of_the_Dark_Side",
  "/wiki/Star_Wars:_The_Secrets_of_the_Sith",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Tarkin_(novel)",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_On_the_Front_Lines",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Yavin_4",
  "/wiki/Standard_month",
  "/wiki/Before_the_Awakening",
  "/wiki/Shadow_Fall",
  "/wiki/%27ABY-BBY%27_dating_system"
 ]
}