{
 "name": "Yuralla_Vega",
 "display_name": "Yuralla Vega",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Chorin"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Yuralla Vega, known as Yura, was a human female resident of Chorin during the Imperial Era. She was the lover of Beilert Valance, a miner from Chorin who left to join the Galactic Empire. Chorin's mines then ran out, and the Empire abandoned the world, leaving it defenseless from raiders. When Valance returned after being discharged from the Empire, he encountered Vega, who told him what had happened to their homeworld. Valance vowed to take revenge on the raiders, but arrived at their camp after they had left.\nWhen the Sith Lord Darth Vader ordered the residents of Chorin, including Vega, be wiped out, Valance rescued them and relocated the group to the forest world Lowik. Vega expressed her disbelief that she and the other Chorin residents were able to evade the Empire.\nLater, Valance would visit her for help in hiding the heir to the Unbroken Clan and Mourner's Wail crime syndicates, Cadeliah. By this time, she was married to the Rebel lieutenant Kondra. After a skirmish with bounty hunters on the girl's trail, Vega became Cadeliah's new caretaker as Valance left Lowik. Vega then departed Lowik with Cadeliah and the rest of the Rebel Alliance.\nThe female human Yuralla Vega was a resident on the planet Chorin during the Imperial Era. Prior to or during the year 13 BBY, she was in love with the miner Beilert Valance. The two looked at the stars in the Itani Nebula near the Hydian Way where Valance explained his decision to leave Chorin, to join the Galactic Empire as a pilot. Before he departed, Vega gave him a gem, a fire ruby, to remember her by.\nAfter Valance left, the Empire took everything from the mines on Chorin and then left the residents defenseless to raiders. The residents fought back against the raiders, but many miners were killed in the process and the settlement was left devastated. Valance eventually returned to Chorin, having been being discharged by the Empire after losing all of his limbs in battle, becoming a cyborg as a result. After finding the graves of the miners, Valance was greeted by Vega, who explained what had happened while he was absent. Valance told her that he would make the raiders pay and went in search for them. Vega begged him not to leave but he departed regardless arriving at the raiders camp to find that they had already left.\nAt sometime prior to the Battle of Hoth in 3 ABY, the Sith Lord Darth Vader worked with Valance to defeat the Hidden Hand syndicate. After Valance abandoned Vader, the Sith Lord ordered the residents of Chorin be wiped out. Valance, though, rescued them before the stormtroopers arrived to level the settlement. Valance took Vega and the others to the rebel outpost on the forest world Lowik. Vega expressed her disbelief that their escape from the Empire had been successful. Valance asked the rebels Gita and Aeliar whether Vega and the other people from Chorin would be safe on Lowik. Gita confirmed his hopes and offered for him to stay. Valance refused and departed Lowik to deal with his own matters. Before he left he returned the gem Vega had given to him before.\nYura encountered Valance again after he sustained severe injuries in protecting Cadeliah. She helped restore the cyborg, and he later provided as diversion so she and Cadeliah could escape the bounty hunters Zuckuss and 4-LOM. Her old love managed to make a deal with the hunters, but the rebel outpost needed to be evacuated. Valance left Cadeliah in Vega's care going forward, as Vega, her husband, and the youth escaped Lowik.\nYuralla Vega was a female human with light skin, brown eyes, and brown hair. When her lover Beilert Valance left to join the Empire, she gave him a gem to remember her by. After he returned and sought out the raiders that had attacked Vega's people, she begged him to stay, although he ignored her. When Valance saved her from the Empire, Vega was in disbelief that the rescue had gone to plan. After Valance's return with Cadeliah, she expressed how she would have waited for him, if she only knew he still cared. Yet by the time he had returned, she was married to Kondra, and he was a bounty hunter. Vega was caring, and was willing to take over as Cadeliah's protector when Valance decided he could not.\nVega wore cream colored clothing when Valance left to join the Empire. By the time Valance returned, she wore brown clothing. Vega also had a golden brace around the top of her head with a green gem in its center.\nYuralla Vega first appeared through flashbacks in the comic Target Vader 5, written by Robbie Thompson, illustrated by Cris Bolson, Roberto Di Salvo, and Marco Failla, and published by Marvel Comics on November 13 2019. She was referred to as Yula in the following issue Target Vader 6, written by Thompson, illustrated by Salvo, Stefano Landini, and Georges Duarte, and published by Marvel Comics on December 11 2019. She was first referred to as Yuralla Vega in Bounty Hunters 3, written by Ethan Sacks, illustrated by Paolo Villanelli, and published by Marvel Comics on June 24 2020.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Yura_Telamarch",
  "/wiki/Bounty_Hunters_3",
  "/wiki/Bounty_Hunters_5",
  "/wiki/Bounty_Hunters_6",
  "/wiki/Bounty_Hunters_7",
  "/wiki/Bounty_Hunters_8",
  "/wiki/Bounty_Hunters_16",
  "/wiki/Crimson_Reign_2",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Chorin",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Imperial_Era",
  "/wiki/Beilert_Valance",
  "/wiki/Miner",
  "/wiki/Galactic_Empire",
  "/wiki/Mining",
  "/wiki/Pirate",
  "/wiki/Homeworld",
  "/wiki/Sith_Lord",
  "/wiki/Anakin_Skywalker",
  "/wiki/Forest",
  "/wiki/Lowik",
  "/wiki/Unbroken_Clan",
  "/wiki/Mourner%27s_Wail_Syndicate",
  "/wiki/Cadeliah",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Lieutenant",
  "/wiki/Kondra",
  "/wiki/Planet",
  "/wiki/Standard_year",
  "/wiki/13_BBY",
  "/wiki/Itani_Nebula",
  "/wiki/Hydian_Way",
  "/wiki/Pilot",
  "/wiki/Gemstone",
  "/wiki/Fire_ruby",
  "/wiki/Death",
  "/wiki/Limb",
  "/wiki/Mimban_Campaign",
  "/wiki/Cyborg",
  "/wiki/Battle_of_Hoth",
  "/wiki/3_ABY",
  "/wiki/Hidden_Hand",
  "/wiki/Sith",
  "/wiki/Lord",
  "/wiki/Stormtrooper",
  "/wiki/Rebel_outpost_(Lowik)",
  "/wiki/Gita",
  "/wiki/Aeliar",
  "/wiki/Zuckuss",
  "/wiki/4-LOM",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Target_Vader_5",
  "/wiki/Robbie_Thompson",
  "/wiki/Cris_Bolson",
  "/wiki/Roberto_Di_Salvo",
  "/wiki/Marco_Failla",
  "/wiki/Marvel_Comics",
  "/wiki/November_13",
  "/wiki/2019",
  "/wiki/Target_Vader_6",
  "/wiki/Stefano_Landini",
  "/wiki/Georges_Duarte",
  "/wiki/December_11",
  "/wiki/Ethan_Sacks",
  "/wiki/Paolo_Villanelli",
  "/wiki/June_24",
  "/wiki/2020",
  "/wiki/Category:Images_of_Yuralla_Vega",
  "/wiki/Bounty_Hunters_18",
  "/wiki/Bounty_Hunters_19",
  "/wiki/Darth_Vader_(2020)_19",
  "/wiki/Darth_Vader_(2020)_21",
  "/wiki/Bounty_Hunters_24",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Boba_Fett_and_Other_Characters_of_the_Underworld",
  "/wiki/Carida_Academy",
  "/wiki/Han_Solo_-_Imperial_Cadet_1",
  "/wiki/Carida",
  "/wiki/Han_Solo",
  "/wiki/Corellia",
  "/wiki/Solo:_A_Star_Wars_Story",
  "/wiki/Solo:_A_Star_Wars_Story_The_Official_Guide",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/19_BBY",
  "/wiki/10_BBY",
  "/wiki/Star_Wars:_Target_Vader",
  "/wiki/Empire_Ascendant_1",
  "/wiki/Hunt_for_Vader"
 ]
}