{
 "name": "Yurdak_Fav",
 "display_name": "Yurdak Fav",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Inner Uvena",
      "Uvena system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Shistavanen"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Republic Survey Corps",
      "Republic Survey Corps"
     ]
    }
   ]
  }
 ],
 "content": "Yurdak Fav was a female Shistavanen scout.\nYurdak Fav was born in the Uvena system, particularly in Inner Uvena as could be shown by her bright yellow eyes. She was the youngest of a long family of Republic scouts who could be traced to her great-great-grandmother. Following her steps, Fav served in the Republic Survey Corps.\nThe declaration of the Galactic Empire led many Shistavanens to leave the Corps. Fav was one of those newly unemployed scouts.\nSometime before 11 BBY, Fav and Lak Sivrak were contacted by the Uvena System Constabulary. They were asked to search missing Alpha Premier Korta Sarc, who was eventually found murdered inside the Jenet embassy. Afterward, Fav and Sivrak spent a time together and with other scouts before returning to their respective warrens. Sivrak kept a good impression on Fav.\nShe was then seen following Rebel Alliance scouts, always with a new ship . As those scouts were looking for potential safeworlds, Fav's presence made them rule out those worlds as unsafe, which eventually led to a dearth of Rebel safeworlds.\nShe never attacked any Rebel, and the Rebel Alliance never could proof any Imperial forces in the safeworlds identified by Fav. However, the Alliance considered her a potential threat to be dealt with; and old acquaintance Lak Sivrak wanted to question her.\nThe following time she was identified, a team of Rebels tried to meet with her and discuss an agreement. She was captured by slavers, probably the Mytaranor Slaving Council, and the Rebels tried to rescue her due to her knowledge.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Inner_Uvena",
  "/wiki/Uvena_system/Legends",
  "/wiki/Shistavanen/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Republic_Survey_Corps/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Lak_Sivrak/Legends",
  "/wiki/Scout/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/11_BBY/Legends",
  "/wiki/Uvena_System_Constabulary",
  "/wiki/Alpha_Premier",
  "/wiki/Korta_Sarc",
  "/wiki/Jenet/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Zol-Uvena",
  "/wiki/Mytaranor_Slaving_Council",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}