{
 "name": "Yutsen",
 "display_name": "Yutsen",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "TriNebulon News"
     ]
    }
   ]
  }
 ],
 "content": "Yutsen was a Rodian reporter for TriNebulon News. During the Clone Wars, Yutsen gave the Gungan Jar Jar Binks information on Outer Rim traffic in return for an interview with Naboo Senator Padmé Amidala. During the interview, Yutsen affronted Amidala for being too preoccupied to notice that Rodia had been assaulted by pirates.\nThe Rodian Yutsen was a reporter who worked for TriNebulon News. In approximately 21 BBY, during the Clone Wars, the Gungan Jar Jar Binks spoke with Yutsen in order to gather information on traffic reports in the Outer Rim in the hopes of finding news relating to Jedi Knight Anakin Skywalker for Binks' friend, Naboo Senator Padmé Amidala.\nYutsen gave Binks the information on one condition—that Amidala would agree to an interview with TriNebulon News. During the interview, Yutsen questioned the Republic's commitment to a peace that benefited everybody in the galaxy, pointing out that no help had yet been given to the planet Rodia, which had been attacked by pirates. When Amidala revealed that she didn't know that Rodia had been attacked, Yutsen suggested that she was too preoccupied with her own affairs.\nYutsen, a green-skinned Rodian, was a reporter for TriNebulon News, a media group that, according to Amidala, had a reputation for being \"vultures.\" Yutsen manipulated Binks into arranging an interview for TriNebulon with Amidala—which Amidala did not want to attend. Later, during the interview itself, Yutsen confronted Amidala about the Republic's commitment to peace and suggested to the Senator that she was being too distracted by her own agenda.\nYutsen first appeared in The Clone Wars: Agenda, a six-page online comic in The Clone Wars web comic series, which led directly into \"Destroy Malevolence,\" the fourth episode of Season One of the Star Wars: The Clone Wars television series.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rodian/Legends",
  "/wiki/Black",
  "/wiki/Green_(disambiguation)",
  "/wiki/TriNebulon_News/Legends",
  "/wiki/The_Clone_Wars:_Agenda",
  "/wiki/Journalist/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Jar_Jar_Binks/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Rodia/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/21_BBY/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_Clone_Wars_(webcomics)",
  "/wiki/Destroy_Malevolence",
  "/wiki/The_Clone_Wars:_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Star_Wars_Annual_2011",
  "/wiki/StarWars.com"
 ]
}