{
 "name": "Z%27Vk%27Thkrkza",
 "display_name": "Z'Vk'Thkrkza",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Crul"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gilliand"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.40 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Aunt Z's Tavern",
      "Team Colossus"
     ]
    }
   ]
  }
 ],
 "content": "Z'Vk'Thkrkza, commonly known as Aunt Z, was a member of the female Gilliand species who lived on the ocean planet Castilon during the era of the New Republic. Residing on the refueling platform Colossus, she owned a popular tavern where fellow station residents could eat, drink or seek advice from the tavern owner. After the First Order occupied the Colossus, Aunt Z was arrested for vocally expressing her dislike of the First Order. After Kazuda Xiono and Torra Doza helped Aunt Z, Hype Fazon, Grevel, and Nod overcome their stormtrooper guards to escape the planet in a stolen transport, Aunt Z decided that the pair would go to Takodana and hide out with a friend of hers.\nAunt Z, originally from the planet Crul, owned a tavern on the Colossus, an independent refueling station on Castilon. She also had several service droids including G1-7CH \"Glitch\" and ran the betting pool for when races took place. At some point, the Resistance starfighter pilot Poe Dameron approached her with one of his new spies, Kazuda Xiono. They were looking for Poe's friend Jarek Yeager. Aunt Z led them to Yeager and Poe left with him, leaving Xiono at the tavern. Xiono decided to play holodarts with an Aleen named Grevel, but Grevel sabotaged his dart, making it fly into the Klatooinian Bolza Grool's back.\nGrool started a fight with Xiono and the residents of the bar joined in until Yeager returned to restore order. Shortly after, when Neeku Vozo decided to help Xiono get a start to his racing career by announcing he would be challenging solo the next day, Aunt Z quickly opened up bets. Xiono attempted to tell her he didn't want to race, but Yeager told him he couldn't as Grool would throw him off the platform if he refused to race.\nWhen Kaz struggled to fit into Yeager's repair shop, he visited Aunt Z's Tavern to seek solace. When Kaz vented his frustration with Yeager, Aunt Z opined that Yeager may not be the best option and suggested looking for other accommodation. That same day, Kaz was befriended by the unscrupulous racer Jace Rucklin and his racing team, who tried to steal a bottle of hyperfuel from Kaz's employer Yeager.\nWhen blackouts started occurring on the Colossus due to a fuel shortage, she told Xiono, Tamara Ryvora and Vozo that she believed they were intentionally being caused by Captain Imanuel Doza because she thought he worked for the First Order, which inspired Xiono to sneak into Doza Tower and spy on Doza's meeting with Major Elrik Vonreg. Later, Kaz was pursued by stormtroopers while navigating through the ledges of Doza Tower. Aunt Z was unsympathetic to his dire situation and bet 20 credits that he would fall to his death, something that was quickly taken up by the other patrons. Nevertheless, she cheered him on and seemed quite happy when Kaz managed to escape the stormtroopers with the help of the BB unit BB-8, whom Poe assigned to look after Kaz.\nAfter incurring the wrath of Tam for accidentally damaging an acceleration compensator, Kaz visited Aunt Z's Tavern seeking solace. Kaz ordered a drink of water from Aunt Z but she tried to take it away when Kaz did not pay the full amount. Neeku then took pity on Kaz and paid the full bill, prompting Aunt Z to praise Neeku for being a good friend. While visiting the cantina, Kaz learnt about a bounty on two children and decided to rescue the children in order to purchase a new acceleration compensator for Tam. Kaz and his friends learnt that the children Kel and Eila had fled a massacre on Tehar and helped them hide from the First Order with the Chelidae, the \"shell folk\" who worked as engineers in the Colossus' engineering deck.\nLater, when BB-8 stopped by her tavern looking for Xiono, she told the droid she hadn't seen him that day. BB-8 returned to Yeager's repairs only to discover that Kaz had been back at the workshop all that time.\nWhen the Platform Classic was held, after Yeager was successfully goaded by his employees into challenging his brother Marcus Speedstar in the race, Aunt Z was quick to open up betting, prompting Xiono, reminded of what had happened to him on his first day on the platform, to smugly remind Yeager that he couldn't back out once he had agreed to race.\nAunt Z was present when Kaz, Torra Doza, Neeku, BB-8, R1-J5 \"Bucket,\" Bolza Grool, and Al played a game of holo-darts. Kaz had three attempts but failed to hit the bullseye. Bucket then had a go. His first two shots hit the bull's eye but the third holo-dart ricocheted off the board and around the tavern. Aunt Z offhandedly deflected the dart with a tray whilst talking to a female human patron, causing it to strike Kaz in the buttocks.\nLater, Aunt Z was serving the shopkeepers Flix and Orka, who were accompanied by their pit droid G-LN. When Orka served G-LN some Blurrgfire, the pit droid went hyperactive and accosted two service droids including Glitch and Bolza Grool. While Aunt Z was conversing with her guests, the service droids and Grool ganged up on G-LN and roughed him up.\nAunt Z sold Kaz a drink while Torra and Tam played a game of holodarts. Shortly later, Synara San entered Aunt Z's Tavern and Torra invited her for a game of Drone-Blaster. Unknown to everyone, Synara was a pirate and member of Kragan Gorr's Warbird gang. Gaining Torra's trust, Synara gained access to Doza Tower and helped her pirate associates kidnap Torra. Torra was subsequently rescued by the First Order, who used it to convince Captain Imanuel Doza to acquiesce to the First Order's occupation of the Colossus.\nUnlike most of the Colossus' residents who were either supportive or dismissive towards it, Aunt Z was openly unhappy and hostile regarding the First Order occupation, especially when stormtroopers forced her to display propaganda in her tavern after claiming it didn't match her décor. Eventually, her refusal to be silent about her dislike for them led to her throwing the datapad displaying the propaganda at a stormtrooper patrol, after loudly proclaiming her belief that the First Order was responsible for the disappearances of Colossus residents including top Ace Hype Fazon. Later that same day, she was arrested, leading to her droid Glitch being overwhelmed while having to run the tavern by himself, allowing the First Order to place as many propaganda projectors as they pleased.\nAunt Z was placed in the same cargo container where Fazon, along with Grevel and Nod, were being held after their own arrests for similarly hostile behavior towards the First Order. The Gilliand refused to remain quiet or docile about her confinement, demanding to be let out, and even used Fazon as an unwilling stepladder  to interrogate the troopers guarding the container, whereupon she was told that she and the others would be shipped offworld. Xiono resolved to do something, and along with Torra and CB-23, headed to the west docks to rescue the prisoners after being told where they were by Yeager and Captain Doza. He told Aunt Z, who once again used the unwilling Fazon as a footstool to reach a vent hole in the container, that the plan was for her and her fellow prisoners to get onto the First Order transport before Xiono and Torra helped them overpower their guards so they could steal the ship, as the Colossus would be torn apart in a search if they broke them out now. The rescue plan went off without a hitch, and Fazon volunteered to fly the stolen transport. Aunt Z told Xiono that the escapees would go to Takodana, where she had a friend who could help them.\nAunt Z and Fazon later returned just in time to aid Xiono and the rest of the Colossus in escaping the planet and the First Order. She then went back to work in her tavern, serving up a \"Zero-G Special\" while the Colossus was stuck in space without coaxium and with multiple system failures.\nUnfortunately, the Colossus having been forced on the run into space meant that supplies of food and drink quickly ran out and many residents became unhappy with Captain Doza, Aunt Z among them. Reasoning that she couldn't stay if she couldn't run her business, Aunt Z prepared to leave the station but was persuaded by Torra and Kaz to stay if they could hunt and kill a jakoosk, a creature native to the nearby moon Celsor 3 that could keep the residents fed for a good long while. She offered Kragan Gorr and his Warbird gang free drinks if they could bring the beast down, but ultimately it was Torra and Kaz who did the deed, for which she warmly thanked them and agreed to stay for the time being.\nAunt Z was a female Gilliand with black eyes and light skin. She was tattooed on the upper left arm with a space waffle adorned with a crossed knife and spatula. She disliked the First Order, and her refusal to be silent about this led to her arrest when their forces occupied the Colossus. As a result, after Xiono and Torra helped her and her fellow prisoners escape, she was forced to leave Castilon and go into hiding, intending to ask a friend of hers on Takodana for help.\nZ'Vk'Thkrkza, or \"Aunt Z,\" is a character created and developed for the Star Wars Resistance animated series. She is voiced by Tovah Feldshuh.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/All_Aces_Battle_Royale_(comic)",
  "/wiki/No_Escape:_Part_2",
  "/wiki/Star_Wars_Resistance_Season_Two",
  "/wiki/Ace_Squadron_(Star_Wars_Encyclopedia)",
  "/wiki/Special:Upload",
  "/wiki/Crul",
  "/wiki/Gilliand",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Aunt_Z%27s_Tavern",
  "/wiki/Team_Colossus",
  "/wiki/Species",
  "/wiki/Ocean",
  "/wiki/Planet",
  "/wiki/Castilon",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Fuel",
  "/wiki/Colossus",
  "/wiki/Restaurant",
  "/wiki/First_Order",
  "/wiki/Occupation_of_the_Colossus",
  "/wiki/Kazuda_Xiono",
  "/wiki/Torra_Doza",
  "/wiki/Rescue_on_the_Colossus",
  "/wiki/Hype_Fazon",
  "/wiki/Grevel",
  "/wiki/Nod",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Takodana",
  "/wiki/Cantina",
  "/wiki/Refueling_station",
  "/wiki/Service_droid",
  "/wiki/G1-7CH",
  "/wiki/Resistance",
  "/wiki/Starfighter",
  "/wiki/Pilot",
  "/wiki/Poe_Dameron",
  "/wiki/Jarek_Yeager",
  "/wiki/Holodarts",
  "/wiki/Aleen",
  "/wiki/Klatooinian",
  "/wiki/Bolza_Grool",
  "/wiki/Neeku_Vozo",
  "/wiki/Jarek_Yeager%27s_Repair_Station",
  "/wiki/Jace_Rucklin",
  "/wiki/Jace_Rucklin%27s_racing_team",
  "/wiki/Coaxium",
  "/wiki/Tamara_Ryvora",
  "/wiki/Captain",
  "/wiki/Imanuel_Doza",
  "/wiki/Mission_to_Doza_Tower",
  "/wiki/Doza_Tower",
  "/wiki/Major",
  "/wiki/Elrik_Vonreg",
  "/wiki/Credit",
  "/wiki/BB-series_astromech_droid",
  "/wiki/BB-8",
  "/wiki/Acceleration_compensator",
  "/wiki/Kel",
  "/wiki/Eila",
  "/wiki/Massacre_on_Tehar",
  "/wiki/Chelidae",
  "/wiki/Platform_Classic",
  "/wiki/Marcus_Speedstar",
  "/wiki/R1-J5",
  "/wiki/Al",
  "/wiki/Holo-darts",
  "/wiki/Flix",
  "/wiki/Orka",
  "/wiki/DUM-series_pit_droid",
  "/wiki/G-LN",
  "/wiki/Blurrgfire",
  "/wiki/Synara_San",
  "/wiki/Drone-Blaster",
  "/wiki/Kragan_Gorr",
  "/wiki/Warbird_gang",
  "/wiki/Kidnapping_of_Torra_Doza",
  "/wiki/Propaganda",
  "/wiki/Datapad",
  "/wiki/Ace_Squadron",
  "/wiki/CB-23",
  "/wiki/Jakoosk",
  "/wiki/Celsor_3",
  "/wiki/Eye",
  "/wiki/Tattoo",
  "/wiki/Space_waffle",
  "/wiki/Star_Wars_Resistance",
  "/wiki/Tovah_Feldshuh",
  "/wiki/The_Recruit",
  "/wiki/Fuel_for_the_Fire",
  "/wiki/The_High_Tower",
  "/wiki/The_Children_from_Tehar",
  "/wiki/The_Search_for_Kaz",
  "/wiki/The_Platform_Classic",
  "/wiki/Secrets_and_Holograms",
  "/wiki/Dart_and_Cover",
  "/wiki/G-LN_(episode)",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_(2017)_16",
  "/wiki/The_Doza_Dilemma",
  "/wiki/The_Disappeared",
  "/wiki/Into_the_Unknown",
  "/wiki/A_Quick_Salvage_Run",
  "/wiki/Live_Fire",
  "/wiki/Hunt_on_Celsor_3",
  "/wiki/The_Engineer",
  "/wiki/Rendezvous_Point_(episode)",
  "/wiki/Kaz%27s_Curse",
  "/wiki/Breakout",
  "/wiki/The_Mutiny",
  "/wiki/The_New_World",
  "/wiki/Rebuilding_the_Resistance",
  "/wiki/The_Escape",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars_Resistance:_Meet_the_Pilots",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/2019_Topps_Star_Wars_Resistance_Surprise_Packs",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Databank_(website)"
 ]
}