{
 "name": "Z%27meer_Bothu",
 "display_name": "Z'meer Bothu",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Flynn Kybo"
     ]
    }
   ]
  }
 ],
 "content": "Z'meer Bothu was a female Human Jedi Master serving the Jedi Order during the Clone Wars.\nA Force-sensitive Human female, Z'meer Bothu was educated in the ways of the Force by the Jedi Order. Bothu held the rank of Jedi Master, and when the conflict between the Galactic Republic and the Confederacy of Independent Systems erupted into the Clone Wars, Master Bothu stayed at the Jedi Temple on Coruscant. Twenty four months after the war began she accepted the responsibility of training the Padawan of Master T'chooka D'oon, the young Flynn Kybo. Encouraging him to calm his rebellious nature and his thirst for vengeance against his Master's murderer, General Grievous, Bothu and Kybo spent hours deep in meditation within the Temple's expansive rooftop gardens.\nSoon, however, while Bothu was deep in a trance, Master B'dard Tone approached Kybo and offered him a place on his unsanctioned mission to assassinate Grievous. Agreeing to Tone's offer, Kybo was surprised to find that Bothu had overheard the entire conversation and his plan. Reminding the young Human that she was meditating, not asleep, Bothu stated she would not inform the Jedi High Council of his plan; similarly, she would not come to his defense should the mission be a failure and the Council wish to expel him. Departing the Temple together aboard a cruiser carrying several Jedi to the battle on Alderaan, Bothu turned a blind eye as her Padawan stole a small ship from the hangar bay, effectively severing his ties with the Jedi Order.\nBothu possessed distinctive facial markings, including a bow-shaped ribbon mark and a lip marking.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Flynn_Kybo",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Coruscant/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/T%27chooka_D%27oon",
  "/wiki/General/Legends",
  "/wiki/Grievous/Legends",
  "/wiki/B%27dard_Tone",
  "/wiki/Assassin/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Battle_of_Alderaan_(Clone_Wars)",
  "/wiki/Alderaan/Legends",
  "/wiki/General_Grievous_1",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}