{
 "name": "Zabaka",
 "display_name": "Zabaka",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Toydarian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Toydarian Toymaker"
     ]
    }
   ]
  }
 ],
 "content": "Zabaka was a female Toydarian who ran Toydarian Toymaker toyshop in Black Spire Outpost on the planet Batuu.\nZabaka, a female Toydarian, owned and operated the toyshop Toydarian Toymaker in Black Spire Outpost on the Outer Rim planet Batuu. She was a kind individual, and she found immense joy in bringing happiness to others through her handcrafted toys. She was skilled with a blaster, however, and was not afraid to use one against those who intended to cause harm to other beings or her creations.\nZabaka had a slight feud with Bina, the proprietor of the nearby Creature Stall, as Bina's pets would often escape their containers and steal toys from Zabaka's shop. The Toydarian also had a great admiration for Oga Garra, the owner of Oga's Cantina and crime boss in control of Black Spire Outpost.\nIn 34 ABY, Resistance spy Vi Moradi arrived on Batuu to establish a Resistance outpost. Salju, a Batuuan who operated Black Spire Station, advised Moradi about Zabaka's loyalties to Garra which made the Toydarian unlikely to join the Resistance. Zabaka purchased carvings of a convor and a frog-dog made by former First Order stormtrooper Archex, and she told him to bring other items of similar quality to sell to her.\nZabaka was first named in an article on StarWars.com titled \"The Aliens, Droids, and Shops of Star Wars: Galaxy's Edge.\" She was created as the shopkeeper for the retail location Toydarian Toymaker found within Star Wars: Galaxy's Edge, the themed land that first opened at Disneyland Park on May 31, 2019. She can be seen by customers in silhouette, flying around and working in her office behind a translucent window.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Toydarian",
  "/wiki/Gender",
  "/wiki/Toydarian_Toymaker",
  "/wiki/Black_Spire_Outpost",
  "/wiki/Planet",
  "/wiki/Batuu",
  "/wiki/Outer_Rim_Territories",
  "/wiki/Blaster",
  "/wiki/Bina",
  "/wiki/Creature_Stall",
  "/wiki/Oga_Garra",
  "/wiki/Oga%27s_Cantina",
  "/wiki/Crime_lord",
  "/wiki/34_ABY",
  "/wiki/Resistance",
  "/wiki/Spy",
  "/wiki/Vi_Moradi",
  "/wiki/Salju",
  "/wiki/Batuuan",
  "/wiki/Black_Spire_Station",
  "/wiki/Convor",
  "/wiki/Frog-dog",
  "/wiki/First_Order",
  "/wiki/Stormtrooper_(First_Order)",
  "/wiki/Archex",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/May_31",
  "/wiki/2019",
  "/wiki/Galaxy%27s_Edge:_Black_Spire",
  "/wiki/Galaxy%27s_Edge:_Black_Spire_(audiobook)",
  "/wiki/Star_Wars:_Datapad",
  "/wiki/Star_Wars:_Galaxy%27s_Edge:_Traveler%27s_Guide_to_Batuu",
  "/wiki/Template:Galaxy%27s_Edge_Date"
 ]
}