{
 "name": "Zafiel_Snopps",
 "display_name": "Zafiel Snopps",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Corulag"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Galactic Senate",
      "Galactic Senate",
      "Galactic Empire",
      "Imperial Senate",
      "House of Citizens",
      "Imperial Senate",
      "House of Citizens",
      "New Republic",
      "New Republic Senate",
      "New Republic Senate"
     ]
    }
   ]
  }
 ],
 "content": "Zafiel Snopps was a Human male from the planet Corulag who was one of the dominant political figures on his homeworld for several decades. A businessman and captain of industry, Snopps earned appointments to represent Corulag as its senator in the Galactic Republic Senate, as well as its successor, the Imperial Senate. When the Imperial Senate was disbanded by Galactic Emperor Palpatine in 0 BBY, Snopps was granted a special dispensation to serve as Corulag's Imperial governor. In that position, he presided over Corulag's ruling body, the House of Citizens, and worked to ensure that the planet's industry and economy thrived under his stewardship. Snopps' position on Corulag afforded him great power and prestige, and he was often left to control the affairs of the Bormea sector while its Moff, Jamson Caglio, was on the galactic capital Coruscant advising the Emperor. Well liked by the citizens of Corulag, Snopps was elected to represent the planet in the New Republic Senate once his homeworld decided to join the new galactic coalition.\nZafiel Snopps was a Human male from the Core World Corulag in the Bormea sector. He fathered several children, including his youngest son, Regenald Hanniper Snopps III. A businessman and captain of industry, Snopps was appointed as senator for Corulag to the Senate of the Galactic Republic. Snopps and Corulag supported Supreme Chancellor Palpatine during his tenure leading the Republic; when Palpatine declared in 19 BBY that the Republic was being reorganized into the Galactic Empire in the aftermath of the Clone Wars, Corulag's staunch loyalty was rewarded. The planet benefited from having Corulag bureaucrats in key governmental positions, and the establishment of a military academy to rival the academy on Raithal.\nSnopps continued to serve as senator for Corulag to the Imperial Senate, representing his homeworld's interests until the body was dissolved in 0 BBY, shortly prior to the Battle of Yavin. Snopps was then granted a special dispensation by now-Emperor Palpatine to serve as Corulag's Imperial governor. Due to Corulag's influence in Imperial politics, the Moff of the Bormea sector, Jamson Caglio, maintained his residence in Curamelle, Corulag's capital city. However, Moff Caglio spent much of his time advising the Emperor on the galactic capital, Coruscant, leaving most of the actual running of the sector to Snopps. Governor Snopps used his position to further his own industrial holdings, and was not interested in using his power to enforce minor violations of the Imperial Military Code, or engage in politicking. Snopps' main concern was to keep Corulag's powerful economy on track rather than promote the New Order ideology of the Empire.\nSnopps' position placed him in command of the House of Citizens, the ancient ruling body of Corulag. He was extremely popular with the citizens of Corulag, owing to his days representing the planet as a senator, but was looked down upon by the administrators of the local military academy. Snopps attempted to use his influence to secure a place at the Imperial Academy for his son, Regenald, but failed.\nAt some point, Snopps arranged for a gang of thugs hired from Crullov City to break a strike held by the Orbital Transports Union. The Union was protesting new taxes on starship berths, and their strike was effectively halting the planetary economy, a situation that Snopps could not allow to continue. After a series of confrontations between the hired thugs and the protesters, union leaders hired a group of spacers to intercede and stop the violence.\nIn 3 ABY, after the Imperial victory at the Battle of Hoth during the Galactic Civil War, Snopps refused to discipline the cadets at the Corulag Academy for abusing members of the Exotic Entertainers' Union despite protests by their Core Worlds representative, Mayli Weng. In 6 ABY, the New Republic was established as the galactic government, displacing the Empire and re-establishing the Senate. When Corulag allied themselves with the New Republic, Snopps was once again appointed to represent his homeworld in the galactic governing body.\nZafiel Snopps was a no-nonsense businessman and captain of industry with a hard-edged attitude and a ruthless streak. However, he was a warm individual, who had the ability to inspire confidence and greatness in those around him. Snopps was a good listener, and was able to sense when others hid a motive for their actions, and could be intimidating when he needed to be. His position gave him access to a large amount of information, and he was particularly knowledgeable about bureaucratic and diplomatic procedures. His role as an industrialist gave him access to vast resources, and he was able to coordinate his workforce ably.\nSnopps was trained to use a blaster pistol, and was considered to be an excellent shot. He was also trained in melee combat. Snopps could pilot starships and operate computers, and was noted for his ability to play the harp. He had an eye for appraising items, and could swim. In addition to being able to read, write and speak Basic, Snopps could also read, write and speak Herglese. He wore his Imperial uniform with rank insignia while on duty, and carried a blaster pistol, comlink, and datapads.\nZafiel Snopps was first mentioned in The Spira Regatta, an RPG adventure published in the first issue of the Star Wars Adventure Journal by West End Games in 1994. It was written by Paul Sudlow, and Snopps was briefly mentioned to be a former senator and current Core World governor in the biography of his son, Regenald Hanniper Snopps III. The adventure was subsequently reprinted in 1996's The Best of the Star Wars Adventure Journal, Issues 1-4. In 1995, Sudlow also wrote the RPG article Into the Core Worlds for the seventh issue of the Adventure Journal, expanding on Snopps' character and placing him as the former Imperial senator and current Imperial governor of the Core World of Corulag. 1996's Shadows of the Empire Sourcebook included a short narrative story entitled An Old Flame in Need..., which name-checked Snopps in dialogue, and he received a mention in 1998's The Far Orbit Project in the section detailing Corulag and other Core Worlds within the Bormea and Darpa sectors.\nIn 2003, Snopps was mentioned in Wizards of the Coast's Coruscant and the Core Worlds, which indicated that he had served as Corulag's senator in the Galactic Republic Senate, as well as the Imperial Senate. In the sourcebook, Wizards of the Coast allowed for the possibility that any of the Roleplaying Game adventures could be played in one of several eras, including the \"Rise of the Empire era,\" the \"Rebellion era,\" and the \"New Jedi Order era,\" with only minor adjustments to accommodate changes in galactic circumstances such as the proliferation of the Jedi, or the presence of the extra-galactic Yuuzhan Vong invaders. For their purposes, Wizards of the Coast defined the \"Rise of the Empire era\" as the time before the Clone Wars, and the \"Rebellion era\" as the period following the end of the Clone Wars. This is at odds with the official Lucasfilm Ltd. definition of the eras, which states that the \"Rise of the Empire era\" stretched from 1000 BBY to 0 BBY, with the \"Rebellion era\" ranging from 0 ABY to 5 ABY. When detailing Snopps' career, they stated he had served as a senator in both the Rise of the Empire and Rebellion eras, indicating that he had served in the Galactic Republic Senate according to their interpretation of the eras.\nIn Coruscant and the Core Worlds, Snopps is the instigator of the adventure hook called \"Strike Breakers,\" which sees him hire thugs to break a strike enacted by the Orbital Transports Union. Depending upon the era of play the adventure is used in, Snopps is refered to as either \"Governor\" or \"Senator\" as appropriate. During the course of the adventure hook, the players are hired by the union leaders to oppose the hired thugs. The players can choose several options, which include investigating Snopps and the political scene in Curamelle, finding damaging information on him and applying political pressure to settle with the union. However, there are several other options available to the players, and this article assumes that while the strike was eventually ended, the exact method used in unknown.\nIn 1991's Heir to the Empire Sourcebook, the character of Judder Page is established to be from Corulag, and that his father was the planet's senator during the Imperial Period. As Coruscant and the Core Worlds asserts that Snopps had served in the position of Corulag's senator for many years, these two pieces of information seem to contradict one another, or at least imply a familial relationship between the two.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/Corulag/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Senate/Legends",
  "/wiki/House_of_Citizens",
  "/wiki/New_Republic/Legends",
  "/wiki/New_Republic_Senate/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Politics/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Senator/Legends",
  "/wiki/Dissolution_of_the_Imperial_Senate/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/0_BBY/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Bormea_sector/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Jamson_Caglio",
  "/wiki/The_galaxy/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Galaxy/Legends",
  "/wiki/Core_Worlds/Legends",
  "/wiki/Reproduction/Legends",
  "/wiki/Regenald_Hanniper_Snopps_III",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Declaration_of_a_New_Order",
  "/wiki/19_BBY/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Bureaucrat/Legends",
  "/wiki/Corulag_Academy",
  "/wiki/Raithal_Academy/Legends",
  "/wiki/Raithal/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Sector/Legends",
  "/wiki/Curamelle/Legends",
  "/wiki/City/Legends",
  "/wiki/Time/Legends",
  "/wiki/Imperial_Military_Code",
  "/wiki/New_Order/Legends",
  "/wiki/Standard_day/Legends",
  "/wiki/Imperial_Academy/Legends",
  "/wiki/Roleplaying_game",
  "/wiki/Crullov_City",
  "/wiki/Orbital_Transports_Union",
  "/wiki/Starship/Legends",
  "/wiki/Spacer/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Battle_of_Hoth/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Cadet/Legends",
  "/wiki/Exotic_Entertainers%27_Union",
  "/wiki/Mayli_Weng",
  "/wiki/6_ABY/Legends",
  "/wiki/Declaration_of_a_New_Republic/Legends",
  "/wiki/Diplomat/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Melee_weapon/Legends",
  "/wiki/Pilot/Legends",
  "/wiki/Computer/Legends",
  "/wiki/Harp",
  "/wiki/Eye/Legends",
  "/wiki/Galactic_Basic_Standard/Legends",
  "/wiki/Herglese",
  "/wiki/Military_rank/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Comlink/Legends",
  "/wiki/Datapad/Legends",
  "/wiki/The_Spira_Regatta",
  "/wiki/Star_Wars_Adventure_Journal_1",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/West_End_Games",
  "/wiki/1994",
  "/wiki/Paul_Sudlow",
  "/wiki/1996",
  "/wiki/The_Best_of_the_Star_Wars_Adventure_Journal,_Issues_1-4",
  "/wiki/1995",
  "/wiki/Into_the_Core_Worlds",
  "/wiki/Star_Wars_Adventure_Journal_7",
  "/wiki/Shadows_of_the_Empire_Sourcebook",
  "/wiki/An_Old_Flame_in_Need...",
  "/wiki/1998",
  "/wiki/The_Far_Orbit_Project",
  "/wiki/Darpa_sector",
  "/wiki/2003",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Coruscant_and_the_Core_Worlds",
  "/wiki/Star_Wars_Roleplaying_Game",
  "/wiki/Rise_of_the_Empire_era",
  "/wiki/Rebellion_era",
  "/wiki/New_Jedi_Order_era",
  "/wiki/Jedi/Legends",
  "/wiki/Extra-galactic",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/1000_BBY",
  "/wiki/0_ABY/Legends",
  "/wiki/5_ABY/Legends",
  "/wiki/1991",
  "/wiki/Heir_to_the_Empire_Sourcebook",
  "/wiki/Judder_Page/Legends",
  "/wiki/Judder_Page%27s_father",
  "/wiki/Imperial_Period",
  "/wiki/Small_Favors",
  "/wiki/Star_Wars_Adventure_Journal_12",
  "/wiki/Wizards.com",
  "/wiki/Quick_Locations",
  "/wiki/Mission_to_Mustafar/Legends",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_The_Essential_Atlas_Online_Companion",
  "/wiki/Star_Wars:_Episode_III_Revenge_of_the_Sith",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}