{
 "name": "Zagyar",
 "display_name": "Zagyar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 230 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nihil",
      "Lourna Dee's Tempest",
      "Lourna Dee's Tempest"
     ]
    }
   ]
  }
 ],
 "content": "Zagyar was a male member of the Nihil marauder group who held the rank of Storm in the Tempest of Lourna Dee. He wore a mask with large, curling horns over the ears and white slits for eyes. Zagyar participated in an attack on a convoy in the Ab Dalis system, where Blit, one of his Strikes, miscalculated a harpoon shot, leading to the destruction of a freighter and the loss of most of his unit. As per Nihil tradition, one of his surviving crewmembers was killed by being thrown into space at a banquet hosted in the Great Hall of the Nihil in the aftermath. Zagyar later served onboard a Spider Cruiser commanded by Eye of the Nihil Marchion Ro during an attack on Trymant IV.\nZagyar was a male individual who lived during the High Republic Era, where he eventually joined the Nihil pirates as a member of the Tempest commanded by Lourna Dee. In that Tempest, he eventually rose to the rank of Storm.\nIn the aftermath of the Great Hyperspace Disaster caused by the destruction of the freighter Legacy Run, Zagyar and his crew of Strikes participated in an attack on a convoy from Garello Technologies fleeing Ab Dalis due to the destruction caused the first Emergence, which had struck the planet. During the attack, Blit, one of Zagyar's Strikes, miscalculated a harpoon shot she fired at one of the convoy's six freighters, striking a fuel tank. This caused the freighter to explode, depriving the Nihil of its cargo and killing most of Zagyar's crew.\nIn the aftermath, the Tempest Runner Pan Eyta, who had been in command of the raid, held a banquet at the Great Hall of the Nihil in No-Space to celebrate. However, the rules by which the Nihil lived and divided their prizes required \"payment\" for the loss of the freighter, and Eyta had Zagyar called forward to explain what had happened. After Zagyar explained Blit's mistake, the assembled Nihil began howling for blood, and as a result, one of his crew was thrown to their death in the space outside the Great Hall as recompense for the loss. Eye of the Nihil Marchion Ro, who witnessed the events, did not at the time know which one of Zagyar's crew had paid the price because he felt such sacrifices were distasteful and a waste, and did not look.\nLater, Zagyar served as a crewmember aboard a Spider Cruiser under Ro's command which travelled to the planet Trymant IV during an Emergence to pick up Tromak, a member of the Elders of the Path whom Ro wanted to acquire some information for him. However, a battle broke out between the Nihil and a group of Jedi who had arrived to provide aid. In the chaos, Tromak and Krix Kamerat, a young member of his sect who he had claimed was his assistant so he would be brought along, were hustled aboard the cruiser. Kamerat's friend Zeen Mrala, who was Force-sensitive, something against the sect's rules, asked Jedi Master Yoda to rescue her friend from the Nihil. Ro decided to leave, but Zagyar informed him that the approaching Jedi had somehow vanished.\nZagyar was a male individual. When asked to explain the loss of a targeted starship during a raid in front of the assembled ranks of the Nihil, he did not dissemble or panic, coolly stating the events. Marchion Ro realized and respected that. He did not, however, appear to agree with the Nihil custom of sacrificing a member of a crew which had erred during raids, stating that he believed that Blit had already paid the price for the mistake because she had been killed. Zagyar wore a mask with large, curling horns over the ears and eyes which were thin white slits.\nZagyar was created for the Star Wars: The High Republic multimedia project, first appearing in Charles Soule's January 4, 2021 novel, The High Republic: Light of the Jedi. The character then received a visual depiction in the second issue of the Star Wars: The High Republic Adventures comic-book series on March 3, 2021. The issue was written by Daniel José Older, illustrated by Harvey Tolibao and Pow Rodrix, and published by IDW Publishing.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Zagyar",
  "/wiki/230_BBY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nihil",
  "/wiki/Lourna_Dee%27s_Tempest",
  "/wiki/Pirate",
  "/wiki/Storm_(rank)",
  "/wiki/Lourna_Dee",
  "/wiki/Ear",
  "/wiki/Eye",
  "/wiki/Attack_on_the_Garello_convoy",
  "/wiki/Convoy",
  "/wiki/Ab_Dalis_system",
  "/wiki/Blit",
  "/wiki/Strike",
  "/wiki/Harpoon",
  "/wiki/Freighter",
  "/wiki/Death",
  "/wiki/Realspace",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/Spider_Cruiser",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Marchion_Ro",
  "/wiki/Attack_on_Trymant_IV",
  "/wiki/Trymant_IV",
  "/wiki/High_Republic_Era",
  "/wiki/Tempest",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Legacy_Run",
  "/wiki/Garello_Technologies",
  "/wiki/Ab_Dalis",
  "/wiki/First_Emergence",
  "/wiki/Planet",
  "/wiki/Fuel",
  "/wiki/Tempest_Runner",
  "/wiki/Pan_Eyta",
  "/wiki/No-Space",
  "/wiki/Blood",
  "/wiki/Trymant_IV_disaster",
  "/wiki/Tromak",
  "/wiki/Elders_of_the_Path",
  "/wiki/Jedi",
  "/wiki/Krix_Kamerat",
  "/wiki/Cruiser",
  "/wiki/Zeen_Mrala",
  "/wiki/Force-sensitive",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Starship",
  "/wiki/Star_Wars:_The_High_Republic",
  "/wiki/Charles_Soule",
  "/wiki/January_4",
  "/wiki/2021",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/The_High_Republic_Adventures_(2021)_2",
  "/wiki/Star_Wars:_The_High_Republic_Adventures_(IDW_Publishing_2021)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/March_3",
  "/wiki/Daniel_Jos%C3%A9_Older",
  "/wiki/Harvey_Tolibao",
  "/wiki/Pow_Rodrix",
  "/wiki/IDW_Publishing",
  "/wiki/The_High_Republic:_Light_of_the_Jedi_(audiobook)",
  "/wiki/Star_Wars_Adventures_(2020)",
  "/wiki/Tales_of_Villainy:_The_Gaze_Electric",
  "/wiki/Star_Wars_Adventures_(2020)_6",
  "/wiki/The_High_Republic_Adventures_(2021)_3",
  "/wiki/The_High_Republic_Adventures_(2021)_4",
  "/wiki/The_High_Republic_Adventures_(2021)_5",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic:_Trail_of_Shadows_4",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/Category:Images_of_Zagyar",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/Destruction_of_Starlight_Beacon"
 ]
}