{
 "name": "Zakarisz_Ghent",
 "display_name": "Zakarisz Ghent",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Baroli"
     ]
    },
    {
     "name": "Born",
     "values": [
      "11 BBY",
      "Baroli"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Car'das smugglers",
      "Smugglers' Alliance",
      "New Republic",
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Zakarisz Ghent was a slicer and associate of the smuggler Talon Karrde. While highly intelligent and skilled in his area of expertise, Ghent was also incredibly naïve and absent-minded.\nGhent earned a reputation as a legendary computer slicer during his time with Talon Karrde's crew, and as a result he eventually became Chief of Cryptography for the New Republic.\nBorn on the planet Baroli, Ghent's gift with codes and numbers was prodigious. He first came to prominence at the age of twelve, when he single-handedly cracked the Imperial ILKO code in two months—a project that took the Rebel Alliance's entire top slicer team a full month.\nHe was on Corellia after 0 ABY and before 4 ABY.\nThe crux of his early life, however, occurred shortly after the Battle of Endor. Still in his teens, he was lured to the Mid Rim world of Chibias, and blackmailed into joining a Rebel Alliance plot to decrypt the control node of a Star Destroyer. However, the plot was foiled when Ghent encountered the fugitive Emperor's Hand Mara Jade; the pair went their separate ways after the event, but before leaving the planet, Ghent was intercepted and recruited by Talon Karrde.\nDuring the Thrawn Crisis, Ghent was brought in by Karrde after Admiral Gial Ackbar was imprisoned by the New Republic on suspicion of taking bribes. Karrde suspected that Ackbar had been framed and that the funds found in Ackbar's account had been placed there by a slicer, and wanted Ghent to prove his suspicions. Loaned to the New Republic's investigation, it took Ghent a mere two days to clear Ackbar of any wrongdoing.\nTrapped on Coruscant by Thrawn's cloaked-asteroid blockade, Ghent was enlisted by the New Republic cryptologists to break the Imperial battle encryptions; he also \"guarded\" his friend and associate Mara Jade while she was hospitalized. Though his value as a guard was questionable as he tended to ignore most things that weren't binary, Mara appreciated the thought. By the time Ghent's month-long stay on the capital was up he had broken the Imperial code, in addition to slicing the pulse transmitter encrypt code that was used by Delta Source, an Imperial Intelligence system acquiring information directly from the New Republic headquarters for something to do. This led to the discovery, and eventual termination of the costly intelligence leak. During this time, he also sliced himself a code to get into the New Republic's war room. When Leia asked him why, he said he was bored. In his introduction to the crypt team, he was under their impression that their best encryption-breaking routines were a \"silly drill.\"\nLater during the conflict, Ghent assisted Leia Organa Solo's infiltration the planet of Wayland by rigging the Wild Karrde with a fake Imperial transponder code, allowing the ship and her passengers to penetrate the planet's defenses.\nThanks in part to his actions during the Thrawn Crisis, Ghent gained many valuable contacts in the upper echelons of the New Republic's government. After Thrawn's death he joined New Republic Intelligence, and eventually worked his way up to the position of Chief of Cryptography for the New Republic, initially based aboard the Dreadnaught Peregrine under General Garm Bel Iblis.\nIn 19 ABY, Crypt Chief Ghent salvaged a scrambled transmission, addressed to General Garm Bel Iblis, from Admiral Gilad Pellaeon to extend peace between the Imperial Remnant and the New Republic once and for all. He delivered the message in person to High Councilor Leia Organa Solo on Pakrik Major and then accompanied her aboard the Millennium Falcon to meet with Pellaeon at Pesitiin. During their discussion, he surprised both of them by volunteering to go to the Ubiqtorate base at Yaga Minor  to retrieve an Imperial copy of the Caamas Document. He explained that his journey to Pakrik Major with Caamasi Trustant Elegos A'Kla had deeply impressed on him the need to use one's talents for the greater good whenever possible.\nThis assignment nearly resulted in his death when Bel Iblis, unaware of his presence, nearly destroyed the room he was in during the latter's data raid on Yaga Minor. Both the assignment and the raid might also have been futile, since the base's copy of the Caamas Document  had been altered weeks earlier by Major Grodin Tierce during his visit to Yaga Minor.\nGhent remained with NRI during and after the war with the Yuuzhan Vong. In 35 ABY he was called to Ossus by Luke Skywalker in an effort to solve some programming glitches with R2-D2. During the repairs, he was able to unlock holograms that showed Luke his mother, Padmé Amidala, for the first time, and how she died. However, Mara Jade found that Ghent was installing camera bugs in the New Jedi Temple under the orders of Chief of State Cal Omas. Luke Skywalker again trusted Ghent and let him finish his work on R2-D2.\nZakarisz Ghent first appeared in the 1991 novel Heir to the Empire by Timothy Zahn. Ghent's first name was not revealed until the novel The New Jedi Order: Balance Point, released almost a decade after his first appearance in Heir to the Empire. Originally only intended as a minor character by Zahn, the author was suprised by the level of fan following the character gained over time.\nFormer director of Lucas Online Paul Ens posts at the official site discussion boards under the name \"Ghent.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Ghent",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Zakarisz_Ghent",
  "/wiki/Baroli/Legends",
  "/wiki/11_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Barolian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Car%27das_smugglers",
  "/wiki/Smugglers%27_Alliance",
  "/wiki/New_Republic/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Talon_Karrde",
  "/wiki/Slicer/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Crypt_Chief",
  "/wiki/Planet/Legends",
  "/wiki/ILKO",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/0_ABY/Legends",
  "/wiki/4_ABY/Legends",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Mid_Rim",
  "/wiki/Chibias",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Emperor%27s_Hand/Legends",
  "/wiki/Mara_Jade_Skywalker",
  "/wiki/Thrawn_campaign",
  "/wiki/Admiral/Legends",
  "/wiki/Gial_Ackbar/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Delta_Source",
  "/wiki/Imperial_Intelligence/Legends",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Wayland",
  "/wiki/Wild_Karrde",
  "/wiki/New_Republic_Intelligence_Service",
  "/wiki/Peregrine_(Dreadnaught-class)",
  "/wiki/Garm_Bel_Iblis/Legends",
  "/wiki/19_ABY/Legends",
  "/wiki/Gilad_Pellaeon/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/New_Republic_High_Council",
  "/wiki/Pakrik_Major",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Pesitiin",
  "/wiki/Ubiqtorate/Legends",
  "/wiki/Yaga_Minor/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Caamas_Document",
  "/wiki/Caamasi",
  "/wiki/Trustant",
  "/wiki/Elegos_A%27Kla",
  "/wiki/Grodin_Tierce_(clone)",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Yuuzhan_Vong",
  "/wiki/35_ABY/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/Luke_Skywalker/Legends",
  "/wiki/R2-D2/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/New_Jedi_Temple",
  "/wiki/Chief_of_State_(Galactic_Alliance)",
  "/wiki/Cal_Omas",
  "/wiki/1991",
  "/wiki/Heir_to_the_Empire",
  "/wiki/Timothy_Zahn",
  "/wiki/The_New_Jedi_Order:_Balance_Point",
  "/wiki/Lucas_Online",
  "/wiki/Paul_Ens",
  "/wiki/Doaba_Guerfel/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Corellia/Legends",
  "/wiki/Star_Wars_Galaxies",
  "/wiki/Star_Wars_Gamer",
  "/wiki/Handoff",
  "/wiki/Star_Wars_Gamer_10",
  "/wiki/Heir_to_the_Empire:_The_20th_Anniversary_Edition",
  "/wiki/Heir_to_the_Empire:_The_20th_Anniversary_Edition_(audiobook)",
  "/wiki/Dark_Force_Rising",
  "/wiki/Dark_Force_Rising_(unabridged_audiobook)",
  "/wiki/The_Last_Command",
  "/wiki/The_Last_Command_(unabridged_audiobook)",
  "/wiki/Champions_of_the_Force",
  "/wiki/Children_of_the_Jedi_(novel)",
  "/wiki/Specter_of_the_Past",
  "/wiki/Specter_of_the_Past_(unabridged_audiobook)",
  "/wiki/Vision_of_the_Future",
  "/wiki/Vision_of_the_Future_(unabridged_audiobook)",
  "/wiki/The_New_Jedi_Order:_Edge_of_Victory_II:_Rebirth",
  "/wiki/Dark_Nest_I:_The_Joiner_King",
  "/wiki/Dark_Nest_II:_The_Unseen_Queen",
  "/wiki/Dark_Nest_III:_The_Swarm_War",
  "/wiki/Heir_to_the_Empire_Sourcebook",
  "/wiki/Dark_Force_Rising_Sourcebook",
  "/wiki/Star_Wars_Gamemaster_Handbook",
  "/wiki/The_Last_Command_Sourcebook",
  "/wiki/The_Essential_Guide_to_Characters",
  "/wiki/The_Jedi_Academy_Sourcebook",
  "/wiki/The_Thrawn_Trilogy_Sourcebook",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/Star_Wars_Galaxy_Collector",
  "/wiki/Use_the_Force",
  "/wiki/Star_Wars_Galaxy_Collector_5",
  "/wiki/The_Smuggler%27s_Alliance",
  "/wiki/Star_Wars_Gamer_3",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Threats_of_the_Galaxy",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Databank_(original)"
 ]
}