{
 "name": "Zal",
 "display_name": "Zal",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Barabel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wild Knights"
     ]
    }
   ]
  }
 ],
 "content": "Zal was a female Barabel Jedi Knight in the New Jedi Order. During the Yuuzhan Vong War, she served Jedi Master Saba Sebatyne in her starfighter squadron, the Wild Knights. In 43.5 ABY, Zal and fellow Barabel Jedi Knights Dordi and Wilyem served as gunners for Captain Han Solo in the Millennium Falcon to distract Galactic Alliance forces while his wife, Leia Organa Solo, smuggled four Jedi suffering from a psychosis offworld in the Gizer Gut before they could be captured by Galactic Alliance Security and encased in carbonite. In 44 ABY, Zal began a nest with Wilyem, as well as Dordi and Sebatyne's son, Tesar, in the sub-basement of the Jedi Temple. The Barabels stayed behind with their nest when the Jedi left the planet Coruscant in an attempt to lure the Lost Tribe of Sith into a trap. Soon afterward, the Solos' granddaughter Allana—who had accidentally discovered the Barabels' nest sometime previously and had sworn herself to secrecy—returned with her grandparents, as well as Jedi Knight Zekk and the Hapan Taryn Zel, to warn the Barabels of a Force vision she had of their younglings being killed. The Barabels evacuated their nest and were extracted from the Temple aboard the Parting Gift, piloted by the former Imperial Head of State, Jagged Fel.\nZal was a female Force-sensitive Barabel who served in the New Jedi Order. She trained in the ways of the light side of the Force and served as a member of Jedi Master Saba Sebatyne's all-Jedi Wild Knights starfighter squadron during the Yuuzhan Vong War. By 43 ABY, she had attained the rank of Jedi Knight. Around this time, she and fellow Barabel Jedi Knight Dordi considered starting a nest with Sebatyne's son, Tesar Sebatyne. In 43.5 ABY, several young Jedi Knights began to fall prey to a mysterious illness that caused them to believe that everyone they knew had been replaced by impostors, and the Galactic Federation of Free Alliances decided to deal with the psychotic Knights by encasing them in carbonite. The Jedi Order resisted this, however, and secretly kept as many of the ill Jedi as possible hidden in the New Jedi Temple on the planet Coruscant to be studied.\nTo prevent Galactic Alliance Security forces from finding and capturing these Jedi, Captain Han Solo and his wife, Jedi Knight Leia Organa Solo, decided to smuggle them offworld to the planet Shedu Maad. Zal, along with fellow Barabel Knights Dordi and Wilyem, served as gunners in the Millennium Falcon under Han Solo and his granddaughter, Allana Solo. They were to distract Galactic Alliance forces in orbit over Coruscant, allowing Organa Solo to escape with the affected Jedi—Natua Wan, Seff Hellin, Bazel Warv, and Yaqeel Saav'etu—in the Gizer Gut.\nThe Millennium Falcon broke every procedure for departing the planet; the Galactic Alliance's Bolt Squadron and the Fast Death, a Nargi-class pursuit frigate, began to chase them down. Solo maneuvered the Falcon behind PharmCom Orbital Processing Plant One, an orbiting pharmaceutical production plant, and the Fast Death stayed behind, to be replaced by another pursuit frigate, the Quick End. Solo then told Allana to alert Master Sebatyne, and proceeded to order Zal and Dordi to pull up their guns and targeting computer systems as a bluff. Sebatyne arrived with a squadron of StealthXs and quickly scattered Bolt Squadron. Wilyem then fired a proton torpedo, which detonated a few kilometers off their stern. Solo pretended to spin out of control toward the Quick End, and revealed to the Galactic Alliance that he had Allana—who was disguised as his adopted daughter \"Amelia\"—on board. The frigate then maneuvered out of his way, and at Solo's orders, Allana reached out in the Force to Organa Solo, signaling her to leave. She quickly escaped offworld with the four psychotic Jedi in the Gizer Gut. The Galactic Alliance forces broke off their pursuit, and, their objective complete, Dordi, Zal, Wilyem, and the Solos jumped into hyperspace to meet up with the Gizer Gut at Shedu Maad.\nIn 44 ABY, Zal began a nest with Wilyem in the Jedi Temple's underlevels, along with Dordi and Tesar Sebatyne. They were stumbled upon by Amelia and Jedi Knight Bazel Warv, one of the Jedi they had helped to smuggle offworld, and who had since recovered from the psychosis. The Barabels were outraged at first, and demanded that since they had seen the nest and their eggs, Amelia and Warv would have to stay until the eggs hatched. Amelia, however, suggested that she tell them a secret about herself that was as important as the Barabels' nest, and revealed to them her true identity as Allana, daughter of Jedi Jacen Solo and Queen Mother Tenel Ka Djo, and thus the rightful heir to the Hapes Consortium. Zal and the other Barabels agreed to the terms and allowed Allana and Warv to leave.\nUpon the rise of the Lost Tribe of Sith in galactic affairs, the Jedi decided to leave Coruscant in an attempt to lure the Sith into a trap, so that the Jedi could effectively eliminate the Tribe in one mission. Zal and the three other Barabrels, however, remained behind in the Temple. When the Jedi returned and began hunting down the Sith, the Tribe retreated into the Temple. Meanwhile, Allana had a vision of the Barabels' nest being attacked and their younglings being slaughtered, and she—along with her grandparents, the Jedi Knight Zekk, the Hapan Taryn Zel, and several Hapan commandos—traveled to the Temple and located the nest to warn the Barabels. Zal was the only one of the four Barabels who did not come out to meet with them.\nThey quickly gathered the younglings and fled the nest, fighting the Sith on their way out. They suffered casualties, including numerous Hapan soldiers and some of the younglings, leaving twenty of the newborn Barabels alive. The Barabels and their rescuers were extracted from the Jedi Temple by the former Imperial Remnant Head of State Jagged Fel, who piloted the Parting Gift, along with Master Saba Sebatyne, Void Jumper Sergeant Major Gef Olazon, and the former Jedi Tahiri Veila.\nZal shared a sense of humor with other Barabels that other beings rarely understood. Much of what was said between the crew of the Millennium Falcon during her mission with the Solos was taken as a joke between the Barabel Jedi. Even when they were under pressure, Zal kept her sense of humor and remained high-spirited. When Allana and Warv accidentally discovered Zal's nest, she and the other Barabels were outraged, and tried to force the two to stay in the nest until their eggs hatched. However, when Allana offered an exchange of secrets, Zal inquired as to whether the secret was as big as their nest, and when Allana reassured her that it was and went on to reveal it, the Barabels allowed the two intruders to leave.\nZal learned the ways of the Force with the Jedi Order and rose to the rank of Jedi Knight. She was a skillful pilot, and she flew with Saba Sebatyne's Wild Knights during the Yuuzhan Vong War. Zal was also a capable gunner; however, she and Dordi were ordered not to fire on the Galactic Alliance ships during their mission with Solo.\nZal was created by author Troy Denning for his first installment, and the third novel overall, in the Fate of the Jedi series, Fate of the Jedi: Abyss, released August 18, 2009. Zal later appeared in Fate of the Jedi: Vortex and Fate of the Jedi: Apocalypse, the sixth and ninth novels of the series, respectively, both by Denning.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Barabel/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Wild_Knights",
  "/wiki/Fate_of_the_Jedi:_Abyss",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Yuuzhan_Vong_War",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Saba_Sebatyne",
  "/wiki/Starfighter/Legends",
  "/wiki/Squadron/Legends",
  "/wiki/43_ABY",
  "/wiki/Jedi/Legends",
  "/wiki/Dordi",
  "/wiki/Wilyem",
  "/wiki/Gunner/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Toydarian_double-reverse_spinner",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Force_psychosis",
  "/wiki/Gizer_Gut",
  "/wiki/Galactic_Alliance_Security",
  "/wiki/Carbonite/Legends",
  "/wiki/44_ABY",
  "/wiki/Tesar_Sebatyne",
  "/wiki/New_Jedi_Temple",
  "/wiki/Planet/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Lost_Tribe_of_Sith",
  "/wiki/Allana_Solo",
  "/wiki/Parent/Legends",
  "/wiki/Zekk",
  "/wiki/Hapan",
  "/wiki/Taryn_Zel",
  "/wiki/Force_vision/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Death/Legends",
  "/wiki/Assault_on_the_New_Jedi_Temple",
  "/wiki/Parting_Gift",
  "/wiki/Pilot/Legends",
  "/wiki/Imperial_Remnant",
  "/wiki/Head_of_State/Legends",
  "/wiki/Jagged_Fel",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Shedu_Maad",
  "/wiki/Orbit/Legends",
  "/wiki/Natua_Wan",
  "/wiki/Seff_Hellin",
  "/wiki/Bazel_Warv",
  "/wiki/Yaqeel_Saav%27etu",
  "/wiki/Bolt_Squadron_(Galactic_Alliance)",
  "/wiki/Fast_Death",
  "/wiki/Nargi-class_pursuit_frigate",
  "/wiki/PharmCom_Orbital_Processing_Plant_One",
  "/wiki/Frigate/Legends",
  "/wiki/Quick_End",
  "/wiki/StealthX",
  "/wiki/Proton_torpedo/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Darth_Caedus",
  "/wiki/Queen_Mother",
  "/wiki/Tenel_Ka_Djo",
  "/wiki/Hapes_Consortium/Legends",
  "/wiki/Lost_Tribe_of_Sith_emergence",
  "/wiki/The_galaxy/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Liberation_of_Coruscant_(Lost_Tribe_of_Sith_emergence)",
  "/wiki/Commando/Legends",
  "/wiki/Void_Jumper",
  "/wiki/Sergeant_major/Legends",
  "/wiki/Gef_Olazon",
  "/wiki/Tahiri_Veila",
  "/wiki/Laser/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Troy_Denning",
  "/wiki/Star_Wars:_Fate_of_the_Jedi",
  "/wiki/August_18",
  "/wiki/2009",
  "/wiki/Fate_of_the_Jedi:_Vortex",
  "/wiki/Fate_of_the_Jedi:_Apocalypse",
  "/wiki/Fate_of_the_Jedi:_Abyss_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Vortex_(audiobook)",
  "/wiki/Fate_of_the_Jedi:_Apocalypse_(audiobook)"
 ]
}