{
 "name": "Zal_Dinnes",
 "display_name": "Zal Dinnes",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tierfon"
     ]
    },
    {
     "name": "Died",
     "values": [
      "0 BBY",
      "Yavin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blonde"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Hazel"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Tierfon Yellow Aces",
      "Red Squadron",
      "Tierfon Yellow Aces",
      "Red Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Zal Dinnes was a human female pilot who served in the Alliance to Restore the Republic. She flew a T-65B X-wing starfighter under the callsign Red Eight in Red Squadron at the Battle of Scarif and died at the Battle of Yavin.\nHailing from Tierfon, Zal Dinnes served as a pilot in the Alliance to Restore the Republic during the Galactic Civil War. Under the rank of lieutenant, Dinnes was assigned to the Tierfon Launch Base as a member of the Tierfon Yellow Aces starfighter squadron. When encroaching Imperial patrols forced the rebels to scuttle the base on Tierfon, and the Yellow Aces disbanded. Dinnes, along with Jek Tono Porkins and two other pilots were transferred to the Rebel base on Yavin 4, where Dinnes and Porkins were assigned to Commander Garven Dreis' Red Squadron, where Dinnes obtained the callsign Red Eight.\nDuring Operation Fracture, Admiral Raddus sent a readiness report to Mon Mothma, which stated the Alliance starfighter squadrons were prepared to support Captain Cassian Andor's mission. While he stated the most likely scenario was for an extraction team featuring UT-60D U-wing starfighter/support craft from Blue Squadron, he also confirmed that Red Squadron's twelve X-wings and pilots were flight ready, along with Green Squadron. In case reinforcements were needed, allied rebel movements, including Dinnes' previous unit, the Tierfon Yellow Aces, were on alert and stood ready to supply starfighters and pilots from those squadrons.\nIn 0 BBY, the Rebel Alliance sent reinforcements to support Rogue One at the Battle of Scarif, after they had launched on a mission, defiant against the decision of the Alliance Council, to steal plans to the Empire's new secret superweapon, the Death Star. Zal Dinnes and the rest of Red Squadron, under the command of Garven Dreis, were tasked with defending the fleet over Scarif. The squadron's X-wings engaged TIE/ln space superiority starfighters above the planet and attacked the Shield Gate.\nThe fleet managed to destroy the two Imperial I-class Star Destroyers protecting it, which led to the destruction of the Shield Gate and the collapse of the planetary shield. This allowed the stolen plans to be transmitted to the fleet's flagship, the Profundity, just as the Death Star arrived in the system and destroyed the Citadel Tower and those still on the surface. Darth Vader had arrived too, aboard the Star Destroyer, Devastator, preventing some of the Alliance forces from escaping, but was unsuccessful in stopping the plans to get away aboard the CR90 corvette Tantive IV with Princess Leia Organa. Dinnes and few other pilots managed to escape, and showed pride on their faces after the battle.\nShortly after, the Empire's Death Star arrived in the Yavin system to destroy the rebel base. Dinnes was in the ready room with the rest of Red Squadron, when its commander, Dreis, ran through the duty roster for the Battle of Yavin, in which he assigned the pilots to their flights and callsigns. Dinnes was assigned as leader of Third flight for the assault, with Red Nine Nozzo Naytaan and Red Six Jek Porkins as her wingmates.\nThirty Alliance starfighters from Red, Green and Gold Squadrons were launched in the assault on the battle station on the far side of Yavin Prime, however Dinnes was killed in her T-65B X-wing starfighter along with the rest of her flight. Following the successful destruction of the Death Star, Luke Skywalker and Wedge Antilles were the only suvivors from Red Squadron, as well as one other pilot from Gold Squadron.\nIn 1 ABY, Skywalker and fellow rebel pilots Antilles, Zev Senesca, Derek Klivian, Han Solo, and Chewbacca, raised a toast at Mess Hall IV in the Mako-Ta Space Docks to honor the deceased members of Red Squadron, including Dinnes.\nZal Dinnes was a human female with blonde hair, hazel eyes and light skin. She was a committed enemy of the Empire and all that it represented.\nBefore transferring to Yavin, Zal Dinnes was considered to be an ace pilot. She had \"V\"s inside the yellow dots that ran along her helmet that indicated enemy fighter kills. Each mark equaled 20 enemy fighters that she killed in battle.\nAs a Rebel Alliance X-wing starfighter pilot, Zal Dinnes wore an orange flight suit, with a white flak vest, a flight harness, a Diagnostech life support unit and dark gray gloves. Her K-22995 light flight helmet was red and white, with a yellow starbird, the unit insignia of the Tierfon Yellow Aces.\nZal Dinnes was portrayed by Zarene Dallas in Rogue One: A Star Wars Story, but her role was not listed in the end credits. The character was revealed on October 15, 2016 by Entertainment Weekly in an exclusive trading card from Star Wars: Card Trader.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Star_Wars:_Rogue_One:_Secret_Mission",
  "/wiki/Duty_Roster",
  "/wiki/Tierfon",
  "/wiki/0_BBY",
  "/wiki/Yavin_system",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Tierfon_Yellow_Aces",
  "/wiki/Red_Squadron_(Rebel_Alliance)",
  "/wiki/Rebel_pilot",
  "/wiki/T-65B_X-wing_starfighter",
  "/wiki/Callsign",
  "/wiki/Red_Eight",
  "/wiki/Battle_of_Scarif",
  "/wiki/Battle_of_Yavin",
  "/wiki/Galactic_Civil_War",
  "/wiki/Lieutenant",
  "/wiki/Tierfon_Launch_Base",
  "/wiki/Starfighter",
  "/wiki/Squadron",
  "/wiki/Galactic_Empire",
  "/wiki/Jek_Tono_Porkins",
  "/wiki/Great_Temple",
  "/wiki/Yavin_4",
  "/wiki/Commander",
  "/wiki/Garven_Dreis",
  "/wiki/Operation_Fracture",
  "/wiki/Admiral",
  "/wiki/Raddus",
  "/wiki/Mon_Mothma",
  "/wiki/Captain",
  "/wiki/Cassian_Jeron_Andor",
  "/wiki/UT-60D_U-wing_starfighter/support_craft",
  "/wiki/Blue_Squadron_(Rebel_Alliance)",
  "/wiki/X-wing_starfighter",
  "/wiki/Pilot",
  "/wiki/Green_Squadron_(Rebel_Alliance)",
  "/wiki/File:Raddus-RedAndGold-RO.ogg",
  "/wiki/Rebel_Alliance_Navy",
  "/wiki/Rogue_One",
  "/wiki/Alliance_High_Command",
  "/wiki/DS-1_Death_Star_Mobile_Battle_Station",
  "/wiki/Scarif",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Planet",
  "/wiki/Shield_Gate",
  "/wiki/Imperial_I-class_Star_Destroyer",
  "/wiki/Profundity",
  "/wiki/Citadel_Tower",
  "/wiki/Star_Destroyer",
  "/wiki/Devastator",
  "/wiki/CR90_corvette",
  "/wiki/Tantive_IV",
  "/wiki/Prince",
  "/wiki/Leia_Organa_Solo",
  "/wiki/Third_flight",
  "/wiki/Red_Nine",
  "/wiki/Nozzo_Naytaan",
  "/wiki/Red_Six",
  "/wiki/Wingmate",
  "/wiki/Gold_Squadron_(Rebel_Alliance)",
  "/wiki/Yavin_Prime",
  "/wiki/Death",
  "/wiki/Luke_Skywalker",
  "/wiki/Wedge_Antilles",
  "/wiki/Evaan_Verlaine",
  "/wiki/1_ABY",
  "/wiki/Zev_Senesca",
  "/wiki/Derek_Klivian",
  "/wiki/Han_Solo",
  "/wiki/Chewbacca",
  "/wiki/Mess_Hall_IV",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Flight_helmet",
  "/wiki/Flight_suit",
  "/wiki/Flak_vest",
  "/wiki/Flight_harness",
  "/wiki/Diagnostech_life_support_unit",
  "/wiki/Glove",
  "/wiki/K-22995_light_flight_helmet",
  "/wiki/Rebel_Alliance_starbird",
  "/wiki/Zarene_Dallas",
  "/wiki/Rogue_One:_A_Star_Wars_Story",
  "/wiki/October_15",
  "/wiki/2016",
  "/wiki/Entertainment_Weekly",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Category:Images_of_Zal_Dinnes",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/Retcon",
  "/wiki/From_a_Certain_Point_of_View",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Rogue_One:_The_Ultimate_Visual_Guide",
  "/wiki/Star_Wars:_Rogue_One:_Ultimate_Sticker_Encyclopedia",
  "/wiki/Star_Wars:_Rogue_One:_Rebel_Dossier",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_79",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Sparks_(short_story)",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Standard_year",
  "/wiki/Star_Wars_(2015)_43",
  "/wiki/Proclamation_of_the_New_Order",
  "/wiki/19_BBY",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/July_26",
  "/wiki/2018"
 ]
}