{
 "name": "Zalar_Rishek",
 "display_name": "Zalar Rishek",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Blond"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Gray"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "House of Rishek"
     ]
    }
   ]
  }
 ],
 "content": "Zalar Rishek was a male Human of the House of Rishek family who lived during the years following the end of the Clone Wars. Around 17 BBY, Rishek attended the maiden journey of a luxury hovertrain on the planet Alderaan. During the excursion, Rishek played a game of sabacc and had an altercation with the Wookiee musician Khyyynett.\nZalar Rishek was a male Human of the House of Rishek family who lived during the years following the end of the Clone Wars. Around 17 BBY, when Rishek was still a young man, he was among just over one hundred members of the galactic elite invited to the planet Alderaan for the maiden voyage of the luxury hovertrain Gem of Alderaan. Rishek attended a lavish launch gala held at a hoverstation in the city Aldera and traveled on the train as it departed on a six hour journey.\nDuring the excursion, Rishek visited the train's casino car and played the card game sabacc with several other guests including the Sullustan executive Dien Suub and the actress Ardia Terrsyn, bringing 4,000 to bankroll his gambling. Accompanied by an entourage of hangers-on, Rishek also ventured to the hovertrain's Decadence nightclub, where he had an altercation with the Wookiee musician Khyyynett while his entourage watched on. However, a group of undercover Alderaanian Resistance agents broke up the scuffle and separated the pair.\nRishek had blond hair and blue eyes. He was spoiled, conceited and overbearing and he liked to spend his time either chasing potential romantic prospects or racing fast vehicles including customized airspeeders, swoops and yachts.\nZalar Rishek appeared in the Star Wars Legends roleplaying adventure The Gem of Alderaan by Gary M. Sarli, which was published on Wizards.com on February 5 2009 as the eight instalment of Wizards of the Coast's Dawn of Defiance roleplaying campaign. In the adventure, the players roleplay as Alderaanian Resistance agents that infiltrate the Gem of Alderaan and seek the favor of Rishek and the other major guests so as to gain the attention of the train's patron Lady Alya Aldrete. It is possible for the players to join Rishek and other guests in a game of a sabacc, and Rishek's esteem for the operatives increases if they succeed at defeating him or the other participants. When Rishek engages in a heated quarrel with the Wookiee Khyyynett, it is possible for player characters to separate the pair in which case they improve Rishek's opinion of them; if the players are unsuccessful at breaking up the fracas or do not intervene then the quarrel escalates into a brawl.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/House_of_Rishek",
  "/wiki/Standard_year/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/17_BBY/Legends",
  "/wiki/Gem_of_Alderaan",
  "/wiki/Planet/Legends",
  "/wiki/Alderaan/Legends",
  "/wiki/Gambling/Legends",
  "/wiki/Sabacc/Legends",
  "/wiki/Wookiee/Legends",
  "/wiki/Musician/Legends",
  "/wiki/Khyyynett",
  "/wiki/The_galaxy/Legends",
  "/wiki/Hovertrain/Legends",
  "/wiki/Train_station/Legends",
  "/wiki/City/Legends",
  "/wiki/Aldera/Legends",
  "/wiki/Train/Legends",
  "/wiki/Standard_hour/Legends",
  "/wiki/The_Gem_of_Alderaan",
  "/wiki/Canon",
  "/wiki/Casino/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Dien_Suub",
  "/wiki/Actor/Legends",
  "/wiki/Ardia_Terrsyn",
  "/wiki/Credit",
  "/wiki/Decadence_nightclub",
  "/wiki/Alderaanian_Resistance",
  "/wiki/Hair/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Time/Legends",
  "/wiki/Airspeeder/Legends",
  "/wiki/Swoop/Legends",
  "/wiki/Yacht/Legends",
  "/wiki/Gary_M._Sarli",
  "/wiki/Wizards.com",
  "/wiki/February_5",
  "/wiki/2009",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Dawn_of_Defiance",
  "/wiki/Lord/Legends",
  "/wiki/Alya_Aldrete",
  "/wiki/Echoes_of_the_Jedi",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Vhiin_Thorla",
  "/wiki/Almas_Academy",
  "/wiki/Order_66/Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Dawn_of_Defiance:_Gamemaster_Primer"
 ]
}