{
 "name": "Zam_Wesell",
 "display_name": "Zam Wesell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Zolan"
     ]
    },
    {
     "name": "Died",
     "values": [
      "22 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Clawdite"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.68 meters"
     ]
    },
    {
     "name": "Mass",
     "values": [
      "55 kilograms"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Yellow"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Mabari",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Zam Wesell was a Clawdite female bounty hunter who lived during the last years of the Galactic Republic. As a Clawdite, Wesell possessed the ability to physically alter her appearance—a power which she used to assume the visage of a human female. Prior to the beginning of the Clone Wars, the bounty hunter Jango Fett enlisted Wesell's aid to assassinate Senator Padmé Amidala of Naboo in 22 BBY. Her efforts ultimately failed, however, resulting in Wesell's death at the hands of Fett before she could identify him as the would-be assassin to Amidala's Jedi bodyguards.\nA Clawdite female, Wesell was born on the planet Zolan. She was trained by the Mabari until she desired wealth and journeyed to Denon to employ her skills and training as an assassin. At some point, Wesell worked with bounty hunter Jango Fett, and became both his frequent accomplice and sometime partner.\nBy 22 BBY, Wesell went on a vacation with Aurra Sing aboard the Halcyon disguised as a human female. Their job was to protect Colram Vestig and his son Wilmar from the Hutts. When Sing went to Numidian Prime to hunt Predavorexxs, Wesell disguised herself as one of the Hutts' Weequay guards. She helped Sing take out the guards and save Wilmar. The three of them were able to return to the Halycon.\nIn 22 BBY, Wesell was hired by Fett to assassinate Naboo Senator Padmé Amidala to prevent her from speaking up against the Military Creation Act. Sometime later, Wesell bombed the Senator's cruiser when it reached Coruscant. However, Amidala herself wasn't on the cruiser. Instead, it was her handmaiden, Cordé. After receiving the news, Wesell told Fett that she had bombed the ship, but she used a decoy. Fett then gave her some kouhuns and told her to be careful while holding them as they were very poisonous. Wesell sent a droid to do it for her, but two Jedi had been assigned to protect the senator: Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker. Skywalker quickly killed the kouhuns and Kenobi grabbed the droid. While the droid was speeding through an express way, Wesell shot it with her projectile rifle which caused Kenobi to start falling through Coruscant's atmosphere.\nWesell quickly fled in her speeder but the Jedi were able to pursue her with a commandeered open-top XJ-6 airspeeder. Wesell took her speeder on a nosedive—plunging 2,670 meters toward the lower levels of Corusca Circus. With the Jedi relentlessly pursuing her, Wesell flew through the exhaust flames of the Kerdos Company recycling plant, hoping that the flames would scorch her adversaries in the open-top speeder. Seeing the pair still chasing her and unharmed by the flames, Wesell fired at the couplings of a nearby electrical plant, causing the Jedi's speeder to be inundated by electrical shock. The bounty hunter then steered her craft into a network of tunnels, aiming once again to lose the pursuing Jedi. Skywalker did not chase directly into tunnel, but opted to travel an alternate route. Wesell wove through tunnels, reaching speeds of 400 kilometers per hour. Upon exiting the network at the Cybot Galactica droid research institute, the bounty hunter was surprised when Skywalker suddenly jumped on top of her airspeeder. During a struggle to get Skywalker off her speeder, Wesell briefly shapeshifted into her Clawdite form which caused Skywalker to realize she was a changeling species. The Jedi ignited his lightsaber and sliced at the windscreen, knocking out the guidance systems. Wesell shot the lightsaber out of Skywalker's hand, but the ensuing struggle caused Wesell to misfire her blaster pistol, damaging the control pipes.\nAfter crashing her speeder into Vos Gesal Street in the Uscru Entertainment District, Wesell was able to flee into the Outlander Club. Skywalker was about to dash in but Kenobi reminded his Padawan that Wesell had gone in to hide, not to run. Once inside the club, Skywalker told Kenobi he knew that Wesell was a changeling and that she was a female. Kenobi said they should be extra careful in searching for her. As the pair went their separate ways with Skywalker looking for Wesell and Kenobi getting a drink, Wesell approached Kenobi from behind and attempted to shoot him, but Kenobi sensed her and chopped her arm off with his lightsaber. Wesell screamed in pain and fell to the ground. Kenobi and Skywalker carried Wesell outside and asked her if she knew who she was trying to kill. Wesell answered that she knew it was a Senator from Naboo. Then she was asked who hired her but, Wesell answered that it was merely a job as she was reluctant to reveal her employer's name. Skywalker then pressured her to tell them and Wesell was about to say who it was when Fett, who had been watching the whole interrogation, shot her in the neck with a Kamino saberdart. Wesell then said her final words, cursing at Fett in Huttese and died shortly after.\nWesell preferred to strike her targets from afar, utilizing long-range sniper rifles or remote probe droids. Wesell used her changeling powers to take on the form of a human female and kept this form while hiding from the Jedi in the Outlander Club. When captured and interrogated by Jedi Knight Obi-Wan Kenobi and his Padawan Anakin Skywalker, Wesell refused to give the names of her employers, but upon being pressured by Skywalker, Wesell was about to give in to the Jedi's demands, only for her partner Jango Fett to kill her before she could reveal the names of their employers.\nAs a changeling, she was able to assume the appearance of anyone she chose, including her targets. She was capable of taking on any humanoid form. As she died, she reverted from speaking Galactic Basic Standard to Clawdite, before cursing Jango Fett in Huttese.\nZam Wesell first appeared in Attack of the Clones played by Leeanna Walsman.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zam_Wesell",
  "/wiki/Zam_Wesell/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Zolan",
  "/wiki/22_BBY",
  "/wiki/Coruscant",
  "/wiki/Clawdite",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Kilogram",
  "/wiki/Color",
  "/wiki/Mabari",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Bounty_hunter",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Changeling",
  "/wiki/Human",
  "/wiki/First_Battle_of_Geonosis",
  "/wiki/Clone_Wars",
  "/wiki/Bounty",
  "/wiki/Jango_Fett",
  "/wiki/Plot_to_assassinate_Senator_Amidala",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Naboo",
  "/wiki/Death",
  "/wiki/Assassin",
  "/wiki/Jedi",
  "/wiki/Bodyguard",
  "/wiki/Reproduction",
  "/wiki/Planet",
  "/wiki/Denon",
  "/wiki/Aurra_Sing",
  "/wiki/Halcyon",
  "/wiki/Colram_Vestig",
  "/wiki/Wilmar",
  "/wiki/Hutt_Clan",
  "/wiki/Numidian_Prime",
  "/wiki/Predavorexx",
  "/wiki/Weequay",
  "/wiki/Military_Creation_Act",
  "/wiki/J-type_diplomatic_barge",
  "/wiki/Cruiser",
  "/wiki/Naboo_Royal_Handmaidens",
  "/wiki/Cord%C3%A9",
  "/wiki/Kouhun",
  "/wiki/Poison",
  "/wiki/ASN_courier_droid",
  "/wiki/Jedi_Knight",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Padawan",
  "/wiki/Anakin_Skywalker",
  "/wiki/KiSteer_1284_projectile_rifle",
  "/wiki/Atmosphere",
  "/wiki/Koro-2_all-environment_Exodrive_airspeeder",
  "/wiki/XJ-6_airspeeder",
  "/wiki/Corusca_Circus",
  "/wiki/Kerdos_Company_recycling_plant",
  "/wiki/Kilometer_per_hour",
  "/wiki/Cybot_Galactica",
  "/wiki/Anakin_Skywalker%27s_first_lightsaber",
  "/wiki/Lightsaber",
  "/wiki/Vos_Gesal_Street",
  "/wiki/Uscru_Entertainment_District",
  "/wiki/Outlander_Club",
  "/wiki/Dismemberment",
  "/wiki/Limb",
  "/wiki/Obi-Wan_Kenobi%27s_second_lightsaber",
  "/wiki/Kamino_saberdart",
  "/wiki/Huttese",
  "/wiki/Sniper_rifle",
  "/wiki/Probe_droid",
  "/wiki/Humanoid",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Clawdite_(language)",
  "/wiki/Leeanna_Walsman",
  "/wiki/Star_Wars_Insider",
  "/wiki/Galactic_Tales:_The_Wesell_Run",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Star_Wars:_The_Prequel_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Star_Wars_Journeys:_Beginnings",
  "/wiki/Star_Wars:_Galactic_Defense",
  "/wiki/Star_Wars:_Galaxy_of_Heroes",
  "/wiki/Age_of_Republic_-_Jango_Fett_1",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones",
  "/wiki/Attack_of_the_Clones_(Golden_Book)",
  "/wiki/Attack_of_the_Clones_Read-Along_Storybook_and_CD",
  "/wiki/Brotherhood",
  "/wiki/Doctor_Aphra_(2020)_27",
  "/wiki/Halcyon_Legacy_2",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_25",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_10",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_17",
  "/wiki/No_Disintegrations_(Fantasy_Flight_Games)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Helmet_Collection_39",
  "/wiki/Helmets",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Helmet_Collection_41",
  "/wiki/Star_Wars_Helmet_Collection_44",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_11",
  "/wiki/Starfighter_Aces",
  "/wiki/Star_Wars_Helmet_Collection_59",
  "/wiki/Star_Wars_Helmet_Collection_71",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Star_Wars_Search_and_Find_Volume_I",
  "/wiki/Star_Wars_Day-at-a-Time_Calendar_2020",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_The_Galactic_Explorer%27s_Guide",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_45",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Jango_Fett%27s_Slave_I_Expansion_Pack",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Coruscant_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Anakin_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/Ships_of_the_Galaxy:_Naboo_N-1_Starfighter",
  "/wiki/Star_Wars_Inside_Intel:_Coruscant",
  "/wiki/Star_Wars_Inside_Intel:_Bounty_Hunters",
  "/wiki/Star_Wars:_The_Secrets_of_the_Bounty_Hunters",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_The_Force_Awakens:_Head-to-Head"
 ]
}