{
 "name": "Zasha_Ranken",
 "display_name": "Zasha Ranken",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Blue"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith EmpireImperial Forward Command",
      "Imperial Forward Command"
     ]
    }
   ]
  }
 ],
 "content": "Zasha Ranken was a female Human admiral in the Sith Imperial Navy during the Great Galactic War and the Cold War.\nRanken was a promising officer in the final part of the Great War, when Rycus Kilran took her under his wing. She was onboard Kilran's starship during the Sacking of Coruscant, and enjoyed bombarding civilian buildings. During the Cold War, she became the admiral in charge of the Imperial Forward Command. Ranken would earn the respect of Darth Krovos during her service to the Empire.\nRanken became one of the few experienced officers to survive the Eternal Empire's conquest of the galaxy. Ranken desired to join the Outlander's Alliance but had no way to contact them. In her search, she came into contact with Balmorra Senator Tai Cordan and Malita Tal, an exiled Zakuulan and popular holo-dancer. Deciding to search for the Outlander together, the trio formed an alliance. Eventually, they were captured by Emperor Arcann's forces and were en route to Zakuul for interrogation as to the Outlander's whereabouts. However, the Alliance raided their transport ship and set them free.\nIn Star Wars: The Old Republic, Ranken is voiced by actress Anna Graves.\nRanken appears in Chapter XV: The GEMINI Deception of Star Wars: The Old Republic: Knights of the Fallen Empire. At the climax of the chapter, the prison transport is set to self-destruct and Outlander must manually deploy the escape pods one at a time. Predictably, the first two escape pods make it to safety but the third is destroyed. Ranken, Tai Cordan and Malita, save two but the third dies. Lana Beniko's approval will improve if Ranken is one of the survivors; if not, she will disapprove and comment about it later.\nIf Ranken was saved, Darth Krovos will mention that the Admiral and her family send their regards to the player in the post-Jedi Under Siege mission, \"Hearts and Minds\".",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Sourcing",
  "/wiki/Special:EditPage/:Zasha_Ranken",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Imperial_Forward_Command",
  "/wiki/Admiral/Legends",
  "/wiki/Imperial_Navy_(Sith_Empire)",
  "/wiki/Great_Galactic_War",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Rycus_Kilran",
  "/wiki/Starship/Legends",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/Darth_Krovos",
  "/wiki/Eternal_Empire",
  "/wiki/Eternal_Empire_conquest",
  "/wiki/The_galaxy/Legends",
  "/wiki/Alliance_Commander",
  "/wiki/Eternal_Alliance",
  "/wiki/Balmorra/Legends",
  "/wiki/Senator",
  "/wiki/Tai_Cordan",
  "/wiki/Malita_Tal",
  "/wiki/Zakuul",
  "/wiki/Emperor/Legends",
  "/wiki/Arcann",
  "/wiki/GEMINI_trap",
  "/wiki/Anna_Graves",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire",
  "/wiki/Lana_Beniko",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Starfighter",
  "/wiki/Star_Wars:_The_Old_Republic:_Galactic_Strongholds",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}