{
 "name": "Zax",
 "display_name": "Zax",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Taris"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Orange"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green and tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Exchange"
     ]
    }
   ]
  }
 ],
 "content": "Zax was a Hutt criminal who worked in the Lower City of the planet Taris during the Jedi Civil War.\nOfficially, Zax ran the Taris government bounty office, but also had an agreement with Davik Kang that allowed the crime lord to post his \"special contracts.\" He also had some underground business connections with the ancestors of the House of Organa.\nHe had an excellent network of informants that kept track of both bounty hunters and bounties. This worked to his and the hunters' advantages, as he always knew if a job had been carried out, and the hunters didn't have to bring in bodies. However, his spies weren't infallible; an amnesic Revan was able to fool them into thinking Matrik was dead by demolishing his apartment with a permacrete detonator after the Twi'lek had left. Some of his bounties were Dia, Largo, the aforementioned Matrik, Selven and Bendak Starkiller. However, they didn't pay all that well, so Zax's office usually just attracted credit-a-dozen bounty hunters instead of skilled professionals like Calo Nord.\nThe bounties Zax offers the player in Knights of the Old Republic are all worth 300 credits. A player with a high Persuasion can convince Zax to pay 400 credits instead, and Zax will admire the player for having the courage to bargain with a Hutt.\nIt is unknown whether Zax survived the bombing of Taris by the Sith fleet. He lives in the Lower City, so his chances would be better than those of Ajuur, the Hutt living in the upper city who runs the dueling ring, but as intense and devastating as the bombing was, and as slow as Hutts move, Zax may not have survived.\nTwo of Zax's posted contracts are from the Taris government: Bendak Starkiller and Selven. The rest are illegally posted at the behest of Davik Kang or one of his associates.\nHis voice was provided by Neil Kaplan in the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Taris/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Exchange",
  "/wiki/Planet/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/Bounty/Legends",
  "/wiki/Davik_Kang",
  "/wiki/Crime_lord/Legends",
  "/wiki/House_of_Organa/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Spy/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Matrik",
  "/wiki/Permacrete_detonator",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Dia",
  "/wiki/Largo",
  "/wiki/Selven",
  "/wiki/Gorse_Bendak",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Calo_Nord",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Ajuur",
  "/wiki/Neil_Kaplan",
  "/wiki/The_Adjudicator_Special_Report:_Tools_of_the_Trade",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}