{
 "name": "Zayl_Braith",
 "display_name": "Zayl Braith",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Asamin system"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Granse Confederacy"
     ]
    }
   ]
  }
 ],
 "content": "Zayl Braith was a smuggler, a bounty hunter, and a member of the Granse Confederacy.\nBraith was born in the Asamin system, child of a prosperous family who traded through the Essien Run, particularly with the Asamin system. Braith was Callandri's older cousin, and was physically similar to her.\nBraith made friends with different smugglers, and she began working with one of them, Captain Thi Sawrtin, in many smuggling runs.\nDuring a \"routine\" run through the Noonian sector, Sawrtin and Braith found the Imperial Interdictor cruiser the Tory's Catcher. Sawrtin found that Imperial Captain Gresia Vleen was not a friend of bribes, but he nevertheless tried to discuss with her. Vleen shot Sawrtin, impounded his ship and imprisoned Braith for many weeks before transferring her to Rol Two.\nBraith escaped during the transfer, but she became an Imperial fugitive, on the run since.\nTrying to get money working as a smuggler, she contracted with Sullustan gangster Tiron Til. Til was a good manager for Braith, but he eventually decided to deal with some Trandoshan smugglers who wanted to monopolize the spice trade in Asamin. Braith, who still felt loyalty towards her native system, did not want to have anything to do with it, and was expelled from Til's syndicate.\nBraith then met her cousin Callandri, who had became a freelance bounty hunter specialized in Rebel bounties. They began a partnership, and both of them worked together in a plot to kill Rebel lieutenant Alton Lochner. Upon finding him in a cantina on Ord Mantell, they entered the bar guns blazing. Unfortunately for them, Lochner had company, Adazian Liebke and a Wookiee named Tirranna. Tirranna and Lochner were nevertheless injured; Liebke noticed that Tirranna would not mind tasting the blood of either Callandri or Braith should they find her again.\nSoon afterward, Callandri founded the Granse Confederacy with some other bounty hunters and Braith. The Granse Confederacy became a threat to the Rebel Alliance, coming to the attention of Crix Madine.\nRebel Lieutenant Commander Zhir-Khan wrote an article on the threat posed by Braith. He also saw Braith during a mission on Ord Mantell; fortunately for him, she was alone. Zhir-Khan, wondering why would she have come back after her first attack, assigned Shofeld to watch her until she left the planet.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Asamin_system",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Granse_Confederacy",
  "/wiki/Callandri",
  "/wiki/Alton_Lochner",
  "/wiki/General/Legends",
  "/wiki/Crix_Madine/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Essien_Run",
  "/wiki/Thi_Sawrtin",
  "/wiki/Noonian_sector/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Immobilizer_418_cruiser/Legends",
  "/wiki/Tory%27s_Catcher",
  "/wiki/Gresia_Vleen",
  "/wiki/Rol_Two",
  "/wiki/Sullustan/Legends",
  "/wiki/Tiron_Til",
  "/wiki/Trandoshan/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Cantina/Legends",
  "/wiki/Ord_Mantell/Legends",
  "/wiki/Adazian_Liebke",
  "/wiki/Wookiee/Legends",
  "/wiki/Tirranna",
  "/wiki/Zhir-Khan",
  "/wiki/Shofeld",
  "/wiki/Planet/Legends",
  "/wiki/Alliance_Intelligence_Reports"
 ]
}