{
 "name": "Zeami",
 "display_name": "Zeami",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Near-Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Zeami was a female Near-Human Padawan who served the Jedi Order and the Galactic Republic as a Commander in the Grand Army of the Republic during the Clone Wars.\nA Force-sensitive Near-Human, Zeami was educated in the ways of the Force by the Jedi Order at the Coruscant Jedi Temple. A member of a Initiate clan under the instruction of Grand Master Yoda, Zeami befriended fellow Jedi Initiate Iguni at a young age. Selected as a Padawan by a Jedi Master, Zeami constructed a lightsaber which she would wield in battle.\nWhen the Clone Wars erupted between the Galactic Republic and the Confederacy of Independent Systems, Zeami took up the rank of Commander in the Grand Army of the Republic. During the final year of the war, Zeami was stationed on Coruscant when General Grievous launched a surprise attack on the capital world. Alongside Padawans Iguni and Zoi, Zeami rushed out to join in the fray despite orders to remain at the Temple after being convinced by Iguni it was the right thing to do. Together with her peers, Zeami helped take out several B2 super battle droids, Octuptarra combat tri-droids and at least one DSD1 dwarf spider droid before both she and Zoi were injured. Upon seeing his friend injured, Iguni took hold of her limp body and created a whirlwind in the Force which surrounded the two of them and damaged everything nearby, including Zoi.\nIt was at this point that Iguni's master, Mace Windu, arrived and ordered Iguni to return to the Temple and take his friends with him, as he was causing more harm than good. Zeami was then taken to the Halls of Healing, where she was treated for her wounds. Iguni soon visited her to apologize for his actions and, though she forgave him, he vowed to grow stronger in the Force so that he could protect his friends. Zeami went back to her training along with her friends, where both she and Zoi would often check up on Iguni as he practiced his lightsaber techniques with Master Windu. It was soon after this that Iguni had a vision of Anakin Skywalker killing many Jedi and turning to the dark side.\nZeami only appears in the story Evil Eyes, published in Star Wars Manga: Black issue of Tokyopop's Star Wars Manga. Originally published in Japan, those stories were considered to be of \"fuzzy\" continuity by Lucasfilm. Since then, they have been republished in English in the United Kingdom under Infinities label, which established the material in them as non-canonical.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Canon",
  "/wiki/Infinities",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Near-Human",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Jedi_Commander/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Initiate_Clan/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Yoda/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Iguni",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Supreme_Commander_of_the_Droid_Armies",
  "/wiki/Grievous/Legends",
  "/wiki/Battle_of_Coruscant/Legends",
  "/wiki/Zoi",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/Octuptarra_combat_tri-droid",
  "/wiki/DSD1_dwarf_spider_droid/Legends",
  "/wiki/Telekinesis/Legends",
  "/wiki/Mace_Windu/Legends",
  "/wiki/Halls_of_Healing",
  "/wiki/Force_vision/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Evil_Eyes",
  "/wiki/Star_Wars_Manga:_Black",
  "/wiki/Tokyopop%27s_Star_Wars_Manga",
  "/wiki/StarWars.com",
  "/wiki/StarWars.com_Message_Boards",
  "/wiki/Leland_Chee",
  "/wiki/November_6",
  "/wiki/2006"
 ]
}