{
 "name": "Zee_K%27lin",
 "display_name": "Zee K'lin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3643 BBY",
      "Nar Shaddaa"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bith"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Eidolon Security",
      "Nebula Communications"
     ]
    }
   ]
  }
 ],
 "content": "Zee K'lin was a Bith male HoloNet security expert during the Cold War. His services, including securing information for corporations, were in high demand. Among his clients were Eidolon Security and Nebula Communications.\nHis services to Eidolon Security made him a person of interest for the future Grand Champion of the Great Hunt, who was hunting the company's founder as a part of the Great Hunt.\nThe hunter had already bombed the company's manufacturing center, but sought to do more damage to the Eidolon's company, and thus draw him out of hiding. The second attack against Eidolon Security would be a leak of its private information, containing a list of clients and their security specs, and records of shipments to these clients. To acquire and leak this information, the hunter needed the security codes to bypass the data encryption that Zee had put on Eidolon Security's database.\nAfter the hunter acquired these from Zee at the Nebula Communications headquarters, they killed him.\nThe player has the option of sparing Zee instead of killing him. If the player chooses this option, Zee will alert Eidolon Security's guards and they will attack the player after Mako slices into the company's database.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3643_BBY",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Bith/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Eidolon_Security",
  "/wiki/Nebula_Communications",
  "/wiki/HoloNet/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Hunter_(individual)",
  "/wiki/Eidolon_(assassin)",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Mako_(slicer)",
  "/wiki/Slicer/Legends",
  "/wiki/Star_Wars:_The_Old_Republic"
 ]
}