{
 "name": "Zeen_Mrala",
 "display_name": "Zeen Mrala",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Trymant IV"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mikkian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Magenta"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Elders of the Path",
      "Mrala clan",
      "Mrala clan",
      "Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "Zeen Mrala was a Force-sensitive Mikkian female who lived during the High Republic Era. Raised in a commune of the Elders of the Path, she was the best friend of Krix Kamerat and the owner of a pet cru named Cham Cham. Mrala was terrified of her strength with the Force and sought to keep her abilities suppressed due to the Elders' beliefs that the Force should not be touched by any living thing. Living on Trymant IV in the aftermath of the Great Hyperspace Disaster, an Emergence that threatened the Trymant system led to an encounter with Jedi. This caused Mrala to reveal her Force powers to deflect a large piece of falling debris alongside Padawan Lula Talisola, which led to a rift with Krix, who accused her of lying to him. Mrala was separated from Kamerat during the ensuing battle, and subsequently accompanied the Jedi to Starlight Beacon.\nZeen Mrala, a Force-sensitive Mikkian female, was born to parents who were members of a religion called the Elders of the Path. The group valued relationships between elders and acolytes far more than they did ones between parents and children, and Mrala's parents disappeared into a different commune when she was very young. For the first ten years of her life, Mrala's commune kept on the move from planet to planet, causing her to wonder if the group was on the run for some reason. During this time, the only constants in her life were her best friend, a human named Krix Kamerat, and her pet cru, Cham Cham.\nWhen Mrala was ten years old, her commune settled on the planet Trymant IV, in Bralanak City. Her time on Trymant became the longest she had ever stayed in one place, and she came to see it as her home. She hoped that the stability would cause her powerful Force abilities to fade, since she felt safe: the Elders preached that the Force was too dangerous to be sensed, let alone used, by any living being, and so Mrala had suppressed her powers and concealed their existence from everyone, including Kamerat.\nMrala had lived on Trymant IV for several years when the Great Hyperspace Disaster, a calamity in which the freighter Legacy Run broke up in hyperspace near the Hetzal system with galaxy-wide repercussions, occurred. The disaster's aftermath included multiple Emergences where time-delayed debris shot out of hyperspace seemingly at random. One such Emergence threatened the Trymant system, and the Jedi cruiser Star Hopper, being the only Jedi or Galactic Republic starship in range, was dispatched to assist. In the chaos, Mrala and Kamerat attempted to make their way to the Elders' meeting house, only for a large spider-shaped ship to descend in a cloud of smoke.\nThe Force gave Mrala a foreboding feeling when she saw the ship, but Kamerat, insisting he would protect her, dragged Mrala towards the ship, which belonged to the Nihil. The children saw Elder Tromak surrounded by the pirates, who appeared to be escorting him onboard. Two of the Nihil stopped Kamerat and Mrala, ordering them to leave, with one of them flippantly telling them to \"have fun\" with the impending chaos. Mrala and Kamerat attempted to persuade the pirates to allow onboard the civilians of the city who were attempting to evacuate from the falling debris, but the Nihil refused. The pirates nearly killed the two, but Tromak spoke up for them as acolytes of his group, although the pirates had only been ordered to collect him.\nA party of Jedi Padawans led by Lula Talisola arrived and also insisted on the use of the pirates' cruiser for evacuation purposes, leading to a firefight between them and the Nihil. Taking cover with Kamerat, Mrala realized that the newcomers were Jedi and that given they were said to use their Force powers for good, maybe she could as well. Mrala was moved to act when she sensed an enormous piece of debris heading straight for the city, leaping out of cover and attempting to hold it off with telekinesis by herself. Talisola and her friends quickly assisted her, ending the threat the large piece posed. Kamerat, shocked, angrily accused Mrala of lying to him as Tromak pulled him back, while Mrala attempted to explain that she had never used her power before. As the fighting looked to start up again, the pirates surrounded the Padawans. A masked figure descended from the Nihil ship and ordered the Nihil to execute the Jedi.\nAs the Padawans prepared to fight, Mrala looked for Kamerat, whom she had lost track of in the chaos. Jedi Masters Yoda and Torban Buck arrived to help fight off the pirates, and Mrala joined the Jedi as they leaped into battle. Kamerat, high above on the Spider Cruiser's entry ramp, became conflicted and wanted to go back for her, but was overruled by Tromak, who insisted that the boy was his assistant, and Marchion Ro, who was willing to leave him behind for caring about his Force-sensitive friend. Mrala eventually saw Kamerat and called his name, before asking the Jedi Masters for help rescuing her friend, who had apparently been captured by the Nihil. Talisola backed her up, stating that the Jedi had an obligation to help her because she had helped them and used the Force to do it, offering to rescue Kamerat himself. Yoda overruled her and said he would do it, ordering Buck to lead the Padawans to safety. After destroying a projectile a pirate had flung in their direction, the Grand Master asked to borrow Cham Cham, and a surprised Mrala agreed, asking him to be careful with her pet.\nMrala joined the Padawans and Buck as they leapt into battle, using Force pushes against the pirates as she had no weapon. Talisola complimented her that she was a natural. When Farzala Tarabal saw Master Buck in trouble, Mrala rallied alongside the Padawans as Talisola led them to help the combat-disliking Jedi healer. Shortly thereafter, a Galactic Republic rescue fleet arrived to assist as the pirates retreated. In the aftermath, as Buck was asked to explain his \"Buckets of Blood\" nickname by Tarabal and Talisola, the Nihil cruiser took off, to Mrala's alarm as Kamerat, Cham Cham and Yoda were still onboard. Buck reassured them that the ship would not pass the Republic blockade, and Yoda, arriving, insisted that the ship had to be stopped.\nMrala was shocked to see the state of her pet, who was sleeping, and Yoda reassured her that the cru was well-fed, having eaten the fingers of several Nihil, and possibly an arm. He told Mrala that she had to come to the Starlight Beacon with the Jedi, and she asked why he had not saved Kamerat. Yoda told her that the Jedi could not save those who did not want to be saved: he had spoken to Kamerat, giving him a holoprojector so he could contact Mrala and showing him Cham Cham to prove that she had sent him, but the boy, who was deeply conflicted, had reiterated that Zeen had lied to him, before sounding the alarm on Yoda's presence. The Spider Cruiser was able to escape the system by firing on a Republic medical frigate as a diversion for its Jedi Vector escort.\nMrala travelled to the Beacon with the Jedi on the Star Hopper. Talisola comforted her while she cried about what had happened, and Mrala told her that Bralanak City was the only one of the places she had lived that had felt like a home, but that perhaps she had never really known what that was since her commune never accepted her for what she really was as a Force-sensitive. In response, Talisola and her friends, Tarabal and Qort, reassured her that they had her back and that she could find a new home. As the Padawan Academic Cruiser prepared to dock with the Beacon, Talisola further assured Mrala that they were arriving at one of the best places in the galaxy.\nDuring her first week onboard the space station, Mrala was incorporated by Talisola and her friends into their group with ease, making new friends among the Padawans and younglings onboard. She eventually received a message from Kamerat via their linked holoprojectors, in which he said he both missed her but was also angry at her for lying to him, and that he blamed her for \"abandoning\" him. She sent a message back to him, but as she was crying in her room, Talisola entered to inform her that the Jedi Masters wanted to speak to her. Masters Yoda, Buck, Avar Kriss, Estala Maru and Kantam Sy arrived just after Talisola did. Sy asked if they were interrupting, and Kriss said that they wanted to talk with Mrala about what her plans were, if she was okay with that.\nMoving to a larger room on the station, the Masters debated Mrala's fate. Maru pointed out that she was too old to begin Jedi training, but Kriss responded that since they did not know the current state of Trymant IV, they might not be able to send her back. Sy suggested that Mrala could remain temporarily, as she had gotten along with many Padawans, including Sy's own apprentice Talisola, a point Yoda agreed with. Talisola politely interrupted and pointed out that they should ask Mrala herself what she wanted to do, as her opinion was most important. Tarabal added that those with the next most important opinion, the friends Mrala had made during her time on the station, should also be consulted.\nTarabal, assisted by Qort, Bibs, and some other apprentices, regaled the room with a recounting of Mrala and Talisola's heroics at Trymant, using various props, including training weapons. Sy pointed out that the apprentices clearly wanted their friend to stay, and Maru agreed that Mrala should stay on a temporary basis, noting that she could be especially useful since she knew people in the Nihil camp. When Maru asked how they were going to find the Nihil, however, Yoda noted he had an answer for that, explaining about the holoprojectors he had given Mrala and Kamerat. Asked if her friend had reached out, Mrala admitted she had been contacted by him, but when she attempted to apologize, Yoda told her she had nothing to be sorry for, stating she might well save the day.\nMaru noted that the Trymant attack was markedly different from their usual movements, and Yoda stated that the Nihil had had something strange onboard their cruiser. He was not sure what it was, but felt it was imperative that it be found. Kriss suggested that the Nihil group had therefore been on a high-level secret mission, leading Tarabal to exclaim that they could sneak-attack them. Yoda stated that the transponders aboard the holoprojectors only had short ranges, but that there was still a way to find them. Kriss noted that there were reports of Nihil activity in the Bright Jewel system, leading Buck to suggest they start searching at Ord Mantell. Sy declared that they needed to find out what Yoda had seen, and Yoda said that the transponder could only give its location by sending a message once they were closer, but that this was a heavy burden to place upon one so young and Mrala should only take it if she was comfortable. When Talisola asked her if she was going to help them stop the Nihil, Mrala said that she did not know.\nZeen Mrala was a female Mikkian with red eyes and pink skin that shaded to purple at the end of her head-tendrils. Unlike some members of her species, she possessed ears in addition to her tendrils. The beliefs of the Elders of the Path that she had been raised with led her to fear the Force powers that were part of her, attempting to permanently suppress them. She concealed her abilities from everyone she knew, including her best friend Krix Kamerat. Mrala cared strongly for Kamerat and wanted to try and protect him. She also cared for her pet, Cham Cham. She was a better judge of character than Kamerat, being wary of the Nihil upon seeing them in Bralanak City.\nAfter meeting the Jedi, Mrala became more comfortable with her powers. She later admitted to Lula Talisola that she had never really felt at home among the Elders of the Path because she knew they would not accept her for what she truly was. For her friend Kamerat, however, the revelation of her Force powers was a deep shock, not only due to the beliefs they had been raised with, but also because the existence of the powers made him realize she had lied to him in the past. After first coming to Starlight, Mrala deeply missed Bralanak City and Kamerat, but also felt more at home there than she had anywhere else, and felt more at ease since she was allowing herself to feel the Force instead of suppressing it.\nWhile not a Jedi Padawan herself, Mrala accepted the help of Padawans and Jedi Masters alike in honing her abilities. As their partnership carried on, Mrala fell in love with Lula Talisola and acted like an older sister to Ram Jomaram. She was also incredibly happy to have found friends who liked her without being concerned about her Force powers, having come to realize she was making herself lesser in the name of appeasing Kamerat and the Elders of the Path. Indeed, Kamerat had once asked her to bury her abilities deep down so they could return to a \"normal\" life. Dubbing him a \"fool\" who had never loved who she truly was, she broke all her ties with Kamerat, who had become a Nihil leader with much innocent blood on his hands, after he was captured. When she nearly blamed herself for his actions, she stopped that train of thought, knowing that Kamerat had made his own choices.\nZeen Mrala, despite her attempts to suppress her abilities, was a powerful Force-sensitive. She received warnings from the Force when she was in danger, such as upon seeing a Nihil starship in Bralanak City. She was able to use telekinesis to slow down a large piece of debris by herself briefly, despite never having actively used her powers before. She was then able to effectively use Force-pushes in battle against the pirates, so much so that Lula Talisola complimented her as a natural. Despite not receiving offical training, she was competent enough with a lightsaber to be trusted by Ram Jomaram to use his lightsaber to fend off Drengir and defend from Nihil blaster fire during the Attack on Valo and to use Jomaram's lightsaber again as well as Kantam Sy's lightsaber to deflect blasterfire during the Battle on Corellia.\nZeen Mrala wore a blue tunic, grey pants and brown boots, and a long beige vest overtop.\nZeen Mrala first appeared in the 2021 comic The High Republic Adventures  1.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zeen_Afit",
  "/wiki/Star_Wars_Legends",
  "/wiki/The_High_Republic_Adventures_(2021)_4",
  "/wiki/The_High_Republic_Adventures_(2021)_5",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower",
  "/wiki/The_High_Republic_Adventures_Free_Comic_Book_Day_2021",
  "/wiki/Star_Wars:_The_High_Republic_Adventures:_Back_Together_and_Away_Again",
  "/wiki/Star_Wars:_The_High_Republic:_The_Edge_of_Balance,_Vol._2",
  "/wiki/The_High_Republic_Adventures:_Galactic_Bake-Off_Spectacular",
  "/wiki/The_High_Republic_Adventures_(2021)_11",
  "/wiki/The_High_Republic:_Midnight_Horizon",
  "/wiki/The_High_Republic_Adventures_(2021)_12",
  "/wiki/The_High_Republic_Adventures_(2021)_13",
  "/wiki/Special:Upload",
  "/wiki/Trymant_IV",
  "/wiki/Mikkian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Elders_of_the_Path",
  "/wiki/Jedi_Order",
  "/wiki/Force-sensitive",
  "/wiki/High_Republic_Era",
  "/wiki/Krix_Kamerat",
  "/wiki/Cru",
  "/wiki/Cham_Cham",
  "/wiki/The_Force",
  "/wiki/Great_Hyperspace_Disaster",
  "/wiki/Emergences",
  "/wiki/Trymant_IV_disaster",
  "/wiki/Trymant_system",
  "/wiki/Jedi",
  "/wiki/Force_power",
  "/wiki/Telekinesis",
  "/wiki/Padawan",
  "/wiki/Lula_Talisola",
  "/wiki/Attack_on_Trymant_IV",
  "/wiki/Starlight_Beacon",
  "/wiki/Reproduction",
  "/wiki/Parent",
  "/wiki/Standard_year",
  "/wiki/Planet",
  "/wiki/Time",
  "/wiki/Human",
  "/wiki/Bralanak_City",
  "/wiki/Freighter",
  "/wiki/Legacy_Run",
  "/wiki/Hyperspace",
  "/wiki/Hetzal_system",
  "/wiki/The_galaxy",
  "/wiki/Cruiser",
  "/wiki/Star_Hopper",
  "/wiki/Galactic_Republic",
  "/wiki/Starship",
  "/wiki/Meeting_house",
  "/wiki/Spider_Cruiser",
  "/wiki/Nihil",
  "/wiki/Tromak",
  "/wiki/Pirate",
  "/wiki/Unidentified_Nihil_member",
  "/wiki/Death",
  "/wiki/Marchion_Ro",
  "/wiki/Jedi_Master",
  "/wiki/Yoda",
  "/wiki/Torban_Buck",
  "/wiki/Entry_ramp",
  "/wiki/Grand_Master",
  "/wiki/Force_push",
  "/wiki/Farzala_Tarabal",
  "/wiki/Jedi_healer",
  "/wiki/Republic_rescue_fleet",
  "/wiki/Blockade",
  "/wiki/Limb",
  "/wiki/Holoprojector",
  "/wiki/Republic_medical_frigate",
  "/wiki/Jedi_Vector",
  "/wiki/Qort",
  "/wiki/Padawan_Academic_Cruiser",
  "/wiki/Standard_week",
  "/wiki/Space_station",
  "/wiki/Jedi_Initiate",
  "/wiki/Avar_Kriss",
  "/wiki/Estala_Maru",
  "/wiki/Kantam_Sy",
  "/wiki/Jedi_training",
  "/wiki/Bibs",
  "/wiki/Nameless_control_rods",
  "/wiki/Transponder_beacon",
  "/wiki/Bright_Jewel_system",
  "/wiki/Ord_Mantell",
  "/wiki/Eye",
  "/wiki/Species",
  "/wiki/Ear",
  "/wiki/Ram_Jomaram",
  "/wiki/Lightsaber",
  "/wiki/Ram_Jomaram%27s_lightsaber",
  "/wiki/Drengir",
  "/wiki/Attack_on_Valo",
  "/wiki/Battle_on_Corellia",
  "/wiki/Boot",
  "/wiki/2021",
  "/wiki/The_High_Republic_Adventures_(2021)_1",
  "/wiki/Category:Images_of_Zeen_Mrala",
  "/wiki/The_High_Republic_Adventures_(2021)_2",
  "/wiki/The_High_Republic_Adventures_(2021)_3",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/The_High_Republic:_Race_to_Crashpoint_Tower_(audiobook)",
  "/wiki/The_High_Republic_Adventures_(2021)_8",
  "/wiki/The_High_Republic_Adventures_(2021)_9",
  "/wiki/The_High_Republic_Adventures_(2021)_10",
  "/wiki/The_High_Republic:_Trail_of_Shadows_3",
  "/wiki/Han_Solo_%26_Chewbacca_4",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_201",
  "/wiki/Star_Wars",
  "/wiki/StarWarsKids.com",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Accessories_and_Structures",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/The_High_Republic:_Light_of_the_Jedi",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/The_Unknown"
 ]
}