{
 "name": "Zeen_Afit",
 "display_name": "Zeen Afit",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Nar Shaddaa"
     ]
    },
    {
     "name": "Died",
     "values": [
      "17 ABY on Skip 6"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "Zeen Afit was a craggy-faced male Human smuggler who first introduced Han Solo to Smuggler's Run. He owned a freighter named Corona.\nZeen, like many other smugglers, aided the fledgling Alliance to Restore the Republic in their fight on Ylesia. Unlike Han and many others, he, along with Katya M'Buele were not cheated by the Rebels.\nHan later met up with Zeen on Skip One in the Run while investigating Kueller's Senate Hall bombings in 17 ABY. He joined Han and Chewbacca in their attempt to rescue Lando Calrissian from the crime lord Nandreeson, along with Kid DXo'ln, Wynni and Ana Blue. Unknown to Han, Afit's true loyalty lay with Nandreeson. Once the rescue party reached the pool in Nandreeson's chamber, Afit turned on Han along with Kid and Wynni. At a command from Nandreeson, Afit joined Kid, Wynni and Nandreeson's guards in attempting to kill Solo, Calrissian and Chewbacca . Solo dived underwater to avoid the blaster fire and the fiery breath of the Glottalphib guards and pulled Afit down with him. Afit was caught unawares and had no opportunity to draw in a lungful of air before going under. After a desperate struggle with Solo he finally succumbed to lack of oxygen. Solo released his grip on Afit and made for the surface to help Lando and Chewbacca. The unconscious Afit sank toward the bottom of the pool, drowning to death moments later.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zeen_Mrala",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/17_ABY/Legends",
  "/wiki/Skip_6",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Han_Solo/Legends",
  "/wiki/Smuggler%27s_Run/Legends",
  "/wiki/Corona_(freighter)",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Battle_of_Ylesia",
  "/wiki/Ylesia/Legends",
  "/wiki/Katya_M%27Buele",
  "/wiki/Kueller",
  "/wiki/Chewbacca/Legends",
  "/wiki/Lando_Calrissian/Legends",
  "/wiki/Nandreeson",
  "/wiki/Kid_DXo%27ln",
  "/wiki/Wynni",
  "/wiki/Ana_Blue",
  "/wiki/Glottalphib",
  "/wiki/The_Hutt_Gambit",
  "/wiki/Rebel_Dawn",
  "/wiki/The_New_Rebellion",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}