{
 "name": "Zeer_(criminal)",
 "display_name": "Zeer  (criminal)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Fair"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Black Sun"
     ]
    }
   ]
  }
 ],
 "content": "Zeer was a Human male who worked for the criminal organization Black Sun during the Cold War between the Galactic Republic and the Sith Empire. In 3643 BBY, Zeer was hired by the Sith Lord Tarnis to stage the kidnapping of his fake identity, Doctor \"Eli Tarnis,\" from the Senate Building. Zeer's men served as distractions in the nearby spaceport while Tarnis fled to the territory of the paramilitary Justicars' Brigade, and the supposed kidnappers battled the Coruscant Security Force to a stalemate. However, when a Jedi Knight arrived at the spaceport, the Jedi Padawan Kira Carsen helped the Knight defeat and capture Zeer and his men.\nA Human male, Zeer began working for the Black Sun criminal syndicate sometime during the Cold War. Part of Black Sun's Coruscant gang, Zeer and his men were hired in 3643 BBY by Doctor Tarnis—in reality a Sith Lord—to stage his own kidnapping from the Senate Building. Using Tarnis's inside information, Zeer's men disabled the security systems in his section of the building and incapacitated the guards. The group extracted Tarnis before anyone noticed, but the alarm was raised not long after they left the building.\nWhen the group reached the Senate Plaza's taxi pad, Tarnis fled to the territory of the paramilitary Justicars' Brigade, while Zeer and his men served as a distraction by attempting to \"escape\" with the doctor at the spaceport. Kira Carsen, the Padawan of Jedi Master Bela Kiwiiks, led a Coruscant Security Force team after the kidnappers, catching up to them in Docking Bay 84. She tried to negotiate with Zeer, but the man shot at her instead of talking. Carsen and her men were locked in a stalemate with the gang members until a Jedi Knight, the former apprentice of Jedi Master Orgus Din, arrived.\nCarsen, who had \"borrowed\" a stealth field generator from Agent Galen's office, sneaked past the Black Sun thugs while the Knight and the astromech droid T7-O1 fought through the criminals. When the droid and the Jedi encountered Zeer, the pair fought and easily defeated the gang member. Zeer refused to tell the two anything, but Carsen, who had finished off the rest of the Black Sun members, pretended to read his mind. Panicking, Zeer told them that the kidnappers had taken the doctor to Black Sun territory. He and his men were promptly arrested and taken into custody by Coruscant Security.\nA fair-skinned Human male with green eyes and black hair, Zeer was a cruel and arrogant man. He had a strong hatred of authority and tended to hold grudges against those who wronged him. However, behind his cruel persona, Zeer had a deep fear of the supernatural, as he became terrified at the thought of a Jedi invading his mind.\nZeer was created for Star Wars: The Old Republic, a massively multiplayer online roleplaying game released by BioWare on December 20, 2011. He appears in the Jedi Knight class mission \"Kidnapped!\", as the final boss in the class phase area. The player can allow Kira Carsen to trick Zeer or interrogate the criminal directly for dark side points.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Black_Sun/Legends",
  "/wiki/Zeer",
  "/wiki/Zeer_(clone_trooper)",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/3643_BBY",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Tarnis_(Sith_Lord)",
  "/wiki/Doctor/Legends",
  "/wiki/Senate_Building",
  "/wiki/Coruscant_Spaceport",
  "/wiki/Justicar_territory",
  "/wiki/Justicars%27_Brigade",
  "/wiki/Coruscant_Security_Force/Legends",
  "/wiki/Hero_of_Tython",
  "/wiki/Spaceport/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Kira_Carsen",
  "/wiki/Senate_Plaza",
  "/wiki/Air_taxi/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Bela_Kiwiiks",
  "/wiki/Docking_Bay_84",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Canon",
  "/wiki/Stealth_field_generator/Legends",
  "/wiki/Agent/Legends",
  "/wiki/Galen_(SIS)",
  "/wiki/T7-series_astromech_droid",
  "/wiki/T7-O1",
  "/wiki/Droid/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Category:Images_of_Zeer",
  "/wiki/Standard_year/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}