{
 "name": "Zeer_(clone_trooper)",
 "display_name": "Zeer  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Torrent Company",
      "Torrent Company"
     ]
    }
   ]
  }
 ],
 "content": "\"Zeer\" was the nickname of a clone trooper who served the Grand Army of the Republic and a member in Torrent Company during the Clone Wars. During the Battle of Teth in 22 BBY, he served as one of Torrent Company's combat engineers and was one of six clones to survive the battle.\n\"Zeer\" was the nickname of a clone trooper combat engineer within Galactic Republic, assigned to the Grand Army of the Republic's Torrent Company of the battle-hardened 501st Legion. In 22 BBY, he was assigned to a strike force tasked to recapture Rotta, the offspring of Jabba Desilijic Tiure from the Confederacy of Independent Systems. Republic Intelligence indicated that the Huttlet was being held in a former B'omarr Monk monastery on the Outer Rim planet Teth.\nGunships deployed the 501st troopers into the target area under heavy fire, landing the men of Torrent Company at the base of the monastery. Located on a massive cliff, the monastery was protected by a variety of Confederacy forces. Determined to complete their mission, Torrent Company—including Zeer—began the ascent up the cliff face, led by Jedi General Anakin Skywalker. They took heavy casualties in the process, including one of their AT-TEs, but they were able to take control of the monastery. Skywalker and his Padawan, Ahsoka Tano, successfully captured the Huttlet, but the Republic force came under attack by numerous battle droids and were subjected to strafing from vulture droids. Torrent Company suffered heavy casualties, along with their remaining AT-TE walker.\nThe remaining clone troopers of Torrent Company prepared a desperate defense against the inevitable Confederacy assault. Skywalker and Tano retreated to evacuate the Huttlet, while Torrent Company deployed explosive ordinance and tripwires to slow the Separatist attack. Shortly after the Jedi retreated, the droid forces overrode the door controls to the monastery and instantly began the assault on the remaining troopers, who numbered just a quarter of the force they deployed with. The clones managed to inflict heavy casualties, but were eradicated with the exception of six troopers, including Zeer.\nThe last six clone troopers—Clone Captain CT-7567 \"Rex\", Clone Sergeant Coric, Attie, Del, Nax, and Zeer—were taken prisoner by the Separatist troops, and were left outside the monastery under guard. When Rex received a transmission from Skywalker, the clones used the distraction to turn on their captors, destroying a number of the droids and taking their weapons. The survivors took cover upon the destroyed AT-TE as more battle droids responded to their escape and moved to intercept the last members of Torrent Company. Zeer put his skills as a combat engineer to use, rigging a super battle droid with explosives, and programming it to return to its fellow droids, allowing Zeer to detonate it. The detonation inflicted heavy casualties, but the Separatist forces relentlessly assaulted the clone's position. As the droids continued to encroach upon the clones' position, a squadron of V-19 Torrent starfighters, led by Jedi General Obi-Wan Kenobi, opened fire on the attacking battle droids, destroying the ones nearest to Torrent Company's position. Shortly after, the 212th Attack Battalion began landing reinforcements, and was able to repel the droid attack, saving Zeer and the last five members of Torrent Company.\nZeer was trained as a combat engineer in the Grand Army, and was capable of setting detailed explosive traps, such as the super battle droid he wired to explode upon reaching its fellow droids.\nAs a male Human clone of bounty hunter Jango Fett, Zeer stood 1.83 meters tall. Zeer maintained his composure even under extreme duress from Confederacy forces, and was notably modest about his mechanical talent. Clone Captain CT-7567 also noted that he seemed to default to a dictionary \"stock phrases\" when under pressure, as if he was too hyped up or scared to think, and instead needed a script.\nZeer first appeared in the 2008 novelization of the Star Wars: The Clone Wars film by Karen Traviss.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zeer",
  "/wiki/Zeer_(criminal)",
  "/wiki/Kamino/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Torrent_Company/Legends",
  "/wiki/Star_Wars:_The_Clone_Wars_(novelization)",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Teth/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Grand_Army_of_the_Republic",
  "/wiki/501st_Legion/Legends",
  "/wiki/Rotta/Legends",
  "/wiki/Jabba_Desilijic_Tiure/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Republic_Intelligence/Legends",
  "/wiki/B%27omarr_Monastery_(Teth)",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Teth/Legends",
  "/wiki/Low_Altitude_Assault_Transport/infantry/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/General/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/All_Terrain_Tactical_Enforcer",
  "/wiki/Padawan/Legends",
  "/wiki/Ahsoka_Tano/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Variable_Geometry_Self-Propelled_Battle_Droid,_Mark_I/Legends",
  "/wiki/Tripwire",
  "/wiki/Droid/Legends",
  "/wiki/Captain/Legends",
  "/wiki/CT-7567/Legends",
  "/wiki/Sergeant/Legends",
  "/wiki/Coric",
  "/wiki/Attie",
  "/wiki/Del_(clone_trooper)",
  "/wiki/Nax",
  "/wiki/B2_super_battle_droid/Legends",
  "/wiki/V-19_Torrent_starfighter/Legends",
  "/wiki/Obi-Wan_Kenobi/Legends",
  "/wiki/212th_Attack_Battalion/Legends",
  "/wiki/Gender",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Jango_Fett/Legends",
  "/wiki/2008",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Karen_Traviss",
  "/wiki/Star_Wars:_The_Clone_Wars_(audiobook)",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Cloning",
  "/wiki/The_Essential_Reader%27s_Companion",
  "/wiki/Star_Wars:_Episode_II_Attack_of_the_Clones_(novelization)",
  "/wiki/Clone_trooper",
  "/wiki/Battle_of_Teth",
  "/wiki/Standard_year/Legends",
  "/wiki/The_Essential_Atlas"
 ]
}