{
 "name": "Zeetar",
 "display_name": "Zeetar",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 230 BBY",
      "Great Hall of the Nihil",
      "No-Space"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Talpini"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Nihil",
      "Lourna Dee's Tempest",
      "Zeetar's Tempest",
      "Lourna Dee's Tempest",
      "Zeetar's Tempest"
     ]
    }
   ]
  }
 ],
 "content": "Zeetar, nicknamed Zeet, was a Talpini male who was one of three Tempest Runners in the Nihil marauder organization, elevated following the death of Kassav Milliko at the Battle of Kur. A skilled engineer, Zeetar was responsible for improving the Nihil's Path engines, the scav droids that the Nihil used in raids, as well as finding the Nihil a new base in an abandoned prison complex on the planet Grizal.\nZeetar was a Talpini who was a member of the Nihil, a group of anarchist marauders. He was a member of Lourna Dee's Tempest but was eventually given his own after the death of Kassav Milliko and his Tempest after the Battle of Kur. Zeetar gained a reputation for being cantankerous, especially to his fellow Tempest Runners. Despite being hard to work with, Zeetar was a skilled engineer and was responsible for improving the Nihil's Path engines, the scav droids that the Nihil used in raids, as well as finding them a new base in an abandoned prison complex on the planet Grizal.\nZeetar met with his fellow Runners, Dee and Pan Eyta, after a disastrous defeat at the hands of the Galactic Republic during the Attack on Cyclor. Zeetar equipped a newly built powersuit and assaulted Eyta, who he now dominated in size and strength, after insulting the Dowutin for his failure. The Eye of the Nihil, Marchion Ro, broke up the fight but humiliated Eyta and gave him his helmet. To the surprise of the Runners, the helmet was designed to electrocute Eyta to death. Eyta destroyed the helmet as Zeetar and Dee watched in fear.\nZeetar was present when Pan Eyta marched out to confront Ro over the Nihil's current status. Zeetar and his Tempest took the side of Eyta. Ro gave a speech about his aspirations for the Nihil and concocted a plot to assassinate Supreme Chancellor Lina Soh. Zeetar and his Tempest quickly took the side of Ro and were some of the first to cheer for her death.\nZeetar and his Tempest aided his fellow Runners in the attack at the Republic Fair on Valo. While Dee and Eyta led the assault on the planet, Zeetar and his Tempest killed anyone who attempted to flee Valo.\nDespite the Nihil being forced to flee, the attack was an all-around success since they believed they had killed the Chancellor. Zeetar congratulated Eyta on his success before he met with Ro. He witnessed Ro try to kill Eyta with poison but he did survive, unbeknownst to the Talpini. The Jedi Order infiltrated the camp and attacked it. Zeetar fought the Jedi Bell Zettifar and Indeera Stokes with Lourna Dee alongside him. Zeetar was accidentally shot by Dee and the roof collapsed on him from an explosion.\nZeetar was mislabeled as a candidate for the leader of the Nihil after the presumed death of Lourna Dee. Two Jedi named Keeve Trennis and Terec were sent to Soola in an effort to infiltrate the Nihil. The former attacked a subordinate of Zeet which impressed him. He believed their cover story of being members of Pan Eyta's Tempest based on her fighting skills but demanded that Trennis prove that she and Terec were Nihil. He handed her his battle hammer and ordered a prisoner be brought to him. The Runner demanded that she execute the summoned prisoner, Myarga the Hutt.\nZeetar was an extremely cantankerous individual who constantly derided his fellow Tempest Runners. He was fearless in the face of spiting Pan Eyta, who was much more intimidating than he was, for the failure of one of his Clouds, Sarn Starbreaker. Zeetar was capable of acts of kindness such as when he congratulated Eyta for his victory during the attack on Valo. He was also an extremely talented engineer which proved to be a boon to his fellow Nihil.\nDespite temporarily turning his back on Marchion Ro, he was extremely loyal to the Eye and was the first of the Tempest Runners to back him when Eyta challenged him over the leadership of the Nihil. Zeetar knew when to back down; he displayed this when Ro severely punished his Dowutin rival.\nZeetar had constructed a colossal powersuit that put him head and shoulders above any Nihil at the camp. This suit was equipped with a protective cage on its broad chest where Zeetar would pilot his beloved armor. The suit would follow the physical movements of its pilot from the cage. The hulking suit was equipped with Loadlifter droid arms outfitted with flame rifles and grenade launchers above the pilot's head. The armor also possessed laser cannons along the forearms capable of emmiting blue lasers powerful enough to penetrate a Lepi's head. Zeetar also wielded a large battle hammer while piloting his suit.\nZeetar first appeared in the 2021 novel The High Republic: The Rising Storm, written by Cavan Scott, and was first pictured in the ninth issue of the comic series Star Wars: The High Republic, which was written by Scott, illustrated by Ario Anindito, and published by Marvel Comics on September 1 of the same year.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/230_BBY",
  "/wiki/Great_Hall_of_the_Nihil",
  "/wiki/No-Space",
  "/wiki/Talpini",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Nihil",
  "/wiki/Lourna_Dee%27s_Tempest",
  "/wiki/Zeetar%27s_Tempest",
  "/wiki/Pan_Eyta",
  "/wiki/Tempest_Runner",
  "/wiki/Pirate",
  "/wiki/Death",
  "/wiki/Kassav_Milliko",
  "/wiki/Battle_of_Kur",
  "/wiki/Engineer",
  "/wiki/Path_engine",
  "/wiki/Scav_droid",
  "/wiki/Prison",
  "/wiki/Planet",
  "/wiki/Grizal",
  "/wiki/Lourna_Dee",
  "/wiki/Kassav%27s_Tempest",
  "/wiki/Galactic_Republic",
  "/wiki/Attack_on_Cyclor",
  "/wiki/Power_armor",
  "/wiki/Dowutin",
  "/wiki/Eye_of_the_Nihil",
  "/wiki/Marchion_Ro",
  "/wiki/Helmet",
  "/wiki/Tempest",
  "/wiki/Supreme_Chancellor",
  "/wiki/Lina_Soh",
  "/wiki/Attack_on_Valo",
  "/wiki/Republic_Fair",
  "/wiki/Valo",
  "/wiki/Jedi",
  "/wiki/Jedi_Order",
  "/wiki/Bell_Zettifar",
  "/wiki/Indeera_Stokes",
  "/wiki/Keeve_Trennis",
  "/wiki/Terec",
  "/wiki/Unidentified_Crolute_Nihil",
  "/wiki/Hammer_(tool)",
  "/wiki/Myarga",
  "/wiki/Hutt",
  "/wiki/Cloud_(rank)",
  "/wiki/Sarn_Starbreaker",
  "/wiki/Pilot",
  "/wiki/Loadlifter_droid",
  "/wiki/Fire",
  "/wiki/Rifle",
  "/wiki/Grenade_launcher",
  "/wiki/Laser_cannon",
  "/wiki/Laser",
  "/wiki/Lepi",
  "/wiki/2021",
  "/wiki/The_High_Republic:_The_Rising_Storm",
  "/wiki/Cavan_Scott",
  "/wiki/The_High_Republic_(2021)_9",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_The_High_Republic_(Marvel_Comics_2021)",
  "/wiki/Ario_Anindito",
  "/wiki/Marvel_Comics",
  "/wiki/September_1",
  "/wiki/The_High_Republic:_The_Rising_Storm_(audiobook)",
  "/wiki/The_High_Republic:_Tempest_Runner",
  "/wiki/The_High_Republic_(2021)_10",
  "/wiki/The_High_Republic_(2021)_11",
  "/wiki/The_High_Republic_(2021)_13",
  "/wiki/The_High_Republic:_The_Fallen_Star",
  "/wiki/The_High_Republic:_The_Fallen_Star_(audiobook)",
  "/wiki/Halcyon_Legacy_1",
  "/wiki/Star_Wars",
  "/wiki/The_Art_of_Star_Wars:_The_High_Republic_(Phase_One)",
  "/wiki/Destruction_of_Starlight_Beacon",
  "/wiki/StarWars.com",
  "/wiki/232_BBY",
  "/wiki/231_BBY",
  "/wiki/Kara_Xoo"
 ]
}