{
 "name": "Zegmon_Pent",
 "display_name": "Zegmon Pent",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Flail"
     ]
    }
   ]
  }
 ],
 "content": "Zegmon Pent was a male Corellian Human terrorist, smuggler, terrorist leader and false Jedi claimant.\nZegmon Pent began his career as a smuggler with political convictions. At some point, he joined the terrorist organization known as The Flail. The Flail believed that the Galactic Senate was corrupt, and they attacked public services in Coruscant, destroying properties and caring little for lives. Many members of The Flail, including Pent, were fanatically loyal to the cause and ready to sacrifice their own lives to fulfill a goal.\nAt some point in 34 BBY or 33 BBY, Zegmon Pent stole an imitation lightsaber that a technician had experimentally built. The edge would shut down automatically if in contact with an energy weapon or blast, but Pent intended to use it only for intimidation purposes. Pent falsely maintained that he had been trained as a \"secret assassin\" by the Jedi Order, and hinted that he had Force powers. The Flail unquestioningly believed his claims.\nIn 33 BBY, Chancellor Finis Valorum began a personal crusade against The Flail, damaging the organization. Valorum's agents killed all the leaders of The Flail. Pent took advantage of this situation and became the new leader of The Flail. He organized meetings in an empty warehouse, but he only went there for the meetings; his subordinates did not know how to contact him. Pent also made comuniqués to the news, suggesting that he was a Jedi.\nValorum publicly promised to bring the remnants of the Flail to justice before the following Senate hearing. The Flail answered by threatening Valorum. Pent then organized a triple attempt against Valorum's live, to take place during the politician's next public speech. Demolition expert Senn Riip Domeet was sent in disguise to hide an explosive device under Valorum's platform, but his work could have been discovered. Pent also wrote a computer program that would override the current instructions in the Weather Modulation Control Center to unleash a thunderstorm that could damage the buildings around the speech area; five terrorists were sent to the Control Center to load the software, but some new agents of Valorum stopped them.\nValorum then went personally, with seven other men, to the Traffic Control Center only ten minutes before the speech. They intended to load a vehicle with explosives and remote-pilot it to make it crash with the platform. However, they met the new agents, who had discovered Pent's plan, and were forced to fight with them. Pent and his men were defeated, and the Chancellor finished his speech alive.\nPent favored black and yellow robes, with his imitation lightsaber commonly hanging from his belt.\nPent was a zealot, ready to die if he could kill the Supreme Chancellor or at least destroy his career while doing so.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/The_Flail",
  "/wiki/Corellian/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/34_BBY/Legends",
  "/wiki/33_BBY/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Finis_Valorum/Legends",
  "/wiki/Senn_Riip_Domeet",
  "/wiki/Weather_Modulation_Control_Center",
  "/wiki/Air_Traffic_Control",
  "/wiki/Wizards_of_the_Coast",
  "/wiki/Shadows_of_Coruscant",
  "/wiki/Star_Wars_Roleplaying_Game_Core_Rulebook",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}