{
 "name": "Zehrinne_Thaal",
 "display_name": "Zehrinne Thaal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "6 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Federation of Free Alliances"
     ]
    }
   ]
  }
 ],
 "content": "Zehrinne Thaal was a Human female who worked as a model. In 12 ABY, at age eighteen, she married corrupt Galactic Alliance General Stavin Thaal. By 44 ABY, the Thaals were going through divorce proceedings and Zehrinne was left with a home from which she could not pay property taxes on. When she was interviewed by Wraith Squadron member Garik \"Face\" Loran, who was investigating Stavin's guilt as a member of the Lecersen Conspiracy, Zehrinne told Loran that her husband had been married several times to pretty young woman who had divorced after they, like Zehrinne, aged out.\nWraith Squadron later used Zehrinne on Kuratooine in order to confirm the identity of her husband, who, by then, had undergone genetic manipulation to disguise himself for retirement as Thadley Biolan and was wearing makeup that made him look like his original self. Zehrinne confirmed that \"Thadley Biolan\" was wearing makeup and that he was an imposter of Stavin Thaal, who was stated to be dead by Wraith member Turman Durra, disguised as the late Ton Phanan. As a result, Stavin was arrested, ending Wraith Squadron's mission to apprehend him.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/6_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Federation_of_Free_Alliances",
  "/wiki/12_ABY/Legends",
  "/wiki/General/Legends",
  "/wiki/Stavin_Thaal",
  "/wiki/44_ABY",
  "/wiki/Wraith_Squadron",
  "/wiki/Garik_Loran",
  "/wiki/Lecersen_Conspiracy",
  "/wiki/Kuratooine",
  "/wiki/Turman_Durra",
  "/wiki/Ton_Phanan",
  "/wiki/X-Wing:_Mercy_Kill",
  "/wiki/X-Wing:_Mercy_Kill_(audiobook)"
 ]
}