{
 "name": "Zek_Peiro",
 "display_name": "Zek Peiro",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 32 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown with blond highlights"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  }
 ],
 "content": "Zek Peiro was a Force-sensitive human male who was considered by many to be the best thief for hire on the planet Coruscant. His reputation caught the attention of the Sith Lord Darth Maul, who believed Peiro's thieving skills to be the result of untapped Force abilities. In order to prove his hypothesis, Maul posed as a low-level criminal and hired Peiro under the guise of the \"Kaitis Cartel\" to steal a shipment of scarn. After witnessing the thief's power firsthand during the theft, Maul proceeded to kill Peiro out of a desire to satiate his bloodlust.\nZek Peiro operated as a successful thief in the underworld of the planet Coruscant during the Republic Era. Shortly prior to the Invasion of Naboo in 32 BBY, talk of his skills had reached the ear of the Zabrak Sith Lord Darth Maul, who had begun building alliances within the underworld under the guise of the \"Kaitis Cartel,\" a fictitious organization named after a Padawan he had slain in battle. Maul suspected Peiro's talents were gifts of the Force, and so he sought the thief out to discover the truth.\nPiero was hired by the \"Kaitis Cartel\" to intercept a shipment of scarn, a pre-spice compound, that was to be transferred between two criminal organizations. Peiro, unaware of the ulterior motives behind his hiring, accepted the job. Though the thief wanted to work alone, Maul accompanied him, disguised as an enforcer of the Cartel. Peiro led the Sith Lord to the location of the transfer, arriving just before the deal was to happen. Peiro encouraged Maul to wait, but the Zabrak grew impatient and attacked the gangs. Peiro reluctantly joined in on the skirmish, and as they fought, Maul recognized the Force flowing through the thief's movements.\nAfter incapacitating the criminals, Peiro entered their transport and was able to locate the hidden scarn, guided by the Force. Having acquired the shipment, the thief awaited the arrival of the Kaitis Cartel. Unbeknownst to him, however, Maul had become confident in the thief's connection to the Force, and, hoping to satisfy his urge to eliminate the Jedi Order, impaled Peiro with a piece of scrap, killing him.\nPeiro's death did nothing to quell Maul's rage, who still yearned to face a true Jedi. He was chastised for his actions by his Master, Darth Sidious, who was worried that Peiro's death could potentially attract the attention of the Jedi and jeopardize the Dark Lord's plans. Seeking a teachable moment, Sidious took Maul to the site of an ancient battle on the planet Malachor, where he taught his apprentice a lesson in patience.\nA talented criminal, Peiro was confident in his abilities, believing he did not require backup on jobs. He displayed patience while stalking the scarn dealers, waiting for the right opening. He held some disdain for Darth Maul, who he believed to be an amateur in the criminal field, but noted that he was skilled in combat. Peiro also admired the Kaitis Cartel's swift entrance into the underworld, believing that they could become an important power in the future.\nPeiro was a human who had light skin and brown eyes, as well as a mustache. His hair was brown in the back, with blond bangs descending over his face. Underneath his eyes, a large scar ran across his face, bisecting his nose.\nPeiro was a renowned thief, whose name was spread throughout the Coruscant underworld. He was held in such esteem that even the Sith Lord Darth Maul had heard tales of his exploits.\nAs a Force-sensitive, Peiro could use the Force to augment his skills as a thief, allowing him to accomplish tasks others in his field could not. He was also skilled in both hand-to-hand and ranged combat, able to take on multiple opponents at once. However, Peiro lacked proper training in the Force, with Maul noting that his grasp of the Force was \"clumsy\" at best. Still, Maul recognized potential within Peiro's abilities.\nPeiro wore a blue shirt, a black sleeveless jacket, black pants, and black and silver boots on his job with Maul, as well as a pair of fingerless gloves. He carried a holstered blaster on his right hip, which he put to use against the thugs of the underworld.\nZek Peiro first appeared in Age of Republic - Darth Maul 1, the second issue of the anthology series Star Wars: Age of Republic. The issue was written by Jody Houser, illustrated by Luke Ross, and published by Marvel Comics on December 12, 2018. Houser named the character after her friend Zeke Pinheiro, who served as the game master of Star Wars roleplaying game campaigns for Houser's friends. Houser was inspired to use Pinheiro's name after he killed off her player character for possessing latent Force-sensitivity, a trait shared by the individual that would become Peiro. To Houser's delight, Pinheiro later incorporated the character's Age of Republic story into their campaign.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Zek_(disambiguation)",
  "/wiki/32_BBY",
  "/wiki/Coruscant",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Force-sensitive",
  "/wiki/Thief",
  "/wiki/Planet",
  "/wiki/Dark_Lord_of_the_Sith",
  "/wiki/Maul",
  "/wiki/Force_power",
  "/wiki/Kaitis_Cartel",
  "/wiki/Scarn_(spice)",
  "/wiki/Death",
  "/wiki/Blood",
  "/wiki/File:Peiro_and_Maul.jpg",
  "/wiki/Coruscant_Underworld",
  "/wiki/Republic_Era",
  "/wiki/Invasion_of_Naboo",
  "/wiki/Ear",
  "/wiki/Zabrak",
  "/wiki/Eldra_Kaitis",
  "/wiki/Skirmish_on_the_moon_of_Drazkel",
  "/wiki/The_Force",
  "/wiki/Skirmish_in_the_Coruscant_underworld",
  "/wiki/Spice",
  "/wiki/Sith_Lord",
  "/wiki/Transport",
  "/wiki/Jedi_Order",
  "/wiki/Jedi",
  "/wiki/Sith_Master",
  "/wiki/Darth_Sidious",
  "/wiki/Great_Scourge_of_Malachor",
  "/wiki/Malachor",
  "/wiki/Sith_apprentice",
  "/wiki/Darth",
  "/wiki/Eye",
  "/wiki/Hair",
  "/wiki/File:Peiro_fighting.jpg",
  "/wiki/Sith",
  "/wiki/Hand-to-hand_combat",
  "/wiki/Clothing",
  "/wiki/Jacket",
  "/wiki/Boot",
  "/wiki/Glove",
  "/wiki/Holster",
  "/wiki/Blaster",
  "/wiki/Age_of_Republic_-_Darth_Maul_1",
  "/wiki/Star_Wars:_Age_of_Republic",
  "/wiki/Jody_Houser",
  "/wiki/Luke_Ross",
  "/wiki/Marvel_Comics",
  "/wiki/December_12",
  "/wiki/2018",
  "/wiki/Star_Wars",
  "/wiki/Roleplaying_game",
  "/wiki/Category:Images_of_Zek_Peiro",
  "/wiki/Star_Wars_Insider",
  "/wiki/Blaster_(Star_Wars_Insider)",
  "/wiki/Star_Wars_Insider_171",
  "/wiki/Star_Wars:_Darth_Maul_(Marvel)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Ultimate_Star_Wars,_New_Edition"
 ]
}