{
 "name": "Zeke_(clone_trooper)",
 "display_name": "Zeke  (clone trooper)",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kamino"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c.35 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.83 meters"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "1st Platoon",
      "Grand Army of the Republic",
      "1st Platoon",
      "1st Platoon",
      "Veiled Sorority"
     ]
    }
   ]
  }
 ],
 "content": "\"Zeke\" was the nickname of a clone trooper who served the Galactic Republic as a junior sergeant in the Grand Army of the Republic during the Clone Wars. As the leader of the 1st Platoon, Zeke became a mercenary operating on Saleucami during the Galactic Civil War.\nZeke was one of the millions of clone troopers created on the aquatic planet of Kamino for the Grand Army of the Republic, being trained for years as a standard trooper. During the Clone Wars, Zeke served as a junior sergeant of the 1st Platoon before being retired by the Galactic Empire from active duty. Making off with caches of armor and weaponry, Zeke and other platoon members fled to the Outer Rim where they operated as a mercenary group. Basing their operations on Saleucami within Blackwind Crater, Zeke and the Platoon were hired as the long-term guards of the Veiled Sorority's base of operations in the crater. Because of the accelerated age of the clone army, Zeke was physically closer to the age of seventy or eighty then to his chronological age of forty. As members of the Platoon succumbed to old age or fatalities in the line of duty, Zeke saw his brothers buried within a cave system known as the Mausoleum. Nearly killed by thaelos during his time in the crater, Zeke lost his left arm in the attack. Carrying a blaster pistol, vibroknife, frag grenades and worn armor, all standard issue from their time in the Grand Army, Zeke's stores of ammunition had begun to become exhausted. By the time of the Sorority's conflict with the Zann Consortium, only four others were still alive out of the original twenty-seven troopers that survived the Clone Wars. Zeke was joined by Oake, Jayk, Rafe, and Tojo.\nLike most clones produced for the Grand Army, Zeke was trained to be unshakably loyal and highly trained. Over the years he was stationed on Saluecami, Zeke had grown distant and cold as his men perished.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Kamino/Legends",
  "/wiki/35_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cloning/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/1st_Platoon",
  "/wiki/Veiled_Sorority/Legends",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Clone_trooper_sergeant",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Saleucami/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Blackwind_Crater",
  "/wiki/Thaelo",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Vibroknife",
  "/wiki/Fragmentation_grenade/Legends",
  "/wiki/Zann_Consortium/Legends",
  "/wiki/Oake",
  "/wiki/Jayk_(clone_trooper)",
  "/wiki/Rafe_(clone_trooper)",
  "/wiki/Tojo",
  "/wiki/Mask_of_the_Pirate_Queen"
 ]
}