{
 "name": "Zel_Johans",
 "display_name": "Zel Johans",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "112th Repulsorlift Armor Regiment",
      "112th Repulsorlift Armor Regiment",
      "Thrawn's Confederation"
     ]
    }
   ]
  }
 ],
 "content": "Zel Johans was a Human male who served in the Imperial Army of the Galactic Empire. Johans would earn the nickname \"The Rancor\" from men who served alongside him. He was a well respected tactician, and played a key role in the development of repulsortanks for the army.\nJohans would eventually be promoted to the rank of High Colonel, and served as the commanding officer of Imperial Hammers Elite Armor Unit, nicknamed \"Hell Hammer's\". Johans had a rivalry with General Maximilian Veers, who commanded Blizzard Force. With this rivalry, Johans envisioned an elite, better armored battlegroup.\nJohans would be on the planet Brintooin during the Battle of Endor, which saw the death of Emperor Palpatine. Johans would refuse to claim the title of Warlord, despite the power he wielded. He would eventually serve underneath Grand Admiral Thrawn and his campaign to wipe out the New Republic. Only once did Johan's division serve him. Thrawn would perish at Bilbringi at the hands of Noghri bodyguard Rukh.\nZel Johans was born as a human male. At some point within the Imperial Period, Johans enlisted within the Imperial Army.\nJohans would later come to service with the Imperial Hammers Elite Armor Unit, otherwise referred as \"Hell Hammers\". His unit played a pivotal role in the Kwymar Suppressions, a series of invasions to subjugate systems. He was deployed to take the planet Protazk. Johans first plan was to attack the Spuma Flats, a heavily fortified area by the local resistance. It was Johans who personally led regiment from his repulsortank. He had several of his tanks engage laser turrets and resistance fighters hidden in the trenches. Meanwhile, squad three had intercepted a flight group of airspeeders. Once the first assault was finished, armored transports descended from the sky and deployed stormtroopers to finish the siege.\nEighteen months after the Battle of Yavin, the Alliance to Restore the Republic scored major victories at planets Aris V, and Vohai. Imperial scouts later found a base on Turak IV being maintained by Alliance Sector Command. Rather than evacuate, Moff Tallis, governor of the Parmel sector, had authorize General Maltaz to command Battle Group Turak. Tallis also requested two battalions of the Hell Hammers for assistance as well. While the Alliance had confidence they would be able to handle Maltz, they did not know that the Hell Hammers would be alongside him.\nJohans was masterful tactician within planetary warfare, and was a well regarded army officer. Johans believed that the All Terrain Armored Transport, was slow and weak. As such, Johans believed that repulsortanks were more versatile. Johans was skilled to coordinated orbital strikes, and starfighter attack runs on the enemy. A gifted engineer, Johans was a the creator of the Imperial-class repulsortanks.\nJohans was also a believer within the Empire. Believing it was more equipped, and better than the Galactic Republic. As such, he devoted himself to Palpatine's New Order.\nAfter the Battle of Endor, which saw the death of Emperor Palpatine, Johans refused to to claim the title of Warlord, believing only success would earn the promotion. He also refused to claim the title of General, Governor, and Moff.\nA skilled tactician and a talented engineer, Johans wore battle armor in battle. He also wielded a E-11 blaster rifle. He also had training with unarmed combat.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Imperial_Hammers_Elite_Armor_Unit/Legends",
  "/wiki/Thrawn%27s_confederation",
  "/wiki/Arbmab",
  "/wiki/The_Assault_on_Protazk",
  "/wiki/Imperial_Army/Legends",
  "/wiki/Repulsortank/Legends",
  "/wiki/Military_rank/Legends",
  "/wiki/High_Colonel/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/General/Legends",
  "/wiki/Maximilian_Veers/Legends",
  "/wiki/Blizzard_Force/Legends",
  "/wiki/Armored_battlegroup",
  "/wiki/Brintooin_Base",
  "/wiki/Planet/Legends",
  "/wiki/Brintooin",
  "/wiki/Battle_of_Endor/Legends",
  "/wiki/Death/Legends",
  "/wiki/Galactic_Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Warlord/Legends",
  "/wiki/Grand_Admiral/Legends",
  "/wiki/Mitth%27raw%27nuruodo/Legends",
  "/wiki/Thrawn_campaign",
  "/wiki/New_Republic/Legends",
  "/wiki/Battle_of_Bilbringi_(9_ABY)",
  "/wiki/Bilbringi_system",
  "/wiki/Noghri/Legends",
  "/wiki/Rukh/Legends",
  "/wiki/Imperial_Period",
  "/wiki/Kwymar_Suppressions",
  "/wiki/Star_system/Legends",
  "/wiki/Assault_on_Protazk",
  "/wiki/Protazk",
  "/wiki/Spuma_Flats",
  "/wiki/Laser_turret/Legends",
  "/wiki/Squad_three",
  "/wiki/Airspeeder/Legends",
  "/wiki/Imperial_Armored_Transport",
  "/wiki/Stormtrooper/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Aris_V",
  "/wiki/Vohai",
  "/wiki/Turak_IV",
  "/wiki/Sector_Commander_(Alliance)",
  "/wiki/Moff/Legends",
  "/wiki/Tallis",
  "/wiki/Governor/Legends",
  "/wiki/Parmel_sector",
  "/wiki/Maltaz",
  "/wiki/Battle_Group_Turak",
  "/wiki/Battalion/Legends",
  "/wiki/Surface_warfare",
  "/wiki/All_Terrain_Armored_Transport/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Starfighter/Legends",
  "/wiki/Engineer/Legends",
  "/wiki/Imperial-class_repulsortank",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/New_Order/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Armor/Legends",
  "/wiki/E-11_blaster_rifle/Legends",
  "/wiki/Unarmed_combat",
  "/wiki/Imperial_Sourcebook",
  "/wiki/Imperial_Sourcebook_(Second_Edition)",
  "/wiki/Star_Wars_Adventure_Journal",
  "/wiki/Repulsortank_Battlefield",
  "/wiki/Star_Wars_Adventure_Journal_9",
  "/wiki/Special_Military_Unit_Intelligence_Update",
  "/wiki/Star_Wars_Adventure_Journal_15",
  "/wiki/Hyperspace:_The_Official_Star_Wars_Fan_Club",
  "/wiki/The_Battle_of_Turak_IV",
  "/wiki/StarWars.com",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}