{
 "name": "Zelice_Sturm",
 "display_name": "Zelice Sturm",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "Circa 19 BBY",
      "Almas"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Meera Lisso"
     ]
    }
   ]
  }
 ],
 "content": "Zelice Sturm was a female Human who served as a Jedi Knight during the waning years of the Galactic Republic.\nDiscovered to be Force-sensitive at birth, Zelice Sturm was taken to Almas and inducted into the Jedi Order's experimental academy there, where she was trained in the ways of the Force. The academy, experimental because it allowed older students to enter training and several teaching structures differed from the traditional methods set down by the Council of First Knowledge on Coruscant, was Sturm's home for the first decade of her life, where she became one of the academy's most promising students. As she progressed through the academy and was selected by a Jedi Master for one-on-one training as a Padawan, Sturm was of the opinion that older Force-sensitives should not be trained as Jedi. On a mission, Sturm was paired for the first time with one such \"latecomer\" Padawan who died accidentally during the assignment.\nDisturbed by her partner's death, Sturm refused to be paired with a \"latecomer\" again. Petitioning her master and the Academy's Council for a low-threat solo mission, Sturm was dispatched to the floating city of Tolea Biqua above Genarius to investigate a rumored smuggling gang active there. During her search for evidence, Sturm was attacked by a street gang and seriously outnumbered. While Sturm attempted to intimidate the gang members, her efforts only incited violence. Scared, Sturm exerted herself through the Force as her attackers charged her, killing five members of a gang and one of its leaders. Realizing how under-skilled and under-equipped her attackers were, Sturm was consumed by regret and shame, and she felt that she was no longer fit to be a Jedi. She decided that she was only fit to be a hunted criminal, so she confronted the leader of the smuggling ring and demanded to be made a full partner. The leader responded by attacking her, so she killed him and took over control of the gang.\nAttempting to remain in the light of the Force, Sturm ruled the gang with an iron fist for two years, calling herself the Black Queen. When the so-called Heroes of Cularin were said to be involved in the upcoming Trial of Knighthood at the Almas Academy, Sturm began to plot the group's demise as a way to discredit the Jedi on Almas. In order to gauge the group's abilities, Sturm activated a series of battle droids she had reprogrammed to attack the group. The droids, owned by the local academy supplier Snem Noonb, attacked a group of the Heroes while they toured Noonb's factory. Defeating the droids, the group later encountered Pindy Streeto, a thug from the Rancor Riders gang that Sturm had hired to assassinate the group. Subduing the gang and Streeto, Sturm assisted in smuggling Streeto offworld and into hiding. Posing as Streeto, Sturm tried to manipulate the Jedi who hunted her, but she was eventually captured and taken back to the academy.\nBack at the academy, Sturm underwent therapy with the masters there and was eventually brought back into the Order as a fully ranked Jedi Knight. Once more an active Jedi, Sturm selected Meera Lisso as her Padawan, and the pair worked together on many missions from the Council. Having sat out the Clone Wars during her rehabilitation, Jedi Sturm fit well with the other Jedi at the academy, most of whom had invoked the Right of Denial when the Jedi High Council on Coruscant demanded all Jedi fight in the war. Circa 19 BBY the Dark Jedi Garth Ezzar led an attack on the Almas Academy. Defending the academy and its students to her last breath, she died at the hands of Ezzar just as the Heroes of Cularin arrived to help defend the academy.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/19_BBY/Legends",
  "/wiki/Almas",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Meera_Lisso",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Almas_Academy",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Jedi_academy",
  "/wiki/Council_of_First_Knowledge/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Almas_Council",
  "/wiki/Tolea_Biqua",
  "/wiki/Genarius",
  "/wiki/Smuggler/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Black_Queen",
  "/wiki/Heroes_of_Cularin",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Battle_droid/Legends",
  "/wiki/Snem_Noonb",
  "/wiki/Pindy_Streeto",
  "/wiki/Rancor_Riders",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Right_of_Denial",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Garth_Ezzar",
  "/wiki/Destruction_of_the_Almas_Academy",
  "/wiki/The_Way_of_the_Force",
  "/wiki/The_Dark_Side_Beckons",
  "/wiki/Wizards.com",
  "/wiki/Marching_Orders",
  "/wiki/Decision:_Coruscant",
  "/wiki/Destruction_(Living_Force_adventure)",
  "/wiki/A_Hero_Seeks_Not_Vengeance",
  "/wiki/Living_Force:_From_the_Cradle_to_the_Grave",
  "/wiki/The_Complete_Star_Wars_Encyclopedia"
 ]
}