{
 "name": "Zellos",
 "display_name": "Zellos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Sith Empire"
     ]
    }
   ]
  }
 ],
 "content": "Zellos was a Human male who served as a Grand Moff of the Sith Empire during the Great Galactic War against the Old Republic. Zellos commanded the second Imperial invasion of the Mid Rim planet Bothawui, an operation that became a drawn-out ground assault against a guerrilla force of Republic soldiers and Jedi Knights led by the Jedi Master Belth Allusis.\nDespite impressive Imperial advantages, Bothawui's Republic defenders inflicted considerable damage to the Imperial strike force. Zellos's men eventually defeated the majority of the Republic forces, prompting the Grand Moff to offer Allusis survival in exchange for his surrender. The Jedi refused, and Allusis and his forces were massacred, but not before they killed a majority of Zellos's forces. The Battle of Bothawui became a tremendous embarrassment for Zellos, who was not heard from again after returning to the Empire.\nThe Human male Zellos lived during the Great Galactic War between the Old Republic and the revitalized Sith Empire, serving as an Imperial Grand Moff. In the initial stages of the war, the Sith Emperor had targeted the Outer Rim Territories in a widely successful campaign. After the Imperial capture of the Seswenna sector, the Emperor turned his sights toward the Mid Rim. The first planned target was the Bothan sector; however, the first Imperial invasion of Bothan Space met with disaster, as the Republic had anticipated the move and stationed its entire fleet over Bothawui itself.\nThis first major Republic victory provoked the Empire to attempt to redeem its losses by mounting a second campaign to take the planet, with Grand Moff Zellos commanding the assault. With Imperial warships from across the galaxy at his command, the Grand Moff led the second invasion of Bothan Space, this time intending to bombard Bothawui from orbit. The Sith vessels were unable to do so, however, as a powerful planetary shield protected Bothawui's surface. Zellos's forces—a fifty thousand-strong Imperial army—instead landed on the planet to engage the Republic defenders and destroy the shield generator. The small Republic force of Jedi and soldiers that remained after the first battle at Bothawui was led by Jedi Master Belth Allusis, a leading member of the Jedi High Council who developed new tactics and battle plans to combat the Imperials in the Bothan forests.\nZellos and his advisors believed the battle would be a swift victory for the Empire, and so they sent their troops into battle in direct assaults. This proved to be detrimental to the Imperial forces, as Allusis's tactics and determination allowed the Jedi and his men to repel the Imperial soldier. For every Republic trooper killed, the Empire lost ten. Zellos was eventually forced to call in reinforcements that overwhelmed the Republic defenders, who rallied to Allusis for one final stand. However, before allowing his men to finish them off, Zellos extended an offer of peace to Allusis. The Grand Moff promised to spare the Jedi Master's life if he surrendered, but Allusis refused the offer, and he and his men fought to the death. Before falling, the Republic forces inflicted enough damage on the Imperial army to drive them off Bothawui. Zellos's invasion was unsuccessful and served as a major morale boost for the exhausted Republic. The Grand Moff's failure on Bothawui later became the focus of a holorecord created by the Kel Dor Jedi Master Gnost-Dural in the aftermath of the end of the war. The record was submitted to the Jedi Archives on Tython alongside a journal kept by Master Dural during the Great War. The journal also made mention of Moff Zellos and postulated that the Imperial commander would not be seen again after being punished by his Sith superiors.\nGrand Moff Zellos was a little-known but high-ranking official within the Sith Empire and took part in the Imperial conquest of the galaxy. As the commanding officer during the Battle of Bothawui, Zellos hoped to use his overwhelming numbers to crush the Republic resistance on the planet. However, he and his fellow commanders overestimated their advantage and used simple, straightforward assaults during the battle. This overconfidence was detrimental to their efforts, pushing Zellos to seek reinforcements. When he finally had Allusis and his defenders at his mercy, Zellos offered the Jedi Master peace in exchange for surrender. After his offer was refused, Zellos allowed his forces to kill Allusis and the rest of the Republic troops, inadvertently martyring Bothawui's defenders.\nGrand Moff Zellos was introduced in the fifth installment of the Galactic Timeline, an in-universe account of the events leading up to the LucasArts/BioWare massively multiplayer online video game titled Star Wars: The Old Republic. The timeline is narrated by Kel-Dor Jedi Master Gnost-Dural, whose voice is provided by actor Lance Henriksen. Zellos is again mentioned and pictured in The Journal of Master Gnost-Dural, a book which was included with collector's editions of Star Wars: The Old Republic. The game and the journal were released on December 20, 2011. The Journal of Master Gnost-Dural consistently misspells Zellos's name as \"Zelos.\"",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Commanding_officer/Legends",
  "/wiki/Battle_of_Bothawui_(Second;_Great_Galactic_War)",
  "/wiki/Mid_Rim",
  "/wiki/Planet/Legends",
  "/wiki/Bothawui/Legends",
  "/wiki/Ground_warfare",
  "/wiki/Republic_soldier",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Belth_Allusis",
  "/wiki/Jedi/Legends",
  "/wiki/Death/Legends",
  "/wiki/Tenebrae",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Third_battle_of_the_Seswenna_sector",
  "/wiki/Seswenna_sector/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Bothan_sector",
  "/wiki/First_Battle_of_Bothawui",
  "/wiki/Bothan/Legends",
  "/wiki/Realspace/Legends",
  "/wiki/Republic_Navy",
  "/wiki/Warship/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Orbital_bombardment/Legends",
  "/wiki/Orbit/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Bothawui_planetary_shield",
  "/wiki/Planetary_shield/Legends",
  "/wiki/Army/Legends",
  "/wiki/Deflector_shield_generator/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Troop/Legends",
  "/wiki/Imperial_soldier",
  "/wiki/Trooper/Legends",
  "/wiki/Holodocumentary",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gnost-Dural",
  "/wiki/Jedi_Archives_(Tython)",
  "/wiki/Tython/Legends",
  "/wiki/Timeline_5:_The_Battle_of_Bothawui",
  "/wiki/Galactic_Timeline",
  "/wiki/In-universe",
  "/wiki/LucasArts",
  "/wiki/BioWare",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Lance_Henriksen",
  "/wiki/December_20",
  "/wiki/2011",
  "/wiki/March_12",
  "/wiki/2012"
 ]
}