{
 "name": "Zelly",
 "display_name": "Zelly",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Zelly was a human female who was the daughter of Imperial personnel Bevelyn and Jon Melton. Along with her sibling Reen and parents, Zelly lived on the Empire's second Death Star as her parents worked aboard the station during its construction. Bev and Melton eventually became disillusioned with the Empire and became spies for the criminal syndicate Crimson Dawn. Between 3 ABY and 4 ABY, Melton and Bevelyn were activated by Crimson Dawn leader Lady Qi'ra and were instructed to cause chaos for the Empire. The two decided that they would defect from the Empire and inform the Rebel Alliance of the Death Star in exchange for safe passage and protection. They took Zelly and Reen to a shuttle on the station, though before they could leave, the ships intended passenger, Imperial Security Bureau Major Sharin, boarded the shuttle to travel to Al'doleem. Bev killed Sharin and then Melton piloted the shuttle away from the Death Star.\nAs they attempted to flee, TIE/IN interceptors were sent after the shuttle, and Melton used the programmed coordinates to escape, unaware of where it would take them. Bevelyn checked on Zelly and Reen, and Zelly shouted for her mama. The shuttle then arrived at Al'doleem, where TIE fighters were deployed after the shuttle, forcing the family to flee to the Imperial capital of Coruscant. Once they arrived in orbit, Bev told Zelly and Reen to get ready and gave Reen a special job of looking after Zelly. The family then gathered in the cockpit of the shuttle, and Melton pressed a button to activate the shuttle's emergency pod, which landed on Level 2685 of the planet's underworld. Melton deactivated the pod's emergency beacon and the family left the shuttle. Melton suggested they attempt to blend in and not draw attention, though Zelly informed her dad that they had drawn attention as a number of residents gathered around the crashed pod. Bev and Melton then explained to the residents that they were in trouble and sought help, to which a resident pointed out that they had heat on them as Imperial ships approached and rejected the pleas for help. Bev then suggested that the family run after Melton admitted he was out of ideas.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Bevelyn",
  "/wiki/Jon_Melton",
  "/wiki/Reen_(Bevelyn)",
  "/wiki/Parent",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Space_station",
  "/wiki/Sleeper_Agent",
  "/wiki/Crimson_Dawn",
  "/wiki/3_ABY",
  "/wiki/4_ABY",
  "/wiki/Crime_lord",
  "/wiki/Lord",
  "/wiki/Qi%27ra",
  "/wiki/Desertion",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Death_Star",
  "/wiki/Scopium",
  "/wiki/Starship",
  "/wiki/Imperial_Security_Bureau",
  "/wiki/Major",
  "/wiki/Sharin",
  "/wiki/Shuttle",
  "/wiki/Al%27doleem",
  "/wiki/Death",
  "/wiki/Pilot",
  "/wiki/TIE/IN_interceptor",
  "/wiki/Galactic_coordinates",
  "/wiki/TIE/ln_space_superiority_starfighter",
  "/wiki/Capital",
  "/wiki/Coruscant",
  "/wiki/Orbit",
  "/wiki/Cockpit",
  "/wiki/Escape_pod",
  "/wiki/Level_2685",
  "/wiki/Coruscant_Underworld",
  "/wiki/Distress_beacon",
  "/wiki/Wookieepedia:Stub",
  "/wiki/Special:EditPage/Zelly",
  "/wiki/Star_Wars_(2020)_26",
  "/wiki/Star_Wars_(2020)_27",
  "/wiki/Star_Wars_(2020)_28",
  "/wiki/StarWars.com",
  "/wiki/Escape_from_Cloud_City",
  "/wiki/Rescue_of_Han_Solo",
  "/wiki/Star_Wars:_Galactic_Atlas"
 ]
}