{
 "name": "Zenn_Bien",
 "display_name": "Zenn Bien",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sullust"
     ]
    },
    {
     "name": "Born",
     "values": [
      "c. 32 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sullustan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Zenn Bien was a Sullustan female smuggler, Rebel Alliance demolitions expert, and later beautician.\nAfter leaving Sullust due to her disappointment at SoroSuub Corporation's support of both the Confederacy of Independent Systems and the Galactic Empire, she fell in with Quip Fargil, and went to an Imperial impound lot at Nilash III to steal a YT-1300 light freighter. With the help of an Imperial, Bien and Fargil stole the freighter, and made their way to Sriluur, where they met with the Verpine Luufkin, and planned to head out to chop the ship. Luufkin supplied them with crates of fine brand and tabac sticks, and also provided the ship with a new registry, as the Gone to Pieces. The three of them headed to the Tungra sector, but were pulled out of hyperspace.\nA new Sienar Fleet Systems Interdictor-class Star Destroyer, and were let go. Their thrusters had malfunctioned, however, and after Fargil offered the brandy and tabac as a bribe, the Star Destroyer pulled them aboard with its tractor beam so they could repair the ship. Once the crates were offloaded, the the YT's true purpose was revealed: two Chadra-Fan, three Jawas, and four Squibs came out of Gone to Pieces's smuggling compartments to head onto the Interdictor and steal hyperdrive parts for Gone to Pieces, and the Rebel Alliance. Bien had been unaware of this, but memorized a map of the cruiser to aid in their mission.\nAfter the group returned with the parts and started installing them on Gone to Pieces, the Imperials cut their stay short, as they received new orders. The group complied, but as the Imperials prepared to leave, the group's actions were discovered. The group ignored the Imperials order to stay, and as Bien flew Gone to Pieces out of the docking bay, one of the cruiser's gravity well projectors cracked, disabling the ship. This allowed the group to continue to the Tungra sector.\nAfter the run-in with the Interdictor, the Chadra-Fan, Jawas, Squibs, and Bien continued to work together as freelance scavengers. When Bien found out about SoroSuub's control of Sullust, and a resistance on the planet, the scavengers began working with Nien Nunb and Sian Tevv. Before the Battle of Yavin the scavengers joined the Rebel Alliance, and went on to destroy the Invincible, and many other Imperial ships. After the Galactic Civil War, Bien received a degree from the Barbers of Sullust, and opened a beauty salon, The Kindest Cut, on New Balosar, where she started her own warren-clan with several husbands. In 43 ABY, Tobb Jadak and Flitcher Poste visited her in The Kindest Cut to ask her about Gone to Pieces for nostalgic reasons.\nWhen Zenn Bien was about seventy-five years old, she was still clear-eyed and spry, although her dewflaps drooped. Bien's forehead was tattooed, and she had plaits lustrously kept in a bonnet.\nZenn Bien appeared in the novel Millennium Falcon, which was written by James Luceno and released in October 2008.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Sullust/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Sullustan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/SoroSuub_Corporation/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Quip_Fargil",
  "/wiki/Nilash_Imperial_Impound_Facility",
  "/wiki/Nilash_III",
  "/wiki/YT-1300_light_freighter/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Sriluur/Legends",
  "/wiki/Verpine/Legends",
  "/wiki/Luufkin",
  "/wiki/Tabac",
  "/wiki/Millennium_Falcon/Legends",
  "/wiki/Tungra_sector/Legends",
  "/wiki/Hyperspace/Legends",
  "/wiki/Sienar_Fleet_Systems/Legends",
  "/wiki/Interdictor-class_Star_Destroyer/Legends",
  "/wiki/Engine/Legends",
  "/wiki/Star_Destroyer/Legends",
  "/wiki/Tractor_beam/Legends",
  "/wiki/Chadra-Fan/Legends",
  "/wiki/Jawa/Legends",
  "/wiki/Squib/Legends",
  "/wiki/Hyperdrive/Legends",
  "/wiki/Hangar/Legends",
  "/wiki/Gravity_well_projector/Legends",
  "/wiki/Nien_Nunb/Legends",
  "/wiki/Sian_Tevv/Legends",
  "/wiki/Battle_of_Yavin/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Barbers_of_Sullust",
  "/wiki/The_Kindest_Cut",
  "/wiki/New_Balosar",
  "/wiki/43_ABY",
  "/wiki/Tobb_Jadak",
  "/wiki/Flitcher_Poste",
  "/wiki/Standard_year/Legends",
  "/wiki/Tattoo/Legends",
  "/wiki/Millennium_Falcon_(novel)",
  "/wiki/James_Luceno",
  "/wiki/October",
  "/wiki/2008",
  "/wiki/Millennium_Falcon_(audiobook)",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}