{
 "name": "Zephee",
 "display_name": "Zephee",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Endor"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Ewok"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Gray"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Bright Tree tribe"
     ]
    }
   ]
  }
 ],
 "content": "Zephee was a female Ewok who lived on the moon Endor and gave birth to her second daughter during the construction of the second Death Star. She feared what the completion of the superweapon would mean for her children. In 4 ABY, she was present in Bright Tree Village when her tribe prepared to cook a group of rebels they had captured.\nZephee was a female Ewok who lived in Bright Tree Village on the forest moon of Endor. She gave birth to her second daughter while the second Death Star superweapon was being constructed by the Galactic Empire in the Endor system. The battle station was visible in the skies of Endor, and its construction progressed as Zephee's infant daughter grew, leaving the mother to wonder what terrible omens the completion of the Death Star would bring for her tribe and children.\nIn 4 ABY, Zephee was stood on the balcony of a hut on the edge of the village center when a scouting party led by the Ewok Teebo returned with a group of rebels that had been caught in one of the tribe's net traps. Zephee scratched her ear as she watched the scouting party begin to prepare the prisoners to be cooked as part of a great banquet, which was to be held in honor of their comrade C-3PO, who the Ewoks had mistaken for the deity known as the Golden One.\nThe captive Jedi Luke Skywalker then used the Force to lift C-3PO into the air above the village, scaring the Ewoks into freeing the prisoners in order to avoid the god's wrath. The Ewoks then aided the rebels in the Battle of Endor, in which the Death Star was destroyed.\nZephee had white and brown fur and black eyes.\nZephee wore a brown hood.\nThe Ewok that would become known as Zephee first appeared in the 1983 original trilogy film, Star Wars: Episode VI Return of the Jedi. The Ewok village scenes were filmed between January 18 and February 2, 1982 on Stage 3 at Elstree Studios.\nThe character of Zephee originated in the Star Wars Legends continuity, where she was the wife of the Ewok Lumat and mother of Latara, Nippet, and Wiley. This character first appeared as \"Mama Ewok\" in the 1984 children's book The Baby Ewoks' Picnic Surprise and then received a name in the book The Haunted Village, which was released on September 24, 1987 as an adaptation of an episode of the Ewoks television series with the same name which aired on September 14, 1985.\nThe character was then retroactively identified as the Ewok who appeared in Return of the Jedi by the mobile card game Star Wars: Force Collection, which initially launched in 2013. Although the launch of Force Collection predates the Star Wars canon reset of 2014, Lucasfilm Story Group member Leland Chee confirmed that the game was kept updated to fit with canon.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zephee",
  "/wiki/Zephee/Legends",
  "/wiki/Endor",
  "/wiki/Ewok",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Bright_Tree_tribe",
  "/wiki/Moon",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Superweapon",
  "/wiki/4_ABY",
  "/wiki/Bright_Tree_Village",
  "/wiki/Heroes_of_Yavin",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Forest",
  "/wiki/Reproduction",
  "/wiki/Galactic_Empire",
  "/wiki/Endor_system",
  "/wiki/Battle_station",
  "/wiki/Death_Star",
  "/wiki/Scout",
  "/wiki/Teebo",
  "/wiki/Ear",
  "/wiki/C-3PO",
  "/wiki/Golden_One",
  "/wiki/Jedi",
  "/wiki/Luke_Skywalker",
  "/wiki/The_Force",
  "/wiki/Battle_of_Endor",
  "/wiki/Hair",
  "/wiki/Eye",
  "/wiki/Clothing",
  "/wiki/1983",
  "/wiki/Original_trilogy",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/January_18",
  "/wiki/February_2",
  "/wiki/1982",
  "/wiki/Elstree_Studios",
  "/wiki/Star_Wars_Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Lumat/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Latara",
  "/wiki/Nippet/Legends",
  "/wiki/Wiley_(Ewok)",
  "/wiki/1984",
  "/wiki/The_Baby_Ewoks%27_Picnic_Surprise",
  "/wiki/The_Haunted_Village_(book)",
  "/wiki/September_24",
  "/wiki/1987",
  "/wiki/Ewoks_(TV_series)",
  "/wiki/The_Haunted_Village",
  "/wiki/September_14",
  "/wiki/1985",
  "/wiki/Retcon",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Force_Collection",
  "/wiki/2013",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Leland_Chee",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Adventures:_Tales_from_Vader%27s_Castle_4",
  "/wiki/The_Making_of_Star_Wars:_Return_of_the_Jedi",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars",
  "/wiki/In-universe"
 ]
}