{
 "name": "Zerex",
 "display_name": "Zerex",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire"
     ]
    }
   ]
  }
 ],
 "content": "Zerex was a male Human who served the Galactic Empire as a governor, and later as a moff.\nBy the time of the Galactic Civil War, Zerex was an elderly man. He served as the governor of the snow-covered planet Ord Adinorr, and also had dealings with the Hutt crime lord Draba. However, Zerex was ambitious and planned to make a bid to become a moff. To support his bid, Zerex arranged to bring the suspected Rebel Alliance sympathizer Captain Bythen Forral to justice, by sending a group of freelance agents to sabotage astrogation computers on Forral's Corellian corvette, sending the Captain on a one-way course to the Unknown Regions.\nThe agents were successful and Zerex took credit for their actions, using his resulting popularity to secure himself an appointment as the Moff of the Meridian sector. To celebrate, Zerex held a party at his mansion on Ord Adinorr and invited a number of individuals to attend, including the business owner Greddin Zel, the Muun banker Brult Kiais, Admiral Bornet Lorax, the assassin Meren Siefel, his mistress Klorma Draill, his assistant Captain Piedell, the Bith band The Vortices and the freelance agents who had dealt with Forral. However, he didn't invite Draba, as he thought that it would be inappropriate if he was seen socializing with criminal figures. She disliked this, as she had invested a lot of time and money in Zerex, so she hired the freelance agents to blackmail Zerex and remind him of his commitments to her.\nNot satisfied with his new power, Zerex aimed to become a Grand Moff, and dream came true just a few months later. Zerex's inauguration was due to take place on the planet Borleias and he arrived there the day before the ceremony, staying in the luxury Royal Hotel. However, Draba learned that Zerex had promised to crack down on racketeering when he became a Grand Moff, making him a potential threat to the Hutt. Draba didn't believe that she could risk letting the appointment happen, so she hired the freelance agents again and sent them to Boreleias, to assassinate Zerex.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Governor/Legends",
  "/wiki/Moff/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ord_Adinorr",
  "/wiki/Hutt/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Draba",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Bythen_Forral/Legends",
  "/wiki/Astrogation/Legends",
  "/wiki/CR90_corvette/Legends",
  "/wiki/Unknown_Regions/Legends",
  "/wiki/Meridian_sector/Legends",
  "/wiki/Greddin_Zel",
  "/wiki/Muun/Legends",
  "/wiki/Brult_Kiais",
  "/wiki/Admiral/Legends",
  "/wiki/Bornet_Lorax",
  "/wiki/Assassin/Legends",
  "/wiki/Meren_Siefel",
  "/wiki/Klorma_Draill",
  "/wiki/Piedell",
  "/wiki/Bith/Legends",
  "/wiki/The_Vortices",
  "/wiki/Grand_Moff/Legends",
  "/wiki/Borleias/Legends",
  "/wiki/Royal_Hotel",
  "/wiki/Racketeering",
  "/wiki/Scum_and_Villainy_(sourcebook)"
 ]
}