{
 "name": "Zerik",
 "display_name": "Zerik",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3.5 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Bothan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Zerik was a male Bothan who worked as an agent for the Alliance to Restore the Republic during the Galactic Civil War.\nZerik joined the Rebel Alliance prior to the destruction of Alderaan in 0 BBY and was one of the agents sent by the Alliance to the planet Nyriaan. Zerik had a sister, although she was one of the many Bothans who were killed while obtained information about the second Death Star.\nZerik was pragmatic by Bothan standards and recognized the evils of the Galactic Empire and its leader, Emperor Palpatine. He also sought no wealth for his services and performed most of his work for the Alliance for free. Following the death of his sister, he developed an extreme hatred for the Empire and became more concerned with making the Empire pay for causing his sister's death than he was with overthrowing it.\nZerik preferred to remain hidden until he felt that the time was right to strike, so he would lull targets into a false sense of security, by feigning a harmless demeanor. He would then unleashed his combat skills against them and was prepared to fight like a cornered animal, because he had no honor and was prepared to do anything to achieve victory.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Bothan/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Galactic_Civil_War/Legends",
  "/wiki/Destruction_of_Alderaan",
  "/wiki/0_BBY/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Nyriaan/Legends",
  "/wiki/Death/Legends",
  "/wiki/Death_Star_II/Legends",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Emperor/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Galaxy_of_Intrigue"
 ]
}