{
 "name": "Zev_Senesca",
 "display_name": "Zev Senesca",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kestic Station"
     ]
    },
    {
     "name": "Died",
     "values": [
      "3 ABY",
      "Hoth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.6 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Alliance to Restore the Republic",
      "Rogue Squadron",
      "Rogue Squadron"
     ]
    }
   ]
  }
 ],
 "content": "Zev Senesca was a human male rebel pilot who served the Rebel Alliance as a founding member of Rogue Squadron. While operating on Hoth, Senesca flew a snowspeeder under the callsign Rogue Two. He was the pilot who located the missing Alliance members Captain Han Solo and Commander Luke Skywalker, and he later participated in the Battle of Hoth. During the battle, Senesca and his gunner died when their snowspeeder was shot down by an AT-AT.\nZev Senesca was a human male born on the Kestic Station near the Bestine system. At some point, Senesca left Kestic Station and resided on Uthura, where he hunted starwhales. By the time of the Galactic Civil War, Senesca had joined the Alliance to Restore the Republic, serving the Rebel Alliance Starfighter Corps. After joining the Alliance, he met Wedge Antilles and Hobbie whilst at one of General Hera Syndulla's training exercises.\nIn 1 ABY, Senesca was present at the Mako-Ta Space Docks when the Galactic Empire launched an assault on the Alliance's base. Whilst stuck aboard the Star Cruiser Republic Senesca told Klivian that he knew and accepted the risks of fighting the Empire. Thanks to Han Solo, the Rebel starfighters were eventually able to launch, and Senesca, serving as a founding member of Rogue Squadron, flew an X-wing in the battle.\nIn 3 ABY, Senesca was among the Rebels stationed at Echo Base on the ice-planet of Hoth, where he flew a T-47 airspeeder under the callsign of Rogue Two. Senesca organized a betting pool for the worst thing about their new base, which pilot Dak Ralter won for betting on \"too damn cold.\" Senesca and his fellow pilots liked to fly the airspeeders, but they were not operational for some time due to the cold weather and the squadron were forced to use tauntauns until the engineers were able to adapt their equipment.\nWhen Rogue Leader Luke Skywalker went missing during a patrol, Captain Han Solo went in search of him. As news spread of their missing leader, Senesca, as the new first in command of Rogue Squadron, gathered the pilots in the barracks and started a new betting pool, saying the first Rogue pilot to find Skywalker would win a week's worth of wages off of his squadronmates. Ralter and Wedge Antilles wrote their names on the board, but when Derek \"Hobbie\" Klivian said that it was morbid, Leia Organa walked in and said that she thought it was a gesture filled with hope and that she was confident they could find him. The entire squadron then entered the pool. The following morning, Senesca led Rogue Squadron and located the two missing officers. Thinking of Organa's words, Senesca smiled to himself as he approached Solo and Skywalker, also remembering that he had won a lot of extra flight pay.\nSoon after, the Galactic Empire discovered Echo Base, and the Rebel Alliance began an evacuation. During the subsequent Battle of Hoth, Senesca piloted his snowspeeder, with Kit Valent serving as his gunner. While defending Echo Base, Senesca's snowspeeder was hit by an Imperial All Terrain Armored Transport twice. The first shot damaged their snowspeeder enough to slow it down, making the second the killing strike that killed both Senesca and Valent.\nSenesca was a brave rebel pilot and honorably served in multiple engagements during the Galactic Civil War. He did not enjoy life on Hoth, hating the snow and the cold wind, but nonetheless continued to serve. Senesca often organized betting pools for his squadron, including one about how long it would take General Organa to tire of Captain Solo's attempts to flirt and show off in front of her. Senesca did not hold Solo in the highest regard, thinking him to be a \"blowhard\" who had a big mouth and possessed more luck than talent. However, ultimately, Senesca respected Solo for being heroic and putting himself at risk to go search for Skywalker.\nZev Senesca was created for the 1980 film Star Wars: Episode V The Empire Strikes Back, in which he was portrayed by actor Christopher Malcolm. The film's credits identified the character as \"Zev ,\" and the surname of \"Senesca\" was later canonized in Ultimate Star Wars, a 2015 reference book.\nAccording to Ultimate Star Wars, Senesca hailed from Kestic Station. However, the 2015 junior novel The Empire Strikes Back: So You Want to Be a Jedi? states that Uthura is his homeworld, and a cohesive timeline from Lucasfilm has yet to be determined.\nA helmet styled after Zev's film helmet was used by an unidentified pilot in the Home One briefing room scene in the film Return of the Jedi.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zev_Senesca",
  "/wiki/Zev_Senesca/Legends",
  "/wiki/Star_Wars_(2015)_45",
  "/wiki/Star_Wars_(2015)_51",
  "/wiki/Rogue_Two_(short_story)",
  "/wiki/Rendezvous_Point_(short_story)",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing",
  "/wiki/Star_Wars:_Build_Your_Own_X-Wing_20",
  "/wiki/Starfighter_Aces",
  "/wiki/Kestic_Station",
  "/wiki/3_ABY",
  "/wiki/Hoth",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Rogue_Squadron",
  "/wiki/Rebel_pilot",
  "/wiki/T-47_airspeeder",
  "/wiki/Callsign",
  "/wiki/Rogue_Two",
  "/wiki/Pilot",
  "/wiki/Captain",
  "/wiki/Han_Solo",
  "/wiki/Commander",
  "/wiki/Luke_Skywalker",
  "/wiki/Battle_of_Hoth",
  "/wiki/Kit_Valent",
  "/wiki/Death",
  "/wiki/All_Terrain_Armored_Transport",
  "/wiki/Bestine_system",
  "/wiki/Uthura",
  "/wiki/Hunting",
  "/wiki/Starwhale",
  "/wiki/Time",
  "/wiki/Galactic_Civil_War",
  "/wiki/Rebel_Alliance_Starfighter_Corps",
  "/wiki/Wedge_Antilles",
  "/wiki/Derek_Klivian",
  "/wiki/General",
  "/wiki/Hera_Syndulla",
  "/wiki/1_ABY",
  "/wiki/Mako-Ta_Space_Docks",
  "/wiki/Galactic_Empire",
  "/wiki/Assault_on_the_Mako-Ta_Space_Docks",
  "/wiki/Star_Cruiser",
  "/wiki/Republic_(MC80A_Home_One_Type_Heavy_Star_Cruiser)",
  "/wiki/Echo_Base",
  "/wiki/Water",
  "/wiki/Planet",
  "/wiki/Dak_Ralter",
  "/wiki/Tauntaun",
  "/wiki/Rogue_Leader",
  "/wiki/Leia_Skywalker_Organa_Solo",
  "/wiki/Officer",
  "/wiki/Gunner",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Christopher_Malcolm",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/2015",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/Homeworld",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Home_One",
  "/wiki/Star_Wars:_Episode_VI_Return_of_the_Jedi",
  "/wiki/Category:Images_of_Zev_Senesca",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(Screen_Comix)",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Star_Wars:_Squadrons",
  "/wiki/LEGO_Star_Wars:_The_Force_Awakens",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_Complete_Locations_(2016)",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_9",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars_Helmet_Collection_48",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/R2-D2_(Star_Wars_Encyclopedia)",
  "/wiki/Luke_Skywalker_(Star_Wars_Encyclopedia)",
  "/wiki/The_Battle_of_Hoth_and_the_Second_Death_Star",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back:_Special_40th_Anniversary_Collector%27s_Edition",
  "/wiki/Star_Wars:_Battles_that_Changed_the_Galaxy",
  "/wiki/The_Pilots_of_the_Rebel_Alliance",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Standard_year",
  "/wiki/Battle_of_Yavin",
  "/wiki/0_BBY",
  "/wiki/Star_Wars_(2015)_55",
  "/wiki/Star_Wars_Costumes:_The_Original_Trilogy",
  "/wiki/StarWars.com"
 ]
}