{
 "name": "Zez-Kai_Ell",
 "display_name": "Zez-Kai Ell",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3951 BBY",
      "Dantooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Jedi High Council",
      "Jedi High Council",
      "Galactic Republic",
      "Lost Jedi",
      "Refugees"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Unidentified Padawan"
     ]
    }
   ]
  }
 ],
 "content": "Zez-Kai Ell was a male Human Jedi Master serving on the Jedi High Council during the Mandalorian Wars. He was close friends with fellow Jedi Master and Council member Kavar. He was killed on Dantooine by Darth Traya along with Kavar and Vrook Lamar.\nEll was one of the Masters on the High Council during the Mandalorian Wars. He was also one of the Masters that banished Meetra Surik from the Jedi Order. His own Padawan fell to the dark side during the Mandalorian Wars, but Master Ell did not blame his apprentice for choosing to go to war because he understood why his apprentice followed the Jedi that went to fight. When they banished Surik from the Order, he thought that the Council had thrown away an incredible opportunity: to understand why so many Jedi leave the Order and see if there is anything wrong with their teachings.\nAfter the Jedi Civil War, with the onset of the First Jedi Purge, Ell went into a voluntary exile on Nar Shaddaa in an attempt to escape detection by the Sith. While he knew about the bounty G0-T0 put on the remaining Jedi, he did nothing to stop him. But Surik later arrived on Nar Shaddaa to find him and stop G0-T0. When Mira, a bounty hunter Ell hired to protect Surik, was captured, Ell finally came out of hiding and decided to help the Exile stop G0-T0.\nAfter G0-T0's yacht was destroyed, Surik and Ell were finally able to talk. He told her many things, including his own doubt in the Order's teachings, and about his decision to leave the Order. When the subject of Revan came up, he told her that he believed redemption had not actually been Revan's choice, despite the fact that he had learned his identity, and the fact that he had kept to the way of the light side before the destruction of the Star Forge, though it is likely from the context of his statement he may have been referring to the mind-wipe itself. Thus, he was indicating that redemption was not Revan's choice, but rather the choice made by his programmed counterpart.\nHe believed that the Council had committed a crime in inserting a new identity over Revan's dead mind, despite how much they benefited from a Jedi-controlled Revan. He also told Surik that she had done the right thing to take action and fight in the Mandalorian Wars, when so few Jedi had followed her example.\nSoon after Surik sought him out, he gathered with Masters Vrook Lamar and Kavar at the rebuilt Jedi Enclave to answer Surik's questions. Ell was eventually killed when Darth Traya used Force drain on him and the other Masters to strip them of their connection to the Force, after they tried to sever Surik from the Force in order to seal the breach she had created but he and the other Jedi Masters could not survive without it and died.\nZez-Kai Ell was more openly thoughtful and introspective than some of his fellow Jedi Masters, and was quick to state his belief that the Jedi Council's inaction led to Revan's fall - even going as far to say that blame was not solely on the Jedi who left to fight, but on the Council as well. After the Jedi Civil War, he no longer considered himself a Jedi, claiming to have left the Order in disgust with both the Jedi Order and himself.\nIndeed, when the Exile met him, he appeared to have fallen into a depression, displaying something close to a death wish at times during their conversation. Despite this feeling of disillusionment, he still remained loyal to the Order, and continued to trust in Master Kavar's plan to draw out the Sith by finding the Exile.\nZez-Kai Ell was a master of advanced Force forms and an expert at lightsaber combat, practicing Ataru, Shien, Niman and Juyo. He wielded a violet-colored double-bladed lightsaber.\nHe was voiced by Billy Brown.\nIf the player chooses to follow the dark side in Knights of the Old Republic II, the Exile and Ell fight on Nar Shaddaa, a battle during which the Exile kills him and learns his lightsaber combat technique. The Exile can still choose to kill Ell should the player take the light-side path.\nIt is possible that Master Ell was not privy to the knowledge that Revan did eventually learn of his true identity but still remained loyal to the Jedi and the Republic. This could partly be the reason he did not believe Revan's redemption was his own choice. Though it is also possible that he may be referring to the reprogramming that gave Revan his new identity rather than the events surrounding the Star Forge.\nIn Star Wars: The Old Republic you can craft his double-bladed lightsaber, if you have sufficient skill in Artifice. In this game it is orange rather than purple.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3951_BBY",
  "/wiki/Dantooine/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Lost_Jedi",
  "/wiki/Refugee/Legends",
  "/wiki/Zez-Kai_Ell%27s_Padawan",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Kavar",
  "/wiki/Kreia",
  "/wiki/Vrook_Lamar",
  "/wiki/Trial_of_Meetra_Surik",
  "/wiki/Meetra_Surik",
  "/wiki/Padawan/Legends",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Jedi_Civil_War",
  "/wiki/First_Jedi_Purge",
  "/wiki/Nar_Shaddaa/Legends",
  "/wiki/Sith/Legends",
  "/wiki/G0-T0",
  "/wiki/Mira",
  "/wiki/Revan/Legends",
  "/wiki/Star_Forge",
  "/wiki/Force_drain/Legends",
  "/wiki/Jedi_Enclave",
  "/wiki/The_Force/Legends",
  "/wiki/Force_form",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Form_IV/Legends",
  "/wiki/Form_V/Legends",
  "/wiki/Form_VI/Legends",
  "/wiki/Form_VII/Legends",
  "/wiki/Double-bladed_lightsaber/Legends",
  "/wiki/Billy_Brown",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Knights_of_the_Old_Republic_9",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Eternal_Throne",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/3963_BBY",
  "/wiki/Vandar_Tokare",
  "/wiki/Atris",
  "/wiki/Lonna_Vash",
  "/wiki/Dorjander_Kace",
  "/wiki/Lucien_Draay",
  "/wiki/3959_BBY"
 ]
}