{
 "name": "Zharia_Vos",
 "display_name": "Zharia Vos",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kiffar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Tan"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kiffu Guardians"
     ]
    }
   ]
  }
 ],
 "content": "Zharia Vos was a female Kiffar who in 137 ABY ruled over her people and led the Kiffu Guardians as the Sheyf of Kiffex and Kiffu. During that year, she allowed Droo Rawk, a former Guardian, and her family to settle on Kiffex, and soon after contracted Droo's husband, \"Bantha\" Rawk, to create a suit of life-preserving armor for the Guardians to use. The Rawks ultimately placed the mortally wounded Imperial Knight Azlyn Rae inside the suit while healing her at their nephew, Cade Skywalker's, behest, and a furious Rae sought refuge at Vos's palace for two days before returning home. When agents of Darth Krayt's Galactic Empire expressed interest in using Kiffex or Kiffu as an Imperial base, Vos began to take precautions and asked Droo to return to the Guardians as a general.\nZharia Vos, a female Kiffar, lived on the planet Kiffex during the Second Imperial Civil War. She was born into Clan Vos, one of the largest clans on Kiffex, before 137 ABY. By that year, she had ascended to the position of Sheyf, the leader of the Kiffu Guardians and the ruler of Kiffex and Kiffu. Vos resided in the Sheyf's Palace on Kiffex. Under her leadership, the Kiffu Guardians remained neutral during the war.\nDuring the war, Droo Rawk of Clan Vos had a run-in with forces of Darth Krayt's Galactic Empire at her home on Iego. Fearful of his family's safety, her husband, \"Bantha\" Rawk, insisted that they move, and Zharia Vos allowed them to settle on Kiffex. As Rawk was an apt mechanic, Vos requested that he develop a suit of life-preserving armor for the Kiffu Guardians. Rawk set to work constructing a prototype suit at his family's new compound, designing a system that pumped bacta around and breathed for the wearer. When the project neared completion, he spoke with Vos via hologram and reported on his progress. Vos thanked and congratulated him before signing off.\nRawk was visited immediately thereafter by his nephew, Cade Skywalker, who demanded that Rawk and Droo heal his friend, the Imperial Knight Azlyn Rae. Rae had recently been mortally wounded and stood on the brink of death. She accepted her fate and resisted all of Droo's healing efforts, however, prompting Rawk and Droo to place her inside the prototype suit of life-preserving armor. Rae was furious with her predicament and left the compound, seeking refuge at the Sheyf's Palace. Vos received her and allowed her to stay as a guest. Two days after Rae parted ways with the Rawks, the Imperial Knight Ganner Krieg arrived at the palace in search of his fellow Knight. Vos directed him to Rae, who returned with Krieg to the Empire-in-exile's fortress world of Bastion.\nIn 138 ABY, Darth Krayt began a renewed military push against his enemies. Agents of his Empire contacted the Kiffu Guardians and requested that an Imperial base be built on Kiffex or Kiffu, but their request was denied. As a precaution against possible actions by Krayt's forces, Vos contacted Droo and requested that she reactivate her general's commission within the Kiffu Guardians.\nAs a member of Clan Vos, Zharia Vos sported the traditional Kiffar qukuuf tattoos on her face that were applied at the time of a Kiffar's birth. She was kind to and respectful of members of her clan, as well as to their extended families. She allowed Droo Rawk and her family sanctuary on Kiffex, as Droo was a member of Clan Vos. Zharia Vos was also mindful that both Droo and her first husband were former Kiffu Guardians, he having died in their service, and accordingly welcomed Droo's entire family to Kiffex during their time of need.\nVos later allowed a physically and emotionally exhausted Azlyn Rae to stay as a guest at her palace. After contracting \"Bantha\" Rawk to design a suit of armor for her, Vos praised him for his good work and his haste. Despite being Sheyf, she personally interacted with both Rawk and Ganner Krieg rather than dealing with them through an intermediary. While war ravaged the galaxy, Vos kept the Kiffu Guardians a neutral force but took necessary steps to prepare them for a possible attack by Darth Krayt's forces.\nZharia Vos appeared in the Storms story arc of the comic series Star Wars: Legacy, which was written by John Ostrander, penciled by Jan Duursema, and released in 2009. She was later mentioned in the 2011 comic Legacy—War 3. Ostrander and Duursema had previously written a number of comics about the Clone Wars-era Jedi Knight Quinlan Vos, a Kiffar member of Clan Vos and a fan-favorite Expanded Universe character. Their intent was that Zharia not be a direct descendant of Quinlan, however, and this fact was established in the script of the first issue of Storms. Zharia Vos was conceived because Ostrander and Duursema had earlier established that Clan Vos held the Sheyf position and therefore wanted to keep a solid continuity.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Kiffar/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Kiffu_Guardians",
  "/wiki/137_ABY",
  "/wiki/Sheyf",
  "/wiki/Kiffex/Legends",
  "/wiki/Kiffu/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Droo_Rawk",
  "/wiki/Rawk",
  "/wiki/Armor/Legends",
  "/wiki/Imperial_Knight",
  "/wiki/Azlyn_Rae",
  "/wiki/Cade_Skywalker",
  "/wiki/Sheyf%27s_Palace",
  "/wiki/Bastion/Legends",
  "/wiki/Imperial_Agent",
  "/wiki/Darth_Krayt%27s_Galactic_Empire",
  "/wiki/General/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Clan_Vos",
  "/wiki/Rawk%27s_Nest",
  "/wiki/Iego/Legends",
  "/wiki/Marriage/Legends",
  "/wiki/Technician/Legends",
  "/wiki/Rawk_compound",
  "/wiki/Bacta/Legends",
  "/wiki/Hologram/Legends",
  "/wiki/Battle_on_Had_Abbadon",
  "/wiki/Death/Legends",
  "/wiki/Force_healing/Legends",
  "/wiki/Ganner_Krieg",
  "/wiki/Empire-in-exile",
  "/wiki/Fortress_world",
  "/wiki/138_ABY",
  "/wiki/Darth_Krayt",
  "/wiki/Tattoo/Legends",
  "/wiki/Time/Legends",
  "/wiki/Droo%27s_husband",
  "/wiki/The_galaxy/Legends",
  "/wiki/Star_Wars:_Legacy:_Storms",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/2009",
  "/wiki/2011",
  "/wiki/Legacy%E2%80%94War_3",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Quinlan_Vos/Legends",
  "/wiki/Legacy_(2006)_34",
  "/wiki/Canon",
  "/wiki/Legacy_(2006)_35",
  "/wiki/Category:Images_of_Zharia_Vos",
  "/wiki/Dark_Horse_Comics",
  "/wiki/Legacy_(2006)_37",
  "/wiki/Star_Wars_(1998)_20",
  "/wiki/Star_Wars_(1998)_32",
  "/wiki/Legacy%E2%80%94War_2",
  "/wiki/Legacy_(2006)_24",
  "/wiki/Legacy_(2006)_25",
  "/wiki/Legacy_of_the_Force:_Revelation",
  "/wiki/Republic_83",
  "/wiki/Star_Wars:_Republic:_Twilight",
  "/wiki/Star_Wars:_Republic:_Darkness",
  "/wiki/Star_Wars:_Republic:_Dreadnaughts_of_Rendili",
  "/wiki/Star_Wars:_Republic:_Hidden_Enemy",
  "/wiki/StarWars.com",
  "/wiki/November_8",
  "/wiki/2010"
 ]
}