{
 "name": "Zhar_Lestin",
 "display_name": "Zhar Lestin",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3952 BBY",
      "Katarr"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Lethan Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Purple"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi OrderDantooine Jedi Enclave Council",
      "Dantooine Jedi Enclave Council",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Revan",
      "Alek",
      "Belaya"
     ]
    }
   ]
  }
 ],
 "content": "Zhar Lestin was a male Lethan Twi'lek Jedi Master who served as member of the Dantooine Jedi Enclave Council during the Mandalorian Wars and the Jedi Civil War. He taught many students, most notably Revan and Malak, and was among the selected Masters to attend the Conclave at Katarr, when the planet was rendered lifeless by Darth Nihilus.\nBefore he took the seat on the Council in charge of the Jedi training facility on Dantooine, it is known that Zhar spent some time on Coruscant, where he was often sought out by Revan and Malak for additional training. To his account, Revan was his most promising pupil, one he felt sure would one day be a champion of the Jedi Order. When Revan became ruler of the Sith instead, he realized he should have recognized as a warning sign his constant lust for knowledge, which he thought was simply eagerness, a common trait for a learner. On Dantooine, Master Zhar went on to teach many students, among them the Jedi Belaya.\nWhen Zayne Carrick contacted the Enclave from The Last Resort, seeking help from Vandar Tokare in the wake of the Padawan Massacre, Zhar was asked by his fellow Council member about any Jedi Consulars being stationed on Taris that might take Zayne under their care and probe his mind to shed some light on the murders he was being accused of. Zhar informed Master Vandar that except Lucien Draay, the Jedi stationed in the Jedi Tower on Taris were all Consulars, which was the first hint of exposure of the Jedi Covenant. Jedi Masters Vrook Lamar and Bala Nisi, together with Zhar and Vandar, watched him on a news hologram on Dantooine as the Padawan turned himself in and was brought in chains to his murderous Master by a common bounty hunter in front of angry Tarisians.\nYears later, after the capture of Darth Revan, the combined action of the Jedi Council erased the mind of the Dark Lord and created new memories for him through the Force, those of a Republic soldier under the command of Bastila Shan. They also destroyed his robe, which was made into a focusing tool of dark side energies by alien technology and was viewed as an abomination. Bastila had led the strike team that was sent on his flagship, and she was able to convince the Council she could exploit the Force bond between her and Revan to draw upon his subconscious memories and find the Star Forge, the means by which he had amassed the forces arrayed against the Jedi.\nZhar had the chance to teach his former student once again when she returned to the Enclave with Revan after the destruction of Taris. Except for Master Vrook, he found little objection in the Council when he stated that Revan's Force-sensitivity, which had already begun to manifest itself through his actions, could not be safely ignored. Revan had little choice in the matter as well, since the Sith would not ignore it either, and Jedi training was the only way he could save himself. In a few weeks time under Zhar's tutelage, Revan climbed up the title of Padawan, learning techniques of both lightsaber combat and Jedi meditation such as the Floating Meditation technique. The Twi'lek Jedi Master was amazed at the astonishing rate at which he progressed and would speak of it with folks around the Jedi Enclave, including the Jedi Belaya and Deesra Luur Jada, and Aratech merchants Crattis Yurkal and Karal Kaar.\nHe then guided Revan through the Jedi Trials of apprenticeship, having him display a true understanding of the Jedi Code, of the construction of a lightsaber, and of the lure of the dark side of the Force. His final test was the cleansing of an ancient grove on Dantooine from the taint of a fallen Jedi Padawan by the name of Juhani, who was unknowingly undergoing her own trial of the spirit as her Master Quatra saw best fit for her, and when Revan defeated the Dark Jedi in battle and showed her the path back to the light side, he was made by Master Zhar into a full-fledged Jedi and was presented with the customary robes of the Order. After that, the Council decreed he and Bastila entered the Rakatan Ruins to the east of the Enclave to find the first Star Map of the Star Forge system, which even Jedi Masters such as Nemo had been sent to recover without success, leading the Council to think the mission was tied to the destiny of Revan and Bastila, the real threat of dark side corruption notwithstanding.\nZhar survived the attack on Dantooine by the forces of Darth Malak, and saw the triumph of his Padawan over the Sith and over the dark side, which he rejected for good even after facing the truth that the Jedi had been using him.\nAfter the end of the Jedi Civil War, however, Jedi Master Atris called a council on Katarr at which the most powerful members of the Jedi Order were to attend, including Zhar, Vandar and Dorak. They gathered on the Miraluka colony to attempt to find a hidden Sith threat that had been stalking the remnants of the Order in the First Jedi Purge, already thinned dramatically after the war with Revan, Malak, and Exar Kun before them. They were all killed by the very threat that they had gathered to find, along with the Miraluka and all other life on the planet, for Darth Nihilus could not resist the opportunity to feed on them. Atris had sensed what could happen on Katarr but still didn't warn the Jedi, as she wanted to draw out the Sith; as such she was responsible for their deaths.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic:_War",
  "/wiki/3952_BBY",
  "/wiki/Katarr/Legends",
  "/wiki/Lethan",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Dantooine_Jedi_Enclave_Council",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Revan/Legends",
  "/wiki/Darth_Malak",
  "/wiki/Belaya",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Mandalorian_Wars",
  "/wiki/Jedi_Civil_War",
  "/wiki/Conclave_at_Katarr",
  "/wiki/Planet/Legends",
  "/wiki/Darth_Nihilus",
  "/wiki/Dantooine/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Zayne_Carrick",
  "/wiki/The_Last_Resort_(starship)",
  "/wiki/Vandar_Tokare",
  "/wiki/Padawan_Massacre",
  "/wiki/Jedi_Consular",
  "/wiki/Taris/Legends",
  "/wiki/Lucien_Draay",
  "/wiki/Jedi_Tower",
  "/wiki/Jedi_Covenant",
  "/wiki/Vrook_Lamar",
  "/wiki/Bala_Nisi",
  "/wiki/Hologram/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Capture_of_Darth_Revan",
  "/wiki/The_Force/Legends",
  "/wiki/Republic_soldier",
  "/wiki/Bastila_Shan",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Darth_Revan%27s_flagship",
  "/wiki/Force_bond",
  "/wiki/Star_Forge",
  "/wiki/Destruction_of_Taris",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Lightsaber_combat/Legends",
  "/wiki/Floating_Meditation",
  "/wiki/Deesra_Luur_Jada",
  "/wiki/Aratech_Repulsor_Company/Legends",
  "/wiki/Merchant/Legends",
  "/wiki/Crattis_Yurkal",
  "/wiki/Karal_Kaar",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_Code/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Juhani",
  "/wiki/Quatra",
  "/wiki/Dark_Jedi/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Rakatan_ruins_(Dantooine)",
  "/wiki/Star_Map",
  "/wiki/Star_system/Legends",
  "/wiki/Nemo",
  "/wiki/Attack_on_Dantooine_(Jedi_Civil_War)",
  "/wiki/Atris",
  "/wiki/Dorak",
  "/wiki/Miraluka/Legends",
  "/wiki/First_Jedi_Purge",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Knights_of_the_Old_Republic_4",
  "/wiki/Knights_of_the_Old_Republic_6",
  "/wiki/Knights_of_the_Old_Republic:_War_4",
  "/wiki/Knights_of_the_Old_Republic:_War_5",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic",
  "/wiki/Star_Wars:_Knights_of_the_Old_Republic_II:_The_Sith_Lords",
  "/wiki/Timeline_8:_The_Jedi_Civil_War",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Timeline_9:_The_Mandalorian_Wars",
  "/wiki/Star_Wars:_The_Old_Republic:_Onslaught",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Jedi_vs._Sith:_The_Essential_Guide_to_the_Force_(real-life_book)",
  "/wiki/Canon",
  "/wiki/Leviathan_(Interdictor-class_cruiser)"
 ]
}