{
 "name": "Zhari_Vaal",
 "display_name": "Zhari Vaal",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kesh"
     ]
    },
    {
     "name": "Died",
     "values": [
      "Shortly before 5000 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Keshiri"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Mauve"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Neshtovar"
     ]
    }
   ]
  }
 ],
 "content": "Zhari Vaal was a male Keshiri who was a member of the planet Kesh's ruling council, the Neshtovar, in the era prior to the Great Hyperspace War. As a member of the Neshtovar, Vaal was a skilled uvak-rider, although he often mistreated his flying uvak beast, Nink. He was married to Adari Vaal—although theirs was a quite unhappy marriage—and their nine-year union produced two children. Zhari was eventually killed when Nink, provoked by Vaal's constant abuse, dropped him into an ocean.\nA male Keshiri, Zhari Vaal was a native of the planet Kesh. As a member of the planet's ruling Neshtovar, Vaal was one of the few Keshiri adept at riding Kesh's native flying uvak beasts. Vaal was married to a woman named Adari—the match came about after years of lobbying by Adari's ambitious mother, Eulyn. The Vaals were together for nine years, a relatively unhappy union that produced two children, Tona and Finn. Although Zhari's profession revolved around the uvak creatures he rode as a member of the Neshtovar, Vaal was abusive toward his mount, Nink. After mistreating Nink one day, the beast flew Vaal far out over an ocean and dropped him. Vaal was killed but remembered fondly at his wake, eulogized by Neshtovar member Izri Dazh as \"the valiant young rider of the Neshtovar on whom so many hopes rested.\" While his widow, Adari, went on to absorb herself in her work as a geologist, Vaal's children were taken care of by his mother-in-law, Eulyn. After Adari's death in exile in the far-off continent of Alanciar, decades after Vaal's demise, Adari's personal memoirs were found, although they contained little about Vaal.\nZhari Vaal was not a bright individual and lacked conversational ability. In addition, he had a tendency to be unkind to those around him, especially his uvak, Nink. His marriage with Adari Vaal, although one that only came about due to pressure from Adari's mother, was a very unhappy one—Adari held a very negative opinion of Vaal, regarding him as a fool. Vaal's skin had a rich, mauve tone, and he had a short and stocky build.\nZhari Vaal first appeared in Lost Tribe of the Sith: Skyborn, a 2009 eBook by John Jackson Miller. Thus far, it is his only appearance in Star Wars canon, although he was mentioned in one of Skyborn's sequels, Lost Tribe of the Sith: Savior.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Keshiri",
  "/wiki/Vaal_(disambiguation)",
  "/wiki/Kesh",
  "/wiki/5000_BBY/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Neshtovar",
  "/wiki/Planet/Legends",
  "/wiki/Great_Hyperspace_War/Legends",
  "/wiki/Uvak",
  "/wiki/Nink_(uvak)",
  "/wiki/Marriage/Legends",
  "/wiki/Adari_Vaal",
  "/wiki/Standard_year/Legends",
  "/wiki/Tona_Vaal",
  "/wiki/Finn_Vaal",
  "/wiki/Death/Legends",
  "/wiki/Ocean/Legends",
  "/wiki/Parent/Legends",
  "/wiki/Eulyn",
  "/wiki/Izri_Dazh",
  "/wiki/Geologist/Legends",
  "/wiki/Exile_(punishment)/Legends",
  "/wiki/Alanciar",
  "/wiki/Adari_Vaal%27s_personal_memoirs",
  "/wiki/Lost_Tribe_of_the_Sith:_Skyborn",
  "/wiki/2009",
  "/wiki/EBook",
  "/wiki/John_Jackson_Miller",
  "/wiki/Star_Wars",
  "/wiki/Canon",
  "/wiki/Lost_Tribe_of_the_Sith:_Savior",
  "/wiki/Lost_Tribe_of_the_Sith:_Pandemonium"
 ]
}