{
 "name": "Zheepho",
 "display_name": "Zheepho",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Rodian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Republic",
      "Grand Army of the Republic",
      "Grand Army of the Republic"
     ]
    }
   ]
  }
 ],
 "content": "Zheepho was a male Rodian lieutenant who served in the Grand Army of the Republic during the Clone Wars' Battle of Drongar in the year 20 BBY. During the battle, Zheepho was struck by smashbone fever, a chronic disease that threatened to kill him. However, the Jedi Padawan Barriss Offee injected the Rodian with extract from the bota plant, which saved his life.\nZheepho was a male Rodian who served in the Grand Army of the Republic as a lieutenant during the Clone Wars. He had a chronic disease, smashbone fever, that had been latent for years by 20 BBY. In that year, Zheepho was stationed on the planet Drongar while the Republic fought against the troops of the Confederacy of Independent Systems. During his time on the planet, Zeepho suffered a sudden relapse of his disease, leaving him near death. Jedi Padawan Barriss Offee used the extract of bota—a plant native to Drongar—to treat his condition. Zheepho recovered just two minutes after the bota was injected into him, and he thanked Offee for her efforts.\nZheepho was desperate when he was struck by the smashbone fever on Drongar. Although ill, the Rodian apologized for not getting up when Offee began to talk to him. When Offee told him that she was not entirely sure what effects the bota would have on Rodian anatomy, he told her to use it on him anyway and suggested that he would even take poison if she gave it to him. Zheepho was very optimistic despite his illness and believed he could hold still long enough for Offee to inject him with the bota. He later showed his manners when he thanked the Jedi healer after she cured him.\nZheepho appeared in MedStar II: Jedi Healer, the second novel of the MedStar Duology. Jedi Healer was written by Michael Reaves and Steve Perry, and published in 2004.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Rodian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Grand_Army_of_the_Republic/Legends",
  "/wiki/Lieutenant/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Battle_of_Drongar",
  "/wiki/Standard_year/Legends",
  "/wiki/20_BBY/Legends",
  "/wiki/Smashbone_fever",
  "/wiki/Death/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Barriss_Offee/Legends",
  "/wiki/Bota",
  "/wiki/Plant/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Drongar/Legends",
  "/wiki/Trooper/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Time/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Standard_minute/Legends",
  "/wiki/Poison/Legends",
  "/wiki/Jedi_healer/Legends",
  "/wiki/MedStar_II:_Jedi_Healer",
  "/wiki/MedStar_Duology",
  "/wiki/Michael_Reaves",
  "/wiki/Steve_Perry",
  "/wiki/2004",
  "/wiki/The_New_Essential_Chronology"
 ]
}