{
 "name": "Zheela",
 "display_name": "Zheela",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Blue"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Uprising"
     ]
    }
   ]
  }
 ],
 "content": "Zheela was a Rutian Twi'lek female who lived during the reign of the Galactic Empire. Developing an affinity for working with droids, the Twi'lek eventually became a specialist in the field, overcoming her inability to speak by programming her robotic allies to recognize and obey hundreds of subtle gestures. Zheela also acquired experience as a soldier, making use of her technical skills and proficiency in stealth tactics to notable effect.\nBy the time of the second Death Star's destruction over Endor, Zheela was living in the galaxy's Anoat sector, where she found herself trapped behind the so-called \"Iron Blockade,\" enacted by Imperial Governor Ubrik Adelhard in order to lock down the sector and keep out news of the Emperor's death. Amidst a period of rebellious unrest that followed the blockade's institution, the Twi'lek came into contact with an up-and-coming young smuggler from the planet Burnin Konn. Zheela joined the smuggler's crew, offering her technical and covert expertise, carrying out a number of jobs on behalf of her new employer.\nZheela first appeared in Star Wars canon in the multiplayer mobile game Star Wars: Uprising, created by the Kabam company and released on September 10, 2015 for iOS and Android platforms. Within the scope of the game, Zheela acts as a potential crewmate for the player character, able to be tasked with carrying out timed quests to recover valuable experience points and loot.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Twi%27lek",
  "/wiki/Rutian",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Uprising",
  "/wiki/Imperial_Era",
  "/wiki/Galactic_Empire",
  "/wiki/Droid",
  "/wiki/Sign_language",
  "/wiki/Soldier",
  "/wiki/Slicer",
  "/wiki/Time",
  "/wiki/DS-2_Death_Star_II_Mobile_Battle_Station",
  "/wiki/Battle_of_Endor",
  "/wiki/Endor",
  "/wiki/The_galaxy",
  "/wiki/Anoat_sector",
  "/wiki/Iron_Blockade",
  "/wiki/Governor",
  "/wiki/Ubrik_Adelhard",
  "/wiki/Sector",
  "/wiki/Darth_Sidious",
  "/wiki/Death",
  "/wiki/Blockade",
  "/wiki/The_Smuggler",
  "/wiki/Planet",
  "/wiki/Burnin_Konn",
  "/wiki/Smuggler",
  "/wiki/Star_Wars",
  "/wiki/Video_game",
  "/wiki/Star_Wars:_Uprising",
  "/wiki/Kabam",
  "/wiki/September_10",
  "/wiki/2015",
  "/wiki/IPhone",
  "/wiki/Android_(operating_system)"
 ]
}