{
 "name": "Zhen_Mirat",
 "display_name": "Zhen Mirat",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Tatooine"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Unknown albino"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.75 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "White"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Pink"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "The Fatal Visionaries"
     ]
    }
   ]
  }
 ],
 "content": "Zhen Mirat was an albino, with parchment-white skin, close-cropped white hair, and pink eyes. He was slight of build and had slender fingers, and dressed in tailored white pants and jackets.\nHe was born on the planet Tatooine to a family of moisture farmers, and grew up lonely and bitter. His physical differences made the heat from the planet's twin suns unbearable, which often kept him indoors and away from his siblings. At first he started to study books, but then started to focus his studies inwards and discovered that he could access the Force with ease. He chose to walk the darker path, often taking joy in bending the wills of those around him.\nEventually, however, he tired of this reclusive life and set out to see the galaxy, severing all ties with his family and friends, and using his fledgling powers to secure passage on a freighter stopped at the Mos Eisley spaceport. After this he traveled through space for some time, studying others and how they lived and often dabbling in various livelihoods.\nAfter some time and thought, Mirat decided that the violent, anti-social lifestyle of a pirate suited him best. He gathered a group of hand-picked operatives, including Chanchaz Iryt on Bespin, Huggtar on Ryloth as well as the assassin droid, X, whom he snatched up from the black market almost as soon as he was put on it, then secured a ship by kidnapping the wife and child of Vazan Felix. Once he had kidnapped them, he approached Vazan and held his family ransom for the Tine's Future, Vazans ship, which he then renamed The Fatal Vision. Zhen had no intention of giving Vazan his family back, however, and instead used them as leverage to gain Felix's help.\nDespite his cultured and enigmatic demeanor, Zhen was a ruthless and sadistic man who was often prone to fits of violence. When in battle, he enjoyed picking on a weaker target and toying with him, especially if the target was in a position of authority.\nMirat and his group were eventually approached by the Empire, whom offered them access to restricted technology in order to get them to attack only Rebel and smuggler craft, as well as the occasional free-trader. Eventually, a minor Jedi in the services of the Rebellion was approached by Vazan so that he could free his family. The Jedi soon gathered together a group of rebels who found and freed Vazan's family from the cave they were hidden in, deep within the deserts on Tatooine. Unfortunately, when the group contacted Vazan to inform him that his family was free, he didn't believe them as he had asked the Jedi to erase his short term memory so that Mirat could not learn of the plan through the Force.\nBecause of this, the group then had to free Vazan from Mirat's clutches also. Mirat was not happy with this, and so he and his group fought the rebels to keep both Vazan and his ship. When the rebels informed Huggtar that Vazan was being forced to comply with Mirat's wishes, the Gamorrean switched sides and Mirat and his group were all killed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Lucas_Licensing",
  "/wiki/Lucasfilm_Ltd.",
  "/wiki/Tatooine/Legends",
  "/wiki/Albino",
  "/wiki/Gender/Legends",
  "/wiki/The_Fatal_Visionaries",
  "/wiki/Eye/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Moisture_farm/Legends",
  "/wiki/Star/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Freighter/Legends",
  "/wiki/Mos_Eisley/Legends",
  "/wiki/Spaceport/Legends",
  "/wiki/Pirate/Legends",
  "/wiki/Chanchaz_Iryt",
  "/wiki/Bespin/Legends",
  "/wiki/Huggtar",
  "/wiki/Ryloth/Legends",
  "/wiki/Assassin_droid/Legends",
  "/wiki/X_(droid)",
  "/wiki/Black_market/Legends",
  "/wiki/Vazan_Felix",
  "/wiki/The_Fatal_Vision",
  "/wiki/Galactic_Empire/Legends",
  "/wiki/Alliance_to_Restore_the_Republic/Legends",
  "/wiki/Smuggler/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Gamorrean/Legends",
  "/wiki/Polyhedron",
  "/wiki/Iron_Hands,_Captive_Hearts",
  "/wiki/Polyhedron_68"
 ]
}