{
 "name": "Zhios",
 "display_name": "Zhios",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic Empire",
      "Imperial Navy",
      "Imperial Navy"
     ]
    }
   ]
  }
 ],
 "content": "Zhios was an Imperial Navy Trooper serving aboard the Imperial-class Star Destroyer Herald. During Captain Tabor Seitaron's time on the ship, he gained respect for Zhios and another Navy trooper called Cantompa. Tabor brought them to arrest Everi Chalis when she tried to escape the fighting of the Siege of Inyusu Tor on Sullust. But Chalis had rigged her shuttle with about twenty ion bombs and soon set them off creating a power surge in the Star Destroyer. Tabor tried ordering the Star Destroyer to flee to safety before it plummeted to the ground but all electrical equipment around them was disabled so he told Zhios and Cantompa to send the orders to the bridge themselves. The two troopers ran to be immediately stopped by the disabled door so they ripped out the panel to try and override the controls.\nThey eventually made a gap in the door small enough for one of them to slip through but Prelate Verge, the man in charge of the ship and Tabor, told them to stop and that they cannot withdraw. Tabor tried to argue back but Verge contradicted him. Chalis then attacked Verge and they began fighting. Zhios and Cantompa watch, confused about what they should do. Tabor then got his Merr-Sonn B22 pistol out and fired at them. The shot killed Verge, and Tabor ordered Zhios and Cantompa to send his orders to the bridge. The Herald escaped the battle, allowing the 61st Mobile Infantry and Sullustan resistance to take the planet. Chalis escaped and Tabor returned to retirement.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Galactic_Empire",
  "/wiki/Imperial_Navy",
  "/wiki/Imperial_Navy_Trooper",
  "/wiki/Imperial-class_Star_Destroyer",
  "/wiki/Herald",
  "/wiki/Captain",
  "/wiki/Tabor_Seitaron",
  "/wiki/Cantompa",
  "/wiki/Everi_Chalis",
  "/wiki/Siege_of_Inyusu_Tor",
  "/wiki/Sullust",
  "/wiki/Ion_bomb",
  "/wiki/Prelate",
  "/wiki/Verge",
  "/wiki/Merr-Sonn_Munitions,_Inc.",
  "/wiki/B22",
  "/wiki/Pistol",
  "/wiki/61st_Mobile_Infantry",
  "/wiki/Sullustan_resistance",
  "/wiki/Battlefront:_Twilight_Company",
  "/wiki/Battlefront:_Twilight_Company_(audiobook)"
 ]
}