{
 "name": "Zho_Rasi_Tuum",
 "display_name": "Zho Rasi Tuum",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Cathar"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "New Jedi Order"
     ]
    }
   ]
  }
 ],
 "content": "The Cathar male Zho, a member of the Rasi Tuum family, was a Jedi of the New Jedi Order around the time of the Sith–Imperial War. He was born years before into a litter with two other Cathar males, Ahn and another known only as Rasi Tuum. All three survived a joint massacre of the Jedi by the One Sith in 130 ABY, but their Order became scattered across the galaxy, and Ahn was slain by Sith agents seven years later during the Second Imperial Civil War. After making his way with Rasi Tuum to a Hidden Jedi Temple on the planet Taivas, Zho set out into the galaxy to find other surviving Jedi.\nZho was a male Cathar of the Rasi Tuum family. He was born years before 130 ABY into a litter that also included his brother Ahn, and another brother who was known only by their family name, Rasi Tuum. The three littermates were all sensitive to the Force, and they joined the New Jedi Order prior to 130 ABY. Around that year, Zho had long hair that fell past his shoulders and a short beard. He was similar in appearance to his brothers.\nIn 130 ABY, during the Sith–Imperial War, the One Sith order scattered the Jedi across the galaxy by attacking their Jedi Temples on the planets Coruscant and Ossus. The three Rasi Tuums were among the survivors of the massacre, but the Sith spent the next seven years actively hunting Jedi down. Although Ahn was killed by Sith agents in 137 ABY in the middle of the Second Imperial Civil War, Zho and Rasi Tuum were able to find refuge at a Hidden Jedi Temple on the planet Taivas. Several months after Ahn's death, Zho was traveling the galaxy and searching for other surviving Jedi to bring to the safety of the temple.\nAlong with his brothers Ahn and Rasi Tuum, Zho was created by John Ostrander and Jan Duursema for the comic series Star Wars: Legacy. In June 2006, an image of the three Cathar that was simply labeled \"Rasi Tuum\" appeared in Legacy  0, a special preview of the series that was published prior to the release of the first issue. One of the Rasi Tuums appeared and was killed in the second issue, and the character was only revealed to be Ahn two years later in Issue 25, which was also the first source to explicitly mention Zho. The issue established \"Rasi Tuum\" as Zho's family name, but so far, no source has indicated the order in which his family and given names should be placed.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Yuuzhan_Vong",
  "/wiki/Supreme_Commander_(Yuuzhan_Vong_rank)",
  "/wiki/Zho_Krazhmir",
  "/wiki/Cathar/Legends",
  "/wiki/Gender/Legends",
  "/wiki/New_Jedi_Order",
  "/wiki/Azlyn_Rae",
  "/wiki/Rasi_Tuum_family",
  "/wiki/Jedi/Legends",
  "/wiki/Time/Legends",
  "/wiki/Sith%E2%80%93Imperial_War",
  "/wiki/Reproduction/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Litter_(biology)",
  "/wiki/Ahn_Rasi_Tuum",
  "/wiki/Rasi_Tuum",
  "/wiki/Battle_of_Coruscant_(Sith%E2%80%93Imperial_War)",
  "/wiki/Massacre_at_Ossus",
  "/wiki/One_Sith",
  "/wiki/130_ABY",
  "/wiki/The_galaxy/Legends",
  "/wiki/Ambush_on_Daluuj",
  "/wiki/Sith/Legends",
  "/wiki/137_ABY",
  "/wiki/Second_Imperial_Civil_War",
  "/wiki/Hidden_Temple_(Sith%E2%80%93Imperial_War)",
  "/wiki/Planet/Legends",
  "/wiki/Taivas",
  "/wiki/Galaxy/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Hair/Legends",
  "/wiki/New_Jedi_Temple",
  "/wiki/Jedi_Academy_(Ossus)",
  "/wiki/Coruscant/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/Third_Jedi_Purge",
  "/wiki/Standard_month/Legends",
  "/wiki/Death/Legends",
  "/wiki/John_Ostrander",
  "/wiki/Jan_Duursema",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Star_Wars:_Legacy",
  "/wiki/June",
  "/wiki/2006",
  "/wiki/Legacy_(2006)_0",
  "/wiki/Legacy_(2006)_1",
  "/wiki/Legacy_(2006)_2",
  "/wiki/2008",
  "/wiki/Legacy_(2006)_25",
  "/wiki/Legacy_Era_Campaign_Guide"
 ]
}