{
 "name": "Zill_Kartay",
 "display_name": "Zill Kartay",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Neimoidian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "Between 1.75 and 1.91 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Red"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Pale yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Trade Federation",
      "Trade Federation Occupation Council",
      "Trade Federation Occupation Council"
     ]
    }
   ]
  }
 ],
 "content": "Zill Kartay was a male Neimoidian consul of the Trade Federation. In 32 BBY, when the Federation successfully invaded the planet Naboo, he was appointed to the Occupation Council overseeing the planet and took up residence in the planetary capital of Theed. Following the liberation of Naboo by its Human and Gungan inhabitants, Kartay and the remainder of the council were arrested and sent to Coruscant, the seat of the Galactic Republic, to face justice.\nZill Kartay was a male of the Neimoidian species who lived during the rule of Supreme Chancellor Finis Valorum in the last decades of the Galactic Republic. He worked in the Trade Federation, a labyrinthine organization of trade officials and associated bureaucrats. As a Federation consul, he was entrusted with ambassadorial duties on one of the Federation's member worlds or territories. In 32 BBY, the Trade Federation invaded the backwater planet of Naboo by order of Darth Sidious, a mysterious Dark Lord of the Sith. On that occasion, Consul Kartay accompanied the Viceroy Nute Gunray to Naboo's capital city of Theed, where he took a seat in the so-called Occupation Council. In addition to Gunray and his aide, the Settlement Officer Rune Haako, Kartay's colleagues on the council were Magistrate Kund Ekorr, Treasurer Hap Brehg and Chronicler Viff Almay.\nWhile the Occupation Council discussed their options in the Theed Royal Palace, the Human and Gungan inhabitants of Naboo decided to set aside their quarrels and to work together to take their planet back. When a battle was expected to take place in the neighboring Great Grass Plains, Kartay and the other councilors remained in the relative seclusion of the Theed palace throne room, believing they would be safe there. After a fierce struggle both on the ground and in space, the revolting locals destroyed the Federation's droid army, while an elite group led by Queen Amidala, the legitimate sovereign of Naboo, infiltrated the palace to capture the Neimoidian dignitaries. In the wake of the battle, Kartay was arrested by Captain Panaka of the Royal Naboo Security Forces, alongside his fellow councilors Ekorr and Brehg. Subsequently, he and his colleagues were all shipped as prisoners to the Republic capital of Coruscant to await trial.\nZill Kartay was a red-eyed Neimoidian who stood between 1.75 and 1.91 meters tall. His pale, yellowish skin was mottled, a common trait among high-ranking Neimoidians who had an overly self-indulgent lifestyle. He wore a set of subdued purple-gray robes and a simple cap made of black material that revealed his high, hairless forehead.\nZill Kartay appeared as a nameless background character in the movie Star Wars: Episode I The Phantom Menace, which was released on May 19, 1999. However, since the members of the Occupation Council made a collective appearance in the Terry Brooks's movie novelization, which was published a month earlier, Kartay's actual first appearance can be dated to April 21 of the same year. In 2014, the character's name was revealed in Rogues Gallery: The Devious Neimoidians Revealed, an article written by Tim Veekhoven, Kevin Beentjes and Sander de Lange for the 147th issue of the Star Wars Insider magazine. Kartay was named after the Neimoidian fan Lizzi Kartay-Dod, known as Kweh-chan on the online Star Wars encyclopedia Wookieepedia.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Neimoidian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Imperial_standard_meter",
  "/wiki/Color/Legends",
  "/wiki/Trade_Federation_of_Planets",
  "/wiki/Trade_Federation_Occupation_Council",
  "/wiki/Consul/Legends",
  "/wiki/32_BBY/Legends",
  "/wiki/Invasion_of_Naboo/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Naboo/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Theed/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gungan/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Species/Legends",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Finis_Valorum/Legends",
  "/wiki/Standard_decade/Legends",
  "/wiki/Ambassador/Legends",
  "/wiki/Palpatine/Legends",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Trade_Federation_Viceroy",
  "/wiki/Nute_Gunray/Legends",
  "/wiki/City/Legends",
  "/wiki/Aide/Legends",
  "/wiki/Settlement_Officer/Legends",
  "/wiki/Rune_Haako/Legends",
  "/wiki/Magistrate/Legends",
  "/wiki/Kund_Ekorr",
  "/wiki/Treasurer",
  "/wiki/Hap_Brehg",
  "/wiki/Chronicler",
  "/wiki/Viff_Almay",
  "/wiki/Theed_Royal_Palace/Legends",
  "/wiki/Great_Grass_Plains/Legends",
  "/wiki/Palace",
  "/wiki/Throne_room_(Theed_Royal_Palace)/Legends",
  "/wiki/Battle_of_Naboo/Legends",
  "/wiki/Ground_warfare",
  "/wiki/Space_warfare",
  "/wiki/Trade_Federation_Droid_Army/Legends",
  "/wiki/Monarch_of_Naboo/Legends",
  "/wiki/Padm%C3%A9_Amidala/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Quarsh_Panaka/Legends",
  "/wiki/Royal_Naboo_Security_Forces/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Robe/Legends",
  "/wiki/Hair/Legends",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace",
  "/wiki/May_19",
  "/wiki/1999",
  "/wiki/Terry_Brooks",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(novelization)",
  "/wiki/April_21",
  "/wiki/2014",
  "/wiki/Rogues_Gallery_(Star_Wars_Insider)",
  "/wiki/Tim_Veekhoven",
  "/wiki/Kevin_Beentjes",
  "/wiki/Sander_de_Lange",
  "/wiki/Star_Wars_Insider_147",
  "/wiki/Star_Wars_Insider",
  "/wiki/User:Kweh-chan",
  "/wiki/Star_Wars",
  "/wiki/Wookieepedia",
  "/wiki/Star_Wars:_Episode_I_The_Phantom_Menace_(unabridged_audiobook)",
  "/wiki/StarWars.com",
  "/wiki/Star_Wars:_Episode_I_Insider%27s_Guide",
  "/wiki/The_New_Essential_Guide_to_Characters",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Darth_Maul/Legends",
  "/wiki/Star_Wars:_Episode_I_The_Visual_Dictionary",
  "/wiki/January_19",
  "/wiki/File:NeimoidiansFacebook.pdf",
  "/wiki/The_New_Essential_Chronology"
 ]
}