{
 "name": "Zinny",
 "display_name": "Zinny",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Twi'lek"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Zinny was a female Twi'lek who worked as a bounty hunter during the Cold War between the Galactic Republic and the Sith Empire. During the war she worked on the planet Nal Hutta with a Human named Xenteel. The pair worked out of an industrial town named Jiguuna where provided training and supplies for other bounty hunters and had a stall set up in the town's market area. Xenteel directed a bounty hunter who was hoping to take part in the Great Hunt to Zinny for training during their time on Hutta. Zinny ultimately taught a number of tricks to the hunter.\nZinny was a female Twi'lek who lived during the Cold War between the Galactic Republic and the Sith Empire. By the year 3643 BBY she had taken up a career as a bounty hunter and had become talented enough at the job to teach others in the art of bounty hunting. The Twi'lek teamed up with a Human named Xenteel and the pair began a business of training and supplying other bounty hunters, using their own experience. Zinny and her partner set up a stall for their business and an area to test weapons both on the planet Nal Hutta, the adopted homeworld of the Hutt species. The stall and was in the market area of an industrial town named Jiguuna, which was controlled by a Hutt crime lord named Suudaa Nem'ro. Whilst at her stall Zinny often watched holograms of various individuals using a small device capable of projecting a life size hologram of the humans on to the ground in front of the bounty hunter. The individuals spoke during the duration of the projection, although Zinny did not reply to them.\nIn the same year, a bounty hunter was directed to Zinny by Xenteel. Her partner had recognized the individual as an affiliate of another bounty hunter named Braden, whilst in the Poison Pit cantina. Zinny taught the hunter, who hoped to compete in the galactic bounty hunting contest known as the Great Hunt, a number of bounty hunting tricks and skills for a small fee.\nZinny was considered an experienced bounty hunter during the time of the Cold War and knew enough about tricks, weapons and maneuvers to be able to teach others members of the profession. She charged a fee of credits to those she taught and often claimed that with what she taught them they would be far more successful. Zinny had green skin and brown eyes.\nWhilst waiting at her stall for customers Zinny wore grey-colored armor and a brown headpiece. Her gear included a device that could project a green holographic screen on her right wrist and a wrist-mounted flamethrower on her left wrist, which she occasionally tested. She wore a blaster pistol on her belt and kept a blaster rifle and a tool kit at the stall whilst she was there. The Twi'lek also possessed a device a floating capable of projecting a holographic image of a life size Human.\nZinny first appeared in the video game Star Wars: The Old Republic which was released by BioWare in 2011. In the game Zinny is located on Nal Hutta which is the starting planet for players of the bounty hunter and Imperial Agent class. Her role within the game is that of a class trainer for players of the bounty hunter class and she will teach them new usable skills, with what skills are available being dependent on the player's level. She is also involved in the quest \"Tools of the Trade\" in which bounty hunters are directed to Zinny to learn their first class skills. Although not identified by name, Zinny's location as a class trainer in Jiguuna is marked on the Nal Hutta map in Star Wars: The Old Republic Explorer's Guide a book released at the same time as the game.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Twi%27lek/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Cold_War_(Galactic_Republic%E2%80%93Sith_Empire)",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Planet/Legends",
  "/wiki/Nal_Hutta/Legends",
  "/wiki/Human/Legends",
  "/wiki/Xenteel",
  "/wiki/Jiguuna",
  "/wiki/Hunter_(individual)",
  "/wiki/Great_Hunt_(competition)",
  "/wiki/Standard_year/Legends",
  "/wiki/3643_BBY",
  "/wiki/Homeworld/Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Species/Legends",
  "/wiki/Crime_lord/Legends",
  "/wiki/Suudaa_Nem%27ro",
  "/wiki/Hologram/Legends",
  "/wiki/Canon",
  "/wiki/Braden",
  "/wiki/Poison_Pit",
  "/wiki/Cantina/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Eye/Legends",
  "/wiki/Armor/Legends",
  "/wiki/Blaster_pistol/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/2011",
  "/wiki/Imperial_Agent",
  "/wiki/Star_Wars:_The_Old_Republic_Explorer%27s_Guide",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/3653_BBY",
  "/wiki/Star_Wars:_The_Old_Republic_Encyclopedia",
  "/wiki/The_Old_Republic%E2%80%94The_Lost_Suns_2",
  "/wiki/Standard_week/Legends",
  "/wiki/Mission_to_Nar_Shaddaa_(Desolator_crisis)",
  "/wiki/Time/Legends",
  "/wiki/SpecForce_Incident",
  "/wiki/Hero_of_Tython",
  "/wiki/Meteor_(Havoc_Squad)",
  "/wiki/Voidhound"
 ]
}