{
 "name": "Zirchros%27s_father",
 "display_name": "Zirchros's father",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    }
   ]
  }
 ],
 "content": "A Hutt was living during the days of the Galactic Republic. Around the year 5341 BBY, he became the father of Zirchros, who went on to become a crime lord. The Hutt had formed a large collection of artifacts from an extinct civilization, which his son came into the possession of sometime before the year 3641 BBY.\nA Hutt who was living in the galaxy during the time of the Galactic Republic became the father of a Hutt named Zirchros around the year 5341 BBY. Although he was a member of a species of hermaphrodites, Zirchros's father possessed a male personality. At some point in his life, the Hutt had obtained a large collection of cultural artifacts from a civilization that had been extinct for some time by 3641 BBY. By this year, the Hutt's son had become a crime lord and had obtained the collection of artifacts.\nHowever, at that time, Zirchros was dying and he told an individual about his father's collection. The individual found the Hutt's artifacts and brought them to an ally.\nZirchros's father was first mentioned in Star Wars: The Old Republic, a 2011 MMORPG released by BioWare. He was mentioned in the archaeology crew skill mission entitled \"Memoirs of a Crimelord\" which was available for players of both the Sith Empire and Republic factions. In a crew skill mission, the player would send one of their companions to complete the mission, but due to the mission being available to all classes it was unknown who met with the Hutt's son. As a reward for the mission, the player received some lost artifact fragments.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Hutt/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/5341_BBY",
  "/wiki/Zirchros",
  "/wiki/Crime_lord/Legends",
  "/wiki/Unidentified_civilization_(Zirchros)",
  "/wiki/3641_BBY",
  "/wiki/The_galaxy/Legends",
  "/wiki/Time/Legends",
  "/wiki/Species/Legends",
  "/wiki/Canon",
  "/wiki/Death/Legends",
  "/wiki/Star_Wars:_The_Old_Republic",
  "/wiki/2011",
  "/wiki/Video_game",
  "/wiki/BioWare",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/The_New_Essential_Guide_to_Alien_Species"
 ]
}