{
 "name": "Ziro_Desilijic_Tiure",
 "display_name": "Ziro Desilijic Tiure",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Sleheyron",
      "Coruscant"
     ]
    },
    {
     "name": "Died",
     "values": [
      "21 BBY",
      "Teth"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Hutt"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "3.9 meters  long"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Purple"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Kajidic",
     "values": [
      "Desilijic"
     ]
    },
    {
     "name": "Affiliation(s)",
     "values": [
      "Hutt Clan",
      "Ziro the Hutt's criminal organization",
      "Ziro the Hutt's criminal organization",
      "Black Sun",
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Ziro Desilijic Tiure, also known as Ziro the Hutt, was a Hutt male crime lord who, with the title of Master of the Hutt Clan, controlled seven star systems in the name of the Hutt Clan during the decline of the Galactic Republic. A native of the planet Sleheyron, Ziro eventually left Hutt Space in favor of the galaxy's Core Worlds and established his residence on Coruscant, the galactic capital of the Republic. In addition to his father and mother, Ziro's family included his son Hiro and Jabba Desilijic Tiure, his nephew who fathered the Huttlet heir Rotta. Gorga Desilijic Aarrpo was another influential relative of Ziro, serving as a member of the Grand Hutt Council.\nIn the year 22 BBY, Ziro formed a secret pact with Count Dooku—the leader of the Confederacy of Independent Systems—during the early days of the Clone Wars. With the help of the Separatists, Ziro had his great-nephew Rotta abducted and taken to a B'omarr monastery on the distant world of Teth. Knowing the Jedi Order would send their own to rescue the Huttlet, Ziro hoped that the deaths of Rotta's would-be Jedi saviors would lead to a conflict between Jabba and the Republic. With Jabba removed from power, Ziro would be in a position to seize control of their clan.\nZiro's role in the conspiracy was discovered by Senator Padmé Amidala, who confronted the gangster in his nightclub on Coruscant during the mission to rescue Rotta. With Rotta safely returned to his father on Tatooine, Ziro was taken into custody by the Coruscant Guard. However, as the war progressed, the Grand Hutt Council regarded Ziro as too dangerous to be left in a Republic prison, given his knowledge of their inner workings. As a result, the Hutts recruited the bounty hunter Cad Bane, who freed Ziro and turned him over to the Hutt Council. Although Ziro escaped the Hutts as well, he was ultimately murdered in 21 BBY by the Pa'lowick singer Sy Snootles, Ziro's one-time lover whom Jabba hired to kill his uncle and retrieve the Hutt Council records.\nAt some point, Ziro was born to Mama and Papa. He had two siblings, Jabba Desilijic Tiure's father and another brother, Ebor. During his life, he had an affair with Sy Snootles, one of his nephew Jabba's dancers. However, Ziro ended the affair and went to Coruscant. From his nightclub, Ziro controlled his criminal organization. At some point, Ziro had a son named Hiro. Eventually, Ziro earned the title of Master of the Hutt Clan for seven separate star systems.\nDuring the Clone Wars, Ziro made a deal with Separatist leader Count Dooku; Dooku's assassin, Asajj Ventress, would kidnap his nephew Jabba's son, Rotta. However, Ziro then learned from Naboo Senator Padmé Amidala that the Jedi had rescued Jabba's son. Fearing that his role would be discovered, Ziro contacted Dooku, informing him of Amidala's investigation. Dooku assured Ziro that Jabba believed him about the Jedi killing his son. Knowing Jabba would execute the Jedi responsible for killing his son, Dooku assured Ziro that he would become master of all the Hutt Clans when the Jedi would bring Jabba to justice. Ziro was then ordered by Dooku to eliminate Amidala if she continued investigating.\nZiro and his IG-86 sentinel droids then found Amidala. When Dooku realized that it was Amidala, he told Ziro that his allies would pay him for delivering Amidala to him. Ziro, agreeing to the deal, had Amidala placed in his dungeon and thanked Dooku for the profitable alliance. However, Ziro learned that Amidala had contacted her protocol droid, C-3PO, for help. Thus, he decided to execute Amidala, knowing his powerful friends in the Republic Senate would protect him. Ziro and droids were then attacked by Commander Fox and his detachment of the Coruscant Guard that 3PO called. Ziro was then held at gunpoint by Amidala. Ziro tried to plead innocence to no avail to Amidala. Ziro contacted Jabba on Tatooine, and Amidala informed Jabba that Ziro was behind Rotta's kidnapping. Ziro also confessed that Dooku also helped in the kidnapping. Jabba vowed that Ziro would be severely punished.\nZiro was imprisoned in the Judiciary Central Detention Center. Desiring revenge on Amidala, Ziro was able to hire bounty hunter Aurra Sing to kill her as revenge for foiling his plot with the Separatists. Sing followed the Naboo Senator to Alderaan, and awaited her speech to fellow senators regarding the refugee crisis that has plagued the galaxy following the outbreak of the Clone Wars. There she attempted to assassinate the senator on two separate occasions, but was foiled by Ahsoka Tano who had been experiencing premonitions of the assassination attempts.\nSing was then remanded in custody on Coruscant, with Padawan Ahsoka Tano, Amidala, and Bail Organa also present to deliver the assassin to Republic authorities represented by Grand Master Yoda and Jedi Knight Anakin Skywalker. However, Ahsoka had a further vision that she thought pictured the Hutt gangster, leading Amidala to confirm the Padawan's thoughts that Ziro was behind the assassination attempts.\nAnakin and Ahsoka then traveled to the Republic prison complex to interrogate the Hutt, when Ziro inadvertently confirmed that he had hired Sing to complete the job. Ziro was left fuming after giving himself away, vowing to take revenge on the Jedi and the senator. When Sing failed, Ziro spoke with Skywalker and Tano. When Tano told Ziro that Sing revealed that he paid her, Ziro confessed to hiring her. However, Tano tricked him and his sentence was increased.\nDuring this time, Jabba and the Hutt Council knew that it was only a matter of time before Ziro would give the Republic Senate the Council's records. Thus, the council decided to hire Cad Bane to free Ziro. Bane and his team were able to hold several members of the Republic Senate hostage, forcing Chancellor Palpatine to release Ziro, who was brought out when Senator Orn Free Taa arrived to give the Detention Center's guards a pardon disc. Ziro then boarded HELIOS-3D's speeder and was taken to the Galactic Senate Building despite his objections. HELIOS-3D and Ziro then picked up Bane's team. After Bane and his group boarded the speeder, Ziro told Bane about his captivity in the detention center and approved of Bane killing off the senators. Ziro congratulated Bane on freeing him, but Bane reminded him that he expected to be paid.\nZiro was taken to Nal Hutta where he spoke with Gardulla and the Hutt Council. Despite thanking them for his escape from Republic captivity, Ziro knew they did not want him to reveal the location of the Council's records. He threatened to have the records dropped off at the Republic senate should he be killed. Thus, the Council kept Ziro locked up in a prison cell. Ziro was able to escape with help from Snootles. Ziro and Snootles were able to make their escape by stealing a speeder and went to Mama's house. Ziro was able to convince his mother to give Ziro her ship in order to go to Teth.\nOn Teth, Ziro went to his father's grave, where the council records were hidden. However, Snootles had secretly been hired by Jabba to retrieve the records. Snootles then shot Ziro through the chest and left his body to be found by both the Jedi and Bane.\nIn 19 BBY, before Quinlan Vos was sent to assassinate Dooku, Obi-Wan Kenobi reflected that the last time they were paired together was for the failed mission to track down Ziro, recalling that they were never able to discover who Ziro's murderer was.\nZiro was a large, purple male Hutt with emerald green eyes. His body was covered in glow-in-the dark cosmetics and there was an tattoo of a sun printed on his belly. Before his arrest, Ziro wore a feathered hat and several rings on his fingers.\nEven though Ziro understood his native Huttese, Ziro spoke fluent Basic with a high-pitched voice and slight lisp. Like many Hutts, he was greedy and was determined to gain control of the Hutt criminal empire by any means, even if it meant blackmailing his relatives. He was also quite fashion-conscious and very flamboyant for a Hutt. Ziro held grudges, wanting to get revenge on Senator Padmé Amidala for exposing his allegiance to the Separatists where he hired bounty hunter Aurra Sing to assassinate her.\nZiro was very over-dramatic where upon being released from prison, he quickly complained about over his release not taking place at dusk after being exposed to sunlight for the first time. He even complained to Cad Bane about his time in prison and worried about recovering from his experiences. When his life was threatened, Ziro cowardly begged for mercy when clone shock troopers arrested him and again when his ex-girlfriend Sy Snootles held him at gunpoint before she murdered him and stole his holo-diary.\nZiro the Hutt first appeared in the 2008 Star Wars: The Clone Wars animated film, voiced by prolific voice actor Corey Burton. Burton went on to reprise the role in four more episodes of Star Wars: The Clone Wars.\nAlthough Ziro was the first Hutt to speak Galactic Basic Standard onscreen, this was not originally intended. Ziro was meant to speak Huttese into a microphone which would translate his speech into English, but this idea was dropped when the producers felt that younger audiences wouldn't understand what the translator was. Later, George Lucas stepped in and specifically asked for Ziro to sound like Truman Capote. Since the character was a favorite of the production team, they brought him back for further appearances in the subsequent The Clone Wars series.\nFollowing the release of The Clone Wars film, reviewers from some media outlets criticized Ziro as an anti-gay stereotype, with MTV News wondering whether that would make him the first gay alien in the Star Wars franchise. Interviewed by the network after the film premiered, Dave Filoni said that his continuity experts had told him that Ziro did not have a biological sex because he was a \"slug\"; therefore, Filoni framed the matter of Ziro's sexuality as \"questionable\" rather than answerable as straight or gay. Other outlets disputed the framing of Ziro's traits as offensive stereotypes, with Gizmodo instead regarding the character as \"pure weirdo campiness in a franchise known for being far too self-serious.\"\nAs of 2014, Filoni's remarks on Hutt biology no longer apply to Ziro and other Hutts. The species has separate sexes in the new canon continuity, according to statements by Lucasfilm Story Group's Pablo Hidalgo at Celebration Anaheim, unlike Hutts in Legends.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Ziro_Desilijic_Tiure",
  "/wiki/Ziro_Desilijic_Tiure/Legends",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Sleheyron",
  "/wiki/Coruscant",
  "/wiki/21_BBY",
  "/wiki/Teth",
  "/wiki/Hutt",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Tattoo",
  "/wiki/Desilijic",
  "/wiki/Hutt_Clan",
  "/wiki/Ziro_the_Hutt%27s_criminal_organization",
  "/wiki/Black_Sun",
  "/wiki/Confederacy_of_Independent_Systems",
  "/wiki/Crime_lord",
  "/wiki/Master_of_the_Hutt_Clan",
  "/wiki/Star_system",
  "/wiki/Republic_Era",
  "/wiki/Galactic_Republic",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/Hutt_Space",
  "/wiki/The_galaxy",
  "/wiki/Core_Worlds",
  "/wiki/Ziro%27s_Palace",
  "/wiki/Galaxy",
  "/wiki/Capital",
  "/wiki/Papa",
  "/wiki/Mama",
  "/wiki/Reproduction",
  "/wiki/Hiro",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Parent",
  "/wiki/Rotta",
  "/wiki/Gorga_Desilijic_Aarrpo",
  "/wiki/Grand_Hutt_Council",
  "/wiki/Standard_year",
  "/wiki/22_BBY",
  "/wiki/Count",
  "/wiki/Dooku",
  "/wiki/Head_of_State",
  "/wiki/Standard_day",
  "/wiki/Clone_Wars",
  "/wiki/B%27omarr_Order_Monastery",
  "/wiki/Wild_Space",
  "/wiki/Jedi_Order",
  "/wiki/Death",
  "/wiki/Jedi",
  "/wiki/Senator",
  "/wiki/Padm%C3%A9_Amidala",
  "/wiki/Battle_of_Teth",
  "/wiki/Tatooine",
  "/wiki/Coruscant_Guard",
  "/wiki/Prison",
  "/wiki/Bounty_hunter",
  "/wiki/Cad_Bane",
  "/wiki/Senate_hostage_crisis",
  "/wiki/Showdown_on_Teth",
  "/wiki/Musician",
  "/wiki/Sy_Snootles",
  "/wiki/Time",
  "/wiki/Hutt_Council_records",
  "/wiki/Jabba_Desilijic_Tiure%27s_father",
  "/wiki/Ebor",
  "/wiki/File:You%27llRegretThisZiro-TCWf.ogg",
  "/wiki/Asajj_Ventress",
  "/wiki/Naboo",
  "/wiki/IG-86_sentinel_droid",
  "/wiki/Protocol_droid",
  "/wiki/C-3PO",
  "/wiki/Galactic_Senate",
  "/wiki/CC-1010",
  "/wiki/Republic_Judiciary_Central_Detention_Center",
  "/wiki/Aurra_Sing",
  "/wiki/Padawan",
  "/wiki/Ahsoka_Tano",
  "/wiki/Grand_Master",
  "/wiki/Yoda",
  "/wiki/Jedi_Knight",
  "/wiki/Anakin_Skywalker",
  "/wiki/File:ZiroSuffered.ogg",
  "/wiki/Cad_Bane%27s_group",
  "/wiki/Orn_Free_Taa",
  "/wiki/Pardon_disc",
  "/wiki/HELIOS-3D",
  "/wiki/Galactic_Senate_Building",
  "/wiki/Nal_Hutta",
  "/wiki/Gardulla_Besadii_the_Elder",
  "/wiki/Pongeeta-class_speeder",
  "/wiki/Mama_the_Hutt%27s_house",
  "/wiki/19_BBY",
  "/wiki/Quinlan_Vos",
  "/wiki/Mission_to_Raxus_Secundus",
  "/wiki/Obi-Wan_Kenobi",
  "/wiki/Eye",
  "/wiki/Hat",
  "/wiki/Ring",
  "/wiki/Clone_shock_trooper",
  "/wiki/2008",
  "/wiki/Star_Wars:_The_Clone_Wars_(film)",
  "/wiki/Corey_Burton",
  "/wiki/Star_Wars:_The_Clone_Wars",
  "/wiki/Galactic_Basic_Standard",
  "/wiki/Huttese",
  "/wiki/George_Lucas",
  "/wiki/Star_Wars",
  "/wiki/Dave_Filoni",
  "/wiki/2014",
  "/wiki/Lucasfilm_Story_Group",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Celebration_Anaheim_(2015)",
  "/wiki/Star_Wars_Legends",
  "/wiki/Assassin_(episode)",
  "/wiki/Evil_Plans",
  "/wiki/Hostage_Crisis",
  "/wiki/Hunt_for_Ziro",
  "/wiki/Dangerous_Debt",
  "/wiki/Dark_Disciple",
  "/wiki/Dark_Disciple_(audiobook)",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Category:Audio_files_of_Ziro_Desilijic_Tiure",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_One",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Three",
  "/wiki/Star_Wars:_The_Clone_Wars_The_Complete_Season_Four",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_1",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars_Helmet_Collection_6",
  "/wiki/Star_Wars_Helmet_Collection_18",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_64",
  "/wiki/Starship_Fact_File",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_66",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_5",
  "/wiki/Droid_Directory",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars_Super_Graphic:_A_Visual_Guide_to_a_Galaxy_Far,_Far_Away",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know,_Updated_and_Expanded",
  "/wiki/Star_Wars_Adventures,_Volume_1:_Heroes_of_the_Galaxy",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_16",
  "/wiki/Star_Wars_Helmet_Collection_27",
  "/wiki/Star_Wars_Helmet_Collection_30",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_50",
  "/wiki/Star_Wars_Encyclopedia_of_Starfighters_and_Other_Vehicles",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars:_Women_of_the_Galaxy",
  "/wiki/Star_Wars:_Smuggler%27s_Guide",
  "/wiki/Star_Wars_Helmet_Collection_58",
  "/wiki/Star_Wars_Helmet_Collection_68",
  "/wiki/Star_Wars_Helmet_Collection_76",
  "/wiki/Rise_of_the_Separatists",
  "/wiki/Collapse_of_the_Republic",
  "/wiki/Star_Wars:_How_Not_to_Get_Eaten_by_Ewoks_and_Other_Galactic_Survival_Skills",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/C-3PO_(Star_Wars_Encyclopedia)",
  "/wiki/Star_Wars:_The_Clone_Wars:_Character_Encyclopedia_-_Join_the_Battle!",
  "/wiki/Jabba_the_Hutt_and_Other_Characters_of_the_Underworld",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars_Inside_Intel:_Quinlan_Vos",
  "/wiki/Star_Wars_Insider",
  "/wiki/Crime_and_Punishment",
  "/wiki/Star_Wars_Insider_209",
  "/wiki/Databank_(website)",
  "/wiki/ARC_Troopers",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Heroes_on_Both_Sides",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/%27ABY-BBY%27_dating_system",
  "/wiki/Star_Wars:_Galaxy%27s_Edge",
  "/wiki/Mission_to_Utapau",
  "/wiki/Second_Battle_of_Dathomir",
  "/wiki/August_12",
  "/wiki/August_3",
  "/wiki/2020",
  "/wiki/August_13",
  "/wiki/July_14",
  "/wiki/2021"
 ]
}