{
 "name": "Zo%27Tannath",
 "display_name": "Zo'Tannath",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    }
   ]
  }
 ],
 "content": "Zo'Tannath was a female Human bounty hunter who worked for the highest bidder.\nZo'Tannath kept most of her origins a mystery with few individuals ever seeing her face. She wore pieces of Ubese armor scavenged from an Ubese warrior she killed. Although proficient with a blaster carbine or grenades, Zo'Tannath's preferred weapon was the Force pike, with which she could easily subdue most opponents.\nZo'Tannath picked up most of her bounties from Boztrok starport, which she frequented. She was merciless in carrying out her hunts, taking special pleasure in \"dead-or-alive\" bounties. This ensured her plenty of assignments from ruthless individuals from the fringe. She often made use of their starships when tracking her prey, and on occasion hired Klatooinian mercenaries to aid her. She frequently used them to channel her prey into clever traps. Zo'Tannath never accepted any bargaining from her prey, remaining loyal to her employer despite offers of hefty bribes.\nOn one occasion, Zo'Tannath was hired by the Nimbanel Pok Nar-Ten to capture the smuggler Platt Okeefe, who had reneged on some ship payments. Zo'Tannath eventually tracked her down on the planet Wroona and easily disarmed her. Zo'Tannath then took her into custody, giving Okeefe's Gruvian Tovash as a gift to the Nimbanel. Okeefe was later sold into slavery.\nZo'Tannath's bio in Platt's Smugglers Guide does not identify her species, instead emphasizing her mysterious nature. Her Ubese armor is said to have been taken from one of her victims. However, the book also revealed Platt Okeefe's internal point of view, seeing Zo'Tannath as a human. This identification is complicated by the Ultimate Alien Anthology, which lists the name Zo'Tannath as common among Ubese. This article follows Okeefe's identification, although there is some ambiguity in the matter.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Bounty_hunter/Legends",
  "/wiki/Ubese_raider_armor",
  "/wiki/Ubese/Legends",
  "/wiki/Blaster_carbine/Legends",
  "/wiki/Grenade/Legends",
  "/wiki/Force_pike/Legends",
  "/wiki/Boztrok",
  "/wiki/Starship/Legends",
  "/wiki/Klatooinian/Legends",
  "/wiki/Mercenary/Legends",
  "/wiki/Nimbanel/Legends",
  "/wiki/Pok_Nar-Ten",
  "/wiki/Platt_Okeefe/Legends",
  "/wiki/Wroona/Legends",
  "/wiki/Gruvian",
  "/wiki/Gruvian_Tovash",
  "/wiki/Slavery/Legends",
  "/wiki/Platt%27s_Smugglers_Guide",
  "/wiki/Ultimate_Alien_Anthology"
 ]
}