{
 "name": "Zodu_Onglo",
 "display_name": "Zodu Onglo",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Born",
     "values": [
      "7928 C.R.C."
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Pau'an"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "White"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Wandering Star"
     ]
    }
   ]
  }
 ],
 "content": "Zodu Onglo was a Pau'an male criminal with connections to the Wandering Star syndicate. He was arrested on the planet Coruscant in the year 7951 C.R.C. following a botched attempt to sell stolen weapons. Onglo was escorted from the scene of the crime by a member of the Coruscant Security Force's underworld police while Lieutenant Tanivos Divo investigated further.\nThe Pau'an male criminal Zodu Onglo was born in the year 7928 C.R.C. In 7951 C.R.C., when he was twenty-three years old, Onglo was apprehended for aggravated assault on Level 1671 of the planet Coruscant by the Coruscant Security Force after a botched attempt to sell a cache of stolen weapons. Lieutenant Tanivos Divo of the CSF questioned witnesses while Onglo was led away from the scene of the crime in binders by a masked officer of the underworld police.\nFurther investigation by Divo uncovered a connection between the Pau'an and the Wandering Star criminal syndicate based out of Level 1313. Divo's casefile on the arrest of Onglo later came into the possession of the lieutenant's grandson Exantor Divo. He included information from the file and an image of Onglo's arrest in Scum and Villainy: Case Files on the Galaxy's Most Notorious, a book he compiled during the reign of the New Republic on police work carried out by three generations of his family.\nOnglo had white skin and black eyes.\nAt the time of his arrest, Onglo wore a dark brown tunic with gold patterning, with green pants and white boots. As was typical for most Pau'ans, Onglo wore circular ear coverings due to his species's extremely sensitive hearing.\nZodu Onglo was created for the 2018 sourcebook Star Wars: Scum and Villainy: Case Files on the Galaxy's Most Notorious, which was written by Pablo Hidalgo. The image of Onglo included in the book was illustrated by Ronan Le Fur. Prior to the book's release on October 23, Onglo was revealed in a blog post detailing the book on StarWars.com on August 29 earlier that year.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/49_BBY",
  "/wiki/Pau%27an",
  "/wiki/Gender",
  "/wiki/Color",
  "/wiki/Wandering_Star",
  "/wiki/Planet",
  "/wiki/Coruscant",
  "/wiki/Standard_year",
  "/wiki/26_BBY",
  "/wiki/Arms_dealer",
  "/wiki/Thief",
  "/wiki/Coruscant_Security_Force",
  "/wiki/Coruscant_underworld_police",
  "/wiki/Lieutenant",
  "/wiki/Tanivos_Exantor_Divo",
  "/wiki/Reproduction",
  "/wiki/Level_1671",
  "/wiki/Stuncuffs",
  "/wiki/Officer",
  "/wiki/Level_1313",
  "/wiki/Exantor_Divo",
  "/wiki/Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Book",
  "/wiki/New_Republic_Era",
  "/wiki/New_Republic",
  "/wiki/Law_enforcement_agency",
  "/wiki/Divo_family",
  "/wiki/Eye",
  "/wiki/Time",
  "/wiki/Clothing",
  "/wiki/Boot",
  "/wiki/Ear",
  "/wiki/Species",
  "/wiki/2018",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Pablo_Hidalgo",
  "/wiki/Ronan_Le_Fur",
  "/wiki/October_23",
  "/wiki/Star_Wars_Blog",
  "/wiki/StarWars.com",
  "/wiki/August_29",
  "/wiki/C.R.C.",
  "/wiki/Disciples_of_Harmony"
 ]
}