{
 "name": "Zolghast",
 "display_name": "Zolghast",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Zygerrian"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Confederacy of Independent Systems"
     ]
    }
   ]
  }
 ],
 "content": "Commander Zolghast was a male Zygerrian, who served the Confederacy of Independent Systems during the Clone Wars.\nZolghast was the commander of Separatist forces on the planet Tirahnn and he based himself in a secret bunker that was located in the world's capital city, Tirahnn. He was assigned two Geonosian bodyguards to protect him and also kept a Porax-38 starfighter, as his personal starship. When the Galactic Republic planned to recapture the planet, they sent a team of agents there, to gain control of a planetary ion cannon. Zolghast was the only person who had the firing codes for the cannon, so the agents infiltrated his bunker and captured him. Shortly afterward, the Republic forces began their main attack and a team of clone troopers was sent to collect Zolghast, so that he could be transported to the Venator-class Star Destroyer Solidarity.\nThe Separatists sent the Clawdite Braxus Lyn to free Zolghast and transport him away from the battle zone. Lyn disguised herself as Jedi Master Ezar Elasra, allowing her to take custody of the Zygerrian. She then escorted him to a Sheathipede-class transport shuttle and began preparing it, so that they could leave the planet. However, before they could leave, they were attacked by the Republic agents, who attempted to recapture Zolghast.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Zygerrian/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Commander/Legends",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Tirahnn/Legends",
  "/wiki/Capital/Legends",
  "/wiki/Tirahnn_(city)",
  "/wiki/Geonosian/Legends",
  "/wiki/Porax-38_starfighter",
  "/wiki/Starship/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Ion_cannon/Legends",
  "/wiki/Battle_of_Tirahnn_(Clone_Wars)",
  "/wiki/Clone_trooper/Legends",
  "/wiki/Venator-class_Star_Destroyer/Legends",
  "/wiki/Solidarity_(Venator-class)",
  "/wiki/Clawdite/Legends",
  "/wiki/Braxus_Lyn",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Ezar_Elasra",
  "/wiki/Sheathipede-class_transport_shuttle/Legends",
  "/wiki/Galaxy_at_War"
 ]
}