{
 "name": "Zomil",
 "display_name": "Zomil",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Defel"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Dark Blue"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Violet"
     ]
    }
   ]
  }
 ],
 "content": "Zomil was a male Defel assassin who retired to the Reuss system to become a fighter in the Dool Arena. He was powerful enough to be considered a top contender against the reigning champion Tull Raine.\nBefore ending up on Reuss VIII, Zomil was an effective assassin. Through his contracts he traveled all over the galaxy before he arrived on Reuss VIII. When he saw the amount of credits he could earn in the arena at The Broken Tusk he retired from murder-for-hire and became a full time fighter.\nZomil was a very nasty assassin whose methods were easily traceable. He had dark blue fur and violet eyes, although these were often hidden behind his light filtering visor. As a Defel he could only detect ultraviolet light which was optimized for darkness, which left him effectively blind in regular lighting. He kept his large white fangs and yellow claws sharpened to razor-keen points.\nHe was an effective brawler with superior strength and speed to make him a top contender in the arena. From both his Defel heritage and his assassin experience he was highly effective at clandestine operations, being able to slide effortlessly into shadows and approach targets without making a sound. He was skilled with his Rodian cryoge whip that he used in the arena.\nZomil was designed by Paul Danner and Bill Smith for Wretched Hives of Scum \u0026 Villainy, a supplement for the Star Wars: The Roleplaying Game that was published by West End Games in 1997.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Defel/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Assassin/Legends",
  "/wiki/Reuss_system",
  "/wiki/Dool_Arena",
  "/wiki/Tull_Raine",
  "/wiki/Reuss_VIII",
  "/wiki/The_galaxy/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/The_Broken_Tusk_(Reuss_VIII)",
  "/wiki/Norrin_Vaxx",
  "/wiki/Paul_Danner",
  "/wiki/Bill_Smith",
  "/wiki/Wretched_Hives_of_Scum_%26_Villainy",
  "/wiki/Star_Wars:_The_Roleplaying_Game",
  "/wiki/West_End_Games",
  "/wiki/1997"
 ]
}