{
 "name": "Zona_Luka",
 "display_name": "Zona Luka",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3996 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Vultan"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Yellow"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic",
      "Brotherhood of the Sith"
     ]
    },
    {
     "name": "Masters",
     "values": [
      "Dominus",
      "Exar Kun"
     ]
    }
   ]
  }
 ],
 "content": "Zona Luka was a female Vultan Jedi Knight who was active during the Great Sith War. She was trained in the Jedi ways by the respected Jedi Master Dominus, who considered Luka his dearest student. In 3996 BBY, Luka and a group of fellow Knights were visited on the library-world of Ossus by the Jedi Exar Kun, who claimed to be the keeper of Force knowledge forbidden by the Jedi Masters. Intrigued, Luka and the other Jedi agreed to join Kun on a journey to reveal the lost secrets of the Force. They traveled in Kun's starship, Starstorm One, to the dark side–tainted moon of Yavin 4, and Luka and the others were led to the base of a large temple by Kun. There, Kun revealed his true intentions when he shattered a Sith holocron and released the dark-side spirits trapped within, which possessed Luka and the other Jedi Knights. Kun, in reality the Dark Lord of the Sith, commanded Luka and the Jedi team—now subjects of the dark side—to kill their former Masters. Luka tracked Dominus to his home and struck him down after a brief lightsaber duel; however, the dying Dominus mustered enough strength to kill the Vultan Jedi through an exertion of the Force.\nZona Luka, a female Vultan, was born in the years leading up to the Great Sith War. As a Force-sensitive, Luka was admitted into the Jedi Order to be trained in the ways of the Force. Luka became the apprentice of Jedi Master Dominus, who considered the Vultan to be his dearest student. Under Dominus' guidance, Luka eventually became a full-fledged Jedi Knight. In 3996 BBY, she was on the Outer Rim world Ossus when a Knight named Exar Kun began to preach in the Gardens of T'alla regarding a renewal of the Jedi way. Luka and a group of fellow Jedi, including the Human Cay Qel-Droma, fellow Vultan Oss Wilum, and the Cathar Crado, gathered in the Gardens to listen to Kun's words. Kun, in reality the Dark Lord of the Sith, claimed that he had discovered great secrets of the Force and would share them with any who joined him. He told the assembled Knights that the old Jedi Masters had failed to contain the influence of the dark side, and Luka agreed, citing Master Arca Jeth's capture and torture by the Naddist Sith cult on Onderon. Her statement was supported by Kun, who proclaimed that he had destroyed the spirit of former Dark Lord of the Sith Freedon Nadd, and had succeeded where the Jedi Masters had failed.\nWhen Qel-Droma challenged Kun to prove his boasts, Kun produced what he described as a Jedi amulet, which mesmerized Luka. As the assembled Knights stood transfixed by the amulet, Kun asked them to join him on a quest for the most ancient and powerful Jedi secrets, and promised that they could change the galaxy by strengthening the Jedi Order against the dark side. After a period of deliberation, Luka, Crado, Wilum, and the rest of the group who had heard Kun's sermon in the Gardens, excluding Qel-Droma, decided to join him on the trip and set out to inform Kun. By the time they met him at the entrance to the Great Jedi Library's Chamber of Antiquities, Kun was in possession of the Draethos Jedi Master Odan-Urr's robe and staff. Kun claimed that the ancient Jedi Master had passed away peacefully—in reality, Kun had killed Odan-Urr after a short struggle—and revealed that Odan-Urr had promoted him to the rank of Master and given him a rare holocron. Luka and the other Jedi believed Kun's claims, even though he had lied about what had transpired.\nLuka and the other followers of Exar Kun boarded his starship, Starstorm One, and began their journey to learn the ancient mysteries of the Force. They traveled to the moon Yavin 4, which Kun promised was the home to many secrets and forgotten knowledge. The group of Jedi crossed a marshy area and eventually arrived at a large temple. However, they grew impatient, and Luka asked Kun to finally prove his claims. Uncomfortable by the dark-side taint of Yavin 4, a nervous Oss Wilum attempted to leave the group and return to the ship. However, the Vultan Jedi found himself confronted by a large group of Massassi warriors—descendants of members of the warrior class of the Sith species who had come to the moon when Dark Lord Naga Sadow settled there in 5000 BBY—and Luka and the other Jedi Knights sprang into action. The assembled Jedi banded together to fight the Massassi, until Kun commanded the natives to stop their attack. Determined to prove himself to Luka and his other would-be followers, Kun produced the holocron that he had taken from Odan-Urr. He revealed it to be a Sith holocron, not a Jedi holocron as the group of curious Knights previously believed, and asked Luka and the other Jedi to assist him in ridding Yavin 4 of the holocron's dark influence.\nKun declared that he was going to destroy the device, and the Sith Lord instructed Luka's group to hold out their hands to block the flash caused by the artifact's annihilation. However, unbeknownst to Luka and her Jedi brethren, Kun did not intend to destroy the holocron; instead, he planned to release the device's dark power. As Luka looked on, Kun crushed the holocron in his hand, releasing the Sith spirits trapped within. The shards of the dark holocron became embedded in Luka's skin, showing her the past glory of the Sith, and incorporated the teachings and powers of the Sith into the shocked Jedi. The fragments disappeared, and Luka was no longer a follower of the light; she and the other Jedi who had accompanied her on the journey were now darksiders, possessed by the ghosts that inhabited the holocron. With Luka and her Jedi companions now under the influence of the dark side, Kun ordered them back to the ship.\nKun commanded Luka and the other new dark-side followers to kill their former Masters, to make way for a new order in the galaxy. Luka set out to find Dominus and tracked him down at his home. After a verbal exchange, in which Luka professed that her attacking the Jedi was nothing personal, she and Dominus dueled briefly with their lightsabers. Luka struck down the aging Master, but Dominus killed his fallen apprentice with the Force as he lay dying. After the battle, the scene was investigated by Knights Dace Diath, Qrrrl Toq, and Shoaneb Culu, all of whom wondered why Luka would kill her former teacher.\nZona Luka displayed curiosity toward the dark side and the forbidden secrets of the Force. Luka held doubts toward the teachings of the old Jedi Masters, a belief that Exar Kun played upon in convincing her to join him. Luka was also easily captivated by Kun's Sith amulet, showing her fascination with the Force's unknown. All of these factors contributed to Luka's decision to join Kun on his journey to reveal the Force's secrets, although she displayed impatience after Kun did not immediately back up his claims of hidden knowledge. Luka was very loyal to her fellow Jedi, exemplified by her reckless charge into battle with the Massassi to assist her friend Oss Wilum on Yavin 4. However, once she was exposed to the spirits inside the Dark Holocron, Luka changed, becoming willing to do anything, even betray the Jedi Order, for Kun. She began to see the old Jedi hierarchy as standing in the way of the rise of the Sith Empire and therefore something that needed to be eliminated. This new Luka carried off her mission to kill her former Master without hesitation, although she assured Dominus that she still had no personal issue with him.\nZona Luka was adept enough in the Force that Master Dominus considered her his favorite student, and Luka attained the rank of Jedi Knight. However, when she was turned to the dark side by the Dark Holocron, her powers in the Force increased even more, at least according to Exar Kun. Luka was skilled with the lightsaber, striking down Dominus and defending her fellow Jedi against a horde of Massassi, but she was not able to prevent the dying Dominus from killing her with the Force. Luka possessed at least two different lightsabers: while on Yavin 4 she wielded a lightsaber with a purple beam, while she utilized a blue one during her duel with Dominus.\nThe character of Zona Luka first appeared in Star Wars: Tales of the Jedi — The Sith War, a story arc of the Star Wars: Tales of the Jedi comic book series, written by Kevin J. Anderson and released in 1995. Luka appeared in the first, second, third, and fourth issues of the arc and was killed in the fourth issue. In her appearances, Luka was illustrated by Dario Carrasco, Jr.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Featured_articles",
  "/wiki/3996_BBY",
  "/wiki/Vultan",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Brotherhood_of_the_Sith",
  "/wiki/Dominus",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Exar_Kun/Legends",
  "/wiki/Sith_Master/Legends",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Great_Sith_War/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Jedi/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/Great_Jedi_Library/Legends",
  "/wiki/Planet/Legends",
  "/wiki/Ossus/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Starship/Legends",
  "/wiki/Starstorm_One",
  "/wiki/Dark_side_of_the_Force/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Yavin_4/Legends",
  "/wiki/Temple_of_Exar_Kun",
  "/wiki/Dark_Holocron",
  "/wiki/Force_ghost",
  "/wiki/Dark_Lord_of_the_Sith/Legends",
  "/wiki/Jedi_pogrom",
  "/wiki/Dominus%27_hut",
  "/wiki/Lightsaber_duel/Legends",
  "/wiki/Death/Legends",
  "/wiki/Standard_year/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Gardens_of_T%27alla/Legends",
  "/wiki/Human/Legends",
  "/wiki/Cay_Qel-Droma",
  "/wiki/Oss_Wilum",
  "/wiki/Cathar/Legends",
  "/wiki/Crado",
  "/wiki/Arca_Jeth",
  "/wiki/First_Battle_of_Onderon_(Naddist_Uprising)",
  "/wiki/Torture/Legends",
  "/wiki/Naddist",
  "/wiki/Sith_cult/Legends",
  "/wiki/Onderon/Legends",
  "/wiki/Freedon_Nadd",
  "/wiki/Sith_amulet",
  "/wiki/The_galaxy/Legends",
  "/wiki/Time/Legends",
  "/wiki/Chamber_of_Antiquities/Legends",
  "/wiki/Draethos_(species)",
  "/wiki/Odan-Urr/Legends",
  "/wiki/Jedi_apparel",
  "/wiki/Staff/Legends",
  "/wiki/Massassi/Legends",
  "/wiki/Sith_(species)/Legends",
  "/wiki/Lord/Legends",
  "/wiki/Naga_Sadow/Legends",
  "/wiki/5000_BBY/Legends",
  "/wiki/Holocron/Legends",
  "/wiki/Sith/Legends",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Sith_artifact/Legends",
  "/wiki/Force_power/Legends",
  "/wiki/Light_side_of_the_Force/Legends",
  "/wiki/Darksider",
  "/wiki/Lightsaber/Legends",
  "/wiki/Dace_Diath",
  "/wiki/Qrrrl_Toq",
  "/wiki/Shoaneb_Culu",
  "/wiki/Sith_Empire_(Great_Sith_War)",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_%E2%80%94_The_Sith_War",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_(comic_series)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Kevin_J._Anderson",
  "/wiki/1995",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_1",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_2",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_3",
  "/wiki/Tales_of_the_Jedi_%E2%80%93_The_Sith_War_4",
  "/wiki/Dario_Carrasco,_Jr.",
  "/wiki/Star_Wars_Insider",
  "/wiki/The_Horse%27s_Mouth",
  "/wiki/Star_Wars_Insider_26",
  "/wiki/Star_Wars_Insider_28",
  "/wiki/Star_Wars_Encyclopedia",
  "/wiki/A_Guide_to_the_Star_Wars_Universe,_Third_Edition,_Revised_and_Expanded",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/Power_of_the_Jedi_Sourcebook",
  "/wiki/The_Essential_Atlas"
 ]
}