{
 "name": "Zorii_Bliss",
 "display_name": "Zorii Bliss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Kijimi"
     ]
    },
    {
     "name": "Born",
     "values": [
      "Between 1 BBY–1 ABY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Female"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.62 meters"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Brown"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Green"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Light"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Spice Runners of Kijimi",
      "Citizens' Fleet"
     ]
    }
   ]
  }
 ],
 "content": "Zorii Bliss, also known as Zorii Wynn, was a human female native to the frigid planet Kijimi. She was the leader of the Spice Runners of Kijimi. During the war between the First Order and the Resistance, Bliss was neutral, and she spent time in Kijimi's Thieves' Quarter. She shared a past connection with Poe Dameron as he was once a spice runner along with her, but Poe Dameron left the group and abandoned Bliss. The two would meet again when Dameron led Resistance operatives to Kijimi to find the hidden world Exegol. After the destruction of Kijimi, Bliss participated in the Battle of Exegol, which saw the destruction of the Sith Eternal's fleet, the Final Order.\nZorii Bliss, also known as Zorii Wynn, was a resident of the frigid planet Kijimi who joined the Spice Runners of Kijimi, a criminal organization run by her mother Zeva Bliss, at a young age. Both Zorii and her mother had similar names to a spicerunner named Zarah Bliss, who had been active decades prior during the Republic Era.\nPoe Dameron later joined the Spice Runners. However, Poe abandoned the group during the Kijimi summit—rejecting Zorii's offer to take over the pirates from her mother—to return home and later join the New Republic as a T-85 X-wing pilot. He then joined the Resistance as a T-70 X-wing pilot, following in the footsteps of his parents Shara Bey and Kes Dameron, both of whom fought for the Rebellion during the Galactic Civil War. Poe's departure greatly angered Bliss, as well as many others on Kijimi that Poe had run afoul of. At some point before the Cold War, Bliss succeeded in becoming leader of the spice runners.\nIn the years that followed, the First Order, a military organization built on the ashes of the Galactic Empire seized control of Kijimi, abducting people and following the Battle of Crait, took control of the world, as they had with many other planets across the galaxy. Zorii and the others learned to operate under the new control without Dameron.\nWhen the Resistance agents arrived on Kijimi in 35 ABY to find the path to Exegol, Bliss confronted Dameron, alongside a group of goons, still furious at the pilot over his abandonment of their cause, but Rey knocked out her goons, Bliss was impressed by her skill, and was convinced to help them. Bliss then led them to Babu Frik, the legendary droidsmith, as the Resistance needed to unlock forbidden translations in the systems of C-3PO, in order to translate a dagger that would lead to a Wayfinder to the hidden world Exegol. Bliss and Dameron left the room while Frik was working, and spied on First Order operations from the roof of the workshop, talking about how the occupation changed things. During the conversation, Bliss reassured and motivated Dameron to continue the fight against the First Order, and removed part of her helmet.\nThe pair then altered the other Resistance agents to approaching First Order forces. Understanding that Poe needed to get on board Kylo Ren's Star Destroyer Zorii gives him a captain's medallion at great cost. As they began their escape, now with the added knowledge that their Wookiee friend Chewbacca was being held on the First Order capital ship Steadfast, Poe made an offer to Bliss for her to join them, which she declined. Bliss then remained on Kijimi while Poe and his allies liberated Chewbacca, before traveling to Kef Bir after translating the dagger.\nThe resurrected Darth Sidious soon gave the order to use one of his Xyston-class Star Destroyers to destroy a planet that the Resistance would know. Kijimi was chosen, and subsequently obliterated by the Star Destroyer's axial superlaser.\nDespite assumption, Bliss was able to escape before the destruction of Kijimi, joining the Resistance and flying a Y-wing starfighter called the Comeuppance alongside Babu Frik during the Battle of Exegol against the Sith Eternal forces. The Resistance and their allies were ultimately victorious, following the demise of Sidious and the destruction of the Steadfast, which stranded the remaining Sith Star Destroyers on Exegol.\nAfterwards, she joined the celebrations of the Resistance's victory back on Ajan Kloss. She and Dameron acknowledged each other during the celebration from across the crowds of Resistance members.\nZorii Bliss was a human female who, like her fellow Spice Runners, was considered a scoundrel. Nonetheless, she developed a romantic relationship with Poe Dameron during his time with the group, only for Dameron's morals to later lead him to side against the Spice Runners during Bliss's mother's plot to kill rival families under the pretense of a summit. Bliss was also opposed to her mother but wanted to take over the Spice Runners with Dameron at her side. Upon hearing him reject her offer, Dameron observed that the affection and warmth she had felt towards him instantly crumbled away to rage, believing it would never return, although the two later shared several close moments after reuniting.\nZorii was armed with a pair of E-851 blaster pistols.\nZorii Bliss appeared in the 2019 film Star Wars: Episode IX The Rise of Skywalker, where she was portrayed by Keri Russell. Russell accepted the part because she found the idea of an anonymous, mysterious side character attractive.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Bliss_(disambiguation)",
  "/wiki/Poe_Dameron:_Free_Fall",
  "/wiki/Category:Articles_to_be_expanded",
  "/wiki/Talk:Zorii_Bliss",
  "/wiki/Kijimi",
  "/wiki/1_BBY",
  "/wiki/1_ABY",
  "/wiki/Human",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Foot",
  "/wiki/Color",
  "/wiki/Spice_Runners_of_Kijimi",
  "/wiki/Citizens%27_Fleet",
  "/wiki/Homeworld",
  "/wiki/Planet",
  "/wiki/First_Order-Resistance_War",
  "/wiki/First_Order",
  "/wiki/Resistance",
  "/wiki/Time",
  "/wiki/Thieves%27_Quarter",
  "/wiki/Poe_Dameron",
  "/wiki/Kijimi_summit",
  "/wiki/Mission_to_Kijimi",
  "/wiki/Exegol",
  "/wiki/Destruction_of_Kijimi",
  "/wiki/Battle_of_Exegol",
  "/wiki/Sith_Eternal",
  "/wiki/Final_Order",
  "/wiki/Reproduction",
  "/wiki/Zeva_Bliss",
  "/wiki/Spicerunner",
  "/wiki/Zarah_Bliss",
  "/wiki/Standard_decade",
  "/wiki/Republic_Era",
  "/wiki/New_Republic",
  "/wiki/T-85_X-wing",
  "/wiki/Pilot",
  "/wiki/T-70_X-wing_starfighter",
  "/wiki/Shara_Bey",
  "/wiki/Kes_Dameron",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Galactic_Civil_War",
  "/wiki/Cold_War",
  "/wiki/Galactic_Empire",
  "/wiki/Battle_of_Crait",
  "/wiki/35_ABY",
  "/wiki/Rey_Skywalker",
  "/wiki/Babu_Frik",
  "/wiki/C-3PO",
  "/wiki/Blade_of_Ochi_of_Bestoon",
  "/wiki/Wayfinder",
  "/wiki/Wookiee",
  "/wiki/Chewbacca",
  "/wiki/Steadfast_(Resurgent-class)",
  "/wiki/Kef_Bir",
  "/wiki/Darth_Sidious",
  "/wiki/Derriphan",
  "/wiki/Xyston-class_Star_Destroyer",
  "/wiki/Axial_superlaser",
  "/wiki/BTA-NR2_Y-wing_starfighter",
  "/wiki/Comeuppance",
  "/wiki/Sith_Eternal_military",
  "/wiki/Ajan_Kloss",
  "/wiki/E-851_blaster_pistol",
  "/wiki/2019",
  "/wiki/Star_Wars:_Episode_IX_The_Rise_of_Skywalker",
  "/wiki/Keri_Russell",
  "/wiki/Star_Wars:_Starfighter_Missions",
  "/wiki/Poe_Dameron:_Free_Fall_(audiobook)",
  "/wiki/Star_Wars:_We_Are_the_Resistance",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Expanded_Edition_(audiobook)",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_A_Junior_Novel_(audiobook)",
  "/wiki/The_Rise_of_Skywalker_(Little_Golden_Book)",
  "/wiki/Fortnite_X_Star_Wars",
  "/wiki/The_LEGO_Star_Wars_Holiday_Special",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/Star_Wars",
  "/wiki/StarWars.com",
  "/wiki/Hasbro_Inc.",
  "/wiki/Star_Wars:_The_Vintage_Collection",
  "/wiki/LEGO",
  "/wiki/LEGO_Star_Wars_Episode_IX:_The_Rise_of_Skywalker",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_Amazing_Sticker_Adventures",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Galactic_Guide",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker:_The_Visual_Dictionary",
  "/wiki/Star_Wars:_The_Rise_of_Skywalker_%E2%80%93_The_Official_Collector%27s_Edition",
  "/wiki/The_Art_of_Star_Wars:_The_Rise_of_Skywalker",
  "/wiki/The_Star_Wars_Book",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Republic,_Rebel,_and_Resistance_Starfighters",
  "/wiki/The_Final_Order_and_the_Battle_of_Exegol",
  "/wiki/Blasters_and_Ranged_Weapons",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Din_Djarin_and_Other_Bounty_Hunters_and_Criminals",
  "/wiki/Naval_Armament_and_Equipment",
  "/wiki/StarWarsKids.com",
  "/wiki/Star_Wars:_Timelines",
  "/wiki/Databank_(website)",
  "/wiki/Standard_year",
  "/wiki/Hosnian_Cataclysm",
  "/wiki/Star_Wars:_Galactic_Atlas",
  "/wiki/34_ABY",
  "/wiki/Resolve_(short_story)",
  "/wiki/Stories_of_Jedi_and_Sith",
  "/wiki/November_25",
  "/wiki/February_20",
  "/wiki/2020"
 ]
}