{
 "name": "Zornak%27s_companion",
 "display_name": "Zornak's companion",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "A sentient species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "A male companion traveled with the alien Zornak to the Forest Moon of Endor in 3 ABY. He assisted Zornak in rounding up the native Ewoks against their will, forcing them to gather gems for Zornak. However, one remaining Ewok was able to escape and use Zornak's stones of obedience against him, forcing him to leave Endor.\nThe companion of the alien Captain Zornak was a male member of the same species as Zornak. In 3 ABY, the two traveled to the Forest Moon of Endor with a starship, intending on enslaving the native Ewoks. They used a probe droid to locate the Ewok village, which Zornak then teleported to using a transport chamber that his companion had prepared. Prior to Zornak's departure, the two excitedly discussed what they would be able to do with the Ewoks under their control.\nOnce Zornak had used the stones of obedience to put the Ewoks under his control, he and the crewmate oversaw them loading up precious gems into their starship. However, their probe droid discovered that one Ewok, Teebo, had not been given a stone of obedience and was therefore free of their control. Zornak's companion pointed him out and offered to chase Teebo after he escaped back into the forests, but Zornak told him that they were too dense; he felt it would be better to send an Ewok after him instead, choosing Wicket Warrick for the task.\nAfter Zornak gave his companion's blaster to Warrick and ordered him to stun and capture Teebo, Warrick entered the forest to search for him. The runaway Ewok was able to break Warrick free of the stone, however, allowing Teebo to devise a plan that resulted in him using a stone of obedience against Zornak. Once the alien was under his control, Warrick had him issue an order to the rest of the crew to free all of the Ewoks and leave the moon of Endor. Shortly after Zornak gave the command, the starship lifted off and left.\nZornak's companion was excited at the prospect of having lots of precious gems. He had black eyes and green skin.\nThe companion wore pink clothing along with blue boots and blue gloves, gold-colored sleeves, as well as a gold-colored sash and belt. He also wore a blue helmet that had two white horns protruding from its top and utilized a blaster rifle that had a stun setting.\nThe companion of Zornak appeared in the fourteenth issue of the Ewoks comic series, which was written by David Manak, illustrated by Warren Kremer, and published by Marvel Comics on March 31, 1987.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Zornak%27s_species",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Ewoks_14",
  "/wiki/Zornak",
  "/wiki/Endor/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Gemstone/Legends",
  "/wiki/Teebo/Legends",
  "/wiki/Stones_of_obedience",
  "/wiki/Alien/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Zornak%27s_spaceship",
  "/wiki/Slavery/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Transport_chamber",
  "/wiki/Starship/Legends",
  "/wiki/Droid/Legends",
  "/wiki/Forest/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/Blaster_rifle/Legends",
  "/wiki/Stun/Legends",
  "/wiki/Moon/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Clothing/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Belt/Legends",
  "/wiki/Helmet/Legends",
  "/wiki/Blaster/Legends",
  "/wiki/Rifle/Legends",
  "/wiki/Ewoks_(Marvel)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/David_Manak",
  "/wiki/Warren_Kremer",
  "/wiki/Marvel_Comics",
  "/wiki/March_31",
  "/wiki/1987",
  "/wiki/Category:Images_of_Zornak%27s_companion",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Marvel_Age",
  "/wiki/June"
 ]
}