{
 "name": "Zornak",
 "display_name": "Zornak",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Sentient species"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Green"
     ]
    }
   ]
  }
 ],
 "content": "Captain Zornak was an alien who came to the Forest Moon of Endor in a starship with his crew and enslaved the native Ewoks to procure precious gems for his crew. Using the stones of obedience, he was able to get the Ewoks under his control, and he had them load the gems onto his starship. However, a lone unaffected Ewok named Teebo learned of Zornak's plans and, after freeing another Ewok from his influence, was able to use the stones against Zornak, forcing him to leave Endor and free all of the Ewoks.\nCaptain Zornak was an alien male individual who traveled in a starship. In 3 ABY, he and at least one other member of his species traveled to the Forest Moon of Endor, where they intended to use the stones of obedience to enslave the native Ewoks. Once Zornak's probe droid had found the Ewoks' village, his companion reported to him, and Zornak had him ready the transport chamber so that he could be transported to the village.\nZornak put on a robe to disguise himself and was teleported to the village, where he greeted two young Ewoks: Wicket Warrick and Kneesaa a Jari Kintaka. They asked who he was, and he claimed that was merely a traveler seeking hospitality, offering the stones of obedience as gifts. Kintaka started to decline, feeling it was unnecessary. Warrick did not want to hurt the alien's feelings, however, so he accepted the gifts on behalf of both of them. Zornak then instructed the two Ewoks to put them on, which put them under his control. As they had to obey, they followed his orders to give the stones to the rest of the villagers, telling them that they had to listen to the alien traveler.\nZornak and his companion rounded up all of the Ewoks, forcing them to load their starship with precious gems. However, unbeknown to them, a lone Ewok, Teebo, was never given a stone of obedience, so he learned of Zornak's plan while hiding nearby. Once Zornak's probe droid had found Teebo, he ran off into the forests. Zornak's companion intended to chase after him in the woods, but Zornak reminded him that they were too dense, so he instead sent one of Teebo's own kind: Wicket Warrick.\nZornak ordered Warrick to use a stun weapon to capture the runaway Teebo. However, Teebo was able to knock the stone of obedience off of Warrick, breaking him free of Zornak's control. The two then devised a plan to free the villagers; Warrick would again wear the stone, but he would instead be controlled by Teebo. The plan was executed by Warrick bringing Teebo back to Zornak, pretending to still be under his influence. He prepared to place a stone on Teebo's neck, but it was then that he gave Warrick the signal, which prompted him to put a stone on Zornak, forcing him to be under their command. They ordered him to give an order to free all of the prisoners and leave Endor at once, which he promptly obeyed, giving his crewmates a command to do so and taking off in their starship.\nZornak was willing to enslave the Ewoks of Endor and had no qualms about taking away their free will. He had green skin and black eyes.\nUnder the guise of simply being a traveler, he was able to convince the Ewoks to all wear the stones of obedience.\nZornak traveled in a starship that resembled a flying castle. He wore pink clothing that had yellow sleeves along with blue gloves and boots, and he donned a blue-and-pink helmet on his head, all of which was covered by a pink cloak when he was disguised as a traveler. He also used a transport chamber to travel to the Ewok village.\nZornak appeared as the main antagonist in the fourteenth issue of the Ewoks comic series, which was written by David Manak, illustrated by Warren Kremer, and published by Marvel Comics on March 31, 1987.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Zornak%27s_species",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Ewoks_14",
  "/wiki/Captain/Legends",
  "/wiki/Endor/Legends",
  "/wiki/Zornak%27s_spaceship",
  "/wiki/Slavery/Legends",
  "/wiki/Homeworld/Legends",
  "/wiki/Ewok/Legends",
  "/wiki/Gemstone/Legends",
  "/wiki/Stones_of_obedience",
  "/wiki/Starship/Legends",
  "/wiki/Teebo/Legends",
  "/wiki/Wicket_Wystri_Warrick/Legends",
  "/wiki/3_ABY/Legends",
  "/wiki/Zornak%27s_companion",
  "/wiki/Species/Legends",
  "/wiki/Probe_droid/Legends",
  "/wiki/Bright_Tree_Village/Legends",
  "/wiki/Transport_chamber",
  "/wiki/Robe/Legends",
  "/wiki/Youngling/Legends",
  "/wiki/Kneesaa_a_Jari_Kintaka",
  "/wiki/Droid/Legends",
  "/wiki/Forest/Legends",
  "/wiki/Wood/Legends",
  "/wiki/Stun_blaster/Legends",
  "/wiki/Prisoner/Legends",
  "/wiki/Eye/Legends",
  "/wiki/Castle",
  "/wiki/Clothing/Legends",
  "/wiki/Glove/Legends",
  "/wiki/Boot/Legends",
  "/wiki/Helmet/Legends",
  "/wiki/Cloak/Legends",
  "/wiki/Ewoks_(Marvel)",
  "/wiki/Star_Wars_comic_books",
  "/wiki/David_Manak",
  "/wiki/Warren_Kremer",
  "/wiki/Marvel_Comics",
  "/wiki/March_31",
  "/wiki/1987",
  "/wiki/Category:Images_of_Zornak",
  "/wiki/Star_Wars_Insider",
  "/wiki/Star_Wars_Publications_Timeline",
  "/wiki/Star_Wars_Insider_23",
  "/wiki/Standard_year/Legends",
  "/wiki/Star_Wars:_Episode_IV_A_New_Hope",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/Marvel_Age",
  "/wiki/June"
 ]
}