{
 "name": "Zozridor_Slayke",
 "display_name": "Zozridor Slayke",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Red"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Galactic RepublicJudicial Forces",
      "Judicial Forces",
      "Sons and Daughters of Freedom"
     ]
    }
   ]
  }
 ],
 "content": "Captain Zozridor Slayke was a red-haired Human male officer who served in the Judicial Starfleet of the Galactic Republic and commanded the corvette Scarlet Thranta prior to the Clone Wars.\nSlayke's history prior to joining the Judicial Forces was murky even to those who served with him.\nShortly before the start of the Clone Wars, the Scarlet Thranta was assigned to patrol the Sluis sector, near Separatist space. Angered by the Senate's unwillingness to act against the Separatists, Slayke went rogue, taking the Thranta and entering the Expansion Region with intentions of waging a private war against the Separatists. Other ships, including some mercenaries and civilians, soon joined the charismatic Slayke. He named this ragtag group the Sons and Daughters of Freedom, commonly referred to as Freedom's Sons.\nAlthough no battles were reported before the start of the Clone Wars, a 45,000 credit bounty was placed on his head by the leaders of Sluis Van, and a Judicial Department task force, under the command of the Jedi Master Nejaa Halcyon, was dispatched to recapture the vessel and take Slayke into custody. A large segment of the Mid Rim's populace, however, considered him a hero. Eventually, after the Clone Wars broke out, Freedom's Sons became something of an auxiliary militia for the Jedi, and Slayke was officially pardoned by Palpatine, given a set of IFF codes identifying him as friendly to Republic and commissioned as a privateer to fight the Separatists.\nIn 22 BBY, Zozridor worked with Halcyon and Anakin Skywalker to defend the planet of Praesitlyn and its crucial Intergalactic Communications Center from invading Separatist forces led by the Muun Pors Tonith.\nSlayke had a talent for inspiring the soldiers under his command but held a dislike for clone troopers and other Republic forces, referring to the former as 'test-tube soldiers' and calling Republic Quartermaster Mess Boulanger 'A blasted box kicker'.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Judicial_Forces/Legends",
  "/wiki/Sons_and_Daughters_of_Freedom",
  "/wiki/Palpatine/Legends",
  "/wiki/Captain/Legends",
  "/wiki/Officer/Legends",
  "/wiki/Judicial_Department/Legends",
  "/wiki/Corvette/Legends",
  "/wiki/Scarlet_Thranta",
  "/wiki/Clone_Wars/Legends",
  "/wiki/Sluis_sector/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Expansion_Region/Legends",
  "/wiki/Galactic_Credit_Standard",
  "/wiki/Sluis_Van/Legends",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Nejaa_Halcyon",
  "/wiki/Mission_to_Bpfassh_(Separatist_Crisis)",
  "/wiki/Mid_Rim",
  "/wiki/Privateer/Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Battle_of_Praesitlyn",
  "/wiki/Praesitlyn",
  "/wiki/Intergalactic_Communications_Center",
  "/wiki/Muun/Legends",
  "/wiki/Pors_Tonith/Legends",
  "/wiki/Mess_Boulanger",
  "/wiki/HoloNet_News/Legends",
  "/wiki/HoloNet_News_Vol._531_54",
  "/wiki/HoloNet_News_Vol._531_55",
  "/wiki/Jedi_Trial",
  "/wiki/The_New_Essential_Chronology",
  "/wiki/The_Complete_Star_Wars_Encyclopedia",
  "/wiki/The_Essential_Reader%27s_Companion"
 ]
}