{
 "name": "Zuckuss",
 "display_name": "Zuckuss",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Homeworld",
     "values": [
      "Gand"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Gand"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Height",
     "values": [
      "1.5 meters"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Brown"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jabba's criminal empire",
      "Bounty Hunters' Guild",
      "T'onga's crew"
     ]
    }
   ]
  }
 ],
 "content": "Zuckuss was an insectoid male Gand findsman who worked as a bounty hunter prior to and during the Galactic Civil War. A skilled tracker who often worked with 4-LOM, Zuckuss had a run-in with Han Solo that left his ship, the Mist Hunter, powered down on a strange planet. He was later among the hunters assembled by Darth Vader to find the Millennium Falcon following the Battle of Hoth, although Boba Fett ultimately earned the bounty by delivering Solo to Jabba Desilijic Tiure.\nAn insectoid being with compound eyes, Zuckuss was a male Gand born on his species' homeworld of Gand as one of the planet's traditional findsmen. Using the findsmen's mystic traditions, dating back centuries, Zuckuss operated as a tireless tracker until the planet's findsman traditions began dying out. He became one of the first such to leave the planet's thick and toxic atmosphere, and wore a respirator to breathe ammonia while operating in oxygen-rich atmospheres in the wider galaxy. He worked as a bounty hunter on lucrative jobs that made use of his particular talents as a highly sought-after hunter with renowned tracking skills, and he often paired up with 4-LOM on many occasions. Although Zuckuss's uncanny abilities made some uneasy, he and 4-LOM remained a formidable team. They flew aboard the Mist Hunter, which Zuckuss filled with gasses to remind him of his homeworld.\nOne of the first jobs Zuckuss took with 4-LOM was a hunt for the Culisetto doctor Cribiriz Idollax given by Deva Lompop. After fighting past Idollax's droid bodyguards Zuckuss would kill the doctor by cutting him in half with his snare rifle. Afterwards, Zuckuss and 4-LOM agreed to split the bounty in half. Unbeknownst to Zuckuss and 4-LOM, the doctor Cribiriz he killed was actually his brother Sribiriz, leading Cribiriz to vow revenge against the bounty hunters.\nIn 9 BBY, Zuckuss and 4-LOM captured the small-time criminal Beris Ford, keeping him imprisoned aboard their ship and hoping to use the reward for his capture to pay for tractor beam repairs. Weeks later, the hunters took up a bounty placed by Rekias Nodo on Han Solo, and confronted him at Valtos Space Port. Zuckuss incapacitated the smuggler inside a stun net fired from his snare rifle, and he and 4-LOM loaded Han's cargo into the Mist Hunter, where they imprisoned him along with Ford. Sensing a disturbance in the Force, Zuckuss checked on the stolen cargo only to be attacked by Chewbacca bursting from one of the containers, and was hit with a stun net from his own rifle. Zuckuss was left tied up while the Wookiee rescued Han and Beris, and the scoundrels fled with their cargo back to the Millennium Falcon. However, the hunters pursued, and after a firefight Zuckuss chased the Falcon into space.\nFollowing Solo and Chewbacca to an unidentified planet, Zuckuss again sensed something was wrong, but 4-LOM continued the pursuit through a heavy cloud layer until their ship's systems—and 4-LOM himself—suddenly powered down, forcing them to drop out of the sky and crash-land on a beach. Zuckuss was trapped in the wreckage, and called out to Solo for help in freeing his legs, though slapped stuncuffs on Solo when he was in reach. However, the planet's technology-negating effects caused the cuffs to release Solo, who left Zuckuss in his predicament. After Solo and Chewbacca found an energy projector transmitting an immobilizer beam, Zuckuss attacked them with native spears as they climbed the tall mast. Chewbacca dislodged the projection sphere from the top, causing it to crash on the beach below, which caused mechanical drones to erupt from the sand and attack all three interlopers.\nZukuss, Solo, and Chewbacca climbed the projector to evade the scorpion-droids. The three of them fought the droids until 4-LOM was reactivated. After 4-LOM destroyed several of the scorpion droids, the four made their way to the ocean and swam to the Falcon. Once the Falcon had taken flight, Zuckuss and 4-LOM demanded that Solo fly them to Nodo to collect on Solo's bounty. Han then bumped a lever on the Falcon, causing the ship to plummet back down to the planet below. This caused 4-LOM and Zuckuss to believe the Falcon had flown into another dampening field, and look for a means of escape. When Solo said there were only two Anti-grav chutes aboard, Zuckuss and 4-LOM stunned Solo and Chewbacca. The two of them jumped out of the Falcon, but Zuckuss realized that Solo tricked them again. The two bounty hunters were left on the planet at the mercy of the scorpion-droids.\nShortly after the Battle of Yavin, Zuckuss, along with Krrsantan, IG-90, Dengar, Chanath Cha, Beebox and C-21 Highsinger, was hired by Darth Vader to find and return Doctor Chelli Lona Aphra, who had been captured by the Rebel Alliance.\nAfter the Battle of Hoth, he was once again hired by Vader, this time to hunt down the Millennium Falcon and capture the passengers alive. However, the passengers were soon found and captured by the Empire on Cloud City, with help from Boba Fett.\nZuckuss and 4-LOM soon caught wind of a bounty placed on Cadeliah, who was traveling with the cyborg bounty hunter Beilert Valance. The two were intent on capturing the girl, and followed Valance to the Spur Orbiting Market, where they briefly clashed. Valance managed to injure the findsman, and escaped to bring the girl to Lowik. The pair of insect-headed hunters followed Valance to the forest world, and once again clashed with the cyborg, but this time against members of the Rebel Alliance as well. Zuckuss deployed a cache of super battle droids to take care of the Rebel soldiers, while he searched for the girl. After incapacitating Yuralla Vega and stunning Cadeliah, Zuckuss made off with his prize, but was halted in front of the Mist Hunter by Valance. Valance was able to buy 4-LOM and Zuckuss off of his trail by giving them a Fire ruby. They left soon after, Zuckuss vowing the two would resume their hunt in three rotations.\nFollowing his winding path, the duo eventually did catch up with Valance and his new partner Dengar in the Y'Toub System, engaging in a short dogfight through an Asteroid field before the Corellian bounty hunter achieved a truce with 4-LOM and Zuckuss. This peace came in exchange for information regarding the bounty Jabba the Hutt had recently placed on Boba Fett, and his location on Nar Shaddaa. The two sets of hunters then departed the system.\nZuckuss, aided by 4-LOM, tracked Boba Fett to Nar Shaddaa and broke into his ship, Slave I to look for Han Solo. When Fett returned from a bar, he skirmished with the duo, unpleased that they had disrespected his vessel—and by extension, his father's legacy—by trespassing. Fett won the brawl by activating a hidden bomb onboard the ship, knocking Zuckuss off the platform, with Fett leaving Nar Shaddaa with the head of the disabled 4-LOM.\nHaving been left for dead on the moon, the injured Zuckuss stumbled into Jega's Music Hall and Petting Zoo in Wormstew Town. After meeting with Trot, Zuckuss recounted one of his first jobs with 4-LOM. Zuckuss soon became distracted, sensing 4-LOM outside, and ran out to encounter the rebuilt 4-LOM, controlled by Cribiriz. Jega's Squad fought the monster droid while Zuckuss tracked down the nearby Cribiriz and killed him. Zuckuss then destroyed the device controlling 4-LOM, freeing him. The rebuilt 4-LOM malfunctioned, fleeing into the alleys of Nar Shaddaa, leaving Zuckuss alone.\nAfter the loss of his friend and partner, Zuckuss made his way to the Gand floating sanctuary in the Outer Rim, a place he could breathe his body's intended atmosphere, ammonia. It was there that he was approached by T'onga and Losha Tarkon to join their crew. Hesitant at first, the Gand bounty hunter eventually conceded and joined the likes of Tasu Leech in the crew whose goal was to find Cadeliah and unite the galactic underworld. Zuckuss's tracking abilities soon came to be of use, as he tracked Valance, who knew the location of the child, to Jekara, the location of the Auction for Han Solo. On the icy world, Zuckuss and the crew found a tied-up Bossk, feigning death to steal Zuckuss's knife to break free. Bossk informed the crew that he knew the location of Valance.\nLater, aboard an abandoned Hutt freighter, the reprogrammed 4-LOM lured Zuckuss and the rest of the team into a trap, but they managed to triumph. Zuckuss restored 4-LOM's true programming and the two again worked together as T'onga carried on their mission.\nZuckuss was a tireless tracker with uncanny abilities that made him a lucrative bounty hunter. Possessing a sixth sense, he claimed he could feel disturbances in the Force, which his partner 4-LOM dismissed as superstitious mumbo-jumbo. According to early testing by the Inquisitorius, Zuckuss did not register to have Force sensitivity on whatever they used to measure one's capability with it. However, the Inquisitors may have been wrong, as he still had extra-sensory abilities beyond Imperial science. Zuckuss spoke about himself in the third person. Zuckuss was also a Laromun'rac follower, a denomination of faith native to the Osia'Kru Brume lowlands.\nZuckuss wore a gas mask respirator connected to breather packs to breathe ammonia in oxygen-rich atmospheres. He wore heavy battle armor under his beige findsman body cloak, and armed himself with a GRS-1 snare rifle, and a knife. He and 4-LOM flew the modified G-1A starfighter Mist Hunter.\nZuckuss first appeared in the 1980 film Star Wars: Episode V The Empire Strikes Back, where he was played by actress Cathy Munro. Designed by concept artists Ralph McQuarrie and John Mollo, Zuckuss' mask was crafted by Stuart Freeborn, while the mask's eyes were covered with bubble wrap packing material.\nIn the fourth draft of The Empire Strikes Back screenplay, Zuckuss, then named \"Tuckuss,\" was described, along with Dengar as a battle-scarred mangy human type. Only Dengar remained human in the final cut of the film. Both his original name and appearance were featured in Donald F. Glut's novelization.\nZuckuss' costume, along with the full-head mask, included cylinders filled with colored water, which Munroe required an assistant to put on and remove. Munroe described the costume as both hot and restrictive. Between takes, Munroe was supplied a chair on set if she needed to rest. The mask restricted her vision so that she could only see directly in front of her and included a tube into which Monroe could blow air to create bubbles in one of the water-filled cylinders on the chest of the costume.\nZuckuss appeared in the LEGO Star Wars: The Freemaker Adventures Season Two episode \"Return to the Wheel,\" which premiered on August 3, 2017. He and several bounty hunters including Dengar, Bossk, 4-LOM, and IG-88 captured the Freemakers but they escaped after Kordi created a fight between the droid and organic bounty hunters.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Zuckuss",
  "/wiki/Zuckuss/Legends",
  "/wiki/Powered_Down,_Part_II",
  "/wiki/From_a_Certain_Point_of_View:_The_Empire_Strikes_Back",
  "/wiki/Bounty_Hunters_10",
  "/wiki/Bounty_Hunters_17",
  "/wiki/Bounty_Hunters_18",
  "/wiki/Bounty_Hunters_19",
  "/wiki/Bounty_Hunters_20",
  "/wiki/Bounty_Hunters_21",
  "/wiki/Bounty_Hunters_22",
  "/wiki/Bounty_Hunters_24",
  "/wiki/Bounty_Hunters_25",
  "/wiki/Bounty_Hunters_26",
  "/wiki/Bounty_Hunters_27",
  "/wiki/Bounty_Hunters_28",
  "/wiki/Halcyon_Legacy_5",
  "/wiki/Star_Wars:_Scum_and_Villainy:_Case_Files_on_the_Galaxy%27s_Most_Notorious",
  "/wiki/Star_Wars_Helmet_Collection_61",
  "/wiki/Star_Wars_Helmet_Collection_78",
  "/wiki/Gand_(planet)",
  "/wiki/Gand",
  "/wiki/Breathing_Gand",
  "/wiki/Gender",
  "/wiki/Meter",
  "/wiki/Color",
  "/wiki/Jabba%27s_criminal_empire",
  "/wiki/Bounty_Hunters%27_Guild",
  "/wiki/T%27onga%27s_crew",
  "/wiki/Insectoid",
  "/wiki/Findsman",
  "/wiki/Bounty_hunter",
  "/wiki/Galactic_Civil_War",
  "/wiki/4-LOM",
  "/wiki/Han_Solo",
  "/wiki/Mist_Hunter",
  "/wiki/Planet",
  "/wiki/Anakin_Skywalker",
  "/wiki/Millennium_Falcon",
  "/wiki/Battle_of_Hoth",
  "/wiki/Boba_Fett",
  "/wiki/Bounty",
  "/wiki/Jabba_Desilijic_Tiure",
  "/wiki/Eye",
  "/wiki/Species",
  "/wiki/Homeworld",
  "/wiki/Atmosphere",
  "/wiki/Breath_mask",
  "/wiki/Ammonia",
  "/wiki/Oxygen",
  "/wiki/The_galaxy",
  "/wiki/Gas",
  "/wiki/Culisetto",
  "/wiki/Doctor",
  "/wiki/Cribiriz_Idollax",
  "/wiki/Deva_Lompop",
  "/wiki/Droid",
  "/wiki/Bodyguard",
  "/wiki/Death",
  "/wiki/Snare_rifle",
  "/wiki/Sribiriz",
  "/wiki/9_BBY",
  "/wiki/Beris_Ford",
  "/wiki/Tractor_beam",
  "/wiki/Rekias_Nodo",
  "/wiki/Valtos",
  "/wiki/Valtos_space_port",
  "/wiki/Smuggler",
  "/wiki/Stun_net",
  "/wiki/Disturbance_in_the_Force",
  "/wiki/Chewbacca",
  "/wiki/Wookiee",
  "/wiki/Stuncuffs",
  "/wiki/Energy_projector",
  "/wiki/Spear",
  "/wiki/Scorpion-droid",
  "/wiki/Battle_of_Yavin",
  "/wiki/Krrsantan",
  "/wiki/IG-90",
  "/wiki/Dengar",
  "/wiki/Chanath_Cha",
  "/wiki/Beebox",
  "/wiki/C-21_Highsinger",
  "/wiki/Chelli_Lona_Aphra",
  "/wiki/Battle_of_Vrogas_Vas",
  "/wiki/Alliance_to_Restore_the_Republic",
  "/wiki/Time",
  "/wiki/Galactic_Empire",
  "/wiki/Cloud_City",
  "/wiki/Cadeliah",
  "/wiki/Beilert_Valance",
  "/wiki/Spur_Orbiting_Market",
  "/wiki/Lowik",
  "/wiki/B2-series_super_battle_droid",
  "/wiki/Yuralla_Vega",
  "/wiki/Fire_ruby",
  "/wiki/Y%27Toub_System",
  "/wiki/Asteroid_field",
  "/wiki/Nar_Shaddaa",
  "/wiki/Slave_I",
  "/wiki/Unidentified_bar_(Nar_Shaddaa)",
  "/wiki/Moon",
  "/wiki/Jega%27s_Music_Hall_and_Petting_Zoo",
  "/wiki/Wormstew_Town",
  "/wiki/Trot",
  "/wiki/Jega%27s_Squad",
  "/wiki/Monster_droid",
  "/wiki/Gand_floating_sanctuary",
  "/wiki/Outer_Rim_Territories",
  "/wiki/T%27onga",
  "/wiki/Losha_Tarkon",
  "/wiki/Tasu_Leech",
  "/wiki/Jekara",
  "/wiki/Auction_for_Han_Solo",
  "/wiki/Hutt_freighter",
  "/wiki/The_Force",
  "/wiki/Inquisitorius",
  "/wiki/Osia%27Kru_Brume_lowlands",
  "/wiki/GRS-1_snare_rifle",
  "/wiki/Knife",
  "/wiki/G-1A_starfighter",
  "/wiki/1980",
  "/wiki/Star_Wars:_Episode_V_The_Empire_Strikes_Back",
  "/wiki/Cathy_Munro",
  "/wiki/Ralph_McQuarrie",
  "/wiki/John_Mollo",
  "/wiki/Stuart_Freeborn",
  "/wiki/Donald_F._Glut",
  "/wiki/Star_Wars_Episode_V:_The_Empire_Strikes_Back_(novel)",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures",
  "/wiki/LEGO_Star_Wars:_The_Freemaker_Adventures_Season_Two",
  "/wiki/Return_to_the_Wheel",
  "/wiki/August_3",
  "/wiki/2017",
  "/wiki/Bossk%27wassak%27Cradossk",
  "/wiki/IG-88B",
  "/wiki/Mission_to_obtain_an_energy_matrix_activator",
  "/wiki/Freemakers/LEGO",
  "/wiki/Kordi_Freemaker/LEGO",
  "/wiki/Star_Wars_Adventures_(2017)",
  "/wiki/Star_Wars_Adventures_Free_Comic_Book_Day_2018",
  "/wiki/Powered_Down,_Part_I",
  "/wiki/Star_Wars_Adventures_(2017)_10",
  "/wiki/Star_Wars_Adventures_(2017)_11",
  "/wiki/Star_Wars:_The_Original_Trilogy_%E2%80%93_A_Graphic_Novel",
  "/wiki/Darth_Vader_(2015)_16",
  "/wiki/Star_Wars_Galaxy_of_Adventures",
  "/wiki/Boba_Fett_-_The_Bounty_Hunter",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F",
  "/wiki/The_Empire_Strikes_Back:_So_You_Want_to_Be_a_Jedi%3F_(audiobook)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_(paperback_novel)",
  "/wiki/The_Empire_Strikes_Back_(Golden_Book)",
  "/wiki/Star_Wars:_The_Empire_Strikes_Back_Graphic_Novel_Adaptation",
  "/wiki/Tooth_and_Claw",
  "/wiki/STET!",
  "/wiki/Wait_for_It",
  "/wiki/No_Time_for_Poetry",
  "/wiki/Bounty_Hunters_6",
  "/wiki/Bounty_Hunters_7",
  "/wiki/Bounty_Hunters_8",
  "/wiki/Bounty_Hunters_9",
  "/wiki/Bounty_Hunters_12",
  "/wiki/War_of_the_Bounty_Hunters_1",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_4-LOM_%26_Zuckuss_1",
  "/wiki/Bounty_Hunters_15",
  "/wiki/Darth_Vader_(2020)_12",
  "/wiki/Bounty_Hunters_16",
  "/wiki/War_of_the_Bounty_Hunters_3",
  "/wiki/War_of_the_Bounty_Hunters_4",
  "/wiki/War_of_the_Bounty_Hunters_%E2%80%93_IG-88_1",
  "/wiki/Star_Wars_(2020)_22",
  "/wiki/Bounty_Hunters_23",
  "/wiki/Revelations_1",
  "/wiki/LEGO_Star_Wars:_The_Skywalker_Saga",
  "/wiki/StarWars.com",
  "/wiki/Encyclopedia_(StarWars.com)",
  "/wiki/The_Topps_Company,_Inc.",
  "/wiki/Star_Wars:_Card_Trader",
  "/wiki/Ultimate_Star_Wars",
  "/wiki/The_Art_of_Star_Wars:_The_Force_Awakens",
  "/wiki/Star_Wars_Character_Encyclopedia:_Updated_and_Expanded",
  "/wiki/Star_Wars_Helmet_Collection",
  "/wiki/Star_Wars_Helmet_Collection_2",
  "/wiki/Weapons_%26_Uniforms",
  "/wiki/Star_Wars_Helmet_Collection_19",
  "/wiki/Databank_A-Z",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2",
  "/wiki/Star_Wars:_Build_Your_Own_R2-D2_7",
  "/wiki/Droid_Directory",
  "/wiki/No_Disintegrations_(Fantasy_Flight_Games)",
  "/wiki/Star_Wars:_The_Visual_Encyclopedia",
  "/wiki/Star_Wars:_Geektionary:_The_Galaxy_from_A_-_Z",
  "/wiki/Star_Wars:_X-Wing_Second_Edition",
  "/wiki/Scum_and_Villainy_Conversion_Kit",
  "/wiki/Star_Wars:_The_Complete_Visual_Dictionary,_New_Edition",
  "/wiki/Star_Wars:_Alien_Archive",
  "/wiki/Helmets",
  "/wiki/Highlights_of_the_Saga",
  "/wiki/Star_Wars_Character_Encyclopedia,_New_Edition",
  "/wiki/Allies_and_Adversaries",
  "/wiki/Star_Wars:_Destiny",
  "/wiki/Spark_of_Hope",
  "/wiki/LEGO",
  "/wiki/LEGO_Classic_Star_Wars",
  "/wiki/Ultimate_Star_Wars,_New_Edition",
  "/wiki/Disney_Gallery:_The_Mandalorian",
  "/wiki/Connections_(Disney_Gallery:_The_Mandalorian)",
  "/wiki/Star_Wars_Encyclopedia_(De_Agostini)",
  "/wiki/Darth_Vader_(Star_Wars_Encyclopedia)",
  "/wiki/Gentle_Giant_Studios",
  "/wiki/Star_Wars:_The_Skywalker_Saga:_The_Official_Collector%27s_Edition",
  "/wiki/Under_The_Helmet:_The_Legacy_Of_Boba_Fett",
  "/wiki/Star_Wars_Insider",
  "/wiki/Launchpad",
  "/wiki/Star_Wars_Insider_207",
  "/wiki/Star_Wars_Inside_Intel:_Bounty_Hunters",
  "/wiki/Star_Wars:_The_Secrets_of_the_Bounty_Hunters",
  "/wiki/Databank_(website)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_(De_Agostini)",
  "/wiki/Star_Wars:_Build_the_Millennium_Falcon_43",
  "/wiki/Secrets_of_Spaceflight",
  "/wiki/September_27",
  "/wiki/2013",
  "/wiki/Star_Wars:_The_Annotated_Screenplays"
 ]
}