{
 "name": "Zuth",
 "display_name": "Zuth",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "c. 22 BBY"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Human"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "Bald"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Black"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Dark"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    },
    {
     "name": "Apprentices",
     "values": [
      "Tu'ala"
     ]
    }
   ]
  }
 ],
 "content": "Zuth was a male Human Jedi Knight who served the Jedi Order and the Galactic Republic during the final years of both institutions.\nA Force-sensitive, Zuth was trained by the Jedi Order at the Coruscant Jedi Temple in the ways of the Force. Completing years of training, crafting for himself a yellow-bladed lightsaber, and passing the Trials of Knighthood, Zuth was elevated to the rank of Jedi Knight by the Jedi High Council. Serving the Order valiantly as a Knight, Zuth selected Initiate Tu'ala as his Padawan and began to tutor her in the Jedi ways as they traveled the galaxy together.\nAs Tu'ala's mentor, Zuth attempted to instill in his student the notion that the death of a single individuals might be necessary to ensure that others fulfilled their destines. Tu'ala did not take quickly to this lesson, though Zuth was patient with her. His time as her teacher fell short as he fell in battle defending his Padawan's life during an assassination attempt on an unspecified senator; dying so that she may live on. His body was returned to the Temple where it was cremated in the Jedi custom.\nNot long after his death, the Republic and the Confederacy of Independent Systems declared war on each other. In the opening battle, the masterless Tu'ala finally embraced her deceased master's teachings and sacrificed her life in the Petranaki arena so that fellow Padawan Anakin Skywalker might live. Her action went unnoticed during the confusion of battle, but her deed would go onto shape the flow of galactic history, including the completion of the Prophecy of the Chosen One.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/22_BBY/Legends",
  "/wiki/Human/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Tu%27ala",
  "/wiki/The_Lesson",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/Coruscant/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/The_Force/Legends",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_Trials/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Jedi_Initiate/Legends",
  "/wiki/Padawan/Legends",
  "/wiki/The_galaxy/Legends",
  "/wiki/Jedi_funeral/Legends",
  "/wiki/Confederacy_of_Independent_Systems/Legends",
  "/wiki/Petranaki_arena",
  "/wiki/Anakin_Skywalker/Legends",
  "/wiki/Chosen_One/Legends",
  "/wiki/Star_Wars_Tales_14"
 ]
}