{
 "name": "Zym",
 "display_name": "Zym",
 "side_bars": [
  {
   "name": "Biographical information",
   "attributes": [
    {
     "name": "Died",
     "values": [
      "3653 BBY",
      "Coruscant"
     ]
    }
   ]
  },
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Kel Dor"
     ]
    },
    {
     "name": "Gender",
     "values": [
      "Male"
     ]
    },
    {
     "name": "Hair color",
     "values": [
      "None"
     ]
    },
    {
     "name": "Eye color",
     "values": [
      "Silver"
     ]
    },
    {
     "name": "Skin color",
     "values": [
      "Orange"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Jedi Order",
      "Galactic Republic"
     ]
    }
   ]
  }
 ],
 "content": "Zym was a male Kel Dor Jedi Master who served the Galactic Republic as the Grand Master of the Jedi Order during the Great Galactic War.\nA Force-sensitive Kel Dor, Zym was trained in the ways of the Force by the Jedi Order; attaining the rank of Jedi Master and constructing a blue-bladed lightsaber. Gaining a seat on the Jedi High Council, Zym was appointed Grand Master of the Jedi Order sometime before the Great Galactic War. When the Sith Empire first attacked the Republic, Zym led the Council in agreeing to fight on behalf of the Galactic Senate against the Sith invaders.\nAs the war came to a shocking climax with the Empire's request to sign a treaty, Zym advised Supreme Chancellor Berooken to remain on Coruscant as the Republic and Jedi diplomats convened peace talks on Alderaan. While Zym was off Coruscant, the Sith Empire betrayed the Republic and the Order by attacking the capital world; killing the Chancellor and destroying the Jedi Temple. As contact with the Senate was lost, Zym and the diplomats on Alderaan knew nothing of the atrocities suffered by the leaders of the Republic. Establishing contact with Master Dar'Nala and Senator Paran Am-Ris on Alderaan, Zym recommended that they accept the Sith's term and for Jedi Knight Satele Shan to apologize to Sith Lord Darth Baras for attacking him. When Dar'Nala objected, Zym characterized her relationship with her former Padawan as dangerous.\nAfter the treaty was signed, Zym sent Dar'Nala and Shan to the Outer Rim Territories to oversee the withdrawal of Republic troops. Dar'Nala believed it was just a ploy to get the two Jedi out of the way. As Zym returned to Coruscant for a meeting with Senator Paran Am-Ris, he was informed that the rebuilding of the Jedi Temple was being held off indefinitely for lack of funds. Zym reported this to a distraught Master Orgus Din, who had lost a Padawan in the destruction of the ancient edifice. He then tasked Din to find his other student, Fortris Gall who was causing problems in the Outer Rim.\nOrgus Din later reported a disturbing matter to Zym; Master Dar'Nala and Satele Shan had been attacked by a Sith warship while they were on a mission. When the Galactic Senate heard of this, many began screaming for a continuation of the war. When Republic trooper Harron Tavus asked for permission to rescue Dar'Nala, Zym said that would be pointless; they had intercepted an Imperial communication saying Dar'Nala had been executed for helping a prisoner escape.\nZym later received a message from someone saying he had information about the attack on the Envoy, and to meet them at the ruins of the Jedi Temple. When Zym got there, he found Gin Lesl, the captain of the Envoy, but Braden, the prisoner Dar'Nala had helped escape, shot her for getting him wounded on Dantooine. He then told Zym that he had a message to pass on from Dar'Nala, but Zym tried to arrest him for his shooting the captain. Braden attacked Zym, killing him, and the Grand Master's opportunity of finding out that Darth Baras was behind the attack on the Envoy was wasted. Zym's death caused a power vacuum in the Order that was filled by his successor Satele Shan two years later.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Star_Wars_Legends",
  "/wiki/3653_BBY",
  "/wiki/Coruscant/Legends",
  "/wiki/Kel_Dor/Legends",
  "/wiki/Gender/Legends",
  "/wiki/Color/Legends",
  "/wiki/Jedi_Order/Legends",
  "/wiki/Galactic_Republic/Legends",
  "/wiki/Dar%27Nala",
  "/wiki/Senator/Legends",
  "/wiki/Paran_Am-Ris",
  "/wiki/Sacking_of_Coruscant",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_1:_Treaty_of_Coruscant",
  "/wiki/Jedi_Master/Legends",
  "/wiki/Grand_Master/Legends",
  "/wiki/Great_Galactic_War",
  "/wiki/Force-sensitive/Legends",
  "/wiki/Jedi_training/Legends",
  "/wiki/The_Force/Legends",
  "/wiki/Blue",
  "/wiki/Lightsaber/Legends",
  "/wiki/Jedi_High_Council/Legends",
  "/wiki/Sith_Empire_(Post%E2%80%93Great_Hyperspace_War)",
  "/wiki/Galactic_Senate/Legends",
  "/wiki/Treaty_of_Coruscant",
  "/wiki/Supreme_Chancellor/Legends",
  "/wiki/Berooken",
  "/wiki/Alderaan_peace_conference",
  "/wiki/Alderaan/Legends",
  "/wiki/Death/Legends",
  "/wiki/Jedi_Temple",
  "/wiki/Jedi_Knight/Legends",
  "/wiki/Satele_Shan",
  "/wiki/Sith_Lord/Legends",
  "/wiki/Darth_Baras",
  "/wiki/Outer_Rim_Territories/Legends",
  "/wiki/Orgus_Din",
  "/wiki/Padawan/Legends",
  "/wiki/Fortris_Gall",
  "/wiki/Republic_trooper",
  "/wiki/Harron_Tavus",
  "/wiki/Braden",
  "/wiki/Envoy_(Republic_transport_ship)",
  "/wiki/Gin_Lesl",
  "/wiki/Dantooine/Legends",
  "/wiki/3651_BBY",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_2:_New_Galactic_Order",
  "/wiki/The_Old_Republic,_Threat_of_Peace_Act_3:_Uncertain_Surrender",
  "/wiki/The_Old_Republic:_Deceived",
  "/wiki/The_Old_Republic:_Deceived_(audiobook)",
  "/wiki/The_Journal_of_Master_Gnost-Dural_(real-life_book)",
  "/wiki/Nomi_Sunrider",
  "/wiki/3986_BBY",
  "/wiki/3681_BBY",
  "/wiki/3645_BBY",
  "/wiki/3636_BBY",
  "/wiki/Star_Wars:_Force_and_Destiny_Core_Rulebook",
  "/wiki/Star_Wars:_Tales_of_the_Jedi_-_Redemption",
  "/wiki/Star_Wars:_The_Old_Republic:_Knights_of_the_Fallen_Empire"
 ]
}