{
 "name": "Zzzs",
 "display_name": "Zzzs",
 "side_bars": [
  {
   "name": "Physical description",
   "attributes": [
    {
     "name": "Species",
     "values": [
      "Mustafarian"
     ]
    }
   ]
  },
  {
   "name": "Chronological and political information",
   "attributes": [
    {
     "name": "Affiliation(s)",
     "values": [
      "Kkkt's clan"
     ]
    }
   ]
  }
 ],
 "content": "Zzzs was a Southern Mustafarian member of Father Kkkt's clan on the planet Mustafar. Around 14 BBY, Zzzs and Kkkt saw the arrival of Darth Vader's ship on the planet. When Vader began building a structure to channel the Force, it caused multiple lava storms to erupt all over the planet, which Kkkt tried to hold off to protect the clan. After the fifth storm, where Zzzs gathered the clan's people for Kkkt, the clan leader explained to his comrade that they must rally the other clans to destroy the structure.\nZzzs was a Southern Mustafarian who lived on the lava planet Mustafar. They were part of a clan led by Father Kkkt, a Force-sensitive Mustafarian. Around 14 BBY, the entire clan witnessed the arrival of the Sith Lord Darth Vader's ship on Mustafar. As the ship flew across the sky, it set afire due to entering the planet's atmosphere without shields. When Zzzs asked Kkkt what it was, the clan leader claimed it was an omen and examined the falling object through a ring of lava he had manipulated using the Force.\nThe vessel landed in the Gahenn Plains, where Vader eventually began building a structure with the help of the spirit of the Sith Momin. The structure was meant to channel the Force energies from a dark side locus on Mustafar to open the door to another realm. As each design kept failing, lava storms erupted all over the planet, which affected the resident Mustafarians. Kkkt protected his people from the bursting lava as the storms became more frequent and worse.\nWhen the fifth storm came, Kkkt had Zzzs gather the other clan members and calm them while the clan leader protected them. After the storm ended, Kkkt asked them if the others in the clan were safe. Zzzs confirmed that the others were alive thanks to him. Kkkt then asserted that the problem had to be stopped, revealing to Zzzs that the other clanholds he was in contact with were having the same issue. The clan leader further told his comrade that it was time for the clans to come together and destroy the structure being built in the Gahenn Plains.\nLike other Mustafarians, Zzzs wore armor and a breath mask as protection against Mustafar's heat.\nZzzs first appeared in the comic Darth Vader  21, written by Charles Soule, penciled by Giuseppe Camuncoli, and published by Marvel Comics on September 12, 2018.",
 "base_url": "https://starwars.fandom.com",
 "crosslinks": [
  "/wiki/Canon",
  "/wiki/Wookieepedia:Good_articles",
  "/wiki/Wookieepedia:Good_article_nominations/Zzzs",
  "/wiki/Mustafarian",
  "/wiki/Southern_Mustafarian",
  "/wiki/Kkkt%27s_clan",
  "/wiki/Father_(title)",
  "/wiki/Planet",
  "/wiki/Mustafar",
  "/wiki/14_BBY",
  "/wiki/Kkkt",
  "/wiki/Anakin_Skywalker",
  "/wiki/Naboo_Royal_Starship",
  "/wiki/Fortress_Vader",
  "/wiki/The_Force",
  "/wiki/Magma",
  "/wiki/Gender",
  "/wiki/Battle_of_Fortress_Vader",
  "/wiki/Force-sensitive",
  "/wiki/Sith_Lord",
  "/wiki/Starship",
  "/wiki/Atmosphere",
  "/wiki/Deflector_shield",
  "/wiki/Gahenn_Plains",
  "/wiki/Sith",
  "/wiki/Darth_Momin",
  "/wiki/Dark_side_of_the_Force",
  "/wiki/Armor",
  "/wiki/Breath_mask",
  "/wiki/Star_Wars_comic_books",
  "/wiki/Darth_Vader_(2017)_21",
  "/wiki/Charles_Soule",
  "/wiki/Giuseppe_Camuncoli",
  "/wiki/Marvel_Comics",
  "/wiki/September_12",
  "/wiki/2018",
  "/wiki/Darth_Vader_(2017)_23",
  "/wiki/Darth_Vader_(2017)_19",
  "/wiki/Template:DVDLotS18",
  "/wiki/Darth_Vader_(2017)_22",
  "/wiki/Star_Wars:_Absolutely_Everything_You_Need_to_Know"
 ]
}